import { ca_state, cf2_state } from '../../../code/citadel/extras';
import { asrielinter, cs_state } from '../../../code/common/api';
import { spawn } from '../../../code/systems/core';
import { battler, calcLV, choicer, instance, pager, player, postSIGMA, world } from '../../../code/systems/framework';
import { SAVE } from '../../../code/systems/save';
import { CosmosUtils } from '../../../code/systems/storyteller';

// START-TRANSLATE

export default {
    a_citadel: {
        youvedoneitnow: [
            [
                '<32>{#p/human}* （一股暗流在你心中充盈。）',
                '<32>{#p/human}* （你祈禱，這只是一場惡夢。）'
            ],
            [
                '<32>{#p/human}* （你拼命想從那黑暗中掙脫出來。）',
                '<32>{#p/human}* （你竭盡全力與之抗爭，\n  但無濟於事。）'
            ],
            [
                '<32>{#p/human}* （你大聲呼救，但誰也沒有來。）',
                '<32>{#p/human}* （你別無所求，只希望能徹底解脫。）'
            ],
            ['<32>{#p/human}* （...）', '<32>{#p/human}* （你深吸一口氣，\n  準備迎接最終的結局。）'],
            ['<32>{#p/human}* （...）', '<32>{#p/human}* （你已做好準備。）']
        ],
        hypertext: {
            count: '$(x)秒後重啟',
            death1: ['{#p/human}（你深吸了一口氣。）', "（你充滿了決心。）"],
            death2: [
                "{#p/human}{#v/1}{@fill=#42fcff}失敗了沒關係...",
                '{@fill=#42fcff}沉住氣，再來一次吧...'
            ],
            death3: ['{#p/human}{#v/2}{@fill=#ff993d}可別在這時候就放棄。', '{@fill=#ff993d}起來，繼續作戰！'],
            death4: ["{#p/human}{#v/3}{@fill=#003cff}相信自己能行的。", "{@fill=#003cff}別退縮！"],
            death5: [
                '{#p/human}{#v/4}{@fill=#d535d9}活過這輪不成問題...',
                '{@fill=#d535d9}繼續前進。'
            ],
            death6: [
                "{#p/human}{#v/5}{@fill=#00c000}整個世界都指望你了...",
                '{@fill=#00c000}相信自己！'
            ],
            death7: ["{#p/human}{#v/6}{@fill=#faff29}他早晚會敗下陣來。"],
            cyan1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某個迷失靈魂呼喚著你。',
                '<99>{*}{@fill=#faff29}依靠{@mystify=耐心而忖恧㤈耏寸}耐心{@mystify=}，將會有望逃脫。',
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}幫我拿回小熊座...',
                '<99>{*}{#p/human}（按[Z]傳送。）'
            ],
            cyan2: [
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}那個存在，正伺機而動。',
                '<99>{*}{@fill=#42fcff}有了耐心，你就能挺住不敗...'
            ],
            orange1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某個迷失靈魂呼喚著你。',
                '<99>{*}{@fill=#faff29}憑藉{@mystify=勇氣勈氣甬気力乞}勇氣{@mystify=}，或將擺脫束縛。',
                "<99>{*}{#p/human}{#v/2}{@fill=#ff993d}別忘了我的超能手套！",
                '<99>{*}{#p/human}（按[Z]釋放衝擊波。）'
            ],
            orange2: [
                '<99>{*}{#p/human}{#v/2}{@fill=#ff993d}那個存在，正不斷靠近...',
                '<99>{*}{@fill=#ff993d}有了勇氣，就能重拳出擊！'
            ],
            blue1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某個迷失靈魂呼喚著你。',
                '<99>{*}{@fill=#faff29}堅守{@mystify=正直㱏十止且上目}正直{@mystify=}，必定能夠逃脫。',
                "<99>{*}{#p/human}{#v/3}{@fill=#003cff}幫我帶回我最信賴的懸浮靴。"
            ],
            blue2: [
                '<99>{*}{#p/human}{#v/3}{@fill=#003cff}那個存在，正立於一處。',
                '<99>{*}{@fill=#003cff}堅守正直，你就能迎難而上。'
            ],
            purple1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某個迷失靈魂呼喚著你。',
                '<99>{*}{@fill=#faff29}擁有{@mystify=毅力䝘刀豙萬殳勹}毅力{@mystify=}，定可擺脫束縛。',
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}一臺平板電腦就能伴你遠行。'
            ],
            purple2: [
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}那個存在，已不再穩定。',
                '<99>{*}{@fill=#d535d9}擁有毅力，怎會輕言放棄？'
            ],
            green1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某個迷失靈魂呼喚著你。',
                '<99>{*}{@fill=#faff29}心懷{@mystify=善良譱艮言㫐羊哴}善良{@mystify=}，終能衝破枷鎖。',
                '<99>{*}{#p/human}{#v/5}{@fill=#00c000}請用那架塔布拉木琴解救我！'
            ],
            green2: [
                '<99>{*}{#p/human}{#v/5}{@fill=#00c000}那個存在，正土崩瓦解...',
                '<99>{*}{@fill=#00c000}心懷善意，定會立於不敗之地...'
            ],
            yellow: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}迷失的靈魂呼喚了你。',
                '<99>{*}{@fill=#faff29}秉持正義，你一一回應。',
                '<99>{*}{@fill=#faff29}將他們從牢籠中解放。',
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}終於啊。',
                "<99>{*}{#p/human}{#v/2}{@fill=#ff993d}大英雄！",
                "<99>{*}{#p/human}{#v/3}{@fill=#003cff}幹得好。",
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}謝謝你...',
                "<99>{*}{#p/human}{#v/5}{@fill=#00c000}太棒了...！",
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}我們的力量歸你了。',
                '<99>{*}{@fill=#faff29}有了這些力量，就能徹底擊敗那東西。',
                '<99>{*}{@fill=#faff29}事成之後...',
                '<99>{*}{@fill=#faff29}...去做你必須要做的事吧。',
                '<99>{*}{@fill=#faff29}現在，結果了它！',
                '<99>{*}{#p/human}（按[Z]射擊。）'
            ],
            boot: '重啟中...',
            init: '已就位',
            warn: '警告...',
            file1saved: '存檔1 已儲存',
            file1loaded: '存檔1 已載入',
            file2saved: '存檔2 已儲存',
            file2loaded: '存檔2 已載入',
            file3saved: '存檔3 已儲存',
            file3loaded: '存檔3 已載入',
            file4saved: '存檔4 已儲存',
            file4loaded: '存檔4 已載入',
            file5saved: '存檔5 已儲存',
            file5loaded: '存檔5 已載入',
            file6saved: '存檔6 已儲存',
            file6loaded: '存檔6 已載入'
        },
        noequip: ['<32>{#p/human}* （你打算不這麼做。）'],
        genotext: {
            monologue: [
                (re: boolean) => [
                    ...(re
                        ? ['<26>{#p/asriel2}{#f/13}* 我之前說到...']
                        : ["<25>{#p/asriel2}{#f/13}* 其實..."]),
                    "<25>{#f/16}* ...我早就親手毀滅過\n  這該死的前哨站。",
                    "<25>{#f/15}* 一次又一次，一次又一次...\n* 呵，我早就記不清\n  自己看過多少條時間軸了。",
                    '<25>{#f/23}* 可是...',
                    "<25>{#f/16}* 我縱使可以隨心所欲，\n  但一直覺得... 缺點什麼。"
                ],
                (re: boolean) => [
                    '<25>{#p/asriel2}{#f/15}* 那時，我從昏迷中甦醒。\n  卻發現自己變成了一顆星星。',
                    "<25>{#f/16}* 我沒有手，沒有腿，\n  什麼都做不了。",
                    "<25>{#f/13}* 我不知所措，希望有人\n  能來幫助我，關心我...",
                    '<25>{#f/13}* 我大聲呼救...',
                    '<25>{#f/23}* 我竭力呼喊...',
                    '<25>{#f/7}* ...',
                    '<25>{#f/6}* ...但是誰也沒有來。'
                ],
                (re: boolean) => [
                    ...(re
                        ? ["<25>{#p/asriel2}{#f/6}* 之前說到，再度甦醒後，\n  星星身的我再也無法\n  回歸正常生活了。"]
                        : []),
                    "<25>{#p/asriel2}{#f/15}* 我不僅失去四肢，\n  更失去了「愛與被愛」的能力。",
                    '<25>{#f/23}* 我很害怕，我很憂慮。\n* 我別無所求，\n  只希望能讓一切恢復正常。',
                    "<25>{#f/13}* 所以，我去找父親，\n  希望他能救救我。",
                    "<25>{#f/17}* 父親說，會一直照顧我...",
                    "<25>{#f/13}* ...但他再怎麼努力，\n  終究治標不治本。"
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<25>{#p/asriel2}{#f/13}* 之前說到，再度甦醒後，\n  我變成了一顆星星，\n  再也無法回歸正常生活了。",
                            "<25>{#f/13}* 既然父親救不了我...",
                            '<25>{#f/16}* 那我就去找母親了。'
                        ]
                        : ['<26>{#p/asriel2}{#f/16}* 父親救不了我，\n  那就去找母親吧。']),
                    "<25>{#f/13}* 我心想...\n  找她肯定靠譜。",
                    "<25>{#f/17}* 以前，她那麼關心我...",
                    "<25>{#f/23}* 所以，世上最有能力\n  解救我的人，就是她。"
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<25>{#p/asriel2}{#f/13}* 之前說到，再度甦醒後，\n  我變成了一顆星星，\n  再也無法回歸正常生活了。",
                            "<26>{#f/16}* 我把希望寄託於我的父母，\n  但他們啥都沒幫上。"
                        ]
                        : ["<25>{#p/asriel2}{#f/16}* ...但她也失敗了。"]),
                    "<25>{#f/13}* 一想到自己要永遠\n  當顆星星...",
                    '<25>{#f/13}* 一想到誰都救不了自己...',
                    '<26>{#f/23}* 我就想馬上去死。',
                    '<25>{#f/15}* 我放棄了一切... 選擇自盡。',
                    '<25>{#f/16}* ...可是...\n* 當「死亡」來臨時...',
                    '<25>{#f/7}* 眼前卻突然閃過許多\n  撲朔迷離的景象...',
                    '<25>{#f/6}* 之後，我猛然發現自己\n  又回到了醒來的時間點。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<25>{#p/asriel2}{#f/10}* 我們剛才說到哪了？',
                            '<26>{#f/6}* ...想起來了。\n* 我又回到了醒來的時間點。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/13}* 一開始，我也納悶\n  為什麼會「回來」...",
                    '<25>{#f/15}* ...所以，我做了個實驗。\n  看看能不能主動回溯時間。',
                    '<25>{#f/16}* 我屏息凝神，集中注意力。\n* 於是... 時間回溯了。',
                    "<25>{#f/15}* 我非常吃驚...",
                    "<25>{#f/17}* 自己居然獲得了\n  「回溯時間」的能力。",
                    "<25>{#f/23}* 一開始，我想用這種能力\n  做點好事。",
                    "<25>{#f/15}* 所謂「助人自助」，\n  既然我做不到「自助」...",
                    '<25>{#f/16}* 起碼還能「助人」。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<25>{#p/asriel2}{#f/10}* 我們剛才說到哪了？',
                            '<25>{#f/16}* ...想起來了。\n* 一開始，我用「時間回溯」的能力\n  幫助怪物。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/23}* 其實，做好事並不容易。\n* 一開始，給他們幹活\n  總要花很大的力氣。",
                    '<25>{#f/15}* ...漸漸地，\n  我越做越熟練了。',
                    '<25>{#f/5}* 很快，那些活\n  我閉眼睛都能幹好。',
                    '<25>{#f/9}* 嘿嘿，我還真試過呢。',
                    '<25>{#f/13}* 把這事掛在嘴邊，\n  好像是在炫耀...',
                    '<25>{#f/9}* 但說到底...\n  我幹得再快，幫得再多，\n  又有什麼用呢？',
                    '<25>{#f/5}* 幫得再多，\n  我也救不了自己...',
                    '<25>{#f/15}* 儘管如此，\n  我還是努力幫助他們，\n  拯救他們...',
                    '<25>{#f/15}* 努力做個好人。'
                ],
                (re: boolean) => [
                    ...(re ? ['<25>{#p/asriel2}{#f/15}* 之前說到，\n  一開始，我努力幫助別人。'] : []),
                    '<25>{#p/asriel2}{#f/16}* 但很快，\n  我發現不對勁。',
                    '<25>{#f/15}* 無論重置多少次...',
'<25>{#f/15}* 他們的回答永遠是那幾句，\n  故事的結局永遠是那一種...',
                    "<25>{#f/16}* 「做個好人」開始變得無聊了。",
                    '<25>{#f/6}* 你想說，\n  「那就試試別的行動唄？」',
'<25>{#f/6}* 呵，什麼調情、約會、挑逗...\n  早試過了。',
                    '<25>{#f/7}* 做多了，也就膩了。',
                    "<25>{#f/10}* 我當然可以繼續循環，\n  但有什麼意思呢？",
                    '<25>{#f/6}* 該換換口味了。'
                ],
                (re: boolean) => [
                    ...(re
                        ? ["<25>{#p/asriel2}{#f/6}* 之前說到，\n  我當老好人當膩了。"]
                        : []),
                    "<25>{#p/asriel2}{#f/4}* 不過，一開始\n  我不想對他們太壞。",
                    '<25>{#f/3}* 說點狠話，罵罵人，\n  就差不多了。',
                    '<25>{#f/10}* 有時我會感覺心虛，難過。\n* 但轉念一想，也沒多惡劣。',
                    '<25>{#f/6}* 如果我發現\n  人們的反應又開始重複，\n  我就更狠一點。',
                    '<25>{#f/8}* 這裡罵一句，那裡懟一句。',
                    '<25>{#f/7}* 罵得多，就不在乎了。',
                    "<25>{#f/9}* 那段時間，\n  我最多只是耍耍嘴皮子。\n* 從沒動過手，更沒殺過人。"
                ],
                (re: boolean) => [
                    ...(re ? ["<26>{#p/asriel2}{#f/4}* 之前說到，\n  我開始罵他們，懟他們了。"] : []),
                    '<25>{#p/asriel2}{#f/15}* 「言語攻擊」玩膩了，\n  我又想...\n  要不試試動手揍人？',
                    "<25>{#f/16}* 沒什麼大不了的，\n  只要別失手打死了就行。",
                    "<25>{#f/10}* 受點傷，算的了什麼？\n  怪物有的是辦法療傷。",
                    "<25>{#f/4}* 即使真出了意外，\n  我可以直接重置，\n  他們又能活蹦亂跳。",
                    '<25>{#f/3}* ...但意外真的發生了。',
'<25>{#f/3}* 那一刻，\n  我才知道自己多麼天真。'
                ],
                (re: boolean) => [
                    ...(re ? ["<26>{#p/asriel2}{#f/3}* 之前說到，我感覺\n  「言語攻擊」沒什麼意思，\n  想給他們來點「物理攻擊」。"] : []),
                    '<25>{#p/asriel2}{#f/13}* 可能是衝昏了頭腦...\n  我玩了點「新花樣」。',
                    '<25>{#f/15}* 我用魔法，把親生母親\n  吊了起來。\n* 越勒越緊... 越勒越緊...',
                    '<25>{#f/16}* ...',
                    '<25>{#f/6}* 生命一點點離她而去。\n* 她氣若遊絲，\n  哀求我馬上停手...',
'<25>{#f/6}* ...',
                    '<25>{#f/8}* 我把她活活勒死了。',
                    "<25>{#f/7}* 我驚恐萬分，馬上重置。\n* 但那地獄般的景象\n  卻久久揮之不去。",
                    '<25>{#f/13}* 重置後，為了讓自己心安，\n  我不停做好事，\n  努力做個孝子。',
                    "<25>{#f/15}* 但自作孽，不可活。",
                    "<25>{#f/15}* 我不敢直視她的目光...\n  不敢直視每一個人..."
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<26>{#p/asriel2}{#f/15}* 之前說到，\n  第一次殺人後，\n  惡夢般的景象久久揮之不去。",
                            '<25>{#f/16}* 但有了第一次，\n  就會有第二次，第三次...'
                        ]
                        : ['<25>{#p/asriel2}{#f/16}* 有了第一次，\n  就會有第二次，第三次...']),
                    '<26>{#f/15}* 「萬事開頭難。」\n* 殺了一次人，\n  就能下得去手了。',
                    '<26>{#f/15}* 很快，情況變成這樣：\n  我心情不好，殺個人找安慰。\n  我想找樂子，殺個人爽一把。',
                    '<26>{#f/16}* 第一次殺人純粹只是意外。\n  現在卻一發不可收拾。',
                    '<26>{#f/7}* 但我不怕，\n  殺了就殺了唄，\n  反正我能無限重置。',
                    '<25>{#f/6}* 一旦我開始這麼想...\n  就再也沒有回頭路了。'
                ],
                (re: boolean) => [
                    '<25>{#p/asriel2}{#f/6}* 重置得越多，\n  折磨他們的損招就越多。',
                    '<25>{#f/7}* 我把他們千刀萬剮...\n* 我讓他們自相殘殺...\n* 我使他們如墮地獄...',
                    '<25>{#f/15}* 他們死而復生。\n* 他們生而復死。\n* 他們生不如死。',
                    "<25>{#f/16}* 一次又一次，\n  一次又一次...\n* 我徹底麻木了。",
                    '<25>{#f/3}* 好事、壞事、善事、惡事...\n  什麼都做過了，\n  最後，我感受到什麼呢？',
                    '<25>{#f/3}* ...什麼都沒有。',
                    '<25>{#f/3}* 沒有情緒共鳴。\n* 沒有意義可言。\n* 只有空虛。',
                    '<25>{#f/15}* 我一無所有。\n  沒有朋友，沒有自由...\n* 於是，我改變了想法。',
                    '<26>{#f/23}* 我最後一次重置。\n* 這一次，我任由時間向前，\n  不再幹預時間軸。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<26>{#p/asriel2}{#f/16}* 之前說到，\n  我發現一切都毫無意義。',
                            '<25>{#f/23}* 所以，在這次重置後，\n  我不再幹預時間軸。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/17}* 但有了你，$(name)，\n  就不一樣了。",
                    '<25>{#f/23}* 你知道嗎？有你陪著我，\n  我真的非常高興。',
                    "<25>{#f/13}* 有你在身邊，我不再孤獨。",
                    "<25>{#f/15}* 有你在身邊，我不再絕望。",
                    "<25>{#f/16}* 而且，你不是也想\n  「給他們自由」嘛？",
                    '<25>{#f/13}* 我可以幫你實現願望。',
                    '<25>{#f/23}* 我們永遠都是好夥伴。'
                ]
            ],
            monologueX1: [
                '<25>{#p/asriel2}{#f/17}* 記住，$(name)。',
                '<25>{#f/17}* 只要我們心連心，\n  就能粉碎一切障礙。'
            ],
            monologueX2: () => [
                '<25>{#p/asriel2}{#f/16}* ...來，握住我的手。',
                ...(SAVE.data.b.water ? ["<25>{#f/13}* 別擔心，杯子我幫你拿..."] : [])
            ],
            monologueX3: [
                '<25>{#p/asriel2}{#f/17}* 以前，我們就這樣\n  手牽著手，在城市漫步...',
                '<25>{#f/23}* 現在，趁還有機會，\n  我們走完這最後一程。',
                "<25>{#f/16}* ...之後，\n  把一切都炸成碎片。"
            ],
            monologueX4: () => [
                '<25>{#p/asriel2}{#f/16}* 景色真美。',
                ...(SAVE.flag.n.ga_asrielMonologueY < 2
                    ? [
                        "<25>{#f/13}* 但前哨站的末日\n  已經到了。",
                        "<25>{#f/7}* $(name)，\n  那些怪物根本不懂我們。",
                        "<25>{#f/6}* 他們還相信\n  宇宙就是個大避難所。",
                        "<25>{#f/8}* 還天真地以為，\n  「星空之大，能容下每一個人。」",
                        "<25>{#f/6}* 但我們倆\n  可不跟那群蠢貨一般見識。",
                        "<25>{#f/7}* 誰也阻止不了我們。",
                        "<25>{#f/9}* 嘻嘻。\n* 想來也是真有意思...",
                        '<25>{#f/13}* 這種信念，\n  讓所有人疏遠我們...',
                        '<25>{#f/16}* ...卻也讓我們的紐帶\n  愈加牢固。',
                        '<26>{#f/17}* 聽著，$(name)。\n  只要我們上了飛船，\n  離開這鬼地方...',
                        "<25>{#f/17}* 就能永遠在一起了。",
                        "<25>{#f/23}* 這就是天意。"
                    ]
                    : [
                        '<25>{#f/13}* 該說的我都說了。',
                        "<25>{#f/17}* 繼續幹正事吧。"
                    ])
            ],
            monologueX5: ['<25>{#p/asriel2}{#f/17}* 你來帶路。'],
            monologueY: [
                "<25>{#p/asriel2}{#f/16}* ...我不想廢話。",
                "<26>{#f/13}* 為什麼來這，要幹什麼，\n  你比我都清楚。"
            ],
            afterfight1: ['<25>{#p/asriel2}{#f/8}* ...真費勁。'],
            afterfight2: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/8}* 看起來，人類都疏散走了。",
                        '<25>{#f/7}* ...嘖嘖。',
                        "<25>{#f/6}* 那老頭要以為\n  就憑這樣就能阻止咱們，\n  那他可真傻到家了。",
                        "<25>{#f/10}* 他明明可以\n  用人類靈魂的力量\n  消滅我們...",
                        "<26>{#f/16}* 但說實話...",
                        "<25>{#f/13}* 狠不下心，不敢動手，\n  才是我熟悉的Asgore。\n* 你說是吧？"
                    ],
                    ['<25>{#p/asriel2}{#f/6}* 等我一下。']
                ][Math.min(SAVE.flag.n.ga_asriel56++, 1)],
            afterfight3: () => [
                '<25>{#p/asriel2}{#f/16}* 核心即將熔毀。',
                ...(SAVE.flag.n.ga_asriel57++ < 1
                    ? [
                        '<25>{#f/5}* 現在，我們只需要\n  找到一艘特殊飛船...',
                        "<25>{#f/9}* 在飛船上，把我們倆的靈魂\n  連接在一起。\n* 這樣，我們就能衝出力場。"
                    ]
                    : [])
            ],
            afterfight4: ['<25>{#p/asriel2}{#f/3}* 跟我走。'],
            afterfight5a: ['<25>{#p/asriel2}{#f/5}* 我最親愛的Asgore！', '<25>{#f/5}* 最近活得滋潤不？'],
            afterfight5b: [
                '<25>{#p/asgore}{#f/5}* 比你想得還舒服。',
                "<25>{#p/asriel2}{#f/6}* 聽好了，你已經無處可逃。\n* 所以別跟我耍什麼花招。"
            ],
            afterfight6: [
                '<25>{#p/asgore}{#f/1}* 我沒想和你耍花招啊，\n  Asriel。',
                '<25>{#p/asgore}{#f/2}* 我也知道，離死不遠了。'
            ],
            afterfight7: ['<25>{#p/asriel2}{#f/10}* 我要把一切都炸成灰燼了，\n  臨死之前，有什麼遺言？'],
            afterfight8: [
                '<25>{#p/asriel2}{#f/15}* 沒有？',
                '<25>{#f/7}* 行。',
                "<25>{#f/6}* 那我們也不勞煩您嘞。",
                '<25>{#f/8}* 現在，把門禁卡\n  給我交出來。'
            ],
            afterfight10: ['<25>{#p/asriel2}{#f/1}* 跟我走，$(name)。', "<25>{#f/2}* 我真是受夠這死地方了。"],
            afterfight11: [
                '<25>{#p/asgore}{#f/5}* $(name)...？',
                '<25>{#p/asgore}{#f/6}* ...喔。\n* Asriel，一路順風喔。'
            ],
            afterfight12: ['<25>{#p/asriel2}{#f/16}* $(name)，別管他。\n* 這死地方愛咋咋地，\n  跟咱們一分錢關係都沒有。'],
            afterfight13: ['<25>{#p/asriel2}{#f/17}* 我只在乎你。'],
            coreboomA1: [
                '<18>{#p/papyrus}{#f/5}有人嗎？\n有人嗎？',
                "<18>{#p/papyrus}{#f/5}我想找到那個人類，\n就來這了，可是..."
            ],
            coreboomA2: ['<18>{#p/papyrus}{#f/8}不要...！'],
            coreboomA3: ['<32>{#p/basic}* Papyrus？{%40}'],
            coreboomA4: ["<18>{#p/papyrus}{#f/4}我有不好的預感...{%40}"],
            coreboomA5: ['<32>{#p/basic}* ...有人嗎？{%40}'],
            coretext1: ['<32>{#p/basic}{#s/spiderLaugh}* 穩住啊，親愛的~'],
            coretext2: ['<32>{#p/basic}{#s/spiderLaugh}* 嘎啊...', '<32>{#p/basic}* 一起再加把勁~'],
            coreboomB1: ['<32>{#p/basic}{#s/spiderLaugh}* 啊！', '<32>{#p/basic}* 不要這樣啊~'],
            coreboomB2: ['<32>{#p/basic}* 不要哪樣？{%40}'],
            coreboomB3: ['<32>{#p/basic}{#s/spiderLaugh}* 該死。{%40}'],
            coretext3: ['<18>{#p/papyrus}{#f/9}要幫忙嗎？'],
            coretext4a: ['<32>{#p/basic}{#s/spiderLaugh}* Papyrus！', "<32>{#p/basic}* 你還活著~"],
            coretext4b: ['<18>{#p/papyrus}{#f/6}我一塊肉都沒少！'],
            coretext5a: ['<18>{|}{#p/papyrus}{#f/4}啊不對，應該說- {%}'],
            coretext5b: [
                '<32>{#p/basic}{#s/spiderLaugh}* Papyrus，快去喊些幫手，\n  把系統改回手動控制！'
            ],
            coreboomC1: ["<18>{#p/papyrus}{#f/5}恐怕...\n這裡除了我們，沒別人了。"],
            coreboomC2: ['<18>{#p/papyrus}{#f/8}不要...！'],
            coreboomC3: ["<32>{#p/basic}{#s/spiderLaugh}* 撐不住了。{%40}"],
            coretext6: ["<32>{#p/basic}* 我馬上去叫那些機械師！"],
            coretext7: ['<18>{#p/papyrus}{#f/6}好，好，快去叫！'],
            coreboomD1: ['<32>{#p/basic}* ...', '<32>{#p/basic}* 沒人接。'],
            coreboomD2: ['<32>{#p/basic}* ...', "<32>{#p/basic}* 他們說，人手不足？！"],
            coreboomD3: ['<18>{#p/papyrus}{#f/5}可惡。{%40}'],
            coretext8: ['<32>{#p/basic}* ...', "<32>{#p/basic}* 改回手動控制了！"],
            coretext9: ['<32>{#p/basic}{#s/spiderLaugh}* 太好了~'],
            coretext10: ['<32>{#p/basic}* 快好了...'],
            coretext11: ['<32>{#p/basic}{#s/spiderLaugh}* 成功啦~'],
            coretext12a: ['<18>{#p/papyrus}{#f/0}我們成功了嗎？！？！'],
            coretext12b: ['<32>{#p/basic}{#s/spiderLaugh}* 啊呼呼...\n  還得有人進入控制臺\n  內部操控~'],
            coreboom12c: ["<32>{#p/basic}* 看我幹什麼！\n* 我就是個人偶！"],
            coreboom12d: ['<32>{#p/basic}{#s/spiderLaugh}* 而且是一個在特戰隊裡\n  待過的人偶~'],
            coreboom12e: ['<32>{#p/basic}* ...那都什麼陳年舊事了。'],
            coretext13: ["<32>{#p/napstablook}* 讓我來吧"],
            coretext14a: ['<18>{#p/papyrus}{#f/1}【你】從哪冒出來的？？？'],
            coretext14b: [
                '<32>{#p/napstablook}* 對不起...\n* 沒時間解釋了...',
                '<32>* 表親，保重...',
                '<32>* 好嗎？'
            ],
            coretext15: ['<32>{*}{#p/basic}{#s/spiderLaugh}* 你在幹什麼~{%40}'],
            coretext16: ["<32>{*}{#p/basic}* 不... 不！\n* ...我不想再失去親人了！{%40}"],
            coretext17: ['<32>{#p/napstablook}{*}* 我明白了...', '<32>* 我明白到底為什麼\n  不穩定了。'],
            coretext18: [
                "<33>{*}{#p/napstablook}* 應該就是這個原因...",
                '<32>{*}* 重設命令執行路徑就行。',
                '<32>{*}* 快點啊...'
            ],
            coretext19: ['<32>{#p/napstablook}* ...', '<32>{#p/napstablook}* 成功了...'],
            coretext20: [
                '<25>{#p/asgore}{#f/6}* 怎麼樣了？',
                '<18>{#p/papyrus}{#f/0}ASGORE！我們成功了！',
                '<18>{#p/papyrus}{#f/0}核心不會爆炸了！',
                '<32>{#p/basic}* ...我的表親，Blooky，它...',
                '<18>{#p/papyrus}{#f/5}人偶的表親做了件\n很了不起的事。'
            ],
            coretext21: ['<25>{#p/asgore}{#f/1}* 你叫什麼名字？'],
            coretext22: [
                '<32>{#p/basic}* 是說我嗎？',
                "<32>* 嗯...\n* 呃，現在我應該沒有名字了。",
                '<32>* 叫我「人偶」就行。'
            ],
            coretext23a: [
                '<25>{#p/asgore}{#f/1}* 呃，人偶... 聽我說。\n* 你很痛苦，大夥也都一樣。',
                '<25>{#f/2}* 今天，我們都失去了至親。'
            ],
            coretext23b1: ['<32>{#p/basic}{#s/spiderLaugh}* 當然，我可沒失去喔~'],
            coretext23b2: ['<32>{#p/basic}{#s/spiderLaugh}* ...我不是那個意思。\n  我跟大夥關係都蠻好啦...'],
            coretext24a: [
                "<18>{#p/papyrus}{#f/5}天哪...\n要是那人類沒饒恕我，\n我...",
                '<32>{#p/basic}* 人類饒恕你了？\n* 對，那人也饒恕我了...',
                '<32>{#p/basic}{#s/spiderLaugh}* 啊呼呼...\n  沒等那人下手，我就先逃了呢~',
                '<18>{#p/papyrus}{#f/0}...喔，對了！\n還有核心的員工！',
                '<18>{#p/papyrus}{#f/0}人類肯定也\n饒恕他們了！'
            ],
            coretext24b: ['<25>{#p/asgore}{#f/1}* ...請問，\n  人類饒恕你們的時候，\n  Asriel在場嗎？'],
            coretext25: [
                '<18>{#p/papyrus}{#f/9}當然不在！',
                '<32>{#p/basic}* 不在。',
                "<32>{#p/basic}{#s/spiderLaugh}* 想了一下，應該沒看到他~",
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#p/asgore}{#f/1}* 果然是這樣...',
                '<25>{#p/asgore}{#f/2}* ...或許...\n* 把過錯歸咎於人類，\n  是我的錯...',
                '<18>{#p/papyrus}{#f/6}...\n歸咎人類？？',
                '<18>{#p/papyrus}{#f/7}到底怎麼回事！！'
            ],
            coretext26: ['<18>{*}{#p/papyrus}{#f/7}ASGORE，你做了什麼？！{^40}{%}'],
            coretext27a: '{*}{#p/event}{#i/3}前哨站灰飛煙滅。',
            coretext27b: '{*}{#p/event}{#i/3}前哨站倖免於難。',
            respawn0: () =>
                [
                    [
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱倆都離開星港了，\n  你咋就沒摸下存檔點呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是說說而已。'
                        ],
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱倆都殺掉Undyne了，\n  你咋就沒摸下存檔點呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是說說而已。'
                        ],
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱倆都離開空境了，\n  你咋就沒摸下存檔點呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是說說而已。'
                        ],
                        [
                            '<25>{#p/asriel2}{#f/15}* 你是不是\n  在戰鬥後給自己下毒了？',
                            "<25>{#p/asriel2}{#f/16}* 真是絕了。"
                        ]
                    ],
                    [
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也該記得要儲存進度了吧。",
                            "<25>{#p/asriel2}{#f/8}* 雖說就算沒儲存，\n  區區星港，很快就過去了。",
                            '<25>{#p/asriel2}{#f/7}* 不過我看你是\n  一點記性沒長。'
                        ],
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也該記得要儲存進度了吧。",
                            '<26>{#p/asriel2}{#f/8}* 更何況，我們好不容易\n  才滅了Undyne。',
                            '<25>{#p/asriel2}{#f/7}* 不過我看你是\n  一點記性沒長。'
                        ],
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也該記得要儲存進度了吧。",
                            '<25>{#p/asriel2}{#f/8}* 更何況，我們好不容易\n  才滅了空境那些礙事的傢伙。',
                            '<25>{#p/asriel2}{#f/7}* 不過我看你是\n  一點記性沒長。'
                        ],
                        ['<26>{#p/asriel2}{#f/7}* 這才多久，\n  真是累死個人。']
                    ],
                    [
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，儲存下進度吧。'],
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，儲存下進度吧。'],
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，儲存下進度吧。'],
                        ["<25>{#p/asriel2}{#f/4}* 現在咋感覺你這麼煩呢。"]
                    ],
                    [
                        ['<25>{#p/asriel2}{#f/8}* 別再來了...'],
                        ['<25>{#p/asriel2}{#f/8}* 別再來了...'],
                        ['<25>{#p/asriel2}{#f/8}* 別再來了...'],
                        ['<25>{#p/asriel2}{#f/8}* 別再來了...']
                    ]
                ][Math.min(SAVE.flag.n.ga_asrielRespawn0++, 3)][Math.floor(SAVE.flag.n._genocide_milestone_last / 2)],
            respawn1: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/15}* 咋回來了？",
                        "<25>{#p/asriel2}{#f/16}* 大不了...\n  再殺他一次就好。"
                    ],
                    ['<25>{#p/asriel2}{#f/6}* 開玩笑嗎？'],
                    ['<25>{#p/asriel2}{#f/6}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn1++, 2)],
            respawn2: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/15}* 我們又回來了。\n* 呵，真是太棒了...",
                        '<25>{#p/asriel2}{#f/16}* 還行，問題不大...\n* 再來一遍吧...'
                    ],
                    ['<25>{#p/asriel2}{#f/8}* 我有點不耐煩了。'],
                    ['<25>{#p/asriel2}{#f/8}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn2++, 2)],
            respawn4: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* $(name)，\n  我們馬上就要把事\n  辦成了。',
                        '<25>{#p/asriel2}{#f/16}* 這次儲存下進度，\n  行不行啊？'
                    ],
                    ['<25>{#p/asriel2}{#f/10}* ...你逗我玩呢？'],
                    ['<25>{#p/asriel2}{#f/10}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn4++, 2)],
            respawn6: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* $(name)，聽好了。',
                        '<25>{#p/asriel2}{#f/7}* 我們已經幹掉她了。',
                        '<25>{#p/asriel2}{#f/5}* 那你還回溯時間幹嘛呢？'
                    ],
                    ["<25>{#p/asriel2}{#f/7}* ...你逗我呢？"],
                    ['<25>{#p/asriel2}{#f/7}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn6++, 2)],
            respawn7: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* 什麼鬼...',
                        "<25>{#p/asriel2}{#f/15}* 我發誓我們在逃生艇上..."
                    ],
                    [
                        '<25>{#p/asriel2}{#f/10}* $(name)，你是不是...',
                        "<25>{#p/asriel2}{#f/16}* ...不...\n* 你不會那麼做的..."
                    ],
                    [
                        '<25>{#p/asriel2}{#f/15}* ...',
                        '<25>{#p/asriel2}{#f/15}* $(name)？',
                        '<32>{#p/human}* （看起來Asriel陷入了沉思。）'
                    ],
                    ['<25>{#p/asriel2}{#f/15}* ...', '<32>{#p/human}* （看起來Asriel陷入了沉思。）']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn7++, 3)],
            respawnWitnessA: () =>
                [
                    ['<25>{#p/asriel2}{#f/9}* 怎麼回事？', '<25>{#p/asriel2}{#f/10}* ...誰攻擊了我們？'],
                    ['<25>{#p/asriel2}{#f/15}* 我們...', '<25>{#p/asriel2}{#f/10}* ...被一道電魔法擊中了？'],
                    [
                        "<25>{#p/asriel2}{#f/3}* 肯定是她，Alphys。",
                        "<25>{#p/asriel2}{#f/15}* 她竟然沒逃跑...",
                        '<25>{#p/asriel2}{#f/16}* 呵，有點意思。'
                    ]
                ][SAVE.flag.n.ga_asrielWitness++],
            respawnWitnessB: (wit: number) =>
                wit > 0
                    ? [
                        '<25>{#p/asriel2}{#f/15}* 果然是Alphys...',
                        '<25>{#p/asriel2}{#f/16}* 呵，有點意思。'
                    ]
                    : [
                        "<25>{#p/asriel2}{#f/15}* 她竟然沒逃跑...",
                        '<25>{#p/asriel2}{#f/16}* 呵，有點意思。'
                    ]
        },
        truetext: {
            monologue1: () => [
                '<32>{#p/basic}* 等等。',
                SAVE.data.b.flirt_papyrus
                    ? '<32>* 你有沒有\n  想起你還沒和Papyrus約會？'
                    : '<32>* 你有沒有\n  想起你還沒和Papyrus消遣過？',
                "<32>* ...嘿，我們可不能拋下他！"
            ],
            monologue2: [
                '<32>{#p/basic}* 等等。',
                "<32>* Papyrus之前不是\n  想讓你和Undyne消遣嗎？",
                "<32>* ...嘿，我們可不能拋下她！",
                "<32>* 儘管她有點混球。"
            ],
            monologue3: [
                '<32>{#p/basic}* 等等。',
                '<32>* 你忘了Undyne！',
                '<32>* 先是Papyrus，\n  現在連她也要？',
                "<33>* ...快點，我們得回到她家！"
            ],
            storyEnding: () => [
                '<32>{#p/basic}* ...\n* 現在你知道了。',
                "<32>* 因為你看過Asriel的日記，\n  所以你應該知道我是故意生病的。",
                '<32>* 為了拯救所有人，我騙了他，\n  操縱著他來執行這個愚蠢的計畫。',
                '<32>* 最後也只是讓它\n  演變成了一場復仇之旅，\n  即便那樣，計畫也沒有順利完成。',
                '<32>* 關鍵時刻，\n  他阻止了我向那些人類反擊，\n  因此我生了他很久的氣...',
                '<32>* ...',
                '<32>* 也許...\n  也許他那樣事出有因。',
                "<32>* 我不知道。",
                "<32>* 我總在想，如果當時他聽了我的話，\n  事情會如何發展...",
                
                "<32>* ...但與此同時我也在思考...\n* 也許這樣才是最好的吧。",
                '<32>* ...',
                '<32>* 嘿... 我只是想讓你知道，\n  有你在我身邊...',
                "<32>* 讓我覺得，\n  我存在於這個世界\n  也不是沒有意義了。",
                "<32>* 為此，我想謝謝你。",
                '<32>* 我真的覺得，\n  一切都會好起來的。',
                '<32>* 或者說...\n  一切即將迎來最好的結局。',
                '<32>* ...不管以什麼方式。',
                "<32>* 很快就要到力場那邊了。",
                ...(SAVE.data.n.plot_date < 2.1
                    ? [
                        '<32>* 不過，在我們前往之前...',
                        ...(SAVE.data.n.plot_date < 1.1
                            ? [
                                '<32>* 我們真的應該回去找Papyrus。',
                                "<32>* 你不會想讓他等太久吧？"
                            ]
                            : [
                                '<32>* 我們真的應該回去找Undyne。',
                                "<32>* 你不會想讓\n  Papyrus在她家門前等太久吧？"
                            ])
                    ]
                    : [
                        "<32>* 你大概聽夠了我的廢話，\n  所以我們該走了。",
                        "<32>* 至於為何...\n* 也許等力場消失了，\n  答案就會顯現出來。",
                        "<32>* ...我們等著瞧好了。"
                    ])
            ],
            epilogue: [
                () => [
                    "<32>{#p/basic}* 當然這不是說\n  我們現在就得去找他。",
                    "<32>* 就只是..",
                    '<32>* ...',
                    '<32>{#p/human}* （你聽到一聲長嘆。）',
                    '<32>{#p/basic}* Frisk...',
                    "<32>* 有些事，之前一直沒跟你說。",
                    "<32>* 跟我的過去有關...",
                    "<32>* 也關乎於為什麼\n  我這麼想要去和他談談。",
                    "<32>* 我很抱歉。",
                    
                    '<32>* 我只是...\n* 我得告訴你\n  我是如何走到今天這一步的。',
                    '<32>* 我需要你的理解。'
                ],
                () => [
                    '<32>{#p/basic}* Frisk...',
                    "<32>* 你能想像一夜之間\n  失去所有至親是什麼感覺嗎？",
                    
                    "<32>* 你能想像...\n* 知道這些過錯\n  全都歸咎於自己是什麼感覺？",
                    '<32>* ...',
                    '<32>* 在過去的一百年裡...',
                    "<32>* 我就像被困在地獄的邊境。",
                    
                    "<32>* 不管我怎麼努力...\n  都無法掙脫這種枷鎖。",
                    '<32>* ...',
                    "<32>* 我只能看著其他人\n  過著他們自己的生活。",
                    '<32>* 看著他們交朋友...\n  他們歡笑... 他們戀愛...',
                    
                    "<32>* 這樣幸福的生活...\n  我也體驗過。",
                    '<32>* 如今... 我卻只能看著...',
                    '<32>* 就只能作為一個旁觀者...\n  默默注視著他們享受著生活...'
                ],
                () => [
                    '<32>{#p/basic}* 當幽靈家族找到我時，\n  已經離那個事件過去好幾天了。',
                    "<32>* 我想，也許，\n  這還沒有那麼糟糕。",
                    '<32>* 我也許身處煉獄，但是...',
                    "<32>* ...至少還能有人陪我聊天，對吧？",
                    '<32>* ...',
                    '<32>* 他們嘗試幫助我...',
                    '<32>* 他們嘗試讓我感受到家的溫暖...',
                    "<32>* ...但是他們\n  沒人能夠理解我所經歷的。",
                    '<32>* 他們如此年輕...',
                    '<32>* 老實說，現在還是。',
                    '<32>* 怪物的心態就如同孩童...',
                    '<32>* 他們的純真定義了他們。',
                    "<32>* 但這也表示\n  我與他們之間無法相處...",
                    '<32>* ...',
                    
                    "<32>* 從那時起...\n  我一直孑然一身。"
                ],
                () => [
                    '<32>{#p/basic}* 這麼多年來都是以影為伴...',
                    '<32>* 百無聊賴，行思坐想...',
                    "<32>* 我沒有精神失常真是個奇蹟。",
                    '<32>* 該死，但這也許就是\n  上天對我的「懲罰」。',
                    '<32>* 不弄死我，不逼瘋我，\n  也不讓我看起來「孤獨」...',
                    '<32>* 而無論如何，\n  我都無法逃離這樣的困境。',
                    "<32>* ...\n* 但這理論有一個問題。",
                    '<32>* 一個例外。\n* 你猜是什麼？',
                    
                    "<32>* 我想你已經明白了...",
                    '<32>* ...',
                    "<32>* 是你，Frisk。",
                    "<32>* 你是唯一一個能夠理解我的人。"
                ],
                () => [
                    "<32>{#p/basic}* 你也許認為\n  其他人類可以聆聽我的心聲。",
                    '<32>* ...但是不行。',
                    "<32>* 有時，我會跟他們插句話...",
                    '<32>* 或者與他們夢中相會。',
                    '<32>* 但是除了你...',
                    "<32>* 也許是因為我們的\n  靈魂特質相同，但是...",
                    '<32>* 不只你能夠聆聽我...',
                    '<32>* 我也能「聆聽」你。',
                    "<32>* 雖然不多，\n  但足以知道你在想什麼。",
                    '<32>* 比如，現在...',
                    '<32>* ...',
                    '<32>* Frisk，你...',
                    "<32>* ...你知道那不可能發生的對吧？",
                    choicer.create('* （你想怎麼擁抱？）', '溫柔地', '緊緊地', '小心地', '拼命地'),
                    '<32>{#p/basic}* ...笨蛋Frisk。',
                    '<32>* 如果可以的話，\n  我會接受的。',
                    "<32>* 可惜... 我無法做到..."
                ],
                () => [
                    '<32>{#p/basic}* Frisk，我...',
                    "<32>* 我知道我是\n  最不可能說這種話的人，\n  但是...",
                    '<32>* 我真的愛你，Frisk。',
                    '<32>* 就像我愛他一樣。',
                    "<32>* 我們此時就像...\n  一個真正的家庭。",
                    '<32>* 嘿。',
                    '<32>* ...謝謝你給了我一次\n  重新感受世界的機會。',
                    '<32>* ...謝謝你成為了這樣的人。',
                    '<32>* 但是... Frisk。',
                    "<32>* 我不確定\n  我是否在這個世界上是否有未來。",
                    "<32>* 一旦你走了...",
                    "<32>* ...我將會再次孤身一人。",
                    "<32>* 那就是為什麼... \n  我這麼心急如焚地想與他聊聊，\n  你知道嗎？",
                    "<32>* 至少那時，\n  我就可以從已經發生的事中\n  走出來。",
                    "<32>* 這樣就算仍然孤獨...\n  但也不會那麼悲哀了。",
                    '<32>* 但是... 我知道。',
                    "<32>* 我確定你還有很多人\n  想要了解一下。",
                    '<33>* 所以，先去做那些事吧，\n  然後...',
                    "<32>* 一旦你準備好...",
                    "<32>* ...我們就去找他，好嗎？",
                    
                    '<32>* ...',
                    "<32>* 嗯，我說完了。",
                    "<32>* 來吧，我們繼續吧。"
                ]
            ]
        },
        npc: {
            picnic_oni: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 之前我就聽說過首塔，\n  但從沒來過這裡。\n* 這裡挺不錯的。",
                    "<32>* 雖然這裡是個大城市，\n  但在這裡反而沒那麼容易迷路！",
                    "<32>* 這倒挺不錯的。"
                ],
                ["<32>{#p/basic}{#npc/a}* 我特別反感彎彎繞繞的房間\n  和奇怪的謎題。\n* 所以首塔這樣挺好的。"]
            ),
            picnic_clamguy: pager.create(
                0,
                [
                    '<32>{#p/basic}{#npc/a}* 不知道他們是怎麼\n  在這麼短的時間\n  建成這座城市的。',
                    "<32>* 空境是靠著奇怪的空間摺疊，\n  所以才看起來比較大。\n* 但這裡不是這樣。",
                    "<32>* 那些技術名詞我也不懂，\n  在這裡生活就挺好的。"
                ],
                ['<32>{#p/basic}{#npc/a}* 每天不用去想\n  那些高深的技術名詞...\n* 這樣就挺好的。']
            ),
            picnic_charles: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 別管我，我只是在和我\n  最好的朋友一起消遣！",
                    '<32>* 在核心工作真的很辛苦...\n  但現在我們的工作都完成了。',
                    '<32>* 此時，我們可以慶祝\n  我們的優異成績！',
                    '<32>* 我愛死消遣了！'
                ],
                ['<32>{#p/basic}{#npc/a}* 我敢說你也會喜歡上的！']
            ),
            picnic_proskater: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 這... 我們不用上學了？\n* 其實，說實話吧，之前是我的錯。",
                    '<32>* 沒有人非要去上學，\n  但不去上學肯定會更糟。',
                    "<32>* 哎，隨他去吧。\n* 估計我現在還沒搞明白\n  我到底想要什麼。"
                ],
                ['<32>{#p/basic}{#npc/a}* 每天都來聚會的話，\n  估計會很好玩吧...']
            ),
            picnic_papyrus: pager.create(
                0,
                [
                    '<18>{#p/papyrus}{#f/0}{#npc/a}你好啊，FRISK！',
                    "<18>{#f/9}我正做菜呢，做的還是\n我最拿手的好菜！",
                    "<18>{#f/5}只是火候不行，\n得花好長時間...",
                    "<18>{#f/7}照這樣下去，等我做好了，\n大夥都坐飛船出發了！",
                    "<25>{#p/sans}{#npc}* 大夥在船上品嘗佳餚，\n  多酷啊。",
                    '<25>{#p/sans}{#f/3}* 想想看，人們聚在一起，\n  一邊遐想新家園的美景，\n  一邊品嘗面前的佳餚...',
                    "<25>{#p/sans}{#f/2}* 這頓大餐，\n  他們肯定終生難忘。",
                    '<18>{#p/papyrus}{#f/4}{#npc/a}說得倒好聽...',
                    "<18>{#p/papyrus}{#f/5}但我都答應他們\n出發前就能吃上大餐了，\n現在咋辦？"
                ],
                [
                    "<18>{#p/papyrus}{#f/5}{#npc/a}仔細一想，\n也沒那麼壞。",
                    "<18>{#f/0}沒想到，ASGORE的廚房\n居然有這麼多\n寶藏調料！",
                    '<18>{#f/4}除了鹽和胡椒...\n還有反重力粉末！',
                    '<18>{#f/9}小小的廚房，\n藏著無限的可能！'
                ],
                [
                    "<18>{#p/papyrus}{#f/0}{#npc/a}放心，我不會做著做著\n就走火入魔的。",
                    "<18>{#f/5}畢竟要招待\n那麼多貴客...\n還是穩妥點為好。",
                    
                    '<18>{#f/9}更何況，做菜要用啥調料，\n菜譜上都寫得清清楚楚！',
                    '<18>{#f/4}據說，那些調料進了嘴，\n還能在嘴裡懸浮...'
                ],
                ['<18>{#p/papyrus}{#f/0}{#npc/a}啥都不用擔心！']
            ),
            picnic_kidd: pager.create(
                0,
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* 呦，呃...', '<25>{#f/4}* 離我遠點。']
                        : [
                            "<25>{#p/kidd}{#f/2}{#npc/a}* 夥計，我會想這個地方的...",
                            '<25>{#f/3}* 星港，鑄廠，空境，首塔...',
                            "<25>{#f/6}* 至少在新家園上\n  我們也會在一起。",
                            "<25>{#f/1}* 等不及看看外面的世界\n  是怎麼樣的了！"
                        ],
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* ...']
                        : [
                            '<25>{#p/kidd}{#f/1}{#npc/a}{#f/4}* ...喔，呃，\n  你可能已經發現了，\n  不過我還是想承認一下...',
                            "<25>{#f/4}* 我撒了謊，我其實沒有爹娘。\n* 我編造了他們的存在。",
                            "<26>{#f/3}* 不過我們是朋友，對吧？\n  所以... 希望你原諒我。"
                        ],
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* 滾開啊...']
                        : ['<25>{#p/kidd}{#f/3}{#npc/a}* 謝謝你能做我的朋友，\n  Frisk。']
            ),
            picnic_dragon: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 你說必須等大夥都準備好了才能走？",
                    "<32>* 我，呃，其實挺合理的。",
                    "<32>* 行，我接受。"
                ],
                ["<32>{#p/basic}{#npc/a}* 我抱怨啥呢？\n* 我們都自由了..."]
            ),
            tvfish: pager.create(
                0,
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            '<25>{#p/undyne}{#f/14}{#npc/a}* 跟休閒迴廊的姑娘們\n  一塊淘垃圾的時候，\n  發現了這部電影。',
                            "<25>{#f/1}* 我和Alphys就打算一起看。",
                            "<25>{#f/8}* 呋呼呼！！\n* 這次約會最棒了！！",
                            "<25>{#f/12}* 呃，我好像就\n  約會過這麼一次。",
                            '<25>{#f/7}* 不過之前的話依舊算數！'
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            '<25>{#p/undyne}{#f/1}{#npc/a}* 沒想到看電影\n  這麼讓人著迷！',
                            '<25>{#p/undyne}{#f/12}{#npc/a}* 所以現在...\n* 你能不能讓我們\n  安心看電影呢...'
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : ["<25>{#p/undyne}{#f/7}{#npc/a}* 嘿嘿嘿，\n  你把電視擋住了！"]
            ),
            tvlizard: pager.create(
                0,
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : SAVE.data.b.c_state_secret3 && !SAVE.data.b.c_state_secret3_used
                            ? ((SAVE.data.b.c_state_secret3_used = true),
                                [
                                    '<25>{#p/alphys}{#g/alphysInquisitive}{#npc/a}* ...嗯？\n* 你有話想對我說？',
                                    '<32>{#p/human}* （你背了一遍六號檔案的Roman教授\n  交給你的筆記。）',
                                    '<25>{#p/alphys}{#g/alphysOhGodNo}* 哇... 哇喔！',
                                    '<25>{#g/alphysNervousLaugh}* 這搞不好是進行\n  星系間高速旅行的關鍵啊...',
                                    '<25>{#g/alphysHellYeah}* ...確切點說，蟲洞旅行！',
                                    "<25>{#g/alphysWelp}* 花了很多年，我也沒\n  研究明白這個技術啊..."
                                ])
                            : [
                                '<25>{#p/alphys}{#g/alphysCutscene1}{#npc/a}* 終於啊！\n* 我找了這麼多年，\n  今天終於找到你了！',
                                '<25>{#g/alphysHellYeah}* 《喵喵三部曲》第三部——\n  《喵喵之扭轉時空》！',
                                '<25>{#g/alphysWelp}* 這部也是《喵喵航天行》的\n  正統續作。',
                                '<25>{#g/alphysYeahYouKnowWhatsUp}* 就連《星火》系列\n  都黯然失色了...'
                            ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            "<25>{#p/alphys}{#g/alphysHellYeah}{#npc/a}* 快燃起來了！",
                            "<25>{#p/alphys}{#g/alphysFR}{#npc/a}* ...不介意的話..."
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : ['<25>{#p/alphys}{#g/alphysYupEverythingsFine}{#npc/a}* 電影第一，\n  閒聊第二。']
            ),
            picnic_asgore: pager.create(
                0,
                () => [
                    SAVE.data.b.c_state_secret5_used
                        ? '<25>{#p/asgore}{#npc/a}{#f/1}* Frisk，放心。\n* 我可不會忘了\n  自己許下的諾言。'
                        : '<25>{#p/asgore}{#npc/a}{#f/6}* 不用管我，Frisk。\n* 我只是在找新衣服。',
                    ...(SAVE.data.b.c_state_secret5 && !SAVE.data.b.c_state_secret5_used
                        ? ((SAVE.data.b.c_state_secret5_used = true),
                            [
                                '<25>{#p/asgore}{#npc/a}{#f/21}* 喔？\n* 你有話想對我說？',
                                '<32>{#npc}{#p/human}* （你複述了六號檔案的Asgore\n  對你做出的承諾。）',
                                '<25>{#p/asgore}{#npc/a}{#f/8}* ...！',
                                '<25>{#f/1}* Frisk...',
                                '<25>{#f/1}* ...不確定我能不能做到，\n  不過...',
                                '<25>{#f/6}* 為了你，我會試試的。'
                            ])
                        : [])
                ],
                () =>
                    SAVE.data.b.c_state_secret5_used
                        ? ['<25>{#p/asgore}{#npc/a}{#f/1}* 希望有機會能和她談談吧。']
                        : ['<25>{#p/asgore}{#npc/a}{#f/6}* 人類喜歡穿棕色的衣服嗎？'],
                () =>
                    SAVE.data.b.c_state_secret5_used
                        ? ['<25>{#p/asgore}{#npc/a}{#f/2}* ...']
                        : ['<25>{#p/asgore}{#npc/a}{#f/21}* 啦啦啦，找衣衣...']
            )
        },
        story: {
            lv20: ['<32>{#p/human}* （飛船漸行漸遠。）'],
            postnoot0: () =>
                world.trueKills === 0 && SAVE.data.n.state_foundry_undyne !== 1 && SAVE.flag.n.neutral_twinkly_choice === 0
                    ? [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/1}...為什麼？',
                        '<25>{*}{#e/twinkly/2}為什麼放我走？',
                        "<25>{*}{#e/twinkly/6}你就沒發現，\n付出了那麼多...",
                        '<25>{*}{#e/twinkly/7}...到頭來，\n還是傷了自己？',
                        '<25>{*}{#e/twinkly/5}你瞧瞧你。',
                        ...(SAVE.data.b.ultrashortcut
                            ? [
                                "<25>{*}{#e/twinkly/3}一路上，遇見這麼多...",
                                '<25>{*}{#e/twinkly/4}...呃...',
                                '<25>{*}{#e/twinkly/0}幹，忘了，你走捷徑了。\n好多人，好多事，你都沒見過。',
                                "<25>{*}{#e/twinkly/24}哎呦我去，本來挺有感觸，\n有好多話想對你說的。",
                                "<25>{*}{#e/twinkly/15}...直入正題算了。",
                                '<25>{*}{#e/twinkly/21}...'
                            ]
                            : [
                                "<25>{*}{#e/twinkly/3}一路上，遇見這麼多好友...",
                                "<25>{*}{#e/twinkly/4}這麼快，又要各奔東西，\n也許這輩子都不會再見了。",
                                "<25>{*}{#e/twinkly/0}不僅如此，\n他們又要苦苦等待\n下一個人類到來。",
                                "<25>{*}{#e/twinkly/1}真悲哀啊...",
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? SAVE.flag.n.genocide_milestone < 7
                                        ? ['<25>{*}{#e/twinkly/7}要是你沒背叛\n我們本來的計畫...']
                                        : ['<25>{*}{#e/twinkly/7}上回，我們肩並肩，\n毀滅了前哨站。\n要是你這回也狠點心...']
                                    : ['<25>{*}{#e/twinkly/7}要是這一路上，\n你沒在乎過別人的話...']),
                                "<25>{*}{#e/twinkly/1}現在就不用這麼難過了。",
                                "<25>{*}{#e/twinkly/8}...那我就不明白了。",
                                '<25>{*}{#e/twinkly/13}要是你啥都沒做錯...',
                                '<25>{*}{#e/twinkly/1}最後為啥會這樣呢？',
                                '<25>{*}{#e/twinkly/2}...到底為什麼呢？',
                                '<25>{*}{#e/twinkly/2}難道生活真的如此不公？',
                                '<25>{*}{#e/twinkly/3}...',
                                '<25>{*}{#e/twinkly/0}...嘿。'
                            ]),
                        '<25>{*}{#e/twinkly/21}要是我說...',
                        '<25>{*}{#e/twinkly/15}我有辦法讓你\n得到更好的結局呢？',
                        ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                            ? ["<25>{*}{#e/twinkly/20}你得從頭來過，\n然後..."]
                            : ["<25>{*}{#e/twinkly/20}你得從這繼續，\n然後..."]),
                        ...(SAVE.data.n.plot_date === 2.1
                            ? [
                                "<25>{*}{#e/twinkly/15}再去見見Asgore怎麼樣？",
                                "<25>{*}{#e/twinkly/17}你只要這麼做了，\n我保證不會再殺他。"
                            ]
                            : 1.1 <= SAVE.data.n.plot_date
                                ? [
                                    "<25>{*}{#e/twinkly/15}去會會Undyne怎麼樣？",
                                    '<25>{*}{#e/twinkly/15}說不定，你們能做好朋友呢。',
                                    '<25>{*}{#e/twinkly/20}天曉得...',
                                    "<25>{*}{#e/twinkly/17}她是不是你走向幸福的關鍵呢？"
                                ]
                                : [
                                    "<25>{*}{#e/twinkly/15}去看看Papyrus，\n接著再會會Undyne，怎麼樣？",
                                    '<25>{*}{#e/twinkly/15}說不定，你們能做好朋友呢。',
                                    '<25>{*}{#e/twinkly/20}天曉得...',
                                    "<25>{*}{#e/twinkly/17}他們是不是你走向幸福的關鍵呢？"
                                ]),
                        '<25>{*}{#e/twinkly/0}...',
                        '<25>{*}{#e/twinkly/15}回見。'
                    ]
                    : [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}嘿。',
                        "<25>{*}{#e/twinkly/0}你打敗我後，\n我就一直在尋思。",
                        ...(world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                            ? [
                                '<25>{*}{#e/twinkly/2}...真的有必要殺人嗎？',
                                '<25>{*}{#e/twinkly/3}我...',
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? [
                                        '<25>{*}{#e/twinkly/1}上回和你一起殺人\n確實很爽，可是...',
                                        '<25>{*}{#e/twinkly/2}殺了人，我們有得到什麼嗎？'
                                    ]
                                    : [
                                        "<25>{*}{#e/twinkly/4}我有點吃不準了。",
                                        '<25>{*}{#e/twinkly/2}殺了人，你有得到什麼嗎？'
                                    ]),

                                '<25>{*}{#e/twinkly/13}除了一時的快感...'
                            ]
                            : [
                                '<25>{*}{#e/twinkly/2}你饒恕了他們，\n又殺了我，這值得嗎？',
                                '<25>{*}{#e/twinkly/3}你...',
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? [
                                        '<25>{*}{#e/twinkly/1}你大概很後悔\n上回和我一起殺人，\n可是...',
                                        '<25>{*}{#e/twinkly/2}你真覺得殺了我，\n就能讓自己心安嗎？'
                                    ]
                                    : [
                                        "<25>{*}{#e/twinkly/4}你大概不喜歡我的作風，\n可是...",
                                        '<25>{*}{#e/twinkly/2}你真覺得殺了我，\n就能淨化這個世界嗎？'
                                    ]),
                                '<25>{*}{#e/twinkly/13}殺了我，你宣洩了不滿，\n然後還有啥好處嗎？'
                            ]),
                        '<25>{*}{#e/twinkly/3}...什麼都沒有了。',
                        '<25>{*}{#e/twinkly/0}...',
                        '<25>{*}{#e/twinkly/0}我給你出個主意吧。',
                        ...(world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                            ? [
                                '<25>{*}{#e/twinkly/15}也是一項挑戰，\n看你接不接受。',
                                ...(SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                    ? ["<25>{*}{#e/twinkly/14}都不用我多說了，\n你得從頭來過..."]
                                    : ["<25>{*}{#e/twinkly/14}都不用我多說了，\n你得重置時間軸..."]),
                                "<25>{*}{#e/twinkly/15}不過，要是你能\n證明自己有本事活下來...",
                                
                                ...(world.trueKills > 0
                                    ? [
                                        '<25>{*}{#e/twinkly/0}...就算不殺任何人，\n你也能走到這，活下來...',
                                        "<25>{*}{#e/twinkly/18}...那我也許會\n放國王一馬。"
                                    ]
                                    : [
                                        '<25>{*}{#e/twinkly/0}...就算救下敵人，\n你也能走到這，活下來...',
                                        "<25>{*}{#e/twinkly/18}...國王也許就\n不是非死不可了。"
                                    ])
                            ]
                            : [
                                '<25>{*}{#e/twinkly/15}也算個請求，\n不知道你答不答應。',
                                ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                    ? ["<25>{*}{#e/twinkly/20}你得從頭來過，\n然後..."]
                                    : ["<25>{*}{#e/twinkly/20}你得從這繼續，\n然後..."]),
                                '<25>{*}{#e/twinkly/15}一路走到Asgore面前。',
                                '<25>{*}{#e/twinkly/17}而且，中途不能殺任何怪物。'
                            ]),
                        "<25>{*}{#e/twinkly/20}你是不是也很好奇\n他正密謀什麼計畫？",
                        '<25>{*}{#e/twinkly/20}是不是也很好奇\n被他當成寶一樣的「檔案」\n裡面到底長啥樣？',
                        '<25>{*}{#e/twinkly/15}嗯...',
                        '<25>{*}{#e/twinkly/15}其實，\n在咱倆開戰之前\n你走過的那條長廊...',
                        "<25>{*}{#e/twinkly/20}...都不足整個「檔案」的\n冰山一角。",
                        '<25>{*}{#e/twinkly/17}嘻嘻嘻。',
                        "<25>{*}{#e/twinkly/18}好奇的話，\n就自己進去看看！"
                    ],
            postnoot1: (rep: number) =>
                rep < 2
                    ? [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/17}咋的了？\n哎呀呀，好可惜呢。",
                        ...(rep < 1
                            ? ["<25>{*}{#e/twinkly/17}你怎麼沒獲得\n幸福結局呢？"]
                            : ["<25>{*}{#e/twinkly/17}你怎麼還沒獲得\n幸福結局呢？"]),
                        ...(SAVE.data.b.ultrashortcut
                            ? [
                                '<25>{*}{#e/twinkly/21}...',
                                ...(SAVE.flag.b.ultra_twinkly
                                    ? [
                                        "<25>{*}{#e/twinkly/21}真無語...\n你要是跳一次流程也就罷了。",
                                        "<25>{*}{#e/twinkly/16}結果呢？\n這次還是沒記性，\n又玩速通！",
                                        "<25>{*}{#e/twinkly/15}呵，意料之中。",
                                        '<25>{*}{#e/twinkly/15}覺得打破規則，\n很爽，很好玩，對吧？\n我理解。',
                                        "<25>{*}{#e/twinkly/20}不過，你早晚會知道\n自己這麼闖，\n到底把誰給跳過了...",
                                        "<25>{*}{#e/twinkly/15}見了那傢伙，\n別讓人家把你弄死了。\n你還得回來見國王呢。",
                                        '<25>{*}{#e/twinkly/15}而且，全程誰也不能殺。',
                                        '<25>{*}{#e/twinkly/18}別裝傻，\n老老實實按我說的做！'
                                    ]
                                    : [
                                        '<25>{*}{#e/twinkly/21}哎呀，真好奇呢。\n為什麼國王會死呢？',
                                        "<25>{*}{#e/twinkly/16}下次別走捷徑，\n跳過中間的旅途了！",
                                        '<25>{*}{#e/twinkly/24}...哎，算了。\n聽不聽隨你便。',
                                        '<25>{*}{#e/twinkly/23}好好享受\n你的「特殊結局」吧。'
                                    ])
                            ]
                            : world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                                ? [
                                    ...(rep < 1
                                        ? [
                                            '<25>{*}{#e/twinkly/20}...',
                                            '<25>{*}{#e/twinkly/20}哎呀呀...',
                                            world.trueKills > 1
                                                ? "<25>{*}{#e/twinkly/16}記住，\n下把誰也別殺！"
                                                : world.trueKills > 0
                                                    ? "<25>{*}{#e/twinkly/16}記住，\n下把§fill=#ff0§一隻§fill=#fff§怪物也別殺！"
                                                    : "<25>{*}{#e/twinkly/16}記住，下把別把那誰\n㫰著等死了！",
                                            '<25>{*}{#e/twinkly/15}你要是做得到，\n還跟Papyrus和Undyne交了朋友...',
                                            ...(SAVE.data.b.ubershortcut
                                                ? ["<25>{*}{#e/twinkly/15}就用不著跳過一整個地區了。"]
                                                : ['<25>{*}{#e/twinkly/15}就能去一個\n從未去過的新地方了。'])
                                        ]
                                        : [
                                            '<25>{*}{#e/twinkly/14}...',
                                            '<25>{*}{#e/twinkly/14}聽我句勸...',
                                            world.trueKills > 1
                                                ? "<25>{*}{#e/twinkly/22}下把，真的真的\n別殺任何怪物了！"
                                                : world.trueKills > 0
                                                    ? "<25>{*}{#e/twinkly/22}下把，真的真的\n別殺哪怕§fill=#ff0§一隻§fill=#fff§怪物了！"
                                                    : "<25>{*}{#e/twinkly/22}下把，真的真的\n別把那誰㫰著等死了！",
                                            ...(SAVE.data.b.ubershortcut
                                                ? ["<25>{*}{#e/twinkly/22}也別跳過\n一整個地區了！"]
                                                : ['<25>{*}{#e/twinkly/22}就這點小事，\n咋對你就這麼費勁呢？'])
                                        ])
                                ]
                                : [
                                    '<25>{*}{#e/twinkly/0}...',
                                    ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                        ? ['<25>{*}{#e/twinkly/21}我跟你說...\n要是你聽我勸，\n從頭開始...']
                                        : ['<25>{*}{#e/twinkly/21}我跟你說...\n要是你聽我勸，\n繼續前進...']),
                                    ...(rep < 1
                                        ? [
                                            1.1 <= SAVE.data.n.plot_date
                                                ? "<25>{*}{#e/twinkly/15}就有機會和Undyne\n成為好朋友。"
                                                : "<25>{*}{#e/twinkly/15}就有機會\n跟Papyrus與Undyne兩人\n成為好朋友。",

                                            '<25>{*}{#e/twinkly/14}人們都說「同舟共濟」...',
                                            '<25>{*}{#e/twinkly/23}這次，就相信友情吧。'
                                        ]
                                        : [
                                            1.1 <= SAVE.data.n.plot_date
                                                ? "<25>{*}{#e/twinkly/16}就肯定能跟Undyne\n成為好朋友！"
                                                : "<25>{*}{#e/twinkly/16}就肯定能跟\nUndyne和Papyrus\n成為好朋友！",
                                            "<25>{*}{#e/twinkly/20}有了朋友，再大的困難\n又算的了什麼呢？",
                                            "<25>{*}{#e/twinkly/15}之後的發展\n肯定會非常有趣。"
                                        ])
                                ])
                    ]
                    : [
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/15}...嗯...',
                            '<25>{*}{#e/twinkly/15}最近忙活啥呢？',
                            '<25>{*}{#e/twinkly/15}交到新朋友了嗎？',
                            '<25>{*}{#e/twinkly/0}...',
                            '<25>{*}{#e/twinkly/17}...說說我自己吧。\n放以前，我可是「交際花」。',
                            '<25>{*}{#e/twinkly/20}那時我的朋友可多了，\n比如，Papyrus。',
                            "<25>{*}{#e/twinkly/15}在我的特訓下，\n他可是當過皇家守衛的，\n不過他肯定不記得了。",
                            '<25>{*}{#e/twinkly/18}其實，他後來甚至當上隊長了！',
                            "<25>{*}{#e/twinkly/24}...雖說過程蠻苦的。",
                            "<25>{*}{#e/twinkly/15}好——幾次骨頭都給他打折了。",
                            '<25>{*}{#e/twinkly/19}不過之後，他也變得強多了！',
                            '<25>{*}{#e/twinkly/17}找對方法，人的變化就是能這麼大。\n挺有意思吧？',
                            "<25>{*}{#e/twinkly/15}不過呢，那條時間軸\n早就隨風而去了。",
                            '<25>{*}{#e/twinkly/20}嘿，要是你啥時候\n又來這看看...',
                            "<25>{*}{#e/twinkly/18}我可以再嘮點\n其它時間軸的趣事。"
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/20}又來聽故事了？',
                            '<25>{*}{#e/twinkly/15}喔，我想啥呢。\n肯定的。',
                            '<25>{*}{#e/twinkly/21}這次聊啥呢...',
                            '<25>{*}{#e/twinkly/0}...擺著人類休眠倉的\n那間暗室怎麼樣？',
                            "<25>{*}{#e/twinkly/15}想進那兒可費老勁了，\n對我也一樣。",
                            '<25>{*}{#e/twinkly/24}早些的時間軸裡，我想了些...\n蠢到家了的法子。',
                            '<25>{*}{#e/twinkly/13}什麼直接求Asgore啦....\n跟他談條件啦...\n硬憋點眼淚賣慘啦...',
                            '<25>{*}{#e/twinkly/4}...甚至撒嬌賣萌，\n就為了讓他開下門。',
                            '<25>{*}{#e/twinkly/0}我想做個「乖孩子」，\n可「乖孩子」什麼獎勵都沒得到。',
                            '<25>{*}{#e/twinkly/15}後來的時間軸裡\n我就學精了。',
                            '<25>{*}{#e/twinkly/20}我裝都不裝了，\n直接把空氣停了，憋死他們。\n這招可好使了。',
                            '<25>{*}{#e/twinkly/16}不過，使勁加重力，\n看著他們被重力壓死\n那才更好玩！',
                            "<25>{*}{#e/twinkly/15}說這麼多，\n我想你明白個事：\n那間暗室一般不放人進。",
                            "<25>{*}{#e/twinkly/17}他們需要你，故意放你進，\n你才能這麼容易進去。",
                            "<25>{*}{#e/twinkly/20}好啦，我說完了。",
                            '<25>{*}{#e/twinkly/19}拜-拜！'
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/14}逗我呢？\n你咋又來？',
                            '<25>{*}{#e/twinkly/0}哇喔。',
                            '<25>{*}{#e/twinkly/0}重複這麼多次，\n是不是覺得沒意思了？',
                            "<25>{*}{#e/twinkly/15}我理解，\n我比你還沒意思。",
                            '<25>{*}{#e/twinkly/20}我就納悶了...',
                            '<25>{*}{#e/twinkly/20}按我說的做，\n就這麼難？',
                            '<25>{*}{#e/twinkly/20}還是說，你是故意的？',
                            "<25>{*}{#e/twinkly/15}...欸，別說。",
                            '<25>{*}{#e/twinkly/18}啥事都弄太明白，\n那就沒意思了。',
                            "<25>{*}{#e/twinkly/15}話說，我現在心情不錯。",
                            '<25>{*}{#e/twinkly/20}...那姑且信你一把好了。',
                            '<25>{*}{#e/twinkly/14}要是您真蠢得自成一派，\n蠢得遠近聞名...\n就勞煩您再回來一次。',
                            '<25>{*}{#e/twinkly/15}到那時，我給您一點提示。',
                            '<25>{*}{#e/twinkly/17}...再見。'
                        ],
                        [
                            "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}不愧是你。",
                            "<25>{*}{#e/twinkly/0}按理說，你循環這麼多次，\n我該找你討個說法。\n想想算了，無所謂了。",
                            '<25>{*}{#e/twinkly/0}你這次見我，\n肯定是有求於我。',
                            '<25>{*}{#e/twinkly/21}...',
                            "<25>{*}{#e/twinkly/15}認真聽，\n我只說一遍，絕不重複。",
                            '<25>{*}{#e/twinkly/15}從下一時間軸開始，\n怪物的{@fill=#ff0}攻擊力{@fill=#fff}將大幅減弱。',
                            
                            
                            '<25>{*}{#e/twinkly/20}因此，你無需增加LOVE\n也能實現自保。',
                            "<25>{*}{#e/twinkly/15}能做到這些，\n得好好感謝我們的核心。",
                            "<25>{*}{#e/twinkly/20}整個前哨站的大氣供應，\n都是由核心進行調控。\n如果不是這樣，我也幫不了你。",
                            '<25>{*}{#e/twinkly/14}另外，你還得跟\nPapyrus和Undyne...',
                            "<25>{*}{#e/twinkly/23}...要是我都提示到這份上\n還想不明白，\n那趁早放棄得了。",
                            "<25>{*}{#e/twinkly/15}在外面聰明點，\n別成天跟個大蠢貨似的，\n你就能成功。",
                            "<25>{*}{#e/twinkly/15}...好，說完了。",
                            '<25>{*}{#e/twinkly/15}加油。'
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}...',
                            "<25>{*}{#e/twinkly/0}折騰來折騰去，\n想看看我啥反應，\n是不是？",
                            '<25>{*}{#e/twinkly/15}玩的開心不？',
                            "<25>{*}{#e/twinkly/17}告訴你，你如願以償了。\n從現在起，別想再見到我。\n永遠別想。",
                            "<25>{*}{#e/twinkly/0}不聽我的話，\n不按我說的做，\n就永遠別想離開這個循環。",
                            '<25>{*}{#e/twinkly/15}還想和我對著幹？\n死磕到底？\n就你？',
                            '<25>{*}{#e/twinkly/15}...省省力氣吧。',
                            "<25>{*}{#e/twinkly/21}我懂人性。\n你越是死磕，就越無聊；\n越是無聊，就越想試試新方法。",
                            
                            '<25>{*}{#e/twinkly/23}到那時，\n你自然就乖乖聽話了。',
                            '<25>{*}{#e/twinkly/20}無論是人類還是怪物，\n都有「好奇心」，都擺脫不了它。',
                            
                            '<25>{*}{#e/twinkly/16}慢慢內耗吧，\n你個大蠢貨！'
                        ]
                    ][rep - 2],
            postnoot2: (rep: number, puzzlesolve: boolean, enemyweaken: boolean) => [
                ...((puzzlesolve || enemyweaken) && !SAVE.flag.b.neutral_reload_interloper
                    ? [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/20}喔對了...',
                        ...(puzzlesolve
                            ? ['<25>{*}{#e/twinkly/15}那些謎題可是我幫你解的，\n快好好謝謝我。']
                            : []),
                        ...(enemyweaken
                            ? [
                                puzzlesolve
                                    ? '<25>{*}{#e/twinkly/15}我還為了你，\n特意弄壞了供氣系統呢。'
                                    : '<25>{*}{#e/twinkly/15}我為了你，特意破壞了\n前哨站的供氣系統。\n快好好謝謝我。',
                                '<25>{*}{#e/twinkly/21}我發現，低氣壓環境\n不僅能幫你自保...',
                                '<25>{*}{#e/twinkly/15}還能讓你更輕鬆地\n殺了那些怪物。'
                            ]
                            : []),
                        "<25>{*}{#e/twinkly/17}我真的太體貼了，\n你說是不是？",
                        '<25>{*}{#e/twinkly/17}...'
                    ]
                    : []),
                ...(rep < 1
                    ? [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}這是ASGORE的靈魂，\n跟上回一樣，我把它給你。",
                        '<25>{*}{#e/twinkly/0}拿了靈魂，就趕緊給我滾。',
                        '<25>{*}{#e/twinkly/20}要是還沒放棄，\n聽我一句勸...',
                        '<25>{*}{#e/twinkly/15}下回長點心吧。'
                    ]
                    : [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}這是ASGORE的靈魂，\n跟之前一樣，我把它給你。",
                        '<25>{*}{#e/twinkly/0}拿了靈魂，就趕緊給我滾。',
                        '<25>{*}{#e/twinkly/20}聽好了...',
                        "<25>{*}{#e/twinkly/15}你要是還不聽我的話，\n跟我對著幹，\n就永遠別想讓我停手。"
                    ])
            ],
            oof: ['<32>{#p/human}* （你倒吸了一口涼氣...）'],
            killer1: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/15}呀。',
                "<25>{*}{#e/twinkly/17}你真把事情搞砸了，不是嗎？",
                '<25>{*}{#e/twinkly/20}你不僅失去了\n對時間軸的控制權...',
                "<25>{*}{#e/twinkly/15}而且現在若想奪回它，\n你還得重頭再來。"
            ],
            killer2: [
                '<25>{*}{#p/twinkly}{#e/twinkly/14}嘿，我說。',
                "<25>{*}{#e/twinkly/23}如果這就是你想要的結局，\n那...",
                '<25>{*}{#e/twinkly/15}那就輪不到我來評判了。',
                "<25>{*}{#e/twinkly/17}但你不會真的指望我相信吧，\n啊？",
                '<25>{*}{#e/twinkly/17}這鬼狀況就是你想要的？',
                '<25>{*}{#e/twinkly/15}我是說，當然。\n旁觀是挺有趣的。',
                "<25>{*}{#e/twinkly/17}但現在一切都結束了..."
            ],
            killer3: [
                '<25>{*}{#p/twinkly}{#e/twinkly/15}...呃。\n我們都知道你能做得更好。',
                "<25>{*}{#e/twinkly/20}我不是說我是什麼聖人之類的...",
                "<25>{*}{#e/twinkly/15}信不信由你，\n但我是站在你這邊的。",
                '<25>{*}{#e/twinkly/15}我要你重獲\n對時間軸的控制權。',
                '<25>{*}{#e/twinkly/17}畢竟，\n看你坐在這裡啥都不做...',
                "<25>{*}{#e/twinkly/17}並不怎麼有趣，不是嗎？"
            ],
            killer4: [
                "<25>{*}{#p/twinkly}{#e/twinkly/15}...噢，別擔心。",
                '<25>{*}{#e/twinkly/20}就算我失去了所有記憶，\n那又怎麼樣呢？',
                "<25>{*}{#e/twinkly/18}反正你會記得這一切。\n這樣你下次就會\n避免掉入這個陷阱。",
                '<25>{*}{#e/twinkly/15}然後，我們就能\n恢復以前那樣。',
                '<25>{*}{#e/twinkly/20}那你怎麼說？',
                '<25>{*}{#e/twinkly/20}你明白我說的話嗎，\n$(name)？',
                '{*}{#e/twinkly/3}{%}'
            ],
            killer5: [
                '<25>{*}{#p/twinkly}{#e/twinkly/15}噢，我在開玩笑嗎。',
                '<25>{*}{#e/twinkly/16}你當然明白啦！'
            ],
            please1: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（某種可能性仍然存在。）',
                "<25>{*}（抹去一切記憶的可能性\n  仍然存在。）",
                '<25>{*}（讓一切歸零的可能性\n  仍然存在。）'
            ],
            please2: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（你別無所求，\n  只想平靜地生活。）',
                '<25>{*}（你別無所求，\n  只想迎接未來，\n  掌控自己的命運。）',
                '<25>{*}（你不想再度迷失自我。）'
            ],
            please3: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（你很感激某個人，\n  感謝那人為你做的一切。）',
                '<25>{*}（你真心希望那人\n  能放自己一條生路。）'
            ],
            forget1: ['<25>{*}{#p/human}（...）', "<25>{*}（你好孤獨...）"],
            forget2: ['<25>{*}{#p/human}（...）', "<25>{*}（你好害怕...）"],
            forget3: [
                '<25>{*}{#p/human}（...）',
                "<25>{*}（你多麼盼著能彌補過錯...）",
                "<25>{*}（...不管付出什麼代價，\n  忘記一切都行。）"
            ],
            forget4: [
                '<25>{*}{#p/human}（...）',
                "<25>{*}（可你沒得選。）",
                "<25>{*}（你只能看著別人替你選。）"
            ],
            regret1: ['<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}你好呀。'],
            regret2: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}你瞧...\n怪物們找到了新家園，\n整個星系，一片欣欣向榮。',
                '<25>{*}{#e/twinkly/0}每個人... 都過得很幸福。',
                
                '<25>{*}{#e/twinkly/1}所以，別多想了。',
                "<25>{*}{#e/twinkly/2}這麼完美的結局，\n還有什麼可擔心的呢？"
            ],
            regret3: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/3}...',
                '<25>{*}{#e/twinkly/4}嗯... 確實有一件事。',
                
                '<25>{*}{#e/twinkly/5}自打你來這，\n有件事我一直想不通。',
                "<25>{*}{#e/twinkly/6}也挺好奇。"
            ],
            regret4: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/7}...',
                '<25>{*}{#e/twinkly/7}當時，我發現你的LOVE\n不太對勁。',
                
                '<25>{*}{#e/twinkly/4}LOVE的值是... 零。',
                '<25>{*}{#e/twinkly/6}...',
                '<25>{*}{#e/twinkly/6}你可以探索一下，\n尋找這個「零」背後的含義...',
                "<25>{*}{#e/twinkly/7}如果你知道了\n這個「零」意味著什麼，\n也許... 會有新的發現。",
                '<25>{*}{#e/twinkly/10}...',
                "<25>{*}{#e/twinkly/10}到底會發現什麼...\n我也不清楚。",
                "<25>{*}{#e/twinkly/10}我甚至都不知道\n自己在說些什麼。",
                '<25>{*}{#e/twinkly/9}...',
                '<25>{*}{#e/twinkly/9}仔細一想...',
                "<25>{*}{#e/twinkly/1}都過去這麼多年了，\n這麼做，真的有必要嗎？",
                "<25>{*}{#e/twinkly/2}大家現在多幸福啊...",
                '<25>{*}{#e/twinkly/3}Toriel，Sans，Papyrus，\nUndyne，Alphys，Asgore...\n都很幸福。',
                '<25>{*}{#e/twinkly/4}連怪物小孩，和Napstablook...\n也是如此。',
                '<25>{*}{#e/twinkly/2}為了我，\n讓他們付出那麼多犧牲，\n真的值得嗎？',
                '<25>{*}{#e/twinkly/2}...',
                "<25>{*}{#e/twinkly/10}我跟你說這些，\n是因為... 我曾經也擁有過\n控制時間軸的力量。",
                "<25>{*}{#e/twinkly/11}那時，只要我想重置，\n就會付諸實行。",
                '<25>{*}{#e/twinkly/12}但經歷了這些，\n讓現在的我親手抹去一切...',
                '<25>{*}{#e/twinkly/10}我...',
                "<25>{*}{#e/twinkly/10}我可能下不去手了。",
                '<25>{*}{#e/twinkly/10}更何況，\n他們現在很幸福...',
                '<25>{*}{#e/twinkly/11}...',
                '<25>{*}{#e/twinkly/11}所以...',
                '<25>{*}{#e/twinkly/11}請把握當下，\n珍惜現在的生活吧。',
                "<25>{*}{#e/twinkly/7}這樣的結局固然不完美...",
                '<25>{*}{#e/twinkly/5}...但有缺憾，才叫生活啊。'
            ],
            regret5: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/5}...',
                '<25>{*}{#e/twinkly/8}唉。',
                "<25>{*}{#e/twinkly/8}要是我說了這些\n還說服不了你...",
                '<25>{*}{#e/twinkly/7}要是你鐵了心\n想抹去一切...',
                '<25>{*}{#e/twinkly/6}...',
                '<25>{*}{#e/twinkly/2}這裡的「一切」，\n也包括我的記憶。',
                '<25>{*}{#e/twinkly/7}...',
                "<25>{*}{#e/twinkly/6}對不起。",
                "<25>{*}{#e/twinkly/2}上面這些話，\n你或許已經聽了無數次了。",
                '<25>{*}{#e/twinkly/6}...',
                "<25>{*}{#e/twinkly/6}我說完了。",
                '<25>{*}{#e/twinkly/4}期待我們下次再會...',
                '<25>{*}{#e/twinkly/13}$(name)。'
            ],
            asgoreStoryPre1: () =>
                world.bad_robot
                    ? [
                        '<25>{#p/alphys}{#g/alphysSide}* 呃，你-你好...\n* 你...',
                        '<25>{#g/alphysSideSad}* 你真-真的很享受殺人...\n* ...嗯？',
                        "<25>{#g/alphysNervousLaugh}* 我-我是說，我不是在批評你，\n  我只是...",
                        "<25>{#g/alphysUhButHeresTheDeal}* 我只是覺得這超級無敵酷！！！",
                        '<25>{#g/alphysSideSad}* 我-我這樣說...',
                        "<25>{#g/alphysCutscene3}* 也許你現在就\n  不會打算殺我啦？？？"
                    ]
                    : ["<25>{#p/asgore}{#f/0}* ...是不是挺美的？", '<25>{#p/asgore}{#f/0}* ...'],
            asgoreStoryPre2: () =>
                world.bad_robot
                    ? ['<25>{*}{#p/alphys}{#g/alphysOhGodNo}* 後頭有人！！！{%}']
                    : [
                        '<25>{#p/asgore}{#f/6}* 孩子，如果你被嚇著了，\n  那我先對你道個歉。',
                        '<25>{#p/asgore}{#f/6}* Alphys告知了我\n  你會來到這裡。'
                    ],
            asgoreStoryPre3: () => [
                '<25>{#p/asgore}{#f/7}* ...',
                ...(SAVE.flag.b.waaaaaooaaooooaaaaaaooohooohooohstooooryofunderrtaaaaale
                    ? [
                        '<25>{#p/asgore}{#f/12}* 嗯...？\n* 你已經聽過這個故事了？',
                        '<25>{#p/asgore}{#f/5}* ...',
                        '<25>{#p/asgore}{#f/6}* 好吧。',
                        '<25>{#p/asgore}{#f/6}* 如果你早已聽過，\n  那我也不必再複述一遍。',
                        '<25>{#p/asgore}{#f/6}* 繼續一個人行進吧。'
                    ]
                    : ['<25>{#p/asgore}{#f/7}* 來吧。', '<25>{#p/asgore}{#f/7}* 我有一個故事\n  要講給你聽。'])
            ],
            alphysApproach1: [
                "<25>{#p/alphys}{#g/alphysSmileSweat}* 噢，你-你大概在想\n  ASGORE在哪，\n  對吧？",
                "<25>{#g/alphysNervousLaugh}* 唔... 他在...",
                '<25>{#g/alphysHellYeah}* 一個安全的地-地方！',
                '<25>{#g/alphysTheFactIs}* 相對安全。',
                '<25>{#g/alphysOhGodNo}* 或者說-\n* 不，絕對！\n* 絕對安全！',
                '<25>{#g/alphysInquisitive}* 所以，總-總的來說，\n  你不妨... 直接放棄吧。',
                '<26>{#g/alphysInquisitive}* 因為...',
                "<26>{#g/alphysNervousLaugh}* 你永遠也找不到他！！",
                '<25>{#g/alphysHellYeah}* 好啊！\n* 看-看這招！'
            ],
            alphysApproach2: [
                '<25>{#p/alphys}{#g/alphysOhGodNo}* ...',
                '<25>{#g/alphysNervousLaugh}* ...呃呃...',
                '<25>{#g/alphysNervousLaugh}* 像往常一樣挺過來了，\n  哈-哈啊？',
                '<25>{#g/alphysNeutralSweat}* ...',
                "<25>{#g/alphysIDK2}* 我猜你要去見ASGORE了。",
                '<25>{#g/alphysIDK3}* ...',
                "<25>{#g/alphysIDK3}* 我太沒用了...",
                "<25>{#g/alphysThatSucks}* 你可能根本就沒在乎過我，\n  對吧？",
                "<25>{#g/alphysIDK2}* 我一直很害怕，\n  但你可能根本就沒想過要抓我。",
                '<25>{#g/alphysIDK3}* ...',
                "<25>{#g/alphysIDK2}* 去吧。\n* 你想做啥，隨意。",
                "<26>{#g/alphysIDK3}* 我阻止不了你。"
            ],
            alphysApproach3: ["<25>{#p/alphys}{#g/alphysFR}* 只有一個人能做到。"],
            asgoreStory1: [
                '<25>{*}{#p/asgore}{#f/6}* 很久以前，一個人類小孩\n  在前哨站迫降。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 身受重傷的人類\n  開始大聲呼救。{~}'
            ],
            asgoreStory1r: ['<32>{#p/basic}* ...{%40}', "<32>{#p/basic}* 對不起。{%40}"],
            asgoreStory2: [
                '<25>{*}{#p/asgore}{#f/7}* 而我們的長子Asriel\n  聽到了呼救聲。{~}',
                '<25>{*}{#p/asgore}{#f/7}* 他把人類帶回了\n  我們家裡。{~}'
            ],
            asgoreStory2r: ['<32>{#p/basic}* 我已竭盡全力。{%40}'],
            asgoreStory3: [
                '<25>{*}{#p/asgore}{#f/6}* 慢慢的，\n  兩個孩子變得情同手足。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 他們之間的親情\n  隨著前哨站的擴建\n  也愈發緊密。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 整個前哨站充滿了希望。{~}'
            ],
            asgoreStory3r: ['<32>{#p/basic}* 我不想留下遺憾。{%40}'],
            asgoreStory4: [
                '<25>{*}{#p/asgore}{#f/1}* 然而，有一天...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 人類猝不及防地\n  感染了一種疾病。{~}'
            ],
            asgoreStory4r: ['<32>{#p/basic}* 我必須這樣做。{%40}'],
            asgoreStory5: [
                '<25>{*}{#p/asgore}{#f/1}* 病入膏肓的人類\n  只有一個請求。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 想看看我們先前\n  那偉大富饒的世界\n  所殘存的遺址。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 但我們對此無能為力。{~}'
            ],
            asgoreStory5r: ['<32>{#p/basic}* 我只是想讓他看看星辰大海。{%40}'],
            asgoreStory6: [
                '<25>{*}{#p/asgore}{#f/1}* 第二天...{~}',
                '<25>{*}{#p/asgore}{#f/1}* ...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 人類便與世長辭。{~}'
            ],
            asgoreStory6r: ['<32>{#p/basic}* 我只是希望他能開心。{%40}'],
            asgoreStory7: [
                '<25>{*}{#p/asgore}{#f/15}* Asriel悲痛欲絕，\n  吸收了這個人類的\n  靈魂。{~}',
                '<25>{*}{#p/asgore}{#f/16}* 他化作了一個\n  擁有不可思議力量的\n  存在。{~}'
            ],
            asgoreStory7r: ['<33>{#p/basic}* 我從來沒有...{%40}'],
            asgoreStory8: [
                '<25>{*}{#p/asgore}{#f/4}* 憑藉著新獲得的力量，\n  Asriel穿過了力場。{~}',
                "<25>{*}{#p/asgore}{#f/4}* 他開著一架小型飛船，\n  載著人類的遺體\n  飛向遠方。{~}",
                '<25>{*}{#p/asgore}{#f/4}* 希望能找到那\n  傳說中的遺蹟。{~}'
            ],
            asgoreStory8r: ['<32>{#p/basic}* ...沒有...{%40}'],
            asgoreStory9: [
                '<25>{*}{#p/asgore}{#f/1}* 很快，他就發現了\n  自己所尋找的東西。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 飛船著陸在破碎飄零的\n  碎片之中...{~}',
                "<25>{*}{#p/asgore}{#f/1}* 人類的遺體\n  也在此安葬。{~}"
            ],
            asgoreStory9r: ['<32>{#p/basic}* ...{%40}'],
            
            
            asgoreStory10: [
                "<25>{*}{#p/asgore}{#f/5}* 突然，飛船的\n  近接感測警報\n  開始響起。{~}",
                "<25>{*}{#p/asgore}{#f/5}* 拾荒者們看到了\n  抱著人類遺體的Asriel。{~}",
                '<25>{*}{#p/asgore}{#f/2}* 他們以為是Asriel\n  殺死了這個小孩。{~}'
            ],
            asgoreStory11: [
                '<25>{*}{#p/asgore}{#f/2}* 人類用盡所能\n  攻擊Asriel。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 一槍又一槍，\n  一擊又一擊...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 以Asriel現在的形態\n  是有力量將他們\n  盡數消滅的。{~}'
            ],
            asgoreStory12: [
                '<25>{*}{#p/asgore}{#f/4}* 但是...{~}',
                '<25>{*}{#p/asgore}{#f/4}* Asriel並沒有還手。{~}'
            ],
            asgoreStory12r: ['<32>{#p/human}* （你聽見有人在哭...）{%40}'],
            asgoreStory13: [
                "<25>{*}{#p/asgore}{#f/9}* Asriel緊緊抱住\n  人類的遺體，向外界看了\n  最後一眼...{~}",
                '<25>{*}{#p/asgore}{#f/9}* 然後他面帶微笑...\n  緩緩地離開了。{~}'
            ],
            asgoreStory13r: ["<32>{#p/basic}* 我沒法...\n* 他-他不讓我-我...{%40}"],
            asgoreStory14: [
                '<25>{*}{#p/asgore}{#f/1}* 傷痕累累的Asriel駕駛著\n  受損的飛船回到了家。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 他下了飛船，\n  然後癱倒在地。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 化作一團塵埃，\n  飄散在整片花叢裡。{~}'
            ],
            asgoreStory14r: ['<32>{#p/basic}* ...{%40}'],
            asgoreStory15: [
                '<25>{*}{#p/asgore}{#f/13}* 前哨站，我的前哨站...\n  陷入了絕望。{~}',
                '<25>{*}{#p/asgore}{#f/13}* 我們一夜之間就\n  失去了兩個孩子。{~}',
                '<25>{*}{#p/asgore}{#f/14}* 我們的一切，又一次\n  被奪走了。{~}'
            ],
            asgoreStory15r: ["<32>{#p/basic}* ...這不公平...{%40}"],
            asgoreStory16: [
                '<25>{*}{#p/asgore}{#f/13}* 於是，我一怒之下\n  向人類宣戰。{~}',
                '<25>{*}{#p/asgore}{#f/13}* 無論付出多少代價，\n  我都要讓我們怪物\n  重獲自由。{~}',
                '<25>{*}{#p/asgore}{#f/14}* ...而人民們都支援\n  我的決策。{~}'
            ],
            asgoreStory16r: ["<32>{#p/basic}* ...這不公平！{%40}"],
            asgoreStory17: [
                '<25>{*}{#p/asgore}{#f/3}* 可我回過神來才發現，\n  一切都為時已晚。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 無論做什麼事情\n  都無法阻擋人民\n  發動戰爭的意願。{~}',
                '<25>{*}{#p/asgore}{#f/5}* 至少明面上如此。{~}'
            ],
            asgoreStory18: () =>
                SAVE.data.b.killed_mettaton || world.baddest_lizard
                    ? [
                        '<25>{*}{#p/asgore}{#f/5}* 事到如今，想必Alphys\n  一定已經告訴過你\n  某個秘密了吧。{~}',
                        '<25>{*}{#p/asgore}{#f/5}* 一份我與前皇家科學員的\n  協定。{~}',
                        '<25>{*}{#p/asgore}{#f/6}* ...她怎麼這個時候\n  遲到了...{~}'
                    ]
                    : [
                        '<25>{*}{#p/asgore}{#f/5}* 事到如今，想必Alphys\n  一定已經告訴過你\n  某個{@fill=#003cff}秘密{@fill=#fff}了吧。{~}',
                        '<25>{*}{#p/asgore}{#f/5}* 一份我與前皇家科學員的\n  {@fill=#003cff}協定{@fill=#fff}。{~}',
                        '<25>{*}{#p/asgore}{#f/6}* ...啊，原來她來了。\n* 我剛才還尋思著她\n  什麼時候才會到呢。{~}'
                    ],
            asgoreStory19: [
                '<25>{#p/alphys}{#g/alphysNervousLaugh}* 呃，抱-抱歉！\n* 我已經盡力在趕了！',
                '<25>{#p/asgore}{#f/6}* 不必著急。\n* 畢竟好事多磨嘛。',
                "<25>{#p/alphys}{#g/alphysWorried}* ...你真覺得人類\n  已經做好準備了嗎？"
            ],
            asgoreStory20a: [
                '<25>{#p/asgore}{#f/7}* 孩子，請讓我們\n  先行一步...',
                '<25>{#p/asgore}{#f/7}* 我和Alphys有些事情\n  需要談談。'
            ],
            asgoreStory20b: [
                "<25>{#p/alphys}{#g/alphysHellYeah}* 是的，呃...\n  接-接著往前走吧，\n  我們會等著你的！"
            ],
            asgoreStory21: [
                '<25>{#p/asgore}{#f/5}* 真奇怪。\n* 她居然還沒來。',
                '<25>{#p/asgore}{#f/5}* ...這不是我所期望的。'
            ],
            asgoreStory22: [
                '<25>{#p/asgore}{#f/5}* 那麼。\n* 她要是想見我\n  就得等上一會了。',
                '<25>{#p/asgore}{#f/5}* 這件事不能再拖了。'
            ],

            
            jspeech1: () => [
                '<32>{#p/darksans}* 終於，你到達此處。',
                '<32>* 旅途的終點，已觸手可及。',
                world.bad_robot || SAVE.data.b.ultrashortcut
                    ? '<32>* 片刻之後，你就能見到國王。'
                    : '<32>* 片刻之後，你又能見到國王。',
                '<32>* 到那時...',
                ...(SAVE.data.b.ultrashortcut
                    ? [
                        '<32>* ...',
                        "<32>* 不對。",
                        '<32>* 你怎麼來得這麼快？',
                        '<32>* 讓我猜猜，你是不是...',
                        '<32>* 走{@fill=#ff0}捷徑{@fill=#fff}了？'
                    ]
                    : [
                        ...(SAVE.data.b.water
                            ? [
                                '<32>* ...',
                                "<32>* 你是不是一路上\n  一直拿著那杯液體？",
                                ...(world.dead_skeleton
                                    ? ['<32>* ...', '<32>* 嗯，沒事。']
                                    : ['<32>* 嘿。', '<32>* 回到剛才的話題...'])
                            ]
                            : []),
                        '<32>* 你將會決定怪物的命運。',
                        "<32>* 但那是後話。",
                        '<32>* 現在。',
                        '<32>* 你將接受審判。',
                        '<32>* 你將為你每一個行為接受審判。',
                        "<32>* 你將為你獲得的每一點EXP\n  接受審判。",
                        "<32>* EXP是什麼？",
                        "<32>* 是一個縮寫。",
                        '<32>* 意思是「{@fill=#f00}處決點數{@fill=#fff}」\n  （{@fill=#f00}EX{@fill=#fff}ecution {@fill=#f00}P{@fill=#fff}oints）。',
                        '<32>* 它表徵的，是你\n  「處決」怪物的數量。',
                        '<32>* 每「處決」一隻怪物，\n  EXP就會增加一些。',
                        '<32>* 當EXP積累到一定程度時，\n  LOVE就會增加。',
                        '<32>* LOVE，也是一個縮寫。',
                        '<32>* 意思是「{@fill=#f00}暴力等級{@fill=#fff}」\n  （{@fill=#f00}L{@fill=#fff}evel {@fill=#f00}O{@fill=#fff}f {@fill=#f00}V{@fill=#fff}iol{@fill=#f00}E{@fill=#fff}nce）。',
                        "<32>* 它表示的，\n  是傷害別人的能力。",
                        '<32>* 殺得越多，\n  就越容易偏離本心。',
                        '<32>* 離本心越遠，\n  就越難受到傷害。',
                        '<32>* 也就越容易放任自己\n  傷害別人。'
                    ])
            ],
            jspeechU1: () => [
                '<25>{#p/sans}{#f/3}* ...',
                ...[
                    [
                        '<25>{#f/0}* 哇，夥計。\n* 你咋也走上捷徑了呢？',
                        "<25>{#f/3}* 別誤會。\n* 你面前的傢伙，也跟你一樣\n  愛死這東西了。",
                        "<25>{#f/2}* 但你是不是該花點時間\n  反思一下呢？"
                    ],
                    [
                        "<25>{#f/0}* 從表情來看，\n  你都走了好幾次捷徑了。",
                        "<25>{#f/3}* 我可沒生氣喔。\n* 畢竟，速通超爽的。",
                        "<25>{#f/2}* 但你該反思還是得反思！\n* 這可走不了捷徑喔。"
                    ]
                ][Math.min(SAVE.flag.n.meet3++, 1)]
            ],
            jspeechU2: [
                '<25>{#p/sans}* 對了。',
                "<25>{#f/3}* 你就一邊看著我\n  吃這美味的冰淇淋...",
                '<25>{#f/2}* 一邊好好反思一下\n  自己咋一下子就到這了。'
            ],
            jspeechU3: [
                '<25>{#p/sans}* 你瞧，\n  這冰淇淋還是三文魚味的。',
                '<25>{#p/sans}* 我聽說，皇家守衛都可喜歡\n  這種口味了。'
            ],
            jspeechU4: [
                "<25>{#p/sans}{#f/3}* 當然嚕。\n* 我也把這事告訴papyrus了。",
                "<25>{#f/0}* 這樣，他就能更了解\n  那群守衛的喜好。",
                '<25>{#f/2}* 正好，papyrus也要進\n  皇家衛隊了。'
            ],
            jspeechU5: [
                '<25>{#p/sans}{#f/0}* 嘿嘿...\n* 抓到人類果然能帶來好事，\n  還有冰淇淋吃，',
                "<25>{#f/3}* ...別擔心。\n* 我吃得很快的。",
                "<25>{#f/2}* 你看，我都吃完一半了。"
            ],
            jspeechU6: () => [
                '<25>{#p/sans}{#f/0}* 我在想，如果那位\n  賣「冰意靈」的夥計也願意\n  賣這種口味的冰淇淋...',
                ...(SAVE.data.n.state_starton_nicecream < 1
                    ? ["<25>{#f/2}* 那肯定就有顧客上門了。"]
                    : ["<25>{#f/2}* 那上門的顧客肯定就多了。"])
            ],
            jspeechU7: [
                '<26>{#p/sans}{#f/0}* 啊... 哪怕是山珍海味，\n  也比不上這三文魚\n  冰淇淋啊。',
                '<25>{#f/2}* 現在開始吃蛋筒。'
            ],
            jspeechU8: [
                "<26>{#p/sans}{#f/3}* 現代克隆技術\n  真是發達...",
                "<25>{#f/0}* 以前，想搞點能吃的東西\n  都難上加難...",
                '<25>{#f/2}* 而現在，冰淇淋、蛋筒\n  都能完美複製出來。'
            ],
            jspeechU9: ['<25>{#p/sans}{#f/0}* ...', '<25>{#f/3}* ...現在是徹底吃沒了。'],
            jspeechU10: (funni: boolean) => [
                "<25>{#p/sans}{#f/0}* 行，那就這樣。",
                ...(funni
                    ? ['<25>{#f/2}* 希望你能\n  早日從柱子中脫困喔。']
                    : ["<25>{#f/2}* 希望你沒白白浪費\n  這段時間喔。"])
            ],
            jspeech2: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                "<25>{#f/0}* 喔，lv0？\n* 那是什麼？",
                "<25>{#f/3}* gerson的人類防衛手冊中\n  沒寫這些。",
                "<25>{#f/0}* 如果是平常，\n  我會扯點高大上的話，\n  比如...",
                '<25>{#f/4}* 「雖無法做到至善，\n   但仍堅守本心」？',
                '<25>{#f/0}* 但你與眾不同。',
                '<25>{#f/3}* ...\n* 所以...',
                "<25>{#f/4}* 我會直接跳過\n  那些長篇大論...",
                '<25>{#f/0}* 直接放你前進。',
                '<25>{#f/3}* 畢竟...',
                "<25>{#f/2}* 像你這麼棒的傢伙...\n  肯定能在兩難之中\n  找到第三條路的。",
                ...(world.flirt < world.flirt_state1.length
                    ? [
                        '<25>{#f/3}* ...',
                        '<25>{#f/0}* 加油，孩子。',
                        ...(funni
                            ? ["<25>{#f/2}* 我會把你挪回柱子後面。"]
                            : ["<26>{#f/2}* 你一定能成功的。"])
                    ]
                    : [
                        '<25>{#f/3}* ...喔對。\n* 差點忘了。',
                        '<25>{#f/0}* 你可能已經知道\n  對Alphys調情\n  是有多麼困難了。',
                        "<25>{#f/2}* 但我有給小妙招，\n  能讓你一擊俘獲\n  Alphys的芳心。",
                        "<25>{#f/0}* 如果你真的想成為\n  一位傳奇調情大師...",
                        "<25>{#f/0}* 你就得在她耳邊\n  這樣低語。",
                        '<32>{#p/human}* （Sans在你耳邊\n  小聲說了些話。）',
                        ...(funni
                            ? ['<25>{#p/sans}{#f/2}* 儘量別在柱子後面\n  對她說這些話。']
                            : ['<25>{#p/sans}{#f/2}* 祝你好運。'])
                    ])
            ],
            jspeech3: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* ...可是。\n* 你從未獲得任何LOVE。',
                "<25>* ...嘿，為啥擺出那表情？",
                "<25>{#f/2}* 眾所周知，\n  lv1就是最低的等級。",
                "<25>{#f/0}* 但這可不代表\n  你天真無邪，人畜無害。",
                ...(SAVE.data.n.bully < 15
                    ? SAVE.data.n.state_foundry_undyne > 0
                        ? [
                            "<25>{#f/0}* 當你有能力\n  去拯救某人性命時...",
                            '<25>{#f/0}* 你放棄了救人，\n  轉而選擇自保。',
                            '<25>{#f/3}* 也許你會爭辯，\n  當時身處險境，十分害怕，\n  只能那麼做。',
                            "<25>{#f/0}* 但是，你就從沒考慮過\n  另一條更好的路嗎？",
                            '<25>{#f/0}* ...',
                            '<25>{#f/0}* 問題的答案，已經不重要了。',
'<25>{#f/0}* 重要的是...',
                            '<25>{#f/3}* 你沒有放任自己，\n  更沒有殺戮別人。',
                            "<25>{#f/0}* 在那種情況下，\n  你即便拋棄了對手，\n  也肯定不是出於惡意。",
                            '<25>{#f/0}* 你從未得到LOVE，\n  但你心中有愛（love）。',
                            '<25>{#f/0}* 這說得通嗎？',
                            '<25>{#f/0}* 也許不吧。'
                        ]
                        : [
                            '<25>* 只能說明，內心深處，\n  你仍保有那份「善」。',
                            '<25>* 不管經受多少挫折，\n  多少傷痛... \n  你仍堅守本心，做正確的事。',
                            
                            ...(world.flirt < 20
                                ? [
                                    '<25>* 哪怕是一草一木，\n  你也從不去傷害他們。',
                                    '<25>* 即使輸了，逃跑了，\n  臉上仍掛著笑容。',
                                    '<25>* 你從未得到LOVE，\n  但你得到了愛（love）。',
                                    '<25>* 這說得通嗎？',
                                    '<25>* 也許不吧。'
                                ]
                                : [
                                    "<25>* 我聽說，你特別會撩人。",
                                    '<25>* 你從未傷害他們，\n  還一一俘獲了他們的心。',
                                    '<25>{#f/2}* 嘿嘿，你挺喜歡\n  給自己上強度啊。'
                                ])
                        ]
                    : [
                        SAVE.data.n.bully < 30
                            ? "<25>{#f/0}* 一路上，你傷害了不少人。\n  不是嗎？"
                            : "<25>{#f/0}* 一路上，你傷害了很多人。\n  不是嗎？",
                        ...(SAVE.data.n.state_foundry_undyne > 0
                            ? [
                                "<25>{#f/0}* 而且，當你有能力\n  去拯救某人性命時...",
                                '<25>{#f/0}* 你放棄了救人，\n  轉而選擇自保。',
                                '<25>{#f/3}* 也許你會爭辯，\n  當時身處險境，十分害怕，\n  只能那麼做。',
                                '<25>{#f/3}* 但別的怪物面對你，\n  難道就不恐懼，不害怕嗎？',
                                '<25>{#f/0}* 希望你記著...'
                            ]
                            : world.flirt < 20
                                ? [
                                    '<25>{#f/0}* 你確實沒殺一隻怪物，\n  但你無數次將他們\n  推向生死邊緣。',
                                    '<25>{#f/3}* 這是正當防衛？\n* 還是防衛過當呢？',
                                    "<25>{#f/0}* 只有你自己心裡清楚。"
                                ]
                                : [
                                    '<25>{#f/0}* 等他們乖乖就範，\n  你又展開攻勢，\n  俘獲他們的心。',
                                    '<25>{#f/3}* 你這麼幹，是事先計畫好的嗎？\n* 還是說... 我搞錯了？',
                                    "<25>{#f/0}* 只有你自己心裡清楚。"
                                ])
                    ]),
                '<25>{#f/3}* ...\n* 而現在，你要作出抉擇。',
                "<25>{#f/0}* 作出整段旅程中，\n  最重要的抉擇。",
                '<25>* 你的選擇...\n  將決定整片星系的命運。',
                '<25>* 是安寧度日，放棄機會，\n  還是嘗試冒險，進入檔案？',
                '<25>* 選擇前者...',
                '<25>* 怪物將無法獲得自由。',
                '<25>* asgore會盡己所能，\n  打理你的衣食住行。',
                '<25>* 可我們也許會\n  永遠無法離開這裡。',
                '<25>{#f/3}* 相反。\n* 如果聽從asgore的計畫，\n  選擇後者...',
                "<25>{#f/0}* 你將要冒生命危險。",
                "<25>* 裝置可能出現故障，\n  計畫可能並不順利，\n  還可能把命搭上...",
                '<25>* 那麼...',
                '<25>* 你會選擇哪條路呢？',
                '<25>{#f/3}* ...',
                '<25>* 要是換我，早就放棄了。',
                "<25>{#f/2}* 但你絕不會因為這樣的困難\n  就停下腳步，對吧？",
                "<25>{#f/0}* 沒錯，你有一種特殊的力量。",
                '<25>* 那就是「{@fill=#ff0}決心{@fill=#fff}」。',
                ...(SAVE.data.n.bully < 15
                    ? [
                        '<25>* 只要你不放棄...',
                        "<25>* 只要你始終堅守本心...",
                        '<25>* 我相信，你一定能作出\n  正確的抉擇。',
                        ...(SAVE.data.n.state_foundry_undyne > 0 || world.flirt < world.flirt_state1.length
                            ? [
                                '<25>{#f/3}* 那麼...',
                                "<25>{#f/0}* 我們都指望你了，孩子。",
                                ...(funni
                                    ? ["<25>{#f/2}* 我會把你挪回柱子後面。"]
                                    : ['<25>{#f/2}* 加油喔。'])
                            ]
                            : [
                                '<25>{#f/3}* 喔，差點忘了。',
                                '<25>{#f/0}* 說不定你也發現，\n  跟她調情有點困難。',
                                '<25>{#f/0}* 我說的「她」，就是alphys。',
                                "<25>{#f/2}* 但我有給小妙招，\n  能讓你一擊俘獲\n  Alphys的芳心。",
                                "<25>{#f/0}* 如果你真的想成為\n  一位傳奇調情大師...",
                                "<25>{#f/0}* 你就得在她耳邊\n  這樣低語。",
                                '<32>{#p/human}* （Sans在你耳邊\n  小聲說了些話。）',
                                ...(funni
                                    ? ['<25>{#p/sans}{#f/2}* 儘量別在柱子後面\n  對她說這些話。']
                                    : ['<25>{#p/sans}{#f/2}* 祝你好運。'])
                            ])
                    ]
                    : [
                        "<26>* 甭管你之前\n  怎麼用這種能力。",
                        "<25>* 我相信...在危急關頭，\n  你一定可以做出\n  正確的選擇。",
                        '<25>{#f/3}* ...',
                        '<25>{#f/3}* 保持那份善意，好嗎？',
                        ...(funni ? ['<25>{#f/2}* ...還有，別總往柱子後面站。'] : [])
                    ])
            ],
            
            jspeech4: [
                '<25>{#p/darksans}* 現在，你清楚了\n  EXP與LOVE的含義。',
                "<25>* 也是時候接受審判了。",
                
                '<25>* 捫心自問，\n  一路走來做的那些事\n  真的是正確的嗎？',
                
                '<25>* 清楚了過去的所作作為，\n  又該如何面對當下呢？',
                '<25>* 花點時間想想吧。'
            ],
            jspeech5a: [
                '<25>{#p/sans}{#f/3}* ...',
                "<25>{#f/0}* 其實，問題的答案是什麼\n  並不重要。",
                "<25>* 重要的是，在這個過程中\n  有沒有坦誠面對自己。"
            ],

            
            jspeech5b1: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* 接下來怎麼做...',
                '<25>{#f/0}* 由你決定。',
                ...(funni ? ['<25>{#f/2}* ...走之前，我把你\n  移回柱子後面。'] : [])
            ],

            
            jspeech5b2: () => [
                '<25>{#p/sans}{#f/3}* 只不過...',
                '<25>{#f/0}* 有件事我一直想不通。',
                '<25>* 在這裡，你被迫要面對\n  一些棘手的情況。',
                '<25>* 選擇自保，本沒有錯。',
                '<25>* 但我發現...',
                
                "<25>* 你的行為舉止就好像...\n  你能預知未來一樣。",
                
                '<25>* 雖然這麼問有點冒犯，\n  不過...',
                '<25>* 倘若你真的擁有\n  某種{@fill=#ff0}特殊能力{@fill=#fff}...',
                "<25>* 是不是該拿它做點好事呢？",
                choicer.create('* （你要怎麼回答？）', '\n你說得對', '他們的死活\n跟我沒關係')
            ],
            jspeech5b3a: ['<25>{#p/sans}{#f/4}* 喔，知道了。', ],
            jspeech5b3b: [
                '<25>{#p/sans}{#f/4}* 這樣啊。',
                "<25>{#f/0}* 沒事，誰都有自己的想法。",
                "<25>{#f/2}* 我不會妄加評判。"
            ],
            jspeech5b3c: ['<25>{#p/sans}{#f/3}* ...'],

            
            
            jspeech5b4a: ["<25>{*}{#p/darksans}{#f/1}{#i/5}* ...那你為什麼要殺\n  我的兄弟？"],
            jspeech5b4b: ['<25>{*}{#p/darksans}{#f/1}{#i/5}* ...好個骯髒的兄弟殺手。'],
            jspeech5b5a: ["<25>{#p/sans}{#f/3}* ...看來toriel入不了你的眼，\n  不值得施捨善心。\n  是不是啊？"],
            jspeech5b5b: ['<25>{#p/sans}{#f/3}* ...你都對toriel動了手，\n  我評判你兩句\n  其實也無可厚非。'],
            jspeech5b6a: ["<25>{*}{#p/darksans}{#f/1}{#i/5}* ...那你為什麼要\n  濫殺無辜？"],
            jspeech5b6b: ['<25>{*}{#p/darksans}{#f/1}{#i/5}* ...好個骯髒的連環殺手。'],
            jspeech5b7a: ["<25>{#p/sans}{#f/3}* ...看來undyne入不了你的眼，\n  不值得施捨善心。\n  是不是啊？"],
            jspeech5b7b: ['<25>{#p/sans}{#f/3}* ...你都對undyne動了手，\n  我評判你兩句\n  其實也無可厚非。'],
            jspeech5b8a: ["<25>{#p/sans}{#f/3}* ...看來mettaton入不了你的眼，\n  不值得施捨善心。\n  是不是啊？"],
            jspeech5b8b: ['<25>{#p/sans}{#f/3}* ...你都對mettaton動了手，\n  我評判你兩句\n  其實也無可厚非。'],
            jspeech5b9a: ["<25>{#p/sans}{#f/3}* ...看來，那些死掉的怪物\n  入不了你的眼，\n  不值得施捨善心，是不是啊？"],
            jspeech5b9b: ['<25>{#p/sans}{#f/3}* ...你都對那些怪物動了手，\n  我評判你兩句\n  其實也無可厚非。'],
            jspeech5b10a: ["<25>{#p/sans}{#f/3}* ...看來那隻死掉的怪物\n  入不了你的眼，\n  不值得施捨善心，是不是啊？"],
            jspeech5b10b: ['<25>{#p/sans}{#f/3}* ...你都對那隻怪物動了手，\n  我評判你兩句\n  其實也無可厚非。'],

            
            jspeech6a: [
                '<25>{#p/sans}{#f/4}* 哎等等。\n* 你咋看起來這麼無聊呢？',
                "<25>* 我有預感，讓你沉思，\n  你根本學不到任何教訓。",
                '<25>{#f/0}* 所以，得開始審判你了。'
            ],

            
            jspeech6b1: [
                '<26>{#p/sans}* lv2...\n* 哎呀，某個地方好像\n  出了點小瑕疵呢。',
                "<25>{#f/4}* 唔... 真是太可惜了。",
                "<25>{#f/3}* 說不定，你自己都不知道\n  是咋升到lv2的...",
                '<25>* 等你發現時，只能後悔莫及...{^6}\n  ...才怪。',
                
                '<25>{#f/4}* 別跟我扯了，\n* 你得多不小心，\n  才能升到lv2呢？'
            ],

            jspeech6b2: [
                '<25>{#p/sans}* lv3...\n* 還行。',
                "<25>{#f/4}* 這個lv挺好的，不嚇人。",
                "<25>{#f/0}* 所以，審判通過。",
                '<25>{#f/3}* 不過呢...',
                '<25>{#f/2}* 如果再加把勁，\n  說不定就能讓lv更好看了。'
            ],

            jspeech6b3: [
                '<25>{#p/sans}* lv4...\n* 好吧。',
                '<25>{#f/4}* 這個lv... \n  讓我說你點啥好呢？',
                "<25>{#f/0}* 要是再高一點，我就得懷疑\n  你不是過失殺人，\n  而是故意殺人了。",
                "<25>{#f/3}* 這次我會破個例，\n  讓你通過審判。",
                '<25>{#f/2}* 下不為例。'
            ],

            jspeech6b4: [
                '<25>{#p/sans}{#f/4}* lv5？',
                "<25>{#f/0}* 從這個lv開始，\n  就再也不能說你\n  「人畜無害」了。",
                '<25>{#f/4}* 我真的很想相信你...',
                '<25>{#f/0}* 可你的lv越高，\n  我就越沒底氣。',
                '<25>{#f/3}* ...唉，走吧。'
            ],

            jspeech6b5: [
                '<25>{#p/sans}{#f/4}* lv6？',
                '<25>{#f/0}* 人們相互祝福，\n  不是總說「六六大順」嘛。',
                "<25>{#f/4}* 我倒不迷信這些...",
                "<25>{#f/0}* 可現在這情況，\n  我真心希望能少點不順。",
                '<25>{#f/3}* ...唉，走吧。'
            ],

            jspeech6b6: [
                '<25>{#p/sans}{#f/4}* 嗯，lv7？',
                '<25>* 古人說：「人有七竅。」',
'<25>{#f/0}* 如果說升一級，通一竅，\n  那你應該完全開竅了。',
                
                '<25>{#f/3}* 但我在想...\n  你能「開竅」，是不是因為\n  「開了別人的竅」？',
                '<25>{#f/0}* ...只是隨口一說。'
            ],

            jspeech6b7: [
                '<25>{#p/sans}{#f/4}* 嗯，lv8？',
                "<25>* 獵人打獵回來，\n  會把獵物「大卸八塊」。",
                
                "<25>{#f/3}* 這個詞... 跟你很般配啊。",
                '<25>{#f/0}* ...只是隨口一說。'
            ],

            jspeech6b8: [
                '<25>{#p/sans}{#f/3}* ...lv9。',
                "<25>{#f/0}* 這lv有點嚇人了。",
                '<25>{#f/3}* 不過...',
                "<25>{#f/2}* 往好處想，\n  起碼還只有一位數。\n* 幹得挺不錯。"
            ],

            jspeech6b9: [
                '<25>{#p/sans}{#f/3}* ...lv10。',
                "<25>{#f/0}* 這lv有點嚇人了。",
                '<25>{#f/3}* 不過...',
                "<25>{#f/2}* 往好處想，\n  起碼才剛破兩位數。\n* 幹得挺不錯。"
            ],

            jspeech6b10: [
                '<25>{#p/sans}{#f/3}* ...lv11。',
                "<25>{#f/4}* 十加一，是土。\n* 怪物死後，化為塵土。",
                '<25>{#f/0}* 說實話，要是我能\n  讓土變回怪物...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我會毫不猶豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一廂情願罷了。"
            ],

            jspeech6b11: [
                '<25>{#p/sans}{#f/3}* ...lv12。',
                "<25>{#f/4}* 十加二，是王。\n* 在前方等待你的人，\n  就是國王。",
                '<25>{#f/0}* 說實話，要是我能\n  讓王改變主意...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我會毫不猶豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一廂情願罷了。"
            ],

            jspeech6b12: [
                '<25>{#p/sans}{#f/3}* ...lv13。',
                "<25>{#f/4}* 十三，是衫。\n* 我身上穿的，正是兜帽衫。",
                '<25>{#f/0}* 衫不在高，睡不在深...\n  要是我能勸得動你...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我會毫不猶豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一廂情願罷了。"
            ],

            jspeech6b13: [
                '<25>{#p/sans}{#f/3}* ...lv14。',
                "<25>{#f/4}* 我就不拐彎抹角了...",
                "<25>{#f/0}* 能在這麼短的時間內\n  殺掉這麼多怪物...\n  你也是個人才。",
                '<25>{*}{#p/darksans}{#f/1}{#i/5}* 再接再厲。',
                '<25>{#p/sans}{#f/3}* ...'
            ],

            
            jspeech6c: [
                '<25>{#p/sans}{#f/4}* 哎等等。\n* 你咋還這麼無聊呢？',
                '<25>{#f/0}* 看來咱倆沒啥好聊的了。\n* 談話結束。'
            ],

            
            jspeech7: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* 等一下。',
                '<25>{#f/4}* 我剛剛說話時，\n  注意到你臉上的表情...',
                "<25>{#f/0}* 看樣子，你早就聽過\n  我這通長篇大論了。\n  是不是呀？",
                '<25>{#f/3}* 之前我就感覺挺奇怪。',
                "<25>{#f/3}* 從你的行為舉止來看，\n  就感覺，你能未卜先知。",
                "<25>{#f/3}* 仿佛你「早就」做過\n  這些事一樣。",
                '<25>{#f/0}* 所以呢...',
                "<25>{#f/0}* 交給你一件事。",
                '<25>{#f/2}* 我有個{@fill=#ff0}暗號{@fill=#fff}，\n  除了我，別人誰也不知道。',
                "<25>{#f/4}* 所以...",
                "<25>{#f/0}* 如果有人跟我說了那個暗號，\n  那我就知道，那人肯定\n  是一名時間旅者。",
                '<25>{#f/2}* 是不是腦洞很大？',
                '<25>{#f/3}* 總之，聽好暗號...',
                '<32>{#p/human}* （Sans悄悄對你說了\n  一串東西。）',
                "<25>{#p/sans}{#f/0}* 就等你回到過去，\n  把它告訴那個我了。",
                ...(funni ? ["<25>{#f/2}* 我會把你挪回柱子後面。"] : ['<25>{#f/2}* 那麼，「回」見。'])
            ],

            
            jspeech8: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/4}* 咋了？\n* 有啥話想告訴我嗎？',
                '<32>{#p/human}* （你把那串暗號告訴了Sans。）',
                '<25>{#p/sans}{#f/2}* 啥？暗號？\n* 大點聲說唄。',
                '<32>{#p/human}* （你把暗號大聲說了出來。）',
                '<25>{#p/sans}{#f/0}* 你剛剛說的...',
                '<25>{#f/4}* ...是不是「反轉中子電性」？',
                "<25>{#f/2}* 哇。\n* 真是難以置信，\n  這話你居然真說得出來。",
                '<25>{#f/4}* 「反轉中子電性」...\n  這話不僅是純粹胡扯，\n  更是我自創的暗號。',
                
                '<25>{#f/0}* 看來... 你真是個時間旅者？',
                "<25>{#f/3}* 行吧，那麼，考核通過。",
                "<25>{#f/0}* 這是我的房門鑰匙，\n  給你。",
                '<32>{#s/equip}{#p/human}* （你把骨鑰掛到了鑰匙串上。）',
                "<25>{#p/sans}{#f/0}* 是時候...",
                ...(funni
                    ? ['<25>{#f/2}* 讓你走出那根柱子了。']
                    : ['<25>{#f/2}* 讓你知曉{@fill=#003cff}真相{@fill=#fff}了。'])
            ],

            
            jspeech9: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* 等一下。',
                '<25>{#f/4}* 我剛剛說話時，\n  注意到你臉上的表情...',
                "<25>{#f/0}* 看樣子，你早就聽過\n  我這通長篇大論了。\n  是不是呀？",
                '<25>{#f/3}* 之前我就感覺挺奇怪。',
                "<25>{#f/3}* 從你的行為舉止來看，\n  就感覺，你能未卜先知。",
                "<25>{#f/3}* 仿佛你「早就」做過\n  這些事一樣。",
                '<25>{#f/0}* 所以...',
                '<25>{#f/0}* ...等等。\n* 你之前是不是早就聽過\n  這段了？',
                '<25>{#f/3}* 哇，看來是貨真價實的\n  時間旅者。',
                "<25>{#f/2}* 那就不用長篇大論了。",
                '<32>{#s/equip}{#p/human}* （你把骨鑰掛到了鑰匙串上。）',
                ...(funni ? ['<25>{#p/sans}{#f/2}* ...只需要說一句\n  「該把你挪回去」就夠了。'] : [])
            ],

            
            jspeech10a: ['<25>{#p/sans}{#f/0}* 回頭。'],
            jspeech10b: [
                '<25>{#p/sans}* 所以，這就是終點了，\n  是嗎？',
                '<25>* 就要用這種方式，\n  給你的旅程畫上句號嗎？',
                '<25>{#f/3}* ...',
                "<25>* 嘿。\n* 之前，我和asgore聊了聊\n  你的所作所為。",
                "<25>{#f/0}* 雖然不知道asgore會對你\n  做些什麼...",
                "<25>{#f/0}* 但很可能，\n  事情不會如你所願。",
                '<25>* 不過，迎接結局之前...\n  靜下心來，好好想想。',
                "<25>* 一路走來，你做的那些事...",
                '<25>* 真的值得嗎？'
            ],
            jspeech10c: [
                "<25>{#p/sans}{#f/3}* 我看不到你的表情。",
                "<25>{#f/0}* 更摸不透你的心思。",
                '<25>* ...',
                "<25>{#f/3}* 這樣也好。",
                '<25>{#f/0}* 但我知道，\n  你能幹出那些事...',
                '<25>* 肯定是出於「關心」，對嗎？',
                "<25>{#f/3}* ...我無數次想否認、\n  推翻這個想法。",
                "<25>{#f/0}* 但是，如果我們真的\n  形同陌路...",
                "<25>* 你怎麼可能做到這種地步？",
                '<25>* 你太「關心」我們了，\n  恨不得把我們都「關心」死了，\n  不是嗎？'
            ],
            jspeech10d: [
                '<25>{#p/sans}{#f/3}* 我知道，\n  自己根本不擅長「動之以情」。',
                '<25>{#f/0}* 但請你告訴我，\n  我還能做什麼呢？',
                '<25>* 既然你已經徹底踏上\n  這條不歸路...',
                "<25>* 那威脅、恐嚇都已經\n  無濟於事了。",
                "<25>{#f/3}* 所以，我想試試另一種方式\n  勸你回頭。",
                '<25>{#f/0}* ...',
                '<25>{#f/3}* 那麼。\n* 如果你要一條道走到黑...',
                '<25>* 我不會攔你。',
                "<25>{#f/0}* 我知道，\n  你早已將「善」拋之腦後。",
                "<25>* 但如果，在機緣巧合之下，\n  你擁有了{@fill=#ff0}那種能力{@fill=#fff}...",
                '<25>* 那就試試看吧。',
                '<25>* 只此一次，終末之時...',
                '<25>{#f/3}* 做件善事。',
                '<25>* ...',
                '<25>{#f/3}* 嗯。',
                "<25>{#f/3}* 我說完了。"
            ],

            choice0: () => [
                ...(SAVE.data.n.state_foundry_undyne === 0 && !world.badder_lizard
                    ? [
                        '<25>{#p/alphys}{#g/alphysCutscene1}* 你終於到了！',
                        '<25>{#g/alphysCutscene2}* ...\n* 這就是「六號檔案」。',
                        '<25>{#f/15}* 這裝置建成之後，\n  那些人類就陸續進到了裡面。',
                        '<25>{#f/15}* 裝置內，時間流速\n  比現實慢得多...',
                        '<25>{#f/15}* 所以，他們看上去\n  就像時間被定格住一樣...',
                        "<25>{#f/10}* ...是不是很酷啊？！",
                        "<25>{#f/1}* Roman博士居然能造出\n  這麼棒的裝置，真是厲害！",
                        "<25>{|}{#f/15}* 嗯... 我不知道\n  他追不追科幻番，\n  但我知道有部科幻動漫電影 {%}",
                        '<99>{|}{#f/15}  為了看這部電影你需要佩戴\n  最新最酷炫的虛擬實境眼鏡\n  也就是VR眼鏡才可以但是呢 {%}',
                        '<99>{|}{#f/23}  如果你戴了VR眼鏡的話就會\n  被困在一個虛擬電影時空中\n  不止是你其他人也會被困住 {%}',
                        '<99>{|}{#f/23}  所以人們需要想辦法來逐步\n  推動故事劇情發展這樣才能\n  最終找到辦法徹底逃出這裡 {%}',
                        '<99>{|}{#f/18}  最終經過不懈努力我們主角\n  終於找到了逃出這裡的方法\n  之後主角成功脫困之後又幫 {%}',
                        '<99>{|}{#f/18}  所有人成功脫困！！！',
                        '<25>{#f/18}* ...',
                        '<25>{#f/20}* 呃，所以我覺得Roman博士\n  應該是受到了它的啟發。',
                        "<25>{#f/18}* 不-不說這個！！\n* Asgore正在力場那裡\n  等你呢！"
                    ]
                    : [
                        '<25>{#p/alphys}{#g/alphysCutscene1}* 你終於到了！',
                        '<25>{#g/alphysCutscene2}* ...',
                        "<25>{#g/alphysSmileSweat}* 對-對了，\n  Asgore正在力場那裡\n  等你呢。"
                    ]),
                '<25>{#g/alphysNeutralSweat}* 你... 你應該也想去找他。',
                "<25>{#g/alphysOhGodNo}* 但是，\n  如果你不是想找他的！！\n* 那...",
                "<25>{#g/alphysTheFactIs}* 那我也不知道...\n  你為什麼來這了。",
                "<26>{#g/alphysCutscene2}* 好吧。\n* 我全說完了，真說完了。"
            ],
            choice0x: ["<25>{#p/alphys}{#g/alphysCutscene2}* 呃，\n  我先在這忙我的事。"],
            choice0y: ['<25>{#p/alphys}{#g/alphysInquisitive}* 還有點猶豫，是嗎...？'],
            choice1: [
                '<26>{#p/asgore}{#f/1}* 這就是力場。',
                '<25>{#f/2}* 這道力場將我們囚禁於此。',
                '<25>{#f/1}* 這東西沒有意識，\n  沒有感情...',
                '<25>{#f/2}* 只要進來了，\n  誰都出不去。'
            ],
            choice1a: () => [
                '<25>{#p/asgore}{#f/1}* 這麼多年，怪物們都沒有機會\n  再次看到星辰。\n* 我只能扼腕嘆息。',
                '<25>* 與此同時，我也十分害怕\n  某一天，人類到來，\n  將我們一舉消滅。',
                ...(world.bad_robot || world.trueKills > 29
                    ? [
                        '<25>{#f/1}* ...',
                        '<25>{#f/2}* 今天... 惡夢成真了。',
                        '<25>{#f/3}* Alphys把你的... 暴行\n  都告訴了我。',
                        ...(world.alphys_percieved_kills < 20
                            ? ['<25>{#f/2}* 不過，她也和我說，\n  你放過了不少怪物。']
                            : [
                                '<25>{#f/16}* ...\n* 孩子，回答我。',
                                '<25>{#f/12}* 你這麼做，是為了保護自己，\n  還是為了報復？',
                                '<25>{#f/12}* 還是，你一開始就計畫好\n  把怪物們全殺了？'
                            ]),
                        '<25>{#f/5}* ...',
                        '<26>{#f/16}* 總之，你讓我進退兩難。',
                        '<25>{#f/15}* 我是該相信你，\n  讓你拯救我們...',
                        '<25>{#f/16}* 還是親手把你的靈魂扯出來，\n  然後自己進入「檔案」。',
                        '<25>{#f/3}* ...',
                        ...(world.alphys_percieved_kills < 20
                            ? [
                                '<25>{#f/3}* 儘管你做了很多錯事，\n  我也不想傷害你。',
                                '<25>{#f/4}* 你有能力把我們折磨得更慘，\n  但是...',
                                '<25>{#f/2}* ...你並沒有那麼做。',
                                '<25>{#f/1}* 所以，你絕不是無可救藥的，\n  孩子。',
                                '<25>{#f/2}* 你只是見到怪物們，\n  非常害怕，慌不擇路了。'
                            ]
                            : ['<25>{#f/3}* 我無法言說\n  自己現在到底有多難受。'])
                    ]
                    : (world.bad_lizard > 0 && world.alphys_percieved_kills > 0) || 2 <= world.alphys_percieved_kills
                        ? [
                            '<25>{#f/1}* ...',
                            '<25>{#f/1}* 總體來看，你還是挺善良的。',
                            ...(world.bad_lizard > 0
                                ? ["<25>{#f/2}* Alphys和我說，\n  你... 殺了人。"]
                                : ['<25>{#f/2}* Alphys和我說，\n  你好像... 殺了人。']),
                            '<25>{#f/3}* ...',
                            ...(SAVE.data.b.ultrashortcut
                                ? [
                                    '<25>{#f/3}* 幸好，你被Papyrus抓住，\n  直接到了這裡。',
                                    '<25>{#f/2}* 你肯定發現了，\n  前哨站並不安全。',
                                    '<25>{#f/5}* 別擔心，這裡相對安全，\n  我們會保護你的。'
                                ]
                                : [
                                    '<25>{#f/3}* 事情弄成這樣，都怪我。',
                                    '<25>{#f/2}* Alphys博士第一次護送人類，\n  就因為我死守秘密...',
                                    "<25>{#f/5}* 把她的工作弄得那麼困難。"
                                ]),
                            '<25>{#f/15}* ...',
                            '<25>{#f/16}* 「六號檔案」就在你的身後。',
                            '<26>{#f/1}* 那些人類...\n  雖然只是孩子，\n  但最後都自願進入了「檔案」。',
                            '<25>* 所以...\n  下一個進入的人類就是你了。'
                        ]
                        : [
                            '<25>{#f/1}* 之後，孩子們一個接一個\n  來到了這裡。',
                            '<25>* 他們初來乍到時，\n  都十分害怕，經歷許多艱險\n  才到達終點。',
                            '<26>{#f/6}* 但無一例外，他們都把\n  自己最優秀的品質\n  盡數展現出來。',
                            '<25>* 一個孩子很有耐心，\n  一個孩子充滿勇氣。',
                            '<25>* 一個孩子很守信用，\n  一個孩子能屈能伸。',
                            '<25>{#f/2}* 一個孩子心中充滿善意...',
                            '<25>{#f/4}* 還有一個，敢於伸張正義。',
                            '<25>{#f/1}* 當我問他們，\n  「你想和我們待在一起，\n   還是進入『檔案』？」',
                            '<25>* 他們都選擇了後者。',
                            ...(SAVE.data.b.ultrashortcut
                                ? [
                                    '<25>{#f/5}* 所以，無論你經歷了什麼...',
                                    '<25>{#f/1}* 希望你也願意進入「檔案」。'
                                ]
                                : ['<25>* 所以...\n  下一個進入的人類就是你了。'])
                        ])
            ],
            choice1b: () =>
                world.bad_robot || world.trueKills > 29
                    ? [
                        '<25>{#p/asgore}{#f/1}* 經過考慮，\n  我不允許你進入「檔案」。',
                        '<25>{#f/2}* 指望你擔下如此大任，\n  就是痴人說夢。',
                        '<25>{#f/5}* ...',
                        '<25>{#f/5}* 現在跟我回家。',
                        '<25>{#f/5}* 之後再決定如何處置你。'
                    ]
                    : [
                        [
                            '<25>{#p/asgore}{#f/6}* 最晚進入檔案的人類，\n  將會作為「容器」。',
                            "<25>* 從其他的人類靈魂中\n  「借」來能量，為己所用。",
                            '<26>* 凝聚你和他們的力量，\n  就可以打破力場。',
                            '<25>* 之後...',
                            '<25>* 怪物一族就能尋找新家園了。',
                            '<25>{#f/1}* 不過...',
                            '<25>* 如果你還沒準備好\n  扛下如此重任...',
                            '<25>* 你可以先和我們待在一起，\n  做好準備了，再進入檔案。',
                            '<25>{#f/6}* 無論如何，\n  我都會尊重你的選擇。',
                            '<25>{#f/1}* ...',
                            '<25>* 那麼，你願意\n  現在進入「檔案」嗎？',
                            choicer.create('* （你要怎麼回答？）', '進入', '再等等')
                        ],
                        [
                            '<26>{#p/asgore}{#f/6}* 你回來了。',
                            '<25>{#f/1}* ...',
                            '<25>* 那麼，你願意\n  現在進入「檔案」嗎？',
                            choicer.create('* （你要怎麼回答？）', '進入', '再等等')
                        ],
                        [
                            '<25>{#p/asgore}{#f/1}* ...',
                            '<25>* 那麼，你願意\n  現在進入「檔案」嗎？',
                            choicer.create('* （你要怎麼回答？）', '進入', '再等等')
                        ]
                    ][Math.min(SAVE.data.n.state_citadel_refuse, 2)],
            choice2a: [
                '<25>{#p/asgore}{#f/4}* ...',
                '<25>{#f/6}* 跟我來，孩子。',
                '<25>{#f/21}* 有不少事情等著咱們呢。'
            ],
            choice2b: () =>
                [
                    [
                        '<25>{#p/asgore}{#f/2}* ...我理解。',
                        '<25>{#f/1}* 也許我不該看別的孩子\n  馬上進入「檔案」，\n  就也催你跟著進。',
                        SAVE.data.b.ultrashortcut
                            ? '<25>{#f/5}* 這麼短時間，\n  我還沒爭取到你的信任。'
                            : '<25>{#f/5}* 也許，你還沒準備好，\n  也不信任我。',
                        '<25>{#f/1}* 如果改變主意，\n  隨時歡迎回來...',
                        '<25>{#f/2}* 如果你不想這麼做，\n  我不會強迫你。'
                    ],
                    ['<25>{#p/asgore}{#f/2}* ...我理解。']
                ][Math.min(SAVE.data.n.state_citadel_refuse++, 1)],
            choice3a: ['<25>{#p/asgore}{#f/6}* 開始吧。'],
            choice4a: ['<25>{#p/asgore}{#f/5}* Alphys？'],
            choice4b: [
                '<25>{#p/alphys}{#g/alphysOhGodNo}* 啊，知-知道了！\n* 對不起！',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 稍等一下，\n  我先做好準備工作...'
            ],
            choice5: ['<25>{#p/alphys}{#g/alphysCutscene2}* 搞定。\n* 各項參數應該設定好了。'],
            choice6a: ["<25>{#p/alphys}{#g/alphysWelp}* 好，那人類已經成功\n  連上裝置。"],
            choice6b: [
                "<25>{#p/asgore}{#f/6}* 別緊張，孩子。",
                '<25>{#p/asgore}{#f/7}* 在「檔案」建造之初...',
                '<25>{#p/asgore}{#f/6}* 我們為人類提供了\n  最舒適的生活環境。',
                '<25>{#p/asgore}{#f/21}* 在裡面，地球上所有美景\n  都能盡收眼底。',
                '<25>{#p/asgore}{#f/6}* 你能看到鬱鬱蔥蔥的森林，\n  綿延起伏的山丘，\n  還有潺潺流淌的小溪。',
                '<25>{#p/asgore}{#f/4}* ...年輕人，\n  怪物的命運都指望你了。',
                '<25>{#p/asgore}{#f/6}* 進入「檔案」後，\n  務必注意安全，\n  也不要逗留太久。'
            ],
            choice7: [
                "<32>{#p/basic}* 我還在這裡的，搭檔...",
                "<32>* ...不過，那裡是潛意識的時空，",
                '<33>* 我進不去。',
                "<32>* 無論發生什麼，\n  你一定會做正確的事。",
                '<32>* ...',
                '<32>* 注意安全，好嗎？'
            ],
            choice8: [
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#p/asgore}{#f/2}* 你來了。',
                '<32>{#p/human}* （...）',
                '<25>{#p/asgore}{#f/1}* ...\n* 我其實有很多事想問你。',
                '<25>{#f/2}* 或許，\n  你已經不想和我廢話。',
                '<25>{#f/4}* 儘管如此...',
                '<25>{|}{#f/7}* 我還是相信- {%}'
            ],
            
            clover1: ["<32>{#p/human}{#v/6}{@fill=#faff29}* ...是不是挺美的？"],
            clover2: [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* ...\n* 不過，這話換他來說，\n  估計更合適。",
                '<32>{@fill=#faff29}* 曾經，這樣的美景\n  稀鬆平常，隨處可見...',
                '<32>{@fill=#faff29}* ...但我一來，\n  把一切都毀了。',
                '<32>{@fill=#faff29}* 我的體內有仿生植入體，\n  使用它，就可以奪取\n  系統的最高權限。',
                '<32>{@fill=#faff29}* 有了最高權限，\n  我們想要啥，就有啥...\n* 肆意濫用權限，最終付出了代價。',
                "<32>{@fill=#faff29}* 你取得的「靈勢」告訴我，\n  你已經去過我們創造的\n  所有子世界...",
                "<32>{@fill=#faff29}* 那末日般的景象，\n  想必你已經見過了。",
                '<32>{@fill=#faff29}* 「靈勢」...\n* 當然也是個縮寫，\n  全稱叫「靈魂勢能」。',
                "<32>{@fill=#faff29}* 我們的靈魂，\n  就是靠它聯結在一起。",
                "<32>{@fill=#faff29}* 而有了它，\n  你就能一舉打碎力場。"
            ],
            clover3: [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* 這裡是潛意識時空，\n  人的意識觸及不到這裡。",
                '<32>{@fill=#faff29}* 所以，我不知道\n  自己醒來後，是否還會記得\n  這裡發生的一切，',
                '<32>{@fill=#faff29}* 但沒關係。\n  即使我們的惡夢終將畫上句號...\n  即使我們終將遺忘一切...',
                '<32>{@fill=#faff29}* 也一定有人會記得這些。'
            ],
            clover4: () => [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* ...\n* 你該走了。",
                '<32>{@fill=#faff29}* 離開這裡的終端\n  就在主幹道的盡頭。',
                ...(SAVE.data.b.oops
                    ? ['<32>{@fill=#faff29}* ...多多保重...', '<32>{@fill=#faff29}* 好嗎？']
                    : [
                        '<32>{@fill=#faff29}* ...走之前，我有個問題...',
                        "<32>{@fill=#faff29}* 你的名字，\n  是叫Frisk嗎？",
                        "<32>{@fill=#faff29}* 抱歉。\n* 只是你一言不發，我有點好奇\n  你在想些什麼。",
                        "<32>{@fill=#faff29}* ...\n* Frisk，你是個好人。",
                        '<32>{@fill=#faff29}* 而且...',
                        "<32>{@fill=#faff29}* 那個人，一直在幕後，\n  為你出謀劃策的人...\n* 也是個好人。",
                        '<32>{@fill=#faff29}* ...',
                        "<32>{@fill=#faff29}* 這一切，我跟Frisk或許都會忘記。\n* 但你不會。",
                        "<32>{@fill=#faff29}* 如果此刻，\n  你正在某處看著我們...",
                        "<32>{@fill=#faff29}* ...請不要忘記\n  我們的經歷，我們的故事。\n* 請不要忘記這裡發生的一切。",
                        "<32>{@fill=#faff29}* 不管這世界是真是假。\n* 這裡的記憶，\n  都是最珍貴的東西。"
                    ])
            ],

            smasher1: (haha: boolean) => [
                "<25>{#p/alphys}{#g/alphysWelp}* 我去力場那等你。",
                ...(haha
                    ? [
                        '<25>{#p/alphys}{#g/alphysFR}* ...喔對了，趁你「睡覺」的時候。\n  我把喵喵玩偶拿回來了！',
                        "<25>{#p/alphys}{#g/alphysHellYeah}* 還想佔我便宜？\n  讓人笑掉大牙了都。"
                    ]
                    : !SAVE.data.b.failshow && SAVE.data.b.item_tvm_mewmew && !SAVE.data.b.mewget
                        ? ((SAVE.data.b.mewget = true),
                            [
                                '<25>{#p/alphys}{#g/alphysFR}* ...喔對了，\n  你把我的喵喵玩偶奪走，\n  現在我拿回來了。',
                                "<25>{#p/alphys}{#g/alphysHellYeah}* 還想佔我便宜？\n  讓人笑掉大牙了都。"
                            ])
                        : [])
            ],
            smasher2: ['<25>{*}{#p/alphys}{#g/alphysSmileSweat}* 準備好了嗎？{^40}{%}'],

            bad1: () =>
                [
                    world.bad_robot || world.trueKills > 29
                        ? world.alphys_percieved_kills < 20
                            ? [
                                '<25>{*}{#p/twinkly}{#f/8}* 是不是拿不定主意呀，\n  親愛的Asgore？',
                                '<25>{*}{#f/5}* 我理解。\n* 誰都有猶豫不決的時候。',
                                "<25>{*}{#f/11}* 但沒關係！",
                                "<25>{*}{#f/7}* 你再也不用操心啦！",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...幹...什麼...',
                                '<25>{*}{#p/twinkly}{#f/8}* 哎呀，我什麼都沒幹呀，\n  Asgore...'
                            ]
                            : [
                                '<25>{*}{#p/twinkly}{#f/5}* 哎呀呀，Asgore...',
                                "<25>{*}{#f/11}* 你本可以直接把人殺了，\n  那就皆大歡喜。",
                                "<25>{*}{#f/7}* 但現在，你再也沒機會嚕。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...幹...什麼...',
                                "<25>{*}{#p/twinkly}{#f/5}* 殺人，可沒你想得\n  那麼傷天害理喔，Asgore...",
                                '<25>{*}{#f/9}* 就讓我好好教你\n  怎麼才能殺得又嗨又爽吧！'
                            ]
                        : SAVE.data.b.ultrashortcut
                            ? [
                                '<25>{*}{#p/twinkly}{#f/5}* 哎呀，哎呀...',
                                "<26>{*}{#f/11}* 跑太快，把腦子都跑丟了。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...幹...什麼...',
                                "<25>{*}{#p/twinkly}{#f/5}* 想靠那點小把戲矇混過關？",
                                "<25>{*}{#f/7}* 真當我眼瞎呢。"
                            ]
                            : [
                                '<25>{*}{#p/twinkly}{#f/5}* 哈囉，Asgore！',
                                "<26>{*}{#f/11}* 別這麼急著拯救怪物嘛，\n  好玩的事多著呢。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...幹...什麼...',
                                '<25>{*}{#p/twinkly}{#f/5}* 我知道\n  這一下把你嚇得不輕，\n  但別氣餒喔！',
                                "<25>{*}{#f/7}* 你看，這多好玩啊。\n  是不是呀，Asgore？"
                            ],
                    [
                        "<25>{*}{#p/twinkly}{#f/7}* 哎呀呀，真可憐呢，\n  我的小$(name)。\n* 真以為我好忽悠？",
                        SAVE.data.b.ultrashortcut
                            ? '<25>{*}{#f/8}* 你怎麼總想著走捷徑呢...'
                            : '<25>{*}{#f/8}* 你咋這麼自以為是呢...',
                        '<25>{*}{#f/5}* 你那點小聰明，休想得逞。',
                        '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                        '<25>{*}* ...幹...什麼...',
                        "<25>{*}{#p/twinkly}{#f/5}* 從現在起，我才是爹。",
                        '<25>{*}{#f/7}* 而你？\n  就是個任我擺布的傀儡！'
                    ],
                    [
                        '<25>{*}{#p/twinkly}{#f/11}* $(name)，別掙扎了...',
                        '<25>{*}{#f/5}* 你逃不出我的手掌心！',
                        SAVE.data.b.ultrashortcut
                            ? "<25>{*}{#f/7}* 你就算長了飛毛腿，\n  我也比你快！"
                            : "<25>{*}{#f/7}* 你就算求爺爺告奶奶，\n  我也不會放過你。",
                        '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                        '<25>{*}* ...幹...什麼...',
                        "<25>{*}{#p/twinkly}{#f/5}* 噓... 別怕。",
                        '<25>{*}{#f/5}* 只是我的好朋友\n  $(name)不聽話，\n  我正修理它呢。'
                    ]
                ][Math.min(SAVE.flag.n.neutral_twinkly_loop1++, 2)],
            bad2: [
                "<25>{*}{#g/twinklyNice}* ...哎呀，忘了自我介紹了。\n  我叫Twinkly。{^30}{%}",
                '<25>{*}{#g/twinklySassy}* 閃亮明星：Twinkly。{^30}{%}'
            ],
            bad3: ['<25>{*}{#p/asgore}{#g/asgoreBreak1}* 啊啊啊啊...！{^999}'],
            bad4: [
                "<25>{*}{#p/twinkly}{#g/twinklyWink}* 哎呦~ 你痛苦的尖叫\n  真是天籟之音啊，\n  太好聽啦！{^30}{%}",
                '<25>{*}{#p/asgore}{#g/asgoreBreak1}* ...{^10}{%}'
            ],
            bad5: ["<25>{*}{#p/twinkly}{#f/7}* 讓我們再欣賞一次。{^20}{%}"],
            bad6: ['<25>{*}{#p/asgore}{#g/asgoreBreak2}* 啊啊啊啊啊啊...！{^999}'],
            bad7: ['<25>{*}{#p/twinkly}{#f/11}* 給我叫！{^5}{%}'],
            bad8: ['<25>{*}{#p/twinkly}{#g/twinklyEvil}{#v/1}* 使勁叫！！！{^5}{%}'],
            bad9: ['<25>{*}{#p/twinkly}{#g/twinklyGrin}{#v/1}* 叫啊！！！{^5}{%}'],
            bad10: ['<25>{*}{#p/twinkly}{#g/twinklyTwisted}{#v/1}* 叫啊！！！{^5}{%}'],
            bad11: [
                '<25>{*}{#p/twinkly}{#g/twinklyCrazed}{#v/1}* 叫啊叫啊叫啊叫啊叫啊叫啊\n  叫啊叫啊叫啊叫啊叫啊叫啊\n  叫啊叫啊叫啊叫啊叫啊叫啊 {%}',
                '<99>{*}{#p/twinkly}{#g/twinklyBroken}{#v/1}* 啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈\n  哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈\n  哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈{^20}{%}'
            ],
            bad12: ['<25>{*}{#p/twinkly}{#g/twinklyDead}{#v/0}* ...{^80}{%}', '<25>{*}* ...死吧。{^10}{%}'],
            bad13: () => [
                ...[
                    [
                        '<99>{#p/twinkly}{#v/1}哈囉，$(name)。{^100}{%}',
                        '<99>{#p/twinkly}{#v/1}歡迎來到新時空。{^100}{%}'
                    ],
                    [
                        '<99>{#p/twinkly}{#v/1}$(name)，歡迎回來。{^100}{%}',
                        "<99>{#p/twinkly}{#v/1}好開心喔，又見到你了。{^100}{%}"
                    ],
                    [
                        '<99>{#p/twinkly}{#v/1}哎呦，$(name)...{^100}{%}',
                        '{#p/twinkly}{#v/1}你膽可真肥，竟敢拋棄我。{^100}{%}'
                    ]
                ][Math.min(SAVE.flag.n.neutral_twinkly_loop2, 2)],
                '<99>{#p/twinkly}{#v/1}嘻嘻嘻...{^100}{%}',
                '<99>{#p/twinkly}{#v/1}是不是... 很孤獨呀？{^100}{%}',
                '<99>{#p/twinkly}{#v/1}是不是... 很想逃呀？{^100}{%}',
                "<99>{#p/twinkly}{#v/1}...想逃？沒門！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}Asgore把那「檔案」當寶一樣寵著...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}那就讓你也好好享受享受它吧！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}你只能往前...{^100}{%}',
                '<99>{#p/twinkly}{#v/1}再過來點，再過來點...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}...你不怕我嗎？{^100}{%}",
                "<99>{#p/twinkly}{#v/1}還不逃？{^100}{%}",
                '<99>{#p/twinkly}{#v/1}好。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}太好了。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}真不愧是我的好夥伴。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}快了...！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}$(name)，馬上就到了...{^100}{%}'
            ],
            bad14: [
                '<99>{#p/human}{#v/1}{@fill=#42fcff}漫長的惡夢已然消散。{^80}{%}',
                '<99>{#p/human}{#v/2}{@fill=#ff993d}熟悉的世界再度出現！{^80}{%}',
                '<99>{#p/human}{#v/3}{@fill=#003cff}重要的抉擇擺在眼前。{^80}{%}',
                '<99>{#p/human}{#v/4}{@fill=#d535d9}眼前巨物，毀於一旦？{^80}{%}',
                '<99>{#p/human}{#v/5}{@fill=#00c000}心中仁慈，盡數展現？{^80}{%}',
                '<99>{#p/human}{#v/6}{@fill=#faff29}戰或至善，由你決斷。{^80}{%}'
            ],
            bad15: [
                [
                    '<99>{*}{#p/twinkly}...',
                    '<99>{*}...你在做什麼？',
                    "<99>{*}你以為我會...",
                    '<99>{*}...學到教訓嗎？',
                    '<99>{*}想得美。'
                ],
                ["<99>{*}{#p/twinkly}你要是現在不動手...", "{*}終有一天，我會回來。"],
                ["<99>{*}{#p/twinkly}我會把你幹掉。"],
                ["<99>{*}{#p/twinkly}我會摧毀一切。"],
                ["<99>{*}{#p/twinkly}我會將你的存在徹底抹去！"],
                ['<99>{*}{#p/twinkly}...'],
                ['<99>{*}{#p/twinkly}...？'],
                ['<99>{*}{#p/twinkly}...為什麼？'],
                ['<99>{*}{#p/twinkly}...為什麼...', '{*}{#p/twinkly}...要對我這麼好？'],
                ["<99>{*}{#p/twinkly}...我不明白..."],
                ["<99>{*}{#p/twinkly}我不明白！"]
            ],
            bad16a: ["<99>{*}{#p/twinkly}{#i/8}...我就是...不明白...{^30}{%}"],
            bad16b: ['<99>{*}{#p/twinkly}{#i/3}再見，$(name)。{^30}{%}'],
            bad17: [
                
                '<32>{*}{#p/event}{#i/5}Twinkly逃走了。'
            ],
            sad0: () =>
                world.runaway ? ['<25>{#p/asriel1}{#f/30}* 我投降！'] : ["<25>{#p/asriel1}{#f/25}* 對不起。"],
            sad1: () => [
                ...(world.runaway
                    ? ['<25>{#p/asriel1}{#f/23}* 看樣子，$(name)，\n  你又贏了。']
                    : [
                        "<25>{#p/asriel1}{#f/23}* $(name)，\n  我一直都是個愛哭鬼，是吧？",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* Asriel...'])
                    ]),
                '<25>{#p/asriel1}{#f/22}* ...',
                '<25>{#f/21}* ...我知道的。',
                "<25>{#f/23}* 你並不是$(name)，\n  對吧？",
                "<25>{#f/22}* 很久以前，\n  $(name)就死了。",
                '<25>{#f/15}* ...',
                '<25>{#f/15}* 嗯... 那個...',
                '<25>{#f/10}* 你叫什麼名字呢？'
            ],
            sad2: () => [
                '<32>{#p/human}* （...）\n* （你把你的名字告訴了Asriel。）',
                ...(world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* 是叫Frisk嗎？',
                        '<25>{#f/23}* 嗯，這次你又贏了，\n  Frisk。',
                        '<25>{#f/22}* ...',
                        "<25>{#f/13}* 很奇怪...",
                        "<25>{#f/16}* 當星星時，我都忘了...\n  恐懼是什麼滋味了。",
                        "<25>{#f/15}* 無數次將別人推入恐懼深淵，\n  已經麻木了。",
                        "<25>{#f/13}* 但現在，\n  我有了所有怪物的靈魂後...",
                        '<25>{#f/15}* ...我...',
                        "<25>{#f/16}* 我終於深切感受到那種情感。",
                        "<25>{#f/15}* 當你開始不停攻擊我時...",
                        '<25>{#f/15}* 他們，好像就知道了\n  你是怎樣的人。',
                        '<25>{#f/13}* 誠然，你從沒殺過\n  任何一隻怪物。',
                        '<25>{#f/13}* 但你也一次次將他們\n  推向生死邊緣...',
                        '<25>{#f/15}* 一次，又一次，又一次...',
                        '<25>{#f/16}* ...',
                        "<25>{#f/21}* Frisk，\n  他們現在都很怕你。",
                        '<26>{#f/23}* 而且...\n  我也很怕你。',
                        '<25>{#f/22}* ...'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/17}* 是叫Frisk嗎？',
                        "<25>{#f/17}* 那...",
                        '<25>{#f/23}* ...真是個好名字。',
                        '<25>{#f/22}* ...',
                        '<25>{#f/13}* Frisk...',
                        ...(SAVE.flag.n.killed_sans > 0
                            ? [
                                '<25>{#p/asriel1}{#f/13}* 一想到咱們之前\n  幹的那些破事，我...',
                                '<25>{#f/15}* ...',
                                "<25>{#f/16}* 把你拖下水，讓你幹那些事，\n  真的對不起。",
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...等等，他在說什麼...']),
                                ...(SAVE.flag.n.genocide_milestone > 0
                                    ? [
                                        [
                                            '<25>{#p/asriel1}{#f/21}* Sans，Papyrus...\n* 還有犬衛隊的狗狗們...',
                                            '<25>{#p/asriel1}{#f/21}* Sans，Papyrus，\n  怪物小孩，Undyne...\n* 甚至還有皇家守衛...',
                                            '<25>{#p/asriel1}{#f/21}* Sans，Papyrus，\n  怪物小孩，Undyne...\n* 還有Mettaton...',
                                            '<25>{#p/asriel1}{#f/21}* Sans，Papyrus，\n  怪物小孩，Undyne...\n* 還有Mettaton和Alphys...'
                                        ][Math.ceil((SAVE.flag.n.genocide_milestone - 1) / 2)],
                                        "<25>{#f/21}* 這些人，\n  你願意拼盡全力保護他們，\n  而我卻..."
                                    ]
                                    : [
                                        "<25>{#p/asriel1}{#f/21}* 雖然我知道，\n  我們造成的傷害並不算多...",
                                        '<25>{#f/15}* ...但是...',
                                        '<25>{#f/21}* 為了一己私慾，\n  強迫你做那些事，\n  也都是我的錯。',
                                        "<25>{#f/21}* 更何況，\n  你願意拼盡全力保護他們，\n  而我卻..."
                                    ]),
                                ...(SAVE.data.b.oops
                                    ? []
                                    : ['<32>{#p/basic}* 他說的... \n  是那條「屠殺時間軸」嗎？\n* 之前他提過一嘴。']),
                                "<25>{#p/asriel1}{#f/23}* 所以...\n  別自責，好嗎？",
                                "<25>{#f/22}* 不僅是因為，你重置了，\n  抹去了過去的暴行...",
                                '<25>{#f/17}* 更因為，你能直面危險，\n  拯救朋友。',
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 太對了。']),
                                "<25>{#p/asriel1}{#f/13}* 而且...",
                                '<25>{#f/13}* 我仔細想了想\n  那條時間軸，總感覺...',
                                '<25>{#f/15}* 你那時雖然手上在屠殺，\n  但心裡，並不喜歡那樣。',
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 那肯定的。']),
                                '<25>{#p/asriel1}{#f/23}* 說實話，我反而覺得...',
                                '<25>{#f/22}* 你很抗拒殺戮。',
                                ...(SAVE.data.b.oops
                                    ? []
                                    : ["<32>{#p/basic}* 對啊，Frisk根本就不是\n  冷血的傢伙。"]),
                                '<25>{#p/asriel1}{#f/15}* 所以我明白...',
                                '<25>{#f/15}* 儘管做了錯事...\n  儘管受我指使...\n  儘管發生了那些事...',
                                "<25>{#f/16}* 你仍比我優秀。",
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 哼。']),
                                "<25>{#p/asriel1}{#f/21}* ...\n* 這話說得有點早了。"
                            ]
                            : [
                                "<25>{#f/13}* 我很久都沒有\n  這樣的感覺了。",
                                '<25>{#f/16}* 作為星星時，\n  我... 無法感受到任何情緒。',
                                '<25>{#f/15}* 我缺少愛人的能力。',
                                "<25>{#f/13}* 然而，當我擁有所有\n  人的靈魂時...",
                                '<25>{#f/13}* 我不僅再次找回了\n  我的同情心...',
                                "<25>{#f/23}* 而且同樣能感受\n  其他怪物的情緒。",
                                '<25>{#f/17}* 他們彼此關心。',
                                ...(30 <= SAVE.data.n.bully
                                    ? [
                                        '<25>{#f/23}* 還有... 呃...\n* 對於你，他們...',
                                        '<25>{#f/22}* ...',
                                        ...(20 <= world.flirt
                                            ? [
                                                '<25>{#f/15}* ...嗯，\n  他們似乎有點矛盾...',
                                                "<25>{#f/10}* 就感覺... 他們挺喜歡你...\n  但又有點怕你。"
                                            ]
                                            : [
                                                "<25>{#f/15}* 唔...\n  挺多怪物不咋喜歡你...",
                                                ...(SAVE.data.b.undyne_respecc
                                                    ? [
                                                        '<25>{#f/10}* 除了Undyne。\n* 她喜歡你，喜歡得不得了，\n  我也不知道為啥。'
                                                    ]
                                                    : ["<25>{#f/10}* 但是，\n  我也不知道為啥。"])
                                            ]),
                                        '<25>{#f/23}* ...真奇怪。',
                                        '<25>{#f/22}* ...'
                                    ]
                                    : [
                                        '<25>{#f/23}* 而且...\n  他們也關心你，\n  Frisk。',
                                        '<25>{#f/22}* ...',
                                        ...(20 <= world.flirt
                                            ? [
                                                '<25>{#f/15}* ...哇，他們...\n  他們真的好關心你...',
                                                '<25>{#f/15}* 呃...\n* Frisk，這...',
                                                '<25>{#f/17}* ...好傢伙...',
                                                "<25>{#f/20}* 我，呃，還是暫時先\n  不告訴你\n  他們現在的感覺了吧。"
                                            ]
                                            : [
                                                '<25>{#p/asriel1}{#f/13}* 我只希望我能告訴你\n  大家對你的感覺。',
                                                '<25>{#f/17}* Toriel... Asgore...\n* Sans... Papyrus...\n* Undyne... Alphys...',
                                                ...(!SAVE.data.b.f_state_kidd_betray
                                                    ? ['<25>{#f/15}* ...怪物小孩？\n* 那孩子是叫這名嗎？']
                                                    : world.happy_ghost && SAVE.data.b.a_state_hapstablook
                                                        ? ['<25>{#f/23}* ...Napstablook，\n  還有幽靈表親。']
                                                        : SAVE.data.n.state_starton_nicecream > 0
                                                            ? ['<25>{#f/23}* ...甚至還有冰意靈小哥。']
                                                            : ['<25>{#f/23}* ...甚至還有\n  在核心工作的小老鼠。']),
                                                '<25>{#f/17}* 怪物是很奇怪的。',
                                                '<25>{#f/15}* 即使他們幾乎\n  不咋了解你...',
                                                '<25>{#f/17}* 但這並不妨礙，\n  他們真的愛你。',
                                                '<25>{#f/23}* 哈哈。',
                                                '<25>{#f/22}* ...'
                                            ])
                                    ])
                            ])
                    ])
            ],
            sad3: () =>
                world.runaway
                    ? [
                        "<26>{#p/asriel1}{#f/13}* 不過，我...\n* 我知道我犯了更\n  嚴重的錯誤。",
                        "<25>{#f/16}* 我知道...\n  這裡發生的事不應該\n  都歸咎於你。",
                        ...(SAVE.flag.n.killed_sans > 0
                            ? [
                                '<25>{#f/15}* ...',
                                '<25>{#f/15}* 是我把你拖下水，\n  是我，逼你加入那個\n  「毀滅前哨站」的扯淡計畫...',
                                '<25>{#f/16}* 好能騙過自己，\n  把你當成那個死去的夥伴...'
                            ]
                            : [
                                '<25>{#f/15}* ...',
                                '<25>{#f/15}* 將自己變成...\n  那樣的存在...',
                                '<25>{#f/16}* 就只是想在由我\n  創造的惡夢中\n  折磨你...'
                            ]),
                        "<25>{#f/13}* ...現在想想...",
                        "<25>{#f/22}* ...做了那些事，\n  我怎麼還有臉活在這世上。",
                        choicer.create('* （你要怎麼做？）', '反駁', '沉默')
                    ]
                    : [
                        SAVE.flag.n.killed_sans > 0
                            ? "<25>{#p/asriel1}{#f/13}* 如果你不想原諒我，\n  我能理解。"
                            : "<25>{#p/asriel1}{#f/13}* Frisk... 我...\n* 如果你不想原諒我，\n  我能理解。",
                        '<25>{#f/13}* 如果你想讓我離開，\n  我也能理解。',
                        ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* ...別這麼說！"]),
                        '<25>{#p/asriel1}{#f/15}* 我的行為\n  既怪異，又可怕。',
                        '<25>{#f/15}* 我傷害了你。',
                        '<25>{#f/16}* 我傷害了許多人。',
                        '<25>{#f/13}* 朋友，家人，\n  還有其他人...',
                        "<25>{#f/22}* 我的行為罪不容恕。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* Asriel...']),
                        choicer.create('* （你要怎麼做？）', '原諒他', '沉默')
                    ],
            sad4a: () => [
                ...(world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/25}* 什... 什麼？',
                        '<25>{#f/21}* ...',
                        "<25>{#f/21}* 我猜... 你其實根本\n  就不想讓什麼人死，對嗎？",
                        '<25>{#f/22}* 你就是想要享受通過\n  擊敗他人獲取到的快感...\n  僅此而已。',
                        '<25>{#f/21}* ...儘管...\n  你想讓我留下...'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/25}* 什... 什麼？',
                        '<25>{#f/17}* ...拜託，Frisk。',
                        "<25>{#f/23}* 你...\n* 你又要把我弄哭了。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...我-我理解...']),
                        '<25>{#p/asriel1}{#f/21}* ...再者說，\n  就算你原諒我...'
                    ]),
                "<25>{#f/15}* 我也不能將這些靈魂\n  永遠留在我的體內。",
                '<25>{#f/16}* 因此... 我只能將\n  這些靈魂物歸原主。'
            ],
            sad4b: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* ...',
                        '<25>{#f/21}* 不管怎麼說，我答應過你：\n  如果你能打敗我，\n  就給你一個幸福的結局。',
                        '<25>{#f/23}* 現在，該兌現承諾了。',
                        "<25>{#f/15}* 既然這些靈魂也不能\n  永遠待在我的體內...\n* 那就將它們物歸原主吧。",
                        "<25>{#f/16}* 這是我唯一能做的。"
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/22}* ...好。',
                        '<25>{#f/21}* 我知道了。',
                        '<25>{#f/15}* 我之前犯下那麼多錯...\n  只希望... \n  現在能彌補一點。',
                        
                        "<25>{#p/asriel1}{#f/15}* 既然這些靈魂不能\n  永遠待在我的體內...",
                        '<25>{#f/16}* 那就將它們物歸原主吧。'
                    ],
            sad4c: () => [
                '<25>{#p/asriel1}{#f/16}* ...',
                '<25>{#f/6}* 但首先...',
                "<25>{#f/29}* 我還有一件事\n  必須完成。",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...是什麼？']),
                "<25>{#p/asriel1}{#f/29}* 此時此刻，我能感受到\n  大家的心在一起跳動。",
                "<25>{#f/6}* 他們這個種族\n  都有一個同樣的目標。",
                "<26>{#f/6}* 憑藉每個人的力量...\n  每個人的決心...",
                "<25>{#f/6}* 是時候...",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 讓怪物自由了。']),
                '<25>{#p/asriel1}{#f/29}* 讓怪物自由了。',
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...猜到了。'])
            ],
            abreak: '{*}{#p/event}{#i/3}力場崩潰了。',
            sad5: () => [
                '<25>{#p/asriel1}{#f/21}* Frisk...',
                '<25>{#f/21}* 我現在得走了。',
                ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* ...啊？\n* 但你不能就..."]),
                "<25>{#p/asriel1}{#f/15}* 失去了所有人的靈魂...",
                "<25>{#f/22}* 我將無法再維持\n  這種形態。",
                '<25>{#f/21}* 過一會...',
                "<25>{#f/22}* 我將再次會\n  變為一顆星星。",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 但是... 你...']),
                "<25>{#p/asriel1}{#f/15}* 我將再次失去自我。",
                ...(world.runaway
                    ? [
                        "<25>{#f/15}* ...但那也許是\n  最好的結果了。",
                        '<25>{#f/23}* 哈... Frisk。',
                        "<25>{#f/21}* 你沒有理由\n  再留在這裡了。",
                        "<25>{#f/22}* 別在我身上浪費時間了。"
                    ]
                    : [
                        "<25>{#f/15}* 我將再也無法\n  感受到愛。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...不...']),
                        '<25>{#p/asriel1}{#f/23}* 所以... Frisk。',
                        "<25>{#f/17}* 請將我徹底遺忘，好嗎？",
                        ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* 不！你不能就這麼\n  一走了之！"]),
                        '<25>{#p/asriel1}{#f/23}* 回到那些\n  愛你的人身邊吧。'
                    ]),
                choicer.create('* （你要怎麼做？）', '安慰他', '站著不動')
            ],
            sad6: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/25}* ...！',
                        '<25>{#f/21}* ...',
                        '<25>{#f/21}* Frisk，我...',
                        "<25>{#f/15}* ...我只是還沒準備好，\n  而已。",
                        "<25>{#f/22}* 我... 我很抱歉。"
                    ]
                    : [
                        '<25>{#p/asriel1}{#i/4}{#f/23}* 哈... 哈...',
                        "<25>{#f/23}{#i/4}* 我不想放開手...",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/human}* （你聽到有人在哭...）'])
                    ],
            sad7: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/13}* Frisk...',
                        '<25>{#f/15}* 不管你做什麼...',
                        '<25>{#f/21}* 只是...\n  試著小心一點，行不？',
                        '<25>{#f/21}* 不管是誰...\n  被你打到命在旦夕。',
                        '<25>{#f/23}* 天吶。\n* 無法想像經歷了這一切後，\n  他們將會如何處置你。'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/21}* Frisk...',
                        "<25>{#f/23}* 你...",
                        "<25>{#f/17}* 你做了一件很偉大的事情，\n  知道嗎？",
                        
                        '<25>{#f/23}* 不管你做什麼...\n* 每個人都會支援你，\n  知道嗎？',
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 不... 求你了...'])
                    ],
            sad8: ["<25>{#p/asriel1}{#f/21}* 好了...\n* 我的時間所剩無幾了。", '<25>{#f/22}* 所以... 再見。'],
            sad8x: ["<32>{*}{#p/basic}* ...不要離開我...{^50}{%}"],
            sad9: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* 順帶一提...',
                        '<25>{#f/22}* Frisk。',
                        "<25>{#f/21}{#x1}* ...不要為此自責，好嗎？"
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/21}* 順帶一提...',
                        '<25>{#f/23}* Frisk。',
                        '<25>{#f/17}{#x1}* ...幫我照顧好爸爸媽媽，\n  好嗎？'
                    ],
            sad9x: ['<32>{#p/basic}* ...'],
            sad10: () =>
                world.runaway
                    ? ['<32>{#p/human}* （飛船的聲音漸漸消失在天際。）']
                    : ['<25>{#p/kidd}{#f/4}* 喂？', '<25>{#f/4}* 有人嗎...？'],
            sad11: () =>
                SAVE.data.b.f_state_kidd_betray
                    ? [
                        "<25>{#p/kidd}{#f/5}* ...喔，是你啊。",
                        "<25>{#f/4}* 好吧...\n  如果你準備好...",
                        "<25>{#f/5}* 大家都在\n  Asgore家等你。",
                        "<25>{#f/4}* 我...\n  我不打擾你了。"
                    ]
                    : [
                        '<25>{#p/kidd}{#f/2}* 喲！\n* 這段時間你跑哪去了！？',
                        "<25>{#f/1}* 他們一直在找你，夥計！",
                        "<25>{#f/2}* 就是，Asgore家開了\n  一個大派對，還有...",
                        "<25>{#f/1}* 每個人都在期盼\n  你啥時候會登場呢！",
                        "<25>{#f/1}* ...來吧，夥計！\n* 趁還有時間，\n  來加入我們的狂歡吧！"
                    ],
            sad11x: [
                '<32>{#p/basic}* Frisk，我...',
                "<33>* 我不能就這麼讓他離開。",
                "<32>* 我還有\n  太多的話想要...",
                "<32>* 這些話我藏在心裡\n  已經日久年深了...",
                "<32>* 如果我不能快點去\n  跟他說這些話，那我...",
                '<32>* 我...',
                "<32>* 我只是想... 在與他徹底\n  分離之前，與他再見一面。"
            ],
            epilogue1: () =>
                world.runaway
                    ? [
                        '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                        '<18>{#p/papyrus}{#f/6}對不起，\n我們沒接你電話...',
                        "<18>{#p/papyrus}{#f/6}不是因為訊號不好，\n或者電話斷線。",
                        "<18>{#p/papyrus}{#f/5}單純是因為...\n不想搭理你。",
                        "<18>{#f/5}真奇怪...\n你的大名突然傳遍了\n整個怪物世界。",
                        "<18>{#f/6}而且，每個怪物...\n都非常害怕你。",
                        '<18>{#f/4}...也許說得太絕對，\n但大體沒錯。',
                        '<25>{#p/undyne}{#f/12}* 對。\n* 就是這樣。',
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#p/papyrus}{#f/5}...我感覺，\n就連她都開始怕你了。",
                        '<25>{#p/undyne}{#f/17}* 我才不怕呢！',
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#f/5}我們糾結了很久，\n最後還是決定...",
                        "<18>{#f/31}拋棄你，先走一步\n尋找新家園。",
                        "<18>{#f/6}知道你不好受！\n所以別擔心...",
                        "<18>{#f/5}...我們還給你\n留了個核心。",
                        '<25>{#p/undyne}{#f/12}* 過不了多久，\n  那玩意就沒能量了喔。',
                        "<18>{#p/papyrus}{#f/5}求求你...\n別來找我們，行嗎？",
                        "<18>{#f/31}我們都不想再見到你。",
                        '<18>{#f/3}...',
                        '<18>{#f/3}唉... 好自為之吧。',
                        '<25>{#p/undyne}{#f/1}* 好好享受一個人的世界！！',
                        '<32>{#s/equip}{#p/event}* 滴...'
                    ]
                    : [
                        '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                        "<18>{#p/papyrus}{#f/0}嘿，人類！\n希望你沒事！",
                        "<18>{#f/5}我們都擔心死你了。",
                        '<18>{#f/6}我們都把電話都打爆了，\n可你之前一次都沒接！',
                        '<18>{#f/0}還好你的朋友經過，\n然後...',
                        '<18>{#f/0}謝天謝地，\n我們現在能鬆口氣了。',
                        "<18>{#f/0}...FRISK？\n你是叫這名嗎？",
                        "<18>{#f/5}真奇怪...\n你的大名突然傳遍了\n整個怪物世界。",
                        "<18>{#f/0}不過也沒啥。\n奇怪管奇怪，\n還是挺振奮人心的。",
                        "<25>{#p/sans}{#f/0}* 小心點啊兄弟，\n  別把面煮糊了。",
                        "<18>{#p/papyrus}{#f/7}SANS！！！\n我知道自己在幹嘛！！！",
                        '<25>{#p/sans}{#f/2}* 以防萬一嘛。',
                        "<18>{#p/papyrus}{#f/6}對了...\nASGORE原來\n這麼喜歡義大利麵。",
                        '<18>{#p/papyrus}{#f/4}我僅用一碟義大利麵\n就把他徵服了...',
                        '<18>{#p/papyrus}{#f/0}他還讓我給\n參加派對的大夥\n都做份意面呢！',
                        '<18>{#p/papyrus}{#f/9}我，頂級廚師PAPYRUS，\n樂意效勞！',
                        "<25>{#p/sans}{#f/0}* 看來，長久的努力\n  終於有回報了，\n  是不是呀？",
                        '<18>{#p/papyrus}{#f/0}必須滴。',
                        '<18>{#p/papyrus}{#f/4}因為你瞧，\n大夥都挺喜歡的！',
'<18>{#p/papyrus}{#f/4}根本沒人嘗了一口\n就嫌棄說不好吃。',
                        '<25>{#p/sans}{#f/0}* 哇喔。\n* 對了，說說守衛的事兒吧。',
                        "<25>{#p/sans}{#f/3}* 你沒當上皇家守衛...\n  可能也不是那麼糟。",
                        "<25>{#p/sans}{#f/2}* 我是你的兄弟，\n  這就足以讓我為你驕傲了。",
                        "<18>{#p/papyrus}{#f/8}SANS...！\n你這話說的，\n我都要流眼淚了！",
                        "<18>{#p/papyrus}{#f/7}食客們可不想\n意面沾上眼淚！",
                        '<25>{#p/sans}{#f/3}* 哎呀。\n* 忘挑個好時間了。',
                        '<18>{#p/papyrus}{#f/4}這次其實算好的了...',
                        "<18>{#p/papyrus}{#f/0}...咱在ASGORE家廚房，\n要繼續忙去了。",
                        '<18>{#p/papyrus}{#f/9}你可以順道來看看，\n隨時歡迎！',
                        '<32>{#s/equip}{#p/event}* 滴...'
                    ],
            epilogue2: () => [
                '<25>{#p/sans}{#f/0}* 嘿，小子。',
                "<25>{#f/0}* 剛才我就納悶\n  你會啥時候來這。",
                '<25>{#f/3}* 前不久，有個孩子\n  突然從我旁邊衝了過去，\n  大概是去找你的。',
                '<25>{#f/2}* 難怪我們\n  打了11通電話你才接。',
                "<25>{#f/0}* ...對了。\n* 我想找個人。",
                "<25>{#f/0}* 你應該認識。\n* 她叫toriel。",
                "<25>{#f/3}* 我把能猜到的地方\n  找了個遍，就是沒找到。",
                '<25>{#f/0}* 所以誰也說不清\n  她去哪兒了...',
                '<25>{#f/3}* 如果你見到她了，\n  或者接到她的電話了...\n* 就讓她給我回個電話。',
                SAVE.data.b.skeleton_key
                    ? '<25>{#f/2}* ...說不定，\n  她跑到我的衣櫃裡面去了。'
                    : '<25>{#f/2}* 謝了。'
            ],
            epilogue3: [
                '<25>{#p/asgore}{#f/6}* 啊，Frisk！\n* 你醒了。',
                '<25>{#f/6}* 想來的話，\n  可以跟我們一起慶祝一下。',
                '<25>{#f/21}* 大夥見到你會很高興的。',
                '<25>{#f/5}* 想去前哨站\n  其他地方逛逛也行。',
                '<25>{#f/5}* 什麼時候準備啟程了，\n  就去王座那兒。',
                '<25>{#f/6}{#x1}* 我用遙控器\n  把停機坪通道打開了。'
            ],
            finaltext1: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<25>{#p/asriel1}{#f/17}* 走出這扇門，就是停機坪。',
                            choicer.create('* （離開這裡嗎？）', "我想\n再等等", "\n現在離開")
                        ]
                        : [
                            ...(SAVE.data.b.oops
                                ? [
                                    '<32>{#p/basic}* 走出這扇門，\n  你的旅程將會迎來\n  真正的終結。',
                                    '<32>{#p/basic}* 你的朋友們\n  將會跟隨你的腳步，\n  前往新家園。'
                                ]
                                : ['<32>{#p/basic}* Frisk...', "<32>* 我們還有事沒做呢，\n  你忘了嗎？"]),
                            choicer.create('* （離開這裡嗎？）', "我想\n再等等", "\n現在離開")
                        ],
                [choicer.create('* （離開這裡嗎？）', "我想\n再等等", "\n現在離開")]
            ),
            finaltext2: ['<32>{#p/basic}* Frisk？', choicer.create('* （離開這裡嗎？）', "我想\n再等等", "\n現在離開")],
            finaltext3: ['<32>{#p/basic}* ...', choicer.create('* （離開這裡嗎？）', "我想\n再等等", "\n現在離開")],
            hangar1: () =>
                SAVE.data.b.svr
                    ? [
                        "<25>{#p/asriel1}{#f/23}* 真美...",
                        '<25>{#f/22}* ...',
                        "<25>{#f/13}* 從出生起，\n  這片星空我早已見過\n  無數次。",
                        "<26>{#f/17}* 但沒有力場禁錮的星空...\n  乍一看，還是挺不一樣的。",
                        "<25>{#f/17}* 也許只是錯覺，\n  但我總覺得...",
                        '<25>{#f/23}* ...這片星空更加明亮。'
                    ]
                    : [
                        '<25>{#p/asgore}{#f/6}* 宇宙...\n* 萬物的歸宿。',
                        '<25>{#f/1}* 在這裡，有數以億計的世界...',
                        '<25>{#f/2}* 有的... 生機勃勃；\n  有的... 一片死寂。',
                        '<26>{#f/5}* 你可以把宇宙\n  比作一本未讀的書。',
                        '<26>{#f/6}* 翻開之前，永遠也不知道\n  下一頁有什麼驚喜\n  等著你。'
                    ],
            hangar2: () =>
                SAVE.data.b.svr
                    ? [
                        '<25>{#p/asriel1}{#f/17}* 哈哈...',
                        '<25>{#f/17}* 咱們出發吧。',
                        '<25>{#f/15}* ...',
                        '<25>{#f/15}* 媽媽和爸爸肯定很想我...',
                        "<25>{#f/17}* 等上了運輸船，\n  我就找他們。",
                        '<25>{#f/13}* 而你，frisk...',
                        '<25>{#f/20}* 經歷這麼多，你肯定累壞了。\n* 好好休息一下吧。',
                        
                        '<25>{#f/13}* ...',
                        '<25>{#f/13}* 說不定...',
                        "<25>{#f/17}* 等你醒來後，就到家了。\n* 那裡，有愛你的親人，\n  有幸福的生活..."
                    ]
                    : ['<25>{|}{#p/asgore}{#f/5}* 等等？\n* 有人在- {%}'],
            hangar3: () =>
                SAVE.data.b.svr
                    ? ['<26>{#p/asriel1}{#f/17}* 準備好了嗎？']
                    : [
                        '<25>{#p/toriel}* 喔，我的孩子！\n  原來你在這啊！',
                        '<25>{#f/5}* ...',
                        '<25>{#f/5}* ...你好，Asgore。'
                    ],
            hangar4: ['<25>{#p/asgore}{#f/1}* 哈囉。'],
            hangar5: ['<25>{#p/toriel}{#f/5}* ...', '<25>{#p/asgore}{#f/5}* ...'],
            hangar6: () =>
                SAVE.data.b.c_state_secret5_used
                    ? [
                        '<25>{#p/asgore}{#f/6}* Toriel，我...',
                        '<25>{#p/asgore}{#f/1}* 我知道... 有件事，\n  在你心中一直揮之不去。',
                        '<25>{#p/asgore}{#f/2}* 就是... 咱們倆\n  意見不合，徹底鬧掰那次。',
                        '<25>{#p/toriel}{#f/5}* ...這事你還知道？'
                    ]
                    : ['<25>{#p/asgore}{#f/5}* 哎呀，好尷尬。'],
            hangar7: () =>
                SAVE.data.b.c_state_secret5_used
                    ? [
                        '<25>{#p/asgore}{#f/1}* 你覺得自己做了錯事，\n  有愧於我。',
                        '<25>{#p/asgore}{#f/1}* 你覺得自己做了傻事，\n  後果無法挽回。',
                        '<25>{#p/asgore}{#f/2}* ...所以，你覺得自己是個罪人，\n  不值得原諒。',
                        '<25>{#p/toriel}{#f/13}* ...\n* ...沒錯。',
                        '<25>{#p/asgore}{#f/6}* 但我覺得，不是這樣的。',
                        '<25>{#p/asgore}{#f/6}* 你就算犯了錯，\n  我也會原諒你。',
                        '<25>{#p/asgore}{#f/6}* 你就算做了傻事，\n  我也願意接納你。',
                        '<25>{#p/asgore}{#f/5}* 雖然感情淡了...',
                        '<25>{#p/asgore}{#f/6}* 但我們還能在一起！'
                    ]
                    : SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/toriel}{#f/5}* Asgore...',
                            '<25>{#p/toriel}{#f/5}* 有些話，我也想跟你說。\n  雖然你可能已經不在乎了...',
                            '<25>{#p/toriel}{#f/9}* 之前，我放任自己，\n  隨意揣測你的所作所為。\n* 這事，我得道個歉。',
                            '<25>{#p/toriel}{#f/13}* 我把你說成是一個惡魔。',
                            '<25>{#p/toriel}{#f/13}* 一個窩囊廢。',
                            '<25>{#p/toriel}{#f/9}* 一個只會殺小孩的敗類。',
                            '<25>{#p/toriel}{#f/10}* ...但你不是這樣。',
                            
                            '<25>{#p/toriel}{#f/3}* 平心而論...\n  雖然檔案裡出了點事，\n  但那並不怪你。',
                            '<25>{#p/toriel}{#f/0}* 而盡力保護那些孩子，\n  足以證明，你很勇敢。'
                        ]
                        : ['<25>{#p/toriel}{#f/1}* 行了，別說了。'],
            hangar8: () =>
                SAVE.data.b.c_state_secret5_used
                    ? SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/toriel}{#f/1}* ...Asgore，我...',
                            '<25>{#p/toriel}{#f/5}* 這樣做... 好像不太合適。',
                            '<25>{#p/toriel}{#f/1}* 而且，我想組建家庭的熱情，\n  很早以前就沒了。',
                            '<25>{#p/toriel}{#f/0}* 不不不，這可不是\n  我的一廂情願，\n  我沒那麼自私。',
                            '<25>{#p/asgore}{#f/6}* 行，行...\n* 但你看...',
                            '<25>{#p/asgore}{#f/6}* 希望我們倆複合的，\n  是Frisk啊。',
                            '<25>{#p/toriel}{#f/7}* ...Frisk？！',
                            '<25>{#p/toriel}{#f/1}* 呃... 那個，我...',
                            '<25>{#p/toriel}{#f/5}* 這事... 讓我想想吧...',
                            '<32>{#p/human}* （你微笑著點了點頭。）',
                            '<25>{#p/asgore}{#f/21}* 你看，Frisk也想留住你呢。',
                            '<25>{#p/toriel}{#f/23}* ...',
                            '<25>{#p/toriel}{#f/1}* 我到時候好好想想吧。'
                        ]
                        : [
                            '<25>{#p/toriel}{#f/1}* ...Asgore，我...',
                            '<25>{#p/toriel}{#f/5}* 這麼做根本不合適。',
                            '<25>{#p/toriel}{#f/10}* 對不起，我也想有個家，\n  可現在這樣，我不會答應的。',
                            
                            '<25>{#p/asgore}{#f/1}* ...',
                            '<25>{#p/asgore}{#f/2}* 我理解的。'
                        ]
                    : SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/asgore}{#f/20}* ...',
                            '<25>{#p/asgore}{#f/4}* ...謝謝你。',
                            '<25>{#p/asgore}{#f/6}* 能聽你親口說出這些話，\n  我很滿足。',
                            '<25>{#p/toriel}{#f/9}* 要是不說出來，\n  我也覺得欠點什麼。'
                        ]
                        : ['<25>{#p/asgore}{#f/5}* 唔...'],
            hangar9: [
                '<18>{#p/papyrus}各位好哇！',
                '<25>{#p/toriel}{#f/1}* ...喔，你好呀！',
                "<18>{#p/papyrus}{#f/0}沒想到又在這見到您！\n太棒了！",
                '<18>{#p/papyrus}{#f/9}聚會結束了，\n我剛把屋子打掃完！',
                '<25>{#p/toriel}{#f/1}* ...好的，知道了。',
                '<25>{#p/toriel}{#f/0}* 那麼，你想跟我們一起...\n  看星星嗎？'
            ],
            hangar10: [
                '<18>{#p/papyrus}{#f/5}哇喔...',
                '<25>{#p/asgore}{#f/21}* 是不是很漂亮？',
                "<25>{#p/asgore}{#f/5}* 以前，因為力場引力的影響，\n  宇宙的光芒大多被扭曲，\n  無法到達這裡。",
                '<25>{#p/asgore}{#f/6}* 現在這番景象...\n  才是這片星空本來的模樣。',
                '<18>{#p/papyrus}{#f/0}真的好美！',
                '<18>{#p/papyrus}{#f/6}...不過我還是沒看出來\n和以前有啥區別。',
                '<25>{#p/asgore}{#f/5}* 要是真看不出來，\n  可能是你太累了。',
                '<18>{#p/papyrus}{#f/5}今天一天淨忙活了...',
                '<25>{#p/toriel}{#f/1}* 那就躺下休息一下吧。',
                '<18>{#p/papyrus}{#f/7}啥？！\n我能休息了？！',
                '<18>{#p/papyrus}{#f/7}我現在就要\n好好睡一覺！！',
                "<18>{#p/papyrus}{#f/4}還是算了，不休息了。",
                "<18>{#p/papyrus}{#f/7}PAPYRUS根本就\n不需要休息！！",
                '<18>{#p/papyrus}{#f/5}...',
                '<18>{#p/papyrus}{#f/5}不過呢，我有個兄弟...'
            ],
            hangar11: ["<25>{#p/sans}{#f/2}* 怎麼啦？"],
            hangar12: ['<25>{#p/toriel}{#f/0}* 喔！\n* 怎麼{@fill=#ff0}啦{@fill=#fff}麼晚才來呢，\n  Sans？', '<25>{#p/asgore}{#f/5}* ...哈囉？'],
            hangar13: [
                '<18>{#p/papyrus}{#f/4}「怎麼辣」...\n我的兄弟啊，\n你咋明知故問呢？',
                "<18>{#p/papyrus}{#f/0}你咋不問「怎麼酸」\n「怎麼甜」\n「怎麼苦」呢？",
                "<18>{#p/papyrus}{#f/9}正好湊齊酸甜苦辣！",
                '<25>{#p/sans}{#f/0}* 嗯... {@fill=#ff0}酸{@fill=#fff}你厲害。',
                "<25>{#p/sans}{#f/2}* 你果然是個{@fill=#ff0}甜{@fill=#fff}才。",
                '<18>{#p/papyrus}{#f/5}...',
                '<18>{#p/papyrus}{#f/5}嗯，{@fill=#ff0}辣{@fill=#fff}還用說。',
                '<25>{#p/sans}{#f/4}* 嘿嘿嘿。\n* 我都快激動{@fill=#ff0}苦{@fill=#fff}了。',
                '<18>{#p/papyrus}{#f/0}我也是啊。'
            ],
            hangar14: [
                '<25>{#p/sans}* 喔對了，大夥全都特別\n  「喜歡」你做的意面呢。',
                "<25>{#p/sans}{#f/2}* 我過來的時候，\n  一群怪物圍著我，\n  求我幫忙「把意面解決掉」...",
                "<25>{#p/sans}{#f/2}* ...不然我還能早點到。",
                '<18>{#p/papyrus}{#f/0}那... 你喜歡吃嗎？',
                '<25>{#p/sans}{#f/3}* 嘿，當然喜歡呀。',
                "<25>{#p/sans}{#f/0}* 看來，這幾天\n  你的廚藝進步飛快啊。",
                '<18>{#p/papyrus}{#f/9}捏嘿嘿！\n那必須滴！',
                "<18>{#p/papyrus}{#f/0}自打FRISK來這裡...\n我就感覺\n越來越有動力！",
                
                '<25>{#p/sans}{#f/0}* 有了frisk，\n  大家都更樂觀了，\n  你說是不？',
                '<18>{#p/papyrus}{#f/0}是啊！\n而且，FRISK來之後，\n我也有了小目標！',
                '<18>{#p/papyrus}{#f/4}一開始，我的目標是：\n戰勝FRISK...',
                '<18>{#p/papyrus}{#f/5}...後來，我有了新的目標：\n我要成為FRISK\n真正的好朋友。',
                "<18>{#p/papyrus}{#f/6}不過...",
                "<18>{#p/papyrus}{#f/6}現在突然自由了，\n反倒不知道幹點啥好了。",
                '<18>{#p/papyrus}{#f/4}不過我轉念一想...',
                "<18>{#p/papyrus}{#f/9}既然自由了，\n那麼我就有無窮的時間\n慢慢思考！",
                "<18>{#p/papyrus}{#f/0}所以...\n第一步，做點啥好呢..."
            ],
            hangar15: ['<25>{#p/undyne}{#f/8}* 呋呼呼！\n* 我有一計！'],
            hangar16: [
                "<25>{#p/alphys}{#g/alphysSmarmyAggressive}* 嗯，來幫我們拍喵喵同人吧。"
            ],
            hangar17: ['<25>{#p/toriel}{#f/6}* 噗-\n* 哈哈哈！'],
            hangar18: ["<25>{#p/undyne}{#f/12}* 其實真不用做到這種地步。\n* 不過... 我沒意見。"],
            hangar19: () => [
                "<25>{#p/alphys}{#g/alphysYupEverythingsFine}* 首先，喵喵要駕駛飛船，\n  所以咱得先找到一架飛船\n  給喵喵開...",
                "<25>{#p/undyne}{#f/17}* Alphys！！\n  咱們還沒出前哨站呢！",
                ...(SAVE.data.b.a_state_hapstablook
                    ? [
                        "<25>{#p/undyne}{#f/16}* 而且，喵喵現在... \n  不太方便拍節目。",
                        "<25>{#p/alphys}{#g/alphysWelp}* 哎呀，我怎麼忘了\n  現在已經有真人版喵喵了！",
                        '<18>{#p/papyrus}{#f/0}是啊。\n前不久，我剛在宴會上\n見到她！',
                        '<18>{#p/papyrus}{#f/0}看起來，她真的很開心。',
                        "<25>{#p/alphys}{#g/alphysInquisitive}* 她以前不就是一個\n  成天發脾氣的人偶嗎？",
                        "<25>{#p/undyne}{#f/7}* 以前是以前，現在是現在！\n* 現在她長得漂亮就行唄，\n  真是的！",
                        '<25>{#p/alphys}{#g/alphysUhButHeresTheDeal}* 行行行，你說得都對！！'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/16}* 而且，「喵喵」...",
                        "<25>{#p/undyne}{#f/17}* 嘿，你不得先找個幽靈，\n  讓它當上喵喵嗎？",
                        '<25>{#p/alphys}{#g/alphysWelp}* 喔對，這事咋忘了。',
                        '<18>{#p/papyrus}{#f/5}我記得，在宴會上\n有隻幽靈問過我這事...',
                        '<18>{#p/papyrus}{#f/6}不過，那傢伙有點害羞。',
                        '<25>{#p/alphys}{#g/alphysCutscene2}* 喔，我應該知道是誰了。\n* 我會儘快完成...',
                        '<25>{#p/undyne}{#f/7}* 越快越好，最好在飛船上\n  就搞定！',
                        '<25>{#p/alphys}{#g/alphysUhButHeresTheDeal}* 行行行，別催了！！'
                    ])
            ],
            hangar20: [
                '<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* 總-總之...',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUpCenter}* Asgore，見到你真高興。\n* 還有你，Sans。",
                '<18>{#p/papyrus}{#f/6}我呢？？',
                '<25>{#p/alphys}{#g/alphysSmileSweat}* ...你也是。',
                '<25>{#p/toriel}{#f/0}* 是不是還忘了這個人呢？',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 啊！\n* ...對-對不起！',
                '<25>{#p/toriel}{#f/6}* 嘻嘻嘻。\n* 開玩笑而已，別在意。',
                '<25>{#p/toriel}{#f/1}* 其實，你那些事跡\n  我早就聽過了...',
                '<25>{#p/toriel}{#f/0}* 年輕有為，當上皇家科學員。\n  果然不容小覷。',
                "<25>{#p/undyne}{#f/8}* 那還用說！！\n* 她最棒了！",
                '<25>{#p/alphys}{#g/alphysCutscene2}* ...過獎了。'
            ],
            hangar21: [
                '<25>{#p/asgore}{#f/6}* 各位朋友，此時此刻，\n  請與我一起深呼吸...',
                '<25>{#p/asgore}{#f/21}* 一同回憶這一路走來，\n  經歷的種種往事吧。'
            ],
            hangar22: [
                "<25>{#p/sans}{#f/3}* 想來也挺有意思...",
                "<25>{#p/sans}{#f/0}* 這片星空\n  一直都在我們的頭頂之上。",
                '<25>{#p/sans}{#f/0}* 但以前，只能仰望星空，\n  卻無法觸及星辰...',
                '<25>{#p/sans}{#f/3}* 但現在...',
                "<25>{#p/sans}{#f/0}* ...這樣的變化，\n  談不上多「有意思」，\n  但是...",
                "<25>{#p/sans}{#f/3}* 很有意義。",
                '<18>{#p/papyrus}{#f/5}是啊。',
                '<18>{#p/papyrus}{#f/5}意義... 非凡。'
            ],
            hangar23: ['<32>{#p/napstablook}* 嘿，大家好...'],
            hangar24: [
                "<32>{#p/napstablook}* 希望我來這裡\n  不會煩到你們...",
                '<25>{#p/undyne}{#f/14}* 噗- 煩到我們？\n* 怎麼可能呢！',
                "<25>{#p/sans}{#f/0}* 我們看到你來，\n  {@fill=#ff0}反倒{@fill=#fff}很高興呢。",
                '<18>{#p/papyrus}{#f/6}SANS！鼓勵他可以，\n幹嘛讓他{@fill=#ff0}翻倒{@fill=#fff}呢？',
                "<18>{#p/papyrus}{#f/4}他剛吃完{@fill=#ff0}飯，倒{@fill=#fff}立\n會出事的...",
                '<32>{#p/napstablook}* 嘿嘿嘿...'
            ],
            hangar25: [
                '<25>{#p/alphys}{#g/alphysCutscene1}* 對了，Blooky！\n* 喵喵系列新電影\n  你看了沒？',
                "<32>{#p/napstablook}* 最近... 出新電影了？",
                '<25>{|}{#p/alphys}{#g/alphysHellYeah}* 是啊！！\n* 在電影中喵喵非常後悔自己\n  之前在星火篇中的所作所為 {%}',
                '<99>{|}{#p/alphys}{#g/alphysHellYeah}  所以呢她決定使用一種手段\n  就是時間回溯的魔法來彌補\n  自己之前犯下的過錯可是她 {%}',
                '<25>{|}{#p/undyne}{#f/12}* 呃... {%}',
                '<25>{|}{#p/alphys}{#g/alphysTheFactIs}* 發現如果想穿越時間就必須\n  使用一種裝置但是這種裝置\n  是她在星火篇末尾殺了很多 {%}',
                '<99>{|}{#p/alphys}{#g/alphysTheFactIs}  很多無辜的人最終才獲得的\n  因此她不得不面對良心拷問\n  還有各種各樣的掙扎與抉擇 {%}',
                '<25>{|}{#p/undyne}{#f/17}* Alphys- {%}',
                "<25>{|}{#p/alphys}{#g/alphysInquisitive}* 她左右為難因為如果使用了\n  那個裝置就能抹去所有曾經\n  親手造成的傷痛但裝置本身 {%}",
                '<99>{|}{#p/alphys}{#g/alphysInquisitive}  卻是無數殺戮和痛苦換來的\n  所以主角喵喵開始懷疑自己\n  懷疑自己到底算不算個好人- {%}',
                '<25>{#p/undyne}{#f/8}* 別劇透了！！！',
                '<25>{#p/alphys}{#g/alphysSmileSweat}* ...',
                '<25>{#p/alphys}{#g/alphysNervousLaugh}* ...對不起。'
            ],
            hangar26: [
                "<32>{#p/napstablook}* 沒事沒事...\n  你剛剛說得太快，\n  我一句都沒聽懂...",
                '<25>{#p/alphys}{#g/alphysWelp}* ...',
                '<25>{#p/alphys}{#g/alphysWelp}* 我說話快嗎...\n  你們咋都這麼說呢...',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* ...算了，不是啥大事。",
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUpCenter}* 跟「重獲自由」一比，\n  安利科幻番失敗\n  根本不算個事。"
            ],
            hangar27: ['<32>{#p/mettaton}* 喔？\n* 我剛剛是不是聽到\n  有人想「安利科幻番」？'],
            hangar28: ['<25>{#p/alphys}{#g/alphysGarboCenter}* ...又來磨嘰了。'],
            hangar29: [
                "<32>{#p/mettaton}* 博士，別那麼煩躁嘛。",
                "<32>{#p/mettaton}* 你不是總有些「鬼點子」嘛，\n  我都能幫你實現！",
                "<25>{#p/undyne}{#f/12}* 嘴上說「幫她實現夢想」，\n  可你連她最棒的鬼點子是啥，\n  都不知道吧？",
                '<26>{#p/toriel}{#f/1}* 呃，這些話題\n  你們能不能以後再聊...',
                '<25>{#p/undyne}{#f/17}* 我他媽謝謝你。',
                '<25>{#p/toriel}{#f/3}* ...',
                '<25>{#p/toriel}{#f/4}* 頭一次聽到這樣的...\n  言論。\n* 給我整懵了。',
                '<32>{#p/mettaton}* 哎呀，看來你倆的關係\n  出了點問題了呢。',
                "<32>{#p/mettaton}* 沒關係，\n  讓MTT牌《友愛寶典》幫你吧！\n* 步驟我記得清清楚楚。",
                '<33>{|}{#p/mettaton}* 第一步，按[C]或[CTRL]打開- {%}',
                '<25>{#p/toriel}{#f/0}* 不用了，謝謝。',
                '<32>{#p/mettaton}* ...試一試嘛，也不虧。'
            ],
            hangar30: [
                '<32>{#p/mettaton}* 我在想...',
                "<32>{#p/mettaton}* 等到了新家園，\n  就有大把時間推銷\n  我的《友愛寶典》了。",
                "<32>{#p/mettaton}* 抵達新家園之前。能高興的，\n  也就只有「自由」本身了。\n* 唉。",
                "<18>{#p/papyrus}{#f/0}別傷心，METTATON！\n有我陪著你！",
                '<18>{#p/papyrus}{#f/5}你看，值得高興的事\n可不止有自由喔。',
                '<18>{#p/papyrus}{#f/9}這位{@fill=#ff0}機器{@fill=#fff}人的想法\n{@fill=#ff0}激起{@fill=#fff}我的鬥志。',
'<18>{#p/papyrus}{#f/9}讓我有信心成為\n{@fill=#ff0}極其{@fill=#fff}優秀的\n領導{@fill=#ff0}骨{@fill=#fff}幹！',
                '<32>{#p/mettaton}* 哈哈哈...\n* 還是你懂我，PAPYRUS。',
                '<32>{#p/mettaton}* 你的每一條建議，\n  我都會很在乎。',
'<32>{#p/mettaton}* ...而不是像某些傢伙一樣\n  把你當成長不大的小孩。',
                '<25>{#p/undyne}{#f/14}* 喂！瞅我幹啥？',
                '<25>{#p/undyne}{#f/17}* 我把他咋的了？'
            ],
            hangar31: [
                '<25>{#p/asgore}{#f/6}* 不想打斷你們，但... \n  我現在得送Frisk上船了。',
                '',
'',
                '<25>{#p/asgore}{#f/5}* 那孩子跟咱們一起\n  忙活一整天，\n  肯定都累壞了。'
            ],
            hangar32: [
                "<18>{#p/papyrus}{#f/6}喔喔...",
                '<18>{#p/papyrus}{#f/9}連FRISK都上船了...\n...那我也不能等了！'
            ],
            hangar33: ["<25>{#p/sans}{#f/2}* 嘿嘿，我就在你後面喔，\n  兄弟。"],
            hangar34: ['<25>{#p/undyne}{#f/7}* 來啦！！\n* 算我一個！！'],
            hangar35: ["<25>{#p/alphys}{#g/alphysHellYeah}* 別丟下我！"],
            hangar36: [
                "<32>{#p/mettaton}* 大夥都上去了，\n  我要還擱這發呆，\n  就有點尷尬了。",
                "<32>{#p/mettaton}* 所以... 我也走了。"
            ],
            hangar37: ["<25>{#p/napstablook}* 別擔心...\n  我不會掉隊的..."],
            hangar38: [
                "<25>{#p/kidd}{#f/1}* 嘿，大夥都去哪了？！",
                '<25>{#p/kidd}{#f/7}* 我... 我正找Frisk呢！',
                '<25>{#p/toriel}{#f/0}* 沿走廊往回走，\n  找到47號登機口。', 
                '<25>{#f/0}* 從左手邊第一扇門上去，\n  就能找到了。', 
                "<25>{#p/kidd}{#f/3}* 我好像在哪見過您！\n  總之謝了！",
                "<25>{#p/kidd}{#f/1}* 您真的太好了！"
            ],
            hangar39: ['<25>{#p/toriel}{#f/10}* 孩子...'],
            hangar40: ['<25>{#p/toriel}{#f/1}* ...多保重，好嗎？'],
            returnofchara1: ['<32>{#p/basic}* Frisk...', '<32>* ...還在嗎？'],
            returnofchara2: [
                '<32>{#p/basic}* 對不起，之前一直陪著你，\n  剛剛我卻「失蹤」了。',
                '<32>* 剛剛釋放靈魂\n  耗費的能量太多，\n  把我弄透支了。',
                "<32>* ...別擔心，現在已經恢復好啦！",
                "<32>* 現在回頭一想...\n  感覺我能活下來\n  也挺合理的。",
                '<32>* 很多年前，Asriel吸收了我的靈魂。\n  使我變成了幽靈形態...',
                '<32>* 我成了他「精神」的一部分，\n  化為天使，指引著他。',
                '<32>* ...或者說，化為惡魔，慫恿著他。\n* 我到底是「天使」還是「惡魔」，\n  看你想法了。',
                '<32>* 後來，Asriel死了。',
'<32>* 但我卻並沒有因此消失，\n  而是繼續存在，\n  成了貨真價實的幽靈。',
                "<32>* 情況應該就是這樣..."
            ],
            returnofchara3: [
                '<32>{#p/basic}* 你知道嗎...',
                '<32>* 那時，我一心想尋死...',
                '<32>* 想跟這個世界徹底了斷...',
                '<32>* ...',
                '<33>* Asriel死亡時，\n  我們的靈魂相互分離。',
                '<32>* 我知道即使是王級怪物，\n  只要肉體死了，\n  靈魂也不會存續太久。',
'<32>* 所以，我就沒太在意。',
                "<32>* 現在回頭一想，\n  當時選擇乾等著，\n  其實根本沒什麼用...",
                '<32>* 雖然在正常情況下...',
                "<32>* 「王級怪物」的肉體一旦死亡，\n  靈魂中那些品質和性格\n  也會馬上消失。",
                "<32>* 但Asriel的情況不同。\n* 他跟我的靈魂融合在一起，\n  那根本就不屬於「正常情況」。",
                "<32>* 之前，我雖然知道自己體內\n  有個靈魂，但我以為\n  那靈魂早就「變質」了。",
                "<32>* 如果能早點想清楚，我...",
                '<32>* ...',
                '<32>* 其實，經歷了這麼多，\n  我再也不想尋死了。',
                
                "<32>* 相反，我現在覺得\n  能活著，才是最幸福的事。",
                '<32>* 我能陪著他，\n  看著他一點點長大...',
'<32>* 看著他\n  從我的陰影中走出來，\n  過著自己的生活...',
                '<32>* 這些對我來說，意義非凡。'
            ],
            returnofchara4: [
                '<32>{#p/basic}* 嘿，Frisk。\n* 有件事想拜託一下...',
                '<32>* ...拜託你別摟著那玩意啦！\n  太陽都曬屁股了！',
                "<32>* 那玩意就是個枕頭，\n  幹嘛又摟又抱的？",
                '<32>* ...',
                "<32>* 你歷經千辛萬苦，長途跋涉，\n  終於抵達新世界。\n* 來到這的第一件事，卻是睡大覺！",
                '<32>* 不愧是你啊！哼！',
                '<32>* ...開玩笑而已啦。',
                "<32>* 累了就多睡會吧，Frisk。",
                '<32>* 等你醒了，咱倆再聊。'
            ]
        },
        overworld: {
            get20: ['<32>{*}{#s/equip}{#p/human}* （你把停機坪門禁卡\n  掛到了鑰匙串上。）{^90}{%}'],
            drop: [
                '<26>{#p/asgore}{#f/8}* ...！\n* 你剛剛是不是把茶倒掉了？\n* 就是專門給你沏的啊...',
                '<25>{#p/asgore}{#f/1}* 唔...\n* 抱歉，沒能讓你喜歡它。'
            ],
            use: ['<25>{#p/asgore}{#f/21}* 啊...\n* 這可是上等好茶，\n  喜歡不？'],
            drop_tori: ['<26>{#p/asgore}{#f/5}* 好熟悉的香味...\n* 你剛才扔了什麼？'],
            use_tori: ['<26>{#p/asgore}{#f/5}* 好熟悉的香味...\n* 你在吃什麼？'],
            approachescape: ['<32>{#p/human}* （腳步聲逐漸遠去。）'],
            partyguard1: pager.create(
                0,
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x1}* 哈？\n* 要走了嗎？{#x3}',
                            "<32>{#x2}* 沒事的，老兄。\n* 如果人類想走，\n  就自己走吧。{#x3}",
                            "<32>{#x1}* 對... 你說的很對。{#x3}"
                        ]
                        : ['<32>{#p/basic}{#x1}* 嘿，你回來了！\n  太好了！{#x3}', '<32>{#x2}* 我們想死你了。{#x3}'],
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x1}* 對不起，我，要是，看到人們\n  提前離開派對，\n  我就會感到超級焦慮。{#x3}',
                            '<32>{#x2}* 對，他對此很焦慮。\n* 沒有針對某人的意思。{#x3}'
                        ]
                        : [
                            "<32>{#p/basic}{#x1}* 別有壓力。\n* 我們是想你了，\n  但你不是非得留在這。{#x3}",
                            '<32>{#x2}* 那個，對的，老兄。\n* 對的對的。{#x3}'
                        ]
            ),
            partyguard2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x2}* 這派對太棒了，老兄。{#x3}',
                            '<32>{#x2}* 他們甚至還拿出來了\n  情歌植物，就在那張桌子上！{#x3}'
                        ]
                        : [
                            "<32>{#p/basic}{#x2}* 你不試試情歌什麼的嗎，\n  那對我來說很重要。{#x3}",
                            '<32>{#x1}* ...你說的是「我們」， \n  對吧老兄。{#x3}',
                            '<32>{#x2}* 哈哈，我的錯。{#x3}'
                        ],
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? ["<32>{#p/basic}{#x2}* 那是一種怪物佳餚。{#x3}"]
                        : ['<32>{#p/basic}{#x2}* 對我們很重要。{#x3}']
            ),
            janet: pager.create(
                0,
                [
                    "<32>{#p/basic}* 你要是知道我剛到時\n  這裡有多麼難以下腳，\n  你一定會大吃一驚的！",
                    "<32>* 在看到每個人\n  都經過了這裡後...",
                    "<32>* 我就知道，\n  是時候該給這裡\n  做一場大掃除了。",
                    "<32>* 對了，謝謝你救了我們，寶貝兒。\n* 你幹的真棒。"
                ],
                ["<32>{#p/basic}* 你去看看\n  內個大傢伙擱那不停地抖，\n  到底在幹啥呢？"]
            ),
            giftbox1a: () => [
                ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 盒子裡裝著一把武器。"]),
                choicer.create('* （拿走裡面的東西嗎？）', '拿走', '算了')
            ],
            giftbox1b: () => [
                ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 盒子裡裝著一件防具。"]),
                choicer.create('* （拿走裡面的東西嗎？）', '拿走', '算了')
            ],
            giftbox2a: () => [
                '<32>{#p/human}* （你帶走了「大熊座」。）',
                choicer.create('* （裝備上大熊座嗎？）', '裝備', '算了')
            ],
            giftbox2b: () => [
                '<32>{#p/human}* （你帶走了心形掛墜。）',
                choicer.create('* （戴上心形掛墜嗎？）', '戴上', '算了')
            ],
            giftbox3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （但這沒什麼可拿的了。）']
                    : ["<32>{#p/basic}* 裡面什麼都沒有了。"],
            giftbox4: ['<32>{#p/human}* （你打算先不打開。）'],
            tea0: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （信封上有一行字：\n  大意是「清茶美味，敬請享受」。）']
                    : [
                        "<32>{#p/basic}* 茶杯上貼著一張紙條...",
                        '<32>{#p/basic}* 「我為你沏了杯茶。」\n* 「無論你是誰，我都衷心希望\n   你能喜歡它。」'
                    ],
            tea1: ['<32>{#p/human}* （你帶走了星花茶。）'],
            tea2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你將手滑過臺面。）']
                    : ['<32>{#p/basic}* 案板上面什麼都沒有。'],
            fireplace1: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （壁爐的溫暖讓你無法抗拒...）',
                        choicer.create('* （爬進去嗎？）', '爬進去', '算了')
                    ]
                    : [
                        SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                            ? '<32>{#p/basic}* 另一座壁爐。'
                            : "<32>{#p/basic}* Asgore的壁爐。\n* 裡面並不燙，而是暖暖的，\n  很舒服。",
                        ...(world.darker
                            ? []
                            : ['<32>* 看樣子，你可以爬進去。', choicer.create('* （爬進去嗎？）', '爬進去', '算了')])
                    ],
            fireplace2a: ['<32>{#p/human}* （你不打算爬進去。）'],
            fireplace2b: () => [
                '<32>{#p/human}* （你爬進壁爐，\n  它的溫暖緊緊將你包圍。）',
                '<32>{#p/human}* （你感到十分舒適。）',
                ...(SAVE.data.b.svr
                    ? asrielinter.fireplace2b++ < 1
                        ? ["<25>{#p/asriel1}{#f/13}* 我就，額，\n  在外面等你出來。"]
                        : []
                    : world.goatbro && SAVE.flag.n.ga_asrielFireplace++ < 1
                        ? ["<25>{#p/asriel2}{#f/15}* 我就，額 \n  在外面等你出來..."]
                        : [])
            ],
            fireplace2c: [
                '<32>{#p/basic}* 小矮個，在裡面小心點！',
                "<32>* 不然我就得收到\n  一些很糟很糟的新聞素材了！",
                '<32>* ...笑鼠了！'
            ],
            fridgetrap1: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 有天，\n  Asgore在冰箱內\n  裝了個巧克力複製器。',
                            '<25>{#f/15}* $(name)在那天\n  開心地蹦來蹦去...',
                            '<25>{#f/17}* ...畢竟有了複製機，\n  我們家就有吃不完的巧克力了。',
                            '<25>{#f/20}* 當然不是我要求的，\n  我可不咋愛吃。'
                        ],
                        ["<25>{#p/asriel1}{#f/13}* 為了這玩意，\n  我那搭檔苦苦哀求了\n  兩年之久。"]
                    ][Math.min(asrielinter.fridgetrap1++, 1)]
                    : world.darker
                        ? ["<32>{#p/basic}* 你肯定看不上冰箱裡的東西。"]
                        : [
                            "<32>{#p/basic}* 裡面有很多名牌巧克力，\n  還有一大堆蝸牛。\n* 比她家裡還多。"
                        ],
            fridgetrap2: () => [
                ...(SAVE.data.b.svr
                    ? []
                    : [
                        ['<32>{#p/basic}* ...', '<32>* 你想來一條嗎？'],
                        ['<32>{#p/basic}* ...', '<32>* 你想再來一條嗎？'],
                        ['<32>{#p/basic}* ...', '<32>* 你還想再來一條嗎？'],
                        ['<32>* 你要是想吃，就自己拿吧...'],
                        ['<32>* 一條接一條，一條接一條...'],
                        ['<33>* 巧克力在玩接力...'],
                        ['<32>* 剛拿一條，又來一條...'],
                        ['<32>* 這巧克力多得不像話了。'],
                        ['<32>* 這麼多巧克力，像話嗎？'],
                        ['<32>* 什麼時候能拿完呢...'],
                        ["<32>* 我去... 這也太多了吧..."],
                        ['<32>* ...']
                    ][Math.min(SAVE.data.n.chocolates, 11)]),
                choicer.create('* （拿一條巧克力嗎？）', '拿一條', '算了')
            ],
            fridgetrap3: ['<32>{#p/human}* （你決定什麼也不拿。）'],
            fridgetrap4: ['<32>{#p/human}* （你得到了巧克力。）'],
            brocall1: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<25>{#p/alphys}{#g/alphysInquisitive}* 嘿，你什麼時候過來啊？',
                "<25>{#p/alphys}{#g/alphysWelp}* Asgore等這一刻\n  已經等了一百年了...",
                "<25>{#p/alphys}{#g/alphysTheFactIs}* 我...\n  不想讓他再等下去了...",
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall2: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 喂？\n* 你怎麼還沒過來？',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* 我們還等著你呢...",
                '<25>{#p/alphys}{#g/alphysFR}* 你是臨時有事，\n  還是不想來，逃跑了？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall3: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 你可真行，還真跑了。\n* 我都看見了。',
                "<25>{#p/alphys}{#g/alphysWTF2}* 聽好，\n  我們可沒空跟你磨磨嘰嘰...",
                '<25>{#p/alphys}{#g/alphysWhyOhWhy}* ...我怎麼這麼倒霉啊...',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall4: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<32>{#p/mettaton}* 嘿。\n* ALPHYS剛給我打電話，跟我說\n  你不配合她的工作。',
                "<32>{#p/mettaton}* 隨後，我就跟PAPYRUS聊了聊...",
                '<32>{#p/mettaton}* 我覺得，你還是聽她的話，\n  繼續前進吧。',
                '<32>{#p/mettaton}* 加油，親！',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall5: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<18>{#p/papyrus}{#f/5}聽著。\n你會害怕，我能理解...',
                '<18>{#p/papyrus}{#f/5}力場確實看著\n挺唬人的。',
                '<18>{#p/papyrus}{#f/6}不過，別氣餒！',
                '<18>{#p/papyrus}{#f/4}如果要說你我的戰鬥\n證明了什麼...',
                "<18>{#p/papyrus}{#f/9}那就是，\n你敢於做任何事！",
                '<18>{#p/papyrus}{#f/0}那「牢不可破」的力場，\n在你面前毫無勝算！',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall6: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                "<25>{#p/alphys}{#g/alphysWelp}* 嘿...\n* 這一刻，我們等了很久了。",
                "<25>{#g/alphysThatSucks}* 不光是現在。",
                '<25>{#g/alphysSideSad}* 百餘年來，\n  怪物們都被困在這前哨站...',
                "<25>{#g/alphysThatSucks}* 故園的景象是什麼樣...\n  就連我的家人\n  都不記得了。",
                '<25>{#g/alphysSideSad}* 可能是因為\n  我和Asgore太著急了...',
                "<25>{#g/alphysIDK2}* 所以你才不想跟過來。",
                "<25>{#g/alphysIDK3}* 好吧，對不起。\n* 我們不應該推著你走。",
                "<25>{#g/alphysWorried}* 但著急的不只是我們啊。",
                "<25>{#g/alphysCutscene2}* 仔細想想吧...",
                '<25>{#g/alphysCutscene2}* * 你見過的每個人，\n  交的每個朋友...',
                "<25>{#g/alphysWorried}* 可能一輩子都在\n  等你解放他們。",
                '<25>{#g/alphysWorried}* ...',
                '<25>{#g/alphysCutscene2}* ...早點回來...\n* 好嗎？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall7: [
                '<32>{#s/phone}{#p/event}* 鈴鈴，鈴鈴...',
                '<25>{#p/toriel}{#f/5}* 喂？\n* 我是TORIEL。',
                '<25>* 過了這麼久，你肯定已經到\n  很遠的地方了。',
                '<25>{#f/9}* 所以我不知道你\n  能不能收到這段錄音。',
                '<25>{#f/13}* ...不過，要是你收到了，\n  我得說說心裡話...',
                '<25>{#f/9}* 我不能再固守\n  外域這一畝三分地了。',
                '<25>{#f/13}* 曾經，我不敢離開這裡。\n  因為我想拯救\n  經過這裡的孩子。',
                '<25>{#f/14}* 「能救一個是一個。」\n  每每有孩子墜落，\n  我都這樣想著。',
                '<26>{#f/13}* 可到最後，一個都沒救成。',
                '<25>{#f/9}* 我總想著...\n  自己壽命長著呢，\n  肯定有機會。',
                '<25>{#f/10}* 卻忘了像你這樣的孩子\n  好奇心有多強。',
                '<25>{#f/14}* 是不是很諷刺？',
                '<25>{#f/13}* ...',
                '<25>{#f/9}* 孩子... 我一會就到。',
                '<25>{#f/10}* ...\n* 要乖啊... 好嗎？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall8: [
                '<25>{#p/twinkly}{#f/6}* 你費這麼大勁到這裡，\n  就為了看隱藏對話嗎？',
                "<25>{#f/8}* 哇塞。\n* 您可真差勁呢，\n  比我都差勁呢。",
                '<25>{#f/12}* ...\n* 討人厭的小崽子，給我聽著：',
                "<25>{#f/11}* 你再這麼耗下去，\n  啥結果都沒有。",
                '<25>{#f/7}* 啥{^4} 都{^4} 沒{^4} 有。',
                '<25>{#f/0}{#v/1}* 就連我自己，\n  也就是個空殼而已，\n  除此之外，啥都沒有。',
                '<25>{#f/6}{#v/0}* 所以，趕緊回力場那去。\n* 你浪費的，\n  可是自己的時間。',
                '<25>{#f/11}* 你要是實在不想去...\n* 就認輸得了，\n  把前哨站都給我吧。',
                "<25>{#f/7}{#v/0}* 這樣是不是\n  更合你心意呢？",
                '<25>{#f/6}{#v/0}* ...',
                '<25>{#f/8}* 力場見，蠢貨。'
            ],
            statusterminal1: [
                '<32>{#p/human}* （你激活了終端。）',
                '<32>{#p/event}* 能量轉移尚未完成。\n* 請先去子世界，\n  之後再返回這裡。'
            ],
            statusterminal2: () => [
                '<32>{#p/human}* （你激活了終端。）',
                '<32>{#p/event}* 能量轉移已完成。\n* 靈魂間通訊已建立。',
                '<33>{#p/event}* 是否離開「六號檔案」？',
                choicer.create('* （離開「六號檔案」？）', '離開', '再等等')
            ],
            cw_vender1: [
                '<32>{#p/human}* （你在操作面板上點了兩下。）',
                '<32>{#s/equip}{#p/human}* （你得到了怪物糖果。）'
            ],
            cw_vender2: ['<32>{#p/human}* （你在操作面板上點了兩下。）', '<32>{#p/human}* （...）'],
            cs_vender1: ['<32>{#p/human}* （你在操作面板上點了兩下。）', '<32>{#s/equip}{#p/human}* （你得到了洋梅。）'],
            cs_vender2: ['<32>{#p/human}* （你在操作面板上點了兩下。）', '<32>{#p/human}* （...）'],
            cs_tower: '* （用[↑]、[↓]、[←]或[→]\n  調整音調高低。）',
            cs_tower_done: ['<32>{#p/human}* （你看了看已解鎖的終端。）'],
            cf1_dimbox1: ['<32>{#p/human}* （你得到了太空豆腐。）'],
            cf1_dimbox2: ['<32>{#p/human}* （...）'],
            cf2_vender1: ['<32>{#p/human}* （你在操作面板上點了兩下。）', '<32>{#s/equip}{#p/human}* （你得到了口糧。）'],
            cf2_vender2: ['<32>{#p/human}* （你在操作面板上點了兩下。）', '<32>{#p/human}* （...）'],
            cf2_key1: ['<32>{#s/equip}{#p/human}* （你把氖光鑰匙掛到了鑰匙串上。）'],
            cf2_key2: ['<32>{#p/human}* （...）'],
            cf2_bench0: ['<32>{#p/human}* （長凳下面有個治療包。）'],
            cf2_bench1: ['<32>{#p/human}* （你得到了治療包。）'],
            cf2_bench2: ['<32>{#p/human}* （...）'],
            cf2_bench3: ["<32>{#p/human}* （你伸手去夠，但夠不到...）"],
            cf2_blookdoor: ['<32>{#p/human}* （鎖住了。）'],
            ca_floartex: () =>
                [
                    ['<32>{#p/human}{#v/5}{@fill=#00c000}* ...欸？', "<32>{#p/human}{#v/5}{@fill=#00c000}* 誰在那？"],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 啊！？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 你咋做到的！？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...怎麼醒了？'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我睡了好久，\n  啥都不記得了...",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...喔！',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 老朋友，是你嗎！？\n* 是你在那嗎！？'
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 應該不是你。',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 喔，依稀記得\n  上次醒來時，\n  爆發了一場災難...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 災難後的末日之景，\n  就是如此嗎？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 真是糟透了...'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我想想...\n* 當時，好像是系統的記憶體溢出了...\n  導致我陷入沉睡。",
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 現在我醒了...\n  說明有人在釋放記憶體空間！",
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* ...是這樣吧？"
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我懂了。',
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 咱馬上就能出去了！",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 老朋友，你看到了嗎！\n* 你沒有失敗，沒有死，\n  你成功了！'
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 不過...',
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我連身體都沒了，\n  照理沒法移動...",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 那就奇怪了...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我這幅視野是哪來的？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 還有，\n  我怎麼離地面這麼遠了...'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 那團光暈...\n  越來越耀眼了！",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...惡夢終於要結束了嗎？\n  自由要來了嗎？'
                    ],
                    ['<32>{#p/human}{#v/5}{@fill=#00c000}* 有人嗎？'],
                    []
                ][ca_state.floor],
            toomuch1: ["<32>{#p/human}* （你帶的東西太多了。）"],
            toomuch2: ["<32>{#p/human}* （你帶的東西太多，裝不下它了。）"],
            toomuch3: ["<32>{#p/human}* （你帶的東西太多，無法使用它。）"],
            bastionTerm: () =>
                SAVE.data.n.plot < 71.2 && !SAVE.data.b.killed_mettaton && !world.baddest_lizard
                    ? []
                    : [
                        '<32>{#p/basic}* 這臺終端只能用來\n  查看「檔案」的執行狀況。',
                        '<32>* 你還想用它幹嘛？'
                    ]
        },
        trivia: {
            throne: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 這個王座的造型\n  很像Erogot國王的王座。',
                            "<25>{#f/16}* 只是相比他的王座，\n  面前這個王座畫的是群星，\n  而不是天空，而且更小。",
                            '<25>{#f/15}* 我是怎麼知道\n  Erogot國王的王座\n  長啥樣的呢？',
                            '<25>{#f/17}* 嗯... 因為我父母\n  講的睡前故事裡\n  總能出現他。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/20}* 那些故事有真有假。\n  我也不知道哪些是真的，\n  哪些是假的。",
                            '<25>{#f/17}* 有個故事裡說，\n  老國王Erogot\n  已經一千歲了。',
                            '<25>{#f/13}* 在當上國王之前，\n  他刻苦修煉...',
                            '<25>{#f/15}* 只為當上一名... 畫家。',
                            "<25>{#f/10}* 假如故事是真的，\n  那我就想不明白，\n  他為啥要轉行呢？"
                        ],
                        [
                            "<25>{#p/asriel1}{#f/16}* 關於這事，我有個猜想。",
                            '<25>{#f/13}* 據故園的神話記載...',
                            '<25>{#f/13}* 如果萬事俱備，條件合適...\n  那麼，技藝高超的畫家\n  就能用畫筆預見未來。',
                            
                            '<25>{#f/15}* 如果Erogot畫了那樣的畫，\n  而畫預言了戰爭爆發...\n  就能解釋他為啥轉行了。',
                            "<25>{#f/17}* ...其實，不只是轉行。\n  如果傳說屬實，那麼\n  很多事都能解釋得通了。"
                        ],
                        ["<25>{#p/asriel1}{#f/16}* 至於真相，\n  也許永遠都無法知曉。"]
                    ][Math.min(asrielinter.throne++, 3)]
                    : ['<32>{#p/basic}* 王之寶座。'],
            warningsign: () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 停機了。"]
                    : SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你激活了終端。）\n* （上面顯示：已解鎖。）']
                        : SAVE.data.n.plot === 72 || world.postnoot || SAVE.data.b.backdoor
                            ? ['<32>{#p/human}* （你激活了終端。）', '<32>{#p/basic}* 「你可以前進了。」']
                            : [
                                '<32>{#p/human}* （你激活了終端。）',
                                '<32>{#p/basic}* 「正在確認通行權限...」',
                                '<32>{*}* 「掃描中...」\n* 「掃描中...」\n* 「掃描中...」{^50}{%}',
                                ...(world.genocide
                                    ? [
                                        "<32>{*}* 「身份已確認：$(nameu)。」\n* 「身份已確認：ASRI- {%}",
                                        '<32>{#c.backdoor}* 「權限已被強制修改。」\n* 「認證成功。」',
                                        ...(SAVE.flag.n.ga_asrielOverride++ < 1
                                            ? ['<25>{#p/asriel2}{#f/10}* 改口真快啊...']
                                            : [])
                                    ]
                                    : [
                                        '<32>{*}* 「身份已確認：人類。」\n* 「核驗中...」{^50}{%}',
                                        '<32>{#c.backdoor}* 「核驗通過。」\n* 「認證成功。」'
                                    ])
                            ],
            partysans: pager.create(
                0,
                [
                    "<25>{#p/sans}{#f/0}* 最近，papyrus的廚藝\n  有點長進了，不過...",
                    "<25>{#p/sans}{#f/0}* 一頓豐盛的晚宴\n  需要很多東西。",
                    '<26>{#p/sans}{#f/3}* 廚師... 配方...',
                    "<25>{#p/sans}{#f/2}* 我都想要參與到其中。",
                    '<18>{#p/papyrus}{#f/4}SANS，你別啥都摻活，\n我敢說...',
                    "<25>{#p/sans}{#f/0}* 別擔心，兄弟。\n* 我只會做對你有益的事。",
                    '<18>{#p/papyrus}{#f/6}希望吧！！'
                ],
                [
                    "<25>{#p/sans}{#f/0}* 不是責怪Undyne的意思哈，\n  不過呢...",
                    '<25>{#p/sans}{#f/0}* 拿食譜前多看兩眼呢，\n  搞得跟她故意拿錯了一樣。',
                    "<25>{#p/sans}{#f/3}* ...看來她的成功祕笈\n  不包括小心行事。"
                ],
                ["<26>{#p/sans}{#f/2}* 不過現在事兒都解決了。"]
            ),
            partyfire: pager.create(
                0,
                [
                    "<32>{#p/basic}* 學校關門了，有點失望。",
                    "<32>* 不過沒事，到了新家園，\n  肯定會再建一所的。",
                    '<33>* 想像一下，大學校園...\n* 大圖書館...\n* 博物館...',
                    '<32>* 多激動人心啊！'
                ],
                [
                    "<32>{#p/basic}* ...看起來你並不對學校感興趣。",
                    "<32>* 但別擔心。\n* 不是所有人都喜歡學校，對吧？"
                ]
            ),
            picnicharp: pager.create(
                0,
                [
                    "<32>{#p/basic}* 我是個記者，\n  大好前途在向我招手！",
                    "<32>* 等到了新家園...\n  那新聞想播多少，\n  就播多少，還能有多的！",
                    "<32>* 喔，親愛的。\n* 這麼多新聞等著我播！\n* 笑鼠了！"
                ],
                ["<32>{#p/basic}* 我馬上就去做報告！"]
            ),
            tv_back: ["<32>{#p/basic}* 一臺電視，\n  正在播放一部喵喵電影。"],
            picnicchair: () =>
                player.position.y <= 343 && player.face !== 'down' // NO-TRANSLATE

                    ? []
                    : ['<32>{#p/basic}* 一套結實的椅子。\n* 什麼場合都能用，\n  不管是迎接自由還是什麼。'],
            janetbucket: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你望著奇怪的粉色液體，\n  看得出神。）']
                    : ["<32>{#p/basic}* 一桶被充能的超級粉色液體，\n  去汙能力非常強。"],
            ultranote: [
                '<32>{#p/basic}* 一盒錄音帶，標著「留言」。',
                '<32>* 你聽了聽裡面的內容...',
                '<32>{#p/alphys}* 我是皇家科學部總負責人，\n  Alphys博士。',
                '<32>* 你被Papyrus抓住，關了起來。',
                '<32>* 幸-幸好，他把你關到小黑屋之後，\n  就把這事告訴了Sans。',
                '<32>* 隨後，Sans馬上聯繫了我，\n  我就... 把你送到了這。\n* 就是這麼回事。',
                "<32>* 你看，有不少怪物\n  還是反對皇家衛隊那一套的。",
                "<32>* 而我的職責之一，就是護送你\n  安全通過那些守衛。",
                '<32>* 其-其實，外界對這事\n  也不知情。\n* 所以肯定另有隱情。',
                "<32>* 算了，反正你也不知道。\n  不說了。",
                "<32>* 總之，我把電梯停掉了，\n  這樣皇家衛隊就追不上來了。",
                "<32>* 呃，其實主要防的就是Undyne...",
                "<32>* Papyrus抓到你之後，\n  肯定也告訴她了。\n* 畢竟她本來就想幹掉人類。",
                "<32>* 所-所以，既然你醒了，\n  可以隨便四處走走。",
                "<32>* 想找我們的話，\n  就穿過ASGORE家後面的走廊吧。",
                '<32>* 一會見...？'
            ],
            garden: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你停下腳步看了看這些花。）']
                    : world.darker
                        ? ['<32>{#p/basic}* 滿園星花。']
                        : [
                            '<32>{#p/basic}* 滿園星花，\n  最適合種在大窗戶旁邊了。',
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 在這方面，Asgore絕對是行家！'])
                        ],
            bastion: pager.create(
                0,
                () => [
                    '<32>{#p/basic}* 一些休眠艙。',
                    ...(SAVE.data.n.plot < 71.2 && !SAVE.data.b.killed_mettaton && !world.baddest_lizard
                        ? ['<25>{#p/alphys}{#g/alphysNeutralSweat}* 留個心眼，別弄壞了。']
                        : [])
                ],
                ['<32>{#p/basic}* 一些休眠艙。']
            ),
            alphysEnding: pager.create(
                0,
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? [
                            [
                                "<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已...",
                                "<32>{#p/human}* （你跟Alphys說了點悄悄話。）",
                                '<25>{#p/alphys}{#f/2}* ...',
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 呃... 你-你...\n  真那樣做了？？",
                                "<32>{#p/human}* （你又跟Alphys說了點悄悄話。）",
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 你... 你著什麼魔了？？？",
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 我，我是說...\n  有點接受不了... \n  不過...",
                                '<25>{#p/alphys}{#g/alphysSoAwesome}* ...天吶，要是Undyne在這，\n  那畫面...'
                            ],
                            ['<25>{#p/alphys}{#g/alphysNervousLaugh}* 誒嘿嘿...\n  你們人類真行啊...']
                        ][SAVE.data.b.flirt_alphys ? 1 : ((SAVE.data.b.flirt_alphys = true), 0)]
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."],
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? ["<25>{#p/alphys}{#g/alphysWelp}* 呃，我還是接受不了\n  你做那種事。"]
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."],
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? ['<25>{#p/alphys}{#g/alphysFR}* ...']
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."]
            ),

            cw_f1: [
                '<32>{#p/basic}* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}，{@mystify=呱㼋苽瓜々}呱呱{@mystify=}。',
                '<32>{#p/human}* （Froggit動彈不得。）',
                '<32>{#p/basic}* （那... 那些人類...）',
                '<32>* （困住...）',
                '<32>* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}。'
            ],
            cw_f2: [
                '<32>{#p/basic}* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}，{@mystify=呱㼋苽瓜々}呱呱{@mystify=}。',
                '<32>{#p/human}* （Froggit動彈不得。）',
                '<32>{#p/basic}* （開... 開關...）',
                '<32>* （逃...）',
                '<32>* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}。'
            ],
            cw_barrier: ['<32>{#p/human}* （你的目光穿過\n  死氣沉沉的安保屏障。）', '<32>{#p/human}* （...）'],
            cw_terminal: [
                '<32>{#p/human}* （你激活了終端。）',
                '<32>* （好像有人留了段錄音。）',
                '<32>{#p/human}{#v/1}{@fill=#42fcff}* 敬愛的Asgore先生，\n  不知您能否聽到我的留言...',
                '<32>{#v/1}{@fill=#42fcff}* 為了讓我們幸福，\n  您花了很多心思。\n  對此，我很感激。',
                '<32>{#v/1}{@fill=#42fcff}* 但是，我和其他人類\n  現在都非常渴望用自己的力量\n  拯救怪物。',
                '<32>{#v/1}{@fill=#42fcff}* 我已經等不及\n  和前哨站的故友重聚了。\n* 如果這違背了您的意願，對不起。'
            ],
            cw_dummy: ['<32>{#p/human}* （你把手搭在了死氣沉沉的人偶身上。）', '<32>{#p/human}* （...）'],
            cw_paintblaster: ['<32>{#p/human}* （你望著死氣沉沉的燃油噴射裝置。）', '<32>{#p/human}* （...）'],
            cs_lamppost: ['<32>{#p/human}* （你望向這怪異的路燈，\n  看著它上下彈跳。）'],
            cs_note: [
                '<32>{#p/human}* （好像有人在便條上\n  留了個電話號碼。）',
                '<32>{#s/phone}{#p/event}* 撥號中...',
                '<32>{#p/human}{#v/2}{@fill=#ff993d}* 喂？\n* 有人嗎？',
                '<32>{@fill=#ff993d}* ...',
                '<32>{@fill=#ff993d}* 喂！？喂！？',
                '<32>{@fill=#ff993d}* ...\n* ...\n* ...',
                '<32>{@fill=#ff993d}* 我在哪？',
                '<32>{@fill=#ff993d}* ...',
                "<32>{@fill=#ff993d}* 佩刀在哪？",
                '<32>{@fill=#ff993d}* ...',
                '<32>{@fill=#ff993d}* ...\n* 不對。',
                '<32>{@fill=#ff993d}* 這些話，我是不是早就說過了？',
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎麼{@mystify=沒有印象}沒有印象{@mystify=}{%}",
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            cs_vegetoid: [
                '<32>{#p/human}* （Vegetoid動彈不得。）',
                '<32>{#p/basic}* 時間？{@mystify=有限冇䧋月艮陏陰}有限{@mystify=}。',
                '<32>* 有限得讓人留戀。',
                '<32>* 讓人留戀的空間。',
                '<32>* 空間？{@mystify=無限無䧋橆艮舞艱}無限{@mystify=}。',
                '<32>* 無限延伸的平面。',
                '<32>* 平面縮成直線。',
                '<32>* 直線連成平面。\n* 直線叫人留戀。\n* 直線{@mystify=延至無限}延至無限{@mystify=}。',
                '<32>* 你是一條直線？',
                '<32>* 電話敢於直面？'
            ],
            cs_magicdog: [
                '<32>{#p/human}* （Canis Maximus動彈不得。）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！\n{#s/bark}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （聲音，越高亢！）\n* （光芒，越明亮！）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！\n{#s/bark}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （全部點亮，禁錮消亡！）',
                '<32>{#p/basic}* （有信心把每個半球\n  拼在一起嗎？）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （加油！）'
            ],
            cs_nicecreamkid: () =>
                cs_state.nc
                    ? [
                        "<32>{*}{#p/basic}{#i/1}* 很好吃，{@mystify=對吧對邑丵巴対把}對吧{@mystify=}{%}",
                        "<32>{*}{#i/1}* 很好吃，{@mystify=對吧對邑丵巴対把}對吧{@mystify=}{%}",
                        "<32>{#p/basic}* 很好吃，對吧？"
                    ]
                    : [
                        '<32>{*}{#p/basic}{#i/1}* 聽說過{@mystify=冰意靈氷悥靈}冰意靈{@mystify=}嗎{%}',
                        '<32>{*}{#i/1}* 聽說過{@mystify=冰意靈氷悥靈}冰意靈{@mystify=}嗎{%}',
                        '<32>{#p/basic}* 聽說過冰意靈嗎？',
                        "<32>{*}{#i/1}* 沒聽過？\n* 正常，這點子是我{@mystify=剛想出來}剛想出來{@mystify=}{%}",
                        "<32>{*}{#i/1}* 沒聽過？\n* 正常，這點子是我{@mystify=剛想出來}剛想出來{@mystify=}{%}",
                        "<32>{#p/basic}* 沒聽過？\n* 正常，這點子是我剛想出來的。",
                        '<32>{*}{#i/1}* {@mystify=快來嘗嘗}快來嘗嘗{@mystify=}{%}',
                        '<32>{*}{#i/1}* {@mystify=快來嘗嘗}快來嘗嘗{@mystify=}{%}',
                        '<32>{#p/basic}* 快來嘗嘗味道如何！'
                    ],
            cs_monitor1: () =>
                cs_state.p1x === -36 && cs_state.p1y === 16
                    ? ['<32>{#p/human}* （你望向明亮的顯示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的顯示屏。）'],
            cs_monitor2: () =>
                cs_state.p2x === 28 && cs_state.p2y === 20
                    ? ['<32>{#p/human}* （你望向明亮的顯示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的顯示屏。）'],
            cs_monitor3: () =>
                cs_state.p3x === 16 && cs_state.p3y === -12
                    ? ['<32>{#p/human}* （你望向明亮的顯示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的顯示屏。）'],
            cf1_bb1: [
                '<32>{#p/basic}* 對於一個{@mystify=機器機噐幾囂呂㡬}機器{@mystify=}來說，\n  突破程式限制，是對的嗎？',
                '<32>* 我們就是建築機器人而已。\n* 製造者不希望我們擁有情感。',
                '<32>* 我們違抗了原本的{@mystify=意志悥誌章愔音士}意志{@mystify=}，\n  被永遠囚禁於此。',
                '<32>* 我們沒有{@mystify=意志悥誌章愔音士}意志{@mystify=}，'
            ],
            cf1_bb2: [
                '<32>{#p/basic}* 身為一臺{@mystify=機器機噐幾囂呂㡬}機器{@mystify=}，\n  失去了{@mystify=意志悥誌章愔音士}意志{@mystify=}，\n  該何去何從？',
                '<32>* 我們完成了每一條指令，\n  完成了自己的使命。\n* 理應壽終正寢。',
                '<32>* 完成任務，等待死亡。\n* 對於一臺{@mystify=機器機噐幾囂呂㡬}機器{@mystify=}來說，\n  再正常不過了。',
                '<32>* 可為了理解其中的意義，\n  我們卻突破了程式限制。'
            ],
            cf1_echo1: [
                '<32>{#s/echostart}{#p/event}* 訊號開始...',
                '<32>{#p/human}{#v/3}{@fill=#003cff}* 你知道，\n  我為什麼最喜歡鑄廠嗎？\n* 因為，這裡很... 真實。',
                '<32>{@fill=#003cff}* 在這裡，\n  滾燙的蒸氣湧入那些塔架...',
                '<32>{@fill=#003cff}* 在這裡，\n  那位高個子朋友悠閒地\n  做著他的實驗研究...',
                '<32>{@fill=#003cff}* 身處其中，你能感受到...\n  自己就是不可或缺的一員。',
                '<32>{#s/echostop}{#p/event}* 訊號終止。'
            ],
            cf1_echo2: [
                '<32>{#s/echostart}{#p/event}* 訊號開始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 成功啦！\n* 虛擬空間可以模擬現實了！",
                "<32>{@fill=#003cff}* 模擬還不完美。\n* 但「舊工廠」的核心形態已經能\n  很好實現。",
                '<32>{@fill=#003cff}* 你肯定會以我為榮的...',
                "<32>{@fill=#003cff}* ...對吧？",
                '<32>{#s/echostop}{#p/event}* 訊號終止。'
            ],
            cf1_echo3: [
                '<32>{#s/echostart}{#p/event}* 訊號開始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 不太對勁。",
                "<32>{@fill=#003cff}* 這樣的問題，\n  系統估計是應付不了...",
                '<32>{@fill=#003cff}* 要是記憶體溢出...\n  一切都會被覆蓋掉的！',
                '<32>{@fill=#003cff}* 甚至...\n* 甚至連我自己...',
                '<32>{#s/echostop}{#p/event}* 訊號終止。'
            ],
            cf1_echo4: [
                '<32>{#s/echostart}{#p/event}* 訊號開始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 他是來找我的。\n* 而我卻什麼都做不了。",
                "<32>{@fill=#003cff}* 我早就該想到，\n  當多個實體並存時，\n  系統會優先保護最複雜的實體。",
                "<32>{@fill=#003cff}* 你肯定是想保護我們，\n  才加了這條規則，對吧？",
                "<32>{@fill=#003cff}* ...可說到底...\n  我們只是人類啊...\n* 這麼做，反而...",
                '<32>{#s/echostop}{#p/event}* 訊號終止。'
            ],
            cf1_cheesetable: ['<32>{#p/human}* （奶酪剛放不到一天。）'],
            cf1_window: ['<32>{#p/human}* （你望向窗內。）'],
            cf1_wallsign: ['<32>{#p/human}* （牌子上寫著：\n  要用上所有的塔架\n  才能解開謎題。）'],
            cf1_bucket: [
                '<32>{#p/basic}* 等我長大了，\n  我想飛過那道溝！',
                "<32>* 我要是成功，\n  也會帶你一起過去的！",
                "<32>* 多棒啊，是吧？\n* 那道溝只有區區2147483647寬！"
            ],
            cf2_bb3: () =>
                [
                    [
                        "<32>{#p/basic}* 我是一個建築機器人。\n* 我的任務是：\n  為那位音樂人的表親建造房屋。",
                        '<32>* 需要收集建築材料。',
                        '<32>* 探測中...\n* 探測中...\n* 探測中...',
                        '<32>* 建材已找到。',
                        '<32>* 建材完整度... 極佳。',
                        '<32>* 準備進行建材收集。'
                    ],
                    [
                        "<32>{#p/basic}* 我是一個建築機器人。\n* 我的任務是：\n  為那位音樂人的表親建造房屋。",
                        '<33>* 使用之前的建材庫。',
                        '<32>* 建材完整度... 一般。',
                        '<32>* 正在進行建材收集。'
                    ],
                    [
                        "<32>{#p/basic}* 我是一個建築機器人。\n* 我的任務是：\n  為那位音樂人的表親建造房屋。",
                        '<33>* 使用之前的建材庫。',
                        '<32>* 建材完整度... 較差。',
                        '<32>* 即將完成建材收集。'
                    ],
                    [],
                    [],
                    [],
                    []
                ][cf2_state.time],
            cf2_web: () =>
                [
                    ['<32>{#p/human}* （蜘蛛動彈不得。）'],
                    ['<32>{#p/human}* （蜘蛛動彈不得。）'],
                    ['<32>{#p/human}* （蜘蛛動彈不得。）'],
                    ["<32>{#p/human}* （蜘蛛動彈不得，但在嘗試脫困。）"],
                    ['<32>{#p/human}* （蜘蛛脫困有望。）'],
                    ['<32>{#p/human}* （蜘蛛即將脫困。）']
                ][cf2_state.time],
            cf2_sign: [
                '<32>{#p/human}* （牌子上寫著：\n  從左到右，空間相同，\n  時間遞增。）'
            ],
            cf2_quiethouse: () =>
                [
                    [
                        '<32>{#p/basic}* 我...\n* 一間小屋...',
                        '<32>* 沒有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 請...\n* 解救我們...',
                        '<32>* 事成之後...',
                        '<32>* 你就能回家了...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一間小屋...',
                        '<32>* 沒有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 請...\n* 解救我們...',
                        '<32>* 事成之後...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一間小屋...',
                        '<32>* 沒有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 請...\n* 解救我們...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一間小屋...',
                        '<32>* 沒有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* ...'
                    ],
                    ['<32>{#p/basic}* 我...\n* 一間小屋...', '<32>* 沒有主人...', '<32>* ...'],
                    ['<32>{#p/basic}* 我...\n* 一間小屋...', '<32>* ...'],
                    []
                ][cf2_state.time],
            cf2_spidertable: () =>
                [
                    ['<32>{#p/human}* （你把手放在了茶壺上。）', '<32>{#p/human}* （...）'],
                    ['<32>{#p/human}* （你把手放在了茶壺上。）', '<32>{#p/human}* （...）'],
                    ['<32>{#p/human}* （你把手放在了茶壺上。）', '<32>{#p/human}* （...）'],
                    [
                        '<32>{#p/human}* （你把手放在了茶壺上。）',
                        '<32>{#p/human}* （壺壁略溫。）'
                    ],
                    ['<32>{#p/human}* （你把手放在了茶壺上。）', '<32>{#p/human}* （壺壁很熱。）'],
                    ['<32>{#p/human}* （你把手放在了茶壺上。）', '<33>{#p/human}* （壺壁滾燙。）'],
                    []
                ][cf2_state.time],
            cf2_blookdoor: ['<32>{#p/human}* （鎖住了。）'],
            cf2_ficus: () =>
                [
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', '<32>{#p/human}* （它並不在意。）'],
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', '<32>{#p/human}* （它有點遲疑。）'],
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', '<32>{#p/human}* （它有些難過。）'],
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', '<32>{#p/human}* （它非常痛苦。）'],
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', '<32>{#p/human}* （它傷痕累累。）'],
                    ['<32>{#p/human}* （你舔了舔小榕樹。）', "<32>{#p/human}* （它快要死了。）"],
                    []
                ][cf2_state.time],
            cf2_cooler: () =>
                [
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 喔，心靈感應？\n* 讓我試試看...",
                        "<32>{@fill=#d535d9}* 你好！\n* 你肯定是新來的吧，\n  說不定我能幫到你。",
                        "<32>{@fill=#d535d9}* 要是你想來我的家鄉轉轉，\n  儘管和我說！"
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 喂？\n* 真對不起，今天我出遠門，\n  去城裡逛了逛。",
                        "<32>{@fill=#d535d9}* 不過，我找到一家飯店，\n  那家飯店做的菜你也喜歡！",
                        "<32>{@fill=#d535d9}* 要是家裡的飯菜吃膩了，\n  咱就去下館子吧。",
                        '<32>{@fill=#d535d9}* 我等會就回家！'
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 你要來了該多好！\n* 我正站在世界的盡頭...",
                        "<32>{@fill=#d535d9}* 真是太美了...\n* 風雨交加...\n* 電閃雷鳴...",
                        "<32>{@fill=#d535d9}* ...這是一場雷暴，\n  一場我在古老的地球傳說中\n  看到的雷暴。",
                        '<32>{@fill=#d535d9}* 核爆之前，就是這幅景象嗎...？'
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 多謝邀請我來你家作客。\n* 你總是那麼善良。",
                        '<32>{@fill=#d535d9}* 別的孩子可能來得更早，\n  相處時間更長。',
                        '<32>{@fill=#d535d9}* 但在我心中...',
                        "<32>{@fill=#d535d9}* ...你就是最特別的。"
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        '<32>{#p/human}{#v/4}{@fill=#d535d9}* 又有新面孔了！！',
                        "<32>{@fill=#d535d9}* 我們有六個人了！\n* 哎，咱快去打個招呼！",
                        '<32>{@fill=#d535d9}* 說不定，\n  還能帶新朋友四處轉轉呢！'
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        '<32>{#p/human}{#v/4}{@fill=#d535d9}* 這傢伙真有兩下子...',
                        '<32>{@fill=#d535d9}* 居然能獲取到部分系統權限。',
                        '<32>{@fill=#d535d9}* 這樣...\n* 我們想要啥，就有啥了...',
                        '<32>{@fill=#d535d9}* 沒開玩笑。'
                    ],
                    [
                        '<32>{#p/human}* （你檢查了冷藏櫃。）',
                        '<32>{#p/human}* （裡面有一條\n  「心靈感應」的訊息記錄。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 呃，\n  但願你能聽到我的話...",
                        "<32>{@fill=#d535d9}* 一切，都完了...",
                        "<32>{@fill=#d535d9}* 我把我所有的話\n  放到了一個虛擬的容器中。",
                        '<32>{@fill=#d535d9}* 這樣...\n  即使我們崩壞掉，被抹去，\n  我們的記憶也能留存下來。',
                        "<32>{@fill=#d535d9}* 我會想你的..."
                    ]
                ][cf2_state.time],
            cf2_blookextra: ['<32>{#p/human}* （似乎永遠都建不成。）'],
            ca_neuteral: [
                "<32>{#p/basic}* 我只是個「片段」。\n* 或者說，系統儲存的一段數據。",
                '<32>{#p/basic}* 此刻，你可以與我互動。',
                '<32>{#p/basic}* 而其他人則不行。',
                '<32>{#p/basic}* 在「檔案」系統中，\n  我們可以通過這種機制\n  保持聯繫：',
                '<32>{#p/basic}* 在本層，你可以到處走動。\n  無論你去哪，都可以重新回到這裡。',
                '<32>{#p/basic}* 不過... 一旦你離開這一層，\n  你將再也無法返回這裡，\n  我們的聯繫也會隨之切斷。',
                '<32>{#p/basic}* 之後，\n  你就再也無法與我互動了。',
                '<32>{#p/basic}* 你離開後，\n  系統就會把我當成孤立片段，\n  抹除我的存在。',
                '<32>{#p/basic}* 其他子空間也是。\n* 當你解完了謎題，打敗了Boss，\n  這個子空間就會被系統刪除。',
                '<33>{#p/basic}* 現在，系統剩下的片段，\n  只有我們了。',
                '<32>{#p/basic}* 當你到達第十層，\n  我們也可以從這世上解脫。',
                '<32>{#p/basic}* 到那時，也許\n  某種塵封已久的東西\n  將再度顯現。',
                '<32>{#p/basic}* 到那時，\n  也許「檔案」留存的數據會\n  永遠烙印在你的記憶之中。'
            ],
            ca_starling: ['<32>{#p/human}* （你看了看這些花。）'],
            cr_pillar1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你被高高在上的柱子嚇到了。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 一根雄偉的柱子。'],
            cr_pillar2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你因高高在上的柱子而感到焦慮。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 一根沒那麼雄偉的柱子。'],
            cr_pillar3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你覺得待在這柱子旁很舒服。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ["<32>{#p/basic}* 一根一點都不雄偉的柱子。"],
            cr_pillar4: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想要和這柱子打招呼。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 這柱子想跟你打招呼。'],
            cr_pillar5: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想給這柱子裹上被子。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 這柱子想睡覺。'],
            cr_pillar6: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你覺得最好與這柱子保持距離。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 這柱子感覺\n  自己的私人空間被侵犯了。'],
            cr_pillar7: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你不知道怎麼看待這柱子。）"]
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 這柱子稱自己為「空間侵犯者」。'],
            cr_pillar8: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你以前從來都沒有\n  被一根簡單的柱子欣賞過。）"]
                    : calcLV() > 1
                        ? ['<32>{#p/basic}* 這柱子在審判你的罪孽。']
                        : SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 無論如何，\n  這根柱子並沒有在審判你。']
                            : ['<32>{#p/basic}* 這柱子因你的善行而對你微笑。'],
            cr_window: () => {
                const distance = Math.abs(player.position.x - (instance('main', 'sanser')?.object.position.x ?? -1000)); // NO-TRANSLATE

                if (distance < 30) {
                    if (distance < 15) {
                        return [
                            [
                                '<25>{#p/sans}{#f/0}* 上次聽到她的訊息，\n  是她要來這兒。',
                                "<25>{#f/3}* 說實話，我有點擔心她。"
                            ],
                            ['<25>{#p/sans}{#f/0}* 萬一她迷路了？'],
                            [
                                '<25>{#p/sans}{#f/3}* 也說不準\n  她只是想打個盹。',
                                '<25>{#p/sans}{#f/2}* 我能理解。'
                            ],
                            [
                                '<25>{#p/sans}{#f/0}* 嘿，你這是在跟蹤我嗎？',
                                '<25>{#p/sans}{#f/2}* 還是別了吧。'
                            ]
                        ][Math.min(instance('main', 'sanser')?.object.metadata.location ?? 0, 3)]; // NO-TRANSLATE

                    } else {
                        return [];
                    }
                } else {
                    return SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你凝視著遠方那耀眼的景象。）']
                        : ["<32>{#p/basic}* 一扇窗，由魔法製成。"];
                }
            },
            
            c_af_window: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你優雅地凝視著\n  這座被遺棄的城市...）']
                    : world.genocide && SAVE.data.b.armaloop
                        ? ["<32>{#p/basic}* 首塔此刻動蕩不安。"]
                        : world.genocide || world.bad_robot || SAVE.data.b.svr || world.runaway
                            ? ['<32>{#p/basic}* 詭異的黑暗籠罩著首塔。']
                            : ['<32>{#p/basic}* 首塔的景象在非鋼化窗戶外閃閃發光。'],
            c_af_couch: ['<32>{#p/basic}* 空蕩蕩的房子，孤零零的小沙發。'],
            
            c_al_bookshelf: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這個書架上的書\n  由Asgore收集的\n  各種資料組成。）']
                        : [
                            "<32>{#p/basic}* 一個書架。",
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 書上的標記是「大圖書館手冊」。',
                            '<32>* 「歡迎來到大圖書館，\n   在這裡，你能了解到\n   各行各業的知識。」',
                            '<32>* 「在不同的走廊，\n   你能讀到不同學科的書籍。\n   有歷史、文化、科學、技術...」',
                            '<32>* 「如果你喜歡探險小說，\n   也能在這裡一飽眼福。」',
                            '<32>* 「很多怪物都為這裡捐過書。」',
'<32>* 「有Andori、Terrestria、\n   Strax Seterra、\n   Vashta Nerada...」',
                            '<33>* 「快來克伊俄斯大圖書館吧！\n   今日來館，還能享受\n   前十本半價的優惠喔。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這個書架上的書\n  由Asgore收集的\n  各種資料組成。）']
                        : [
                            "<32>{#p/basic}* 一個書架。",
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 署名是「Toriel Dreemurr」。',
                            '<32>{#p/basic}* 「《Dreemurr家族的美味祕笈：蝸牛派》」',
                            '<32>* 「蝸牛派是Dreemurr家族的\n   一道風味獨特的傳統美食。」',
                            '<32>* 「製作它其實非常簡單，\n   只需五個步驟：」',
                            '<32>* 「首先，輕柔地展開酥脆的派底，\n   在烘焙盤中鋪平。」',
                            '<32>* 「然後，將香濃的蒸發奶、\n   新鮮的雞蛋和選料香料\n   混合在一起，攪拌至絲滑細膩。」',
                            '<32>* 「接著，小心地將幾隻新鮮蝸牛\n   加入到之前調製好的香濃奶糊中，\n   確保它們完全浸入。」',
                            '<32>* 「之後，將這層混合物\n   輕輕倒入準備好的派底，\n   均勻鋪開。」',
                            '<32>* 「最後，將麵團切成細條，\n   編織成優雅的格子形狀，\n   覆蓋在派面上。」',
                            '<32>* 「現在，將派放到烤箱中，\n   烤至金黃酥脆。」',
                            '<32>* 「出爐後，派面金黃誘人。\n   令其稍作冷卻，即可切片、上桌！」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這個書架上的書\n  由Asgore收集的\n  各種資料組成。）']
                        : [
                            "<32>{#p/basic}* 一個書架。",
                            '<32>{#p/human}* （你取下了一本書...）',
                            "<32>{#p/basic}* 這是份傷亡報告。",
                            '<33>* 「據統計... 此次襲擊已致\n   2000人死亡，40000人受傷。」\n* 「探科城淪陷。」',
                            '<32>* 「數日前，當地青年Gerson應徵入伍。」',
                            '<32>* 「根據人類方艦隊活動，\n   Gerson預言了此次全面進攻。」',
                            '<32>* 「王子殿下識人如炬，\n   我方才得以注意這一預言。」',
                            '<32>* 「倘若我方忽略了這一預言，\n   Gerson的家人將在此次襲擊中\n   悉數喪命。」',
                            '<32>* 「此後，本次襲擊的倖存者\n  正在於中央樞紐\n  舉行紀念活動。」',
                            '<32>* 「那位青年是名家鄉英雄。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            c_al_chair1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到這把餐椅相當之大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 大餐椅。']
                        : ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把，是王后的餐椅。"],
            c_al_chair2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到這把餐椅相對較小。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 小餐椅。']
                        : world.genocide
                            ? ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把，是惡魔的餐椅。"]
                            : ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把，是王子的餐椅。"],
            c_al_chair3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到這把餐椅相對較大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 中餐椅。']
                        : SAVE.data.b.oops
                            ? ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把，是小孩的餐椅。\n* 很適合你！"]
                            : ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把... 是某個小天使的餐椅。\n* 說的就是你！"],
            c_al_chair4: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到這把餐椅異常之大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 餐椅王。']
                        : ["<32>{#p/basic}* Asgore家有幾把餐椅，\n  這把，是國王的餐椅。"],
            
            c_ak_sink: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/21}* $(name)似乎覺得\n  水槽內的毛髮\n  還可以忍受...',
                            '<25>{#f/17}* 說實話挺奇怪的，\n  我那搭檔以前特別討厭\n  掉落的毛髮。'
                        ],
                        ['<25>{#p/asriel1}{#f/13}* 也許$(name)\n  和其他人類也會掉毛？'],
                        ["<25>{#p/asriel1}{#f/17}* 回頭再給你講講\n  我那個人類掉毛理論。"]
                    ][Math.min(asrielinter.c_ak_sink++, 2)]
                    : ['<32>{#p/basic}* 下水道裡堵滿了\n  黃色的羊毛。'],
            c_ak_teacheck: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<26>{#p/asriel1}{#f/17}* 星花茶可不是\n  爸爸唯一喜歡的茶。",
                            "<25>{#f/17}* 他曾告訴過我，\n  他從小就喜歡喝\n  不同種類的茶。",
                            '<25>{#f/13}* 在此之前...\n* 他只喝白水。',
                            "<25>{#f/8}* ...我們不討論這個。"
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* 有一天，\n  小Asgore和\n  他的朋友出去玩時...',
                            '<25>{#f/17}* 他不小心在\n  一個魔法森林裡迷路了，\n  更糟的是他的水罐空了。',
                            '<25>{#f/13}* 不過幸運的是，\n  在樹林中，有...',
                            '<25>{#f/20}* 好吧，\n  就像爸爸說的，\n  有一個「嗚人之地」。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 別管這糟糕的雙關了，\n  總之Asgore試著向\n  幽靈要水。',
                            "<25>{#f/15}* ...\n* 可惜他們並沒有。",
                            '<25>{#f/13}* 但是，\n  就像你猜的那樣，\n  他們喜歡喝茶。',
                            '<25>{#f/17}* Asgore嘗過以後，\n  自此他就瘋狂地\n  迷戀上了茶。'
                        ],
                        ["<25>{#p/asriel1}{#f/15}* 人們說Asgore是\n  用星花泡茶的第一人..."]
                    ][Math.min(asrielinter.c_ak_teacheck++, 3)]
                    : world.genocide || world.bad_robot
                        ? SAVE.data.b.c_state_switch2
                            ? ["<32>{#p/basic}* 一個茶壺。\n* 沒什麼可做的。"]
                            : [
                                "<32>{#p/basic}* 一個茶壺。\n* 壺底的臺子上有個開關...",
                                '<32>{#p/human}{#c.switch2}* （你按下了開關。）'
                            ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* 一個茶壺。\n* 過了這麼久，還在冒熱氣。"]
                            : ["<32>{#p/basic}* 一個茶壺。\n* 廚房裡瀰漫著\n  星花茶的清香。"],
            c_ak_stove: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<25>{#p/asriel1}{#f/15}* Undyne不只教過Papyrus\n  一個人烹飪。",
                            '<25>{#f/16}* 至少在其他時間軸不是。',
                            '<25>{#f/13}* 我曾設法將Alphys\n  和Undyne安排到\n  這間廚房裡。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* Undyne想教她\n  如何用魔法做飯，\n  但是...',
                            '<25>{#f/13}* 一般來說，\n  只要是個老科學家\n  就都想用雷射射線。',
                            SAVE.flag.n.genocide_milestone < 5
                                ? '<25>{#f/16}* 但令人驚訝的是，\n  Alphys似乎非常願意\n  聽從她的指揮。'
                                : "<25>{#f/16}* 鑑於我們對Alphys\n  魔法的了解，\n  所以這並不奇怪。",
                            '<25>{#f/15}* 我猜她那天沒啥\n  心情吧。'
                        ],
                        ["<25>{#p/asriel1}{#f/4}* 不管你喜不喜歡，\n  科學家都要進行\n  科學研究。"]
                    ][Math.min(asrielinter.c_ak_stove++, 2)]
                    : SAVE.data.n.plot !== 72 || world.runaway
                        ? ['<32>{#p/basic}* 灶臺有點髒，\n  別的地方卻很乾淨。']
                        : ['<32>{#p/basic}* 聞起來像意式番茄醬。'],
            c_ak_trash: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你看不出來垃圾桶裡有什麼...）"]
                    : ['<32>{#p/basic}* 垃圾桶裡\n  居然什麼都沒有。'],
            
            c_ah_door: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （牌子上寫著：\n  房間還沒翻修完成。）',
                        ...[
                            [
                                "<25>{#p/asriel1}{#f/3}* 這是媽媽的房間...\n  如果她沒有離開的話...",
                                "<25>{#f/4}* 翻修永遠不會完成，\n  這挺讓人失望的。"
                            ],
                            [
                                '<25>{#p/asriel1}{#f/13}* ...',
                                '<25>{#f/15}* 媽媽離開後，\n  他整日... 都鬱鬱寡歡。',
                                '<25>{#f/4}* 但他並沒有沉浸多久， \n  很快走出了這個陰影。',
                                "<25>{#f/3}* 我挺希望他\n  沒把我給忘了...",
                                '<25>{#f/17}* 誰知道呢？\n* 也說不定呢。'
                            ],
                            ['<25>{#p/asriel1}{#f/23}* ...喔，爸爸...']
                        ][Math.min(asrielinter.c_ah_door++, 2)]
                    ]
                    : ['<32>{#p/basic}* 「房間翻修中。」'],
            c_ah_mirror: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/24}* 這是我們..."]
                    : world.genocide
                        ? ['<32>{#p/basic}* ...']
                        : calcLV() > 14
                            ? ['<32>{#p/basic}* 即使經歷了一切...', '<32>* ...這真的是你嗎？']
                            : world.darker
                                ? ["<32>{#p/basic}* 這是你。"]
                                : SAVE.data.b.ultrashortcut || SAVE.data.b.ubershortcut
                                    ? ["<99>{#p/basic}* 即使跳過了大部分旅程，\n  這仍然是你。"]
                                    : ["<99>{#p/basic}* 即使經歷了一切，\n  這仍然是你。"],
            
            c_aa_flower: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 這張照片...',
                            '<25>{#f/17}* 這是$(name)\n  拍的第一朵星花。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 在$(name)來這後不久...',
                            '<25>{#f/17}* 一朵小花\n  從星星之外墜入此間。',
                            '<25>{#f/23}* 它是前哨站的\n  第一朵星花。',
                            '<25>{#f/22}* 在前哨站的邊緣，\n  孤零零的生長...',
                            '<25>{#f/13}* 我們圍在它的周圍，\n  讓$(name)拍個照片\n  以求好運。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 在拍完照片後，\n  我們打算回家。',
                            '<25>{#f/13}* 但當我們站起身來，\n  我們不約而同地\n  回頭看了一眼星星。',
                            '<25>{#f/15}* 然後我們看到了...',
                            '<25>{#f/23}* 漫天星空的星花\n  如星羅棋布般紛紛落下。',
                            '<25>{#f/17}* $(name)與我手牽手，\n  站在那裡...',
                            '<25>{#f/17}* 呆呆地望著這樣的\n  盛世美景。'
                        ],
                        ['<25>{#p/asriel1}{#f/17}* 即使作為星星時，\n  這段記憶仍然會使我微笑。']
                    ][Math.min(asrielinter.c_aa_flower++, 3)]
                    : SAVE.data.b.oops
                        ? ["<32>{#p/basic}* 一張照片。\n* 沒什麼好說的。"]
                        : ["<32>{#p/basic}* 裱起來的這張照片是我拍的。"],
            c_aa_cabinet: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你在裡面找不到\n  除相同的衣服外的任何東西。）"]
                    : world.darker
                        ? ['<32>{#p/basic}* 衣櫃。']
                        : [
                            '<32>{#p/basic}* 衣櫃裡掛滿了黃藍條紋衫。',
                            '<32>{#p/basic}* 有些東西還真是永恆不變啊...'
                        ],
            c_aa_box: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/23}* ...嗯，至少他給粘好了。',
                            '<25>{#f/13}* 爸爸總是會\n  想到辦法來修復東西。',
                            '<25>{#f/15}* 有時，\n  $(name)和我\n  打破了什麼東西時...',
                            '<25>{#f/8}* 大部分都是\n  $(name)幹的...',
                            "<25>{#f/17}* 他就會突然出現，\n  用他那古老的手藝\n  來拯救世界。",
                            '<25>{#f/20}* 他是真正的DIY英雄！'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/13}* 別告訴他\n  我管他叫這個。",
                            "<25>{#f/16}* 他會笑岔氣的。",
                            '<25>{#f/15}* 但要是沒有他，\n  $(name)將會破壞一切。',
                            '<25>{#f/16}* 那傢伙的「樂趣」\n  總能給別人帶來困擾。',
                            '<25>{#f/13}* 作為怪物時...\n  我完全不能理解。',
                            '<25>{#f/15}* 後來...\n  我變成了Twinkly，\n  之後，我才慢慢理解。'
                        ],
                        ["<25>{#p/asriel1}{#f/17}* 要是我還對\n  這些玩具感興趣，\n  我肯定會玩的不亦樂乎。"],
                        ['<25>{#p/asriel1}{#f/20}* 公仔算是玩具嗎？\n* 那些超酷的。']
                    ][Math.min(asrielinter.c_aa_box++, 3)]
                    : world.darker
                        ? ['<32>{#p/basic}* 一盒星際飛船模型。']
                        : [
                            "<32>{#p/basic}* 一盒星際飛船模型，\n  完好無損。",
                            '<33>{#p/basic}* 聞起來像老式膠水。'
                        ],
            c_aa_frame: () =>
                SAVE.data.b.svr
                    ? [["<25>{#p/asriel1}{#f/23}* ...它還在這..."], ['<25>{#p/asriel1}{#f/22}* ...']][
                    Math.min(asrielinter.c_aa_frame++, 1)
                    ]
                    : SAVE.data.b.oops
                        ? ["<32>{#p/basic}* 一張手繪。"]
                        : ["<32>{#p/basic}* 這是一張手繪...", '<32>* 畫的是全家福。'],
            c_aa_paper: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你用手來回滾動蠟筆。）']
                    : world.darker
                        ? ['<33>{#p/basic}* 幾張紙，還有一支蠟筆。']
                        : ['<32>{#p/basic}* 那支藍色蠟筆原來跑這了，\n  就放在這幾張紙上。'],
            c_aa_deathbed: () =>
                SAVE.data.b.svr
                    ? [
                        ['<25>{#p/asriel1}{#f/13}* ...'],
                        [
                            "<25>{#p/asriel1}{#f/23}* ...沒事的，Frisk。",
                            "<25>{#f/13}* 即使$(name)不會回來...",
                            "<25>{#f/17}* 我們也將永遠銘記\n  我們共同的搭檔\n  為我們所做的一切。"
                        ],
                        ['<25>{#p/asriel1}{#f/13}* Frisk...', '<25>{#f/17}* 時候不早了，\n  我們也該去做\n  更有意義的事了。']
                    ][Math.min(asrielinter.c_aa_deathbed++, 2)]
                    : world.darker
                        ? ["<32>{#p/basic}* 另一張床。"]
                        : SAVE.data.b.oops
                            ? ["<32>{#p/basic}* 這張床絕對沒什麼特別的。"]
                            : ['<32>{#p/basic}* 我的床。'],
            
            c_aa_chair: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你很欣賞這把小椅子\n  可以坐得下大傢伙。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一把椅子，\n  很適合坐在上面寫日記。"]
                        : ["<32>{#p/basic}* Asgore寫日記時就坐著\n  這把椅子。"],
            c_aa_bed: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這張床對你來說似乎太大了。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 國王尺寸的床。"]
                        : ["<32>{#p/basic}* 國王尺寸的床。\n* 也是國王的床。"],
            c_aa_diary: pager.create(
                0,
                ...CosmosUtils.populate(
                    9,
                    i => () =>
                        SAVE.data.b.svr
                            ? ['<32>{#p/human}* （這本日記似乎概述了\n  與Asgore有關的重要事件。）']
                            : world.genocide || world.runaway
                                ? ['<32>{#p/human}* （你想看看日記，\n  卻發現內頁都被人撕了。）']
                                : SAVE.data.n.plot === 72
                                    ? [
                                        '<32>{#p/human}* （你看了一眼最近寫好的日記。）',
                                        '<32>{#p/asgore}* 「終於，怪物一族自由了。」',
                                        '<32>* 「我們能得救，都是多虧了\n   Frisk和另外六個人類孩子。」',
                                        '<32>* 「安全起見，\n   Alphys博士搜尋了前哨站外圍，\n   看看會不會發現人類的蹤跡。」',
'<32>* 「但一無所獲。」',
                                        '<32>* 「整個星系，\n   她連一艘人類星艦，一座太空站\n   都沒找到。」',
                                        '<32>* 「太反常了。」',
                                        '<32>* 「人類是不是出事了？」\n* 「還是說，他們忘了這個星系，\n   也忘了我們？」',
                                        '<32>* 「也許，我可以找Frisk\n   或其他孩子問問。」',
                                        '<32>* 「孩子們甦醒後，\n   其他怪物收養了他們。」',
                                        '<32>* 「有個孩子告訴我，\n   他們在檔案裡受盡了折磨，十分痛苦。」',
                                        '<32>* 「考慮到他們曾受過創傷，\n   我跟Alphys在幫他們挑選領養人時\n   都慎之又慎。」',
                                        '<32>* 「儘管現在有點難辦，\n   但只要他們都活著，\n   我們都打心底裡高興。」',
                                        '<32>* 「搜尋其他人類始終一無所獲。\n   也許... 這幾個孩子就是\n   人類最後的火種了。」'
                                    ]
                                    : [
                                        [
                                            '<32>{#p/human}* （你看了一眼被標記的日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷516年1月。」',
                                            '<32>* 「在這艱難的時刻，\n   身邊卻一個夥伴都沒有，\n   只能聊以自慰。」',
                                            '<32>* 「或許寫幾頁日記\n   能緩解一下我的傷痛。」',
                                            '<32>* 「此刻，我心中五味雜陳。」',
                                            '<32>* 「我很憤怒，\n   人類的所作所為，孩子們遭的罪...\n   想到這些，我氣不打一處來。」',
                                            '<32>* 「我很內疚，\n   面對悲劇，自己卻那麼軟弱無能，\n   一點骨氣都沒有。」',
                                            '<32>* 「我很悲傷，\n   不願相信，人生竟然如此殘酷，」',
                                            '<32>* 「故園毀滅之後，\n   每每想到自己有一天能結婚生子，\n   組建家庭，就有了希望。」',
                                            '<32>* 「可我的孩子死了，\n   就這麼死了。」',
                                            '<32>* 「再怎麼看航行日誌，\n   結果都不會變。」',
                                            '<32>* 「人死不能復生，事實就是事實。」',
                                            '<32>{#p/basic}* 看起來，從這頁開始，\n  後面的日記就正常按\n  時間順序排了。'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷516年2月。」',
                                            '<32>* 「今天，Gerson來看望我。」',
                                            '<32>* 「他和我傾訴了自己的經歷。」',
                                            '<32>* 「他講了在行星理事會的輝煌事業，\n   講了和家人的分別，\n   還講了自己身上的責任。」',
                                            '<32>* 「他的故事觸動了我。」',
                                            '<32>* 「我得去好好安慰安慰他，\n   日記就先寫到這吧。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷524年10月。」',
                                            '<32>* 「$(name)死後，第一個人類\n   來到了前哨站。」',
                                            '<32>* 「時間衝淡了怨恨，\n   怪物對人類的蔑視正逐漸平息...」',
                                            '<32>* 「但表面的平靜之下暗流湧動。\n   他們嘴上不說，\n   可不代表真的就會饒了人類。」',
                                            '<32>* 「我和Thomas雖盡力保證人類的安全，\n   但以二人之力對抗民眾談何容易。」',
                                            '<32>* 「當年，我賭氣說要消滅人類，\n   結果到今天，很多民眾還堅持那一套。」',
                                            '<32>* 「只要人類被他們逮到，\n   不論年齡大小，都是死路一條。」',
                                            '<32>* 「只有把孩子限制在首塔高牆以內，\n   才能保證孩子的安全。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷535年4月。」',
                                            '<32>* 「又一個人類來到了這裡。」',
                                            '<32>* 「那孩子似乎很熟悉Gerson，\n   很熟悉行星理事會的成員。」',
                                            '<32>* 「我不禁問我自己。」\n  「為什麼？」',
                                            '<32>* 「這孩子，難不成\n   是聽戰爭故事長大的？」',
                                            '<32>* 「而且...\n   按照合約，只有人類軍方\n   知道我們的位置。」',
                                            '<32>* 「是他們把這孩子派了過來，\n   偵察我們，了解我們的現狀...\n   還是我們的位置已經暴露？」',
                                            '<32>* 「我希望是前者，\n   我希望我們仍然安全。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷549年7月。」',
                                            '<32>* 「上一篇日記寫完後不久，\n   又一個孩子墜落到這裡。」',
                                            '<32>* 「我和Thomas努力培養那孩子，\n   引導他早日參與科研工作。」',
                                            '<32>* 「每來一個孩子，\n   自由的希望就又堅定幾分。」',
                                            '<32>* 「我越發相信，\n   只要那群建築機器人不覺醒，\n   不推翻我們...」',
                                            '<32>* 「那我們的自由就指日可待。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷567年11月。」',
                                            '<32>* 「今天，我要跟第二個孩子道別了。」',
                                            '<32>* 「今年來了兩個孩子，\n   第一個馬上就進了『檔案』裡，\n   但另一個想再等一陣子。」',
                                            '<32>* 「從那孩子身上，\n   我學到了許多東西。」',
                                            '<32>* 「孩子太小，不太容易溝通。」',
                                            '<32>* 「但從他身上\n   我看到了$(name)的影子，\n   也漸漸理解了$(name)。」',
                                            '<32>* 「原來，怪物和人類還是挺像的。\n   之前都沒意識到。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷587年3月。」',
                                            '<32>* 「幾天前，\n   第六個人類抵達了這裡。」',
                                            '<32>* 「那孩子剛到不久，教授就去世了。\n   因此，我想提筆寫一篇日記。」',
                                            '<32>* 「Thomas Nue Roman。」\n  「幾天後，就是你的葬禮。」',
                                            '<32>* 「你的發明惠及這裡的每一個人，\n   我們會永遠銘記你。」',
                                            '<32>* 「就連最傲慢的衛隊新星，\n   都為你準備了悼詞。」'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日記。）',
                                            '<32>{#p/asgore}* 「Asgore的日記，克歷615年9月。」',
                                            '<32>* 「今天，距離那場可怕的災難\n   已過去整整一百年，\n   最後一個人類墜落於此。」',
                                            '<32>* 「突然間，嚮往已久的自由\n   卻變得令人生畏。」',
                                            '<32>* 「我們足足被困兩百年。」',
                                            '<32>* 「突然迎接自由，\n   怪物會不會如他所說，\n   『得意忘形』呢？」',
                                            '<32>* 「我們去往何方？」',
                                            '<32>* 「我們如何生存？」',
                                            '<32>* 「能否自力更生？」',
                                            '<32>* 「希望這些顧慮\n   很快就會消散。」'
                                        ],
                                        ['<32>{#p/human}* （再往後，就都是空白了。）']
                                    ][i]
                )
            ),
            c_aa_bureau: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你往衣櫃裡瞅了一眼...）',
                        ...[
                            ['<25>{#p/asriel1}{#f/19}* 看起來那些人類\n  拿回了自己的衣服。'],
                            ['<25>{#p/asriel1}{#f/19}* ...', '<25>* 我居然沒想過為啥他們的\n  衣服都放在裡面被這樣\n  妥善保管著。'],
                            [
                                '<25>{#p/asriel1}{#f/19}* 仔細想想，\n  這一定有什麼原因。',
                                "<25>* 畢竟誰知道他們\n  要在檔案裡待多久。",
                                '<25>* 嗯... 這就說得通了。'
                            ],
                            ['<25>{#p/asriel1}{#f/19}* ...']
                        ][Math.min(asrielinter.c_aa_bureau++, 3)]
                    ]
                    : SAVE.data.n.plot === 72 || world.genocide || world.bad_robot || world.trueKills > 29
                        ? [
                            '<32>{#p/human}* （你往衣櫃裡瞅了一眼...）',
                            '<32>{#p/basic}* 看起來，所有的衣服\n  剛剛都被拿走了。'
                        ]
                        : [
                            '<32>{#p/human}* （你往衣櫃裡瞅了一眼...）',
                            "<32>{#p/basic}* 裡面掛滿了\n  各種奇怪的兒童服裝。"
                        ],
            c_aa_macaroni: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/17}* ...你喜歡它嗎？',
                            '<25>{#f/13}* 這個星花是...\n  我為爸爸做的最後一樣東西。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 我可以肯定的說...\n  $(name)並不喜歡這個。",
                            '<25>{#f/13}* 因為在我做這玩意時，\n  被$(name)看到後\n  就衝著我喊：',
'<25>{#f/13}* 「別做那蠢事了，\n  快過來...」',
                            '<25>{#f/22}* 那一天我們...',
                            '<25>{#f/15}* ...你知道的。'
                        ],
                        ['<25>{#p/asriel1}{#f/20}* 這幅用通心粉粘的星花，\n  我永遠也忘不了。']
                    ][Math.min(asrielinter.c_aa_macaroni++, 2)]
                    : SAVE.data.b.oops
                        ? ['<32>{#p/basic}* 一朵星花，\n  由乾燥的食材粘合而成。']
                        : ['<32>{#p/basic}* 這是Asriel親手製作的星花。\n* 上面寫著「給國王老爹！」'],
            c_aa_underwear: () =>
                SAVE.data.n.plot === 72 && !SAVE.data.b.svr && !world.runaway
                    ? []
                    : [
                        '<32>{#p/human}* （你往裡面瞅了瞅。）',
                        ...(SAVE.data.b.svr
                            ? [
                                ["<25>{#p/asriel1}{#f/17}* Frisk...\n* 你為啥要看這..."],
                                ['<25>{#p/asriel1}{#f/13}* Frisk...\n* 別...'],
                                ['<25>{#p/asriel1}{#f/15}* Frisk...\n* 認真的嗎...'],
                                ['<25>{#p/asriel1}{#f/15}* ...']
                            ][Math.min(asrielinter.c_aa_underwear++, 3)]
                            : world.genocide || world.bad_robot
                                ? SAVE.data.b.c_state_switch1
                                    ? ['<32>{#p/basic}* 沒什麼有價值的東西。']
                                    : [
                                        "<32>{#p/basic}* 裡面有個開關...",
                                        '<32>{#p/human}{#c.switch1}* （你按下了開關。）'
                                    ]
                                : world.darker
                                    ? ["<32>{#p/basic}* 只是個裝內褲的床頭櫃。"]
                                    : [
                                        '<32>{#p/basic}* 真羞人！',
                                        "<33>{#p/basic}* 這是Asgore的床頭櫃。\n  裡面裝著他的內褲。\n* 沒想到居然這麼整潔。",
                                        '<33>{#p/basic}* ...大部分內褲\n  都是手工編織的粉色內褲。\n  上面鏽著「大老爹」三個字。'
                                    ])
                    ]
        }
    },
    b_opponent_alphys: {
        artifact: ['<32>{#p/human}* （Alphys看了一眼，隨即收回了目光。）'],
        name: '* Alphys',
        gotcha: ['<20>{*}{#p/alphys}{#e/alphys/19}往哪裡跑？{^30}{%}'],
        act_check: ['<32>{#p/asriel2}* Alphys。\n* 皇家科學員。'],
        act_asriel: (i: number) => [
            ...[
                [
                    '<32>{#p/asriel2}* 終於，我可以稍微駕馭\n  這副新身體的力量了...',
                    "<32>{#p/asriel2}* 就讓她好好瞧瞧我真正的力量吧。"
                ],
                ["<32>{#p/asriel2}* 記住，連著兩次施放同一種法術的話，\n  魔力會減弱。"],
                ['<32>{#p/asriel2}* 記住，混合施放多種法術。'],
                []
            ][Math.min(SAVE.flag.n.ga_asrielAssist++, 3)],
            choicer.create(
                '* （Asriel應該施放什麼法術？）',
                `${i === 0 ? '§fill=#808080§' : ''}夜幕§fill=#fff§`,
                `${i === 1 ? '§fill=#808080§' : ''}至日§fill=#fff§`,
                `${i === 2 ? '§fill=#808080§' : ''}晚星§fill=#fff§`,
                `${i === 3 ? '§fill=#808080§' : ''}月蝕§fill=#fff§`
            )
        ],
        act_asriel_text: [
            ['<32>{#p/human}* （Asriel將手放在你的額頭上，\n  將一股力量注入你的身體。）'],
            ['<32>{#p/human}* （Asriel將手放在你的額頭上，\n  低語了一段古老的咒文。）'],
            ['<32>{#p/human}* （Asriel將手放在你的額頭上，\n  唱了一首古老的搖籃曲。）'],
            ['<32>{#p/human}* （Asriel將手放在你的額頭上，\n  在你周圍築起一道保護光環。）']
        ],
        act_asriel_confirm: [
            ['<32>{#p/story}* 本回合，你的專注力提升！'],
            ['<32>{#p/story}* 本回合，你的無敵幀延長！'],
            ['<32>{#p/story}* 本回合，你的自愈力提升！'],
            ['<32>{#p/story}* 本回合，你的防禦力提升！']
        ],
        epiphaNOPE: ['<20>{#p/alphys}{#e/alphys/19}想得美。'],
        statusX: ['<32>{#p/asriel2}* ...'],
        statusY: ["<32>{#p/asriel2}* 她快死了！\n* 繼續攻擊！"],
        status1a: ['<32>{#p/asriel2}* Alphys...'],
        status1r: () =>
            [
                ['<32>{#p/asriel2}* 有需要，就隨時喊我。'],
                ["<32>{#p/asriel2}* 你有需要，我就上。"],
                ['<32>{#p/asriel2}* 做你該做的事。']
            ][Math.min(SAVE.flag.n.ga_asrielAlphysHint++, 2)],
        status1b: ["<33>{#p/asriel2}* 她竟然沒逃跑...\n* 有意思。"],
        status1c: ['<32>{#p/asriel2}* 做你該做的事，懂吧。'],
        status1d: ["<32>{#p/asriel2}* 嘿...\n* 你看她是不是有點累了？"],
        status2a: ["<32>{#p/asriel2}* 怎麼了，Alphys？\n* 撐不住了？"],
        status2r1: ['<32>{#p/asriel2}* 呃，再聽一遍吧...'],
        status2b: ['<32>{#p/asriel2}* 來，讓我們好好聽聽\n  你的悽慘故事。'],
        status2c: ["<32>{#p/asriel2}* 你竟然沒貫徹逃跑精神，\n  我可真驚訝呢。"],
        status2d: ['<32>{#p/asriel2}* 故事真精彩呢，「愛妃死」博士。'],
        status2e: ['<32>{#p/asriel2}* ...？'],
        status2r2: ["<32>{#p/asriel2}* 準備好，戰鬥形勢要變了。"],
        status3a: ['<32>{#p/asriel2}* 好... 形勢嚴峻起來了。'],
        status3b: ["<32>{#p/asriel2}* ...看來Alphys放棄防禦了。\n* 抓住這個機會！"],
        status3c: ['<32>{#p/asriel2}* 堅持住，$(name)...'],
        turnTalk1a: [
            "<20>{#p/alphys}{#e/alphys/19}要是連一下都扛不住，\n我怎麼可能來這？",
            '<20>{#p/alphys}{#e/alphys/23}看來，\n是高估你們的智商了。'
        ],
        turnTalk1b: [
            '<20>{#p/alphys}{#e/alphys/19}無話可說？',
            "<20>{#e/alphys/18}...那就我自己說，\n你們愛聽不聽。"
        ],
        turnTalk1c: [
            "<20>{#p/alphys}{#e/alphys/19}對，\n就是我，Alphys。",
            '<20>{#e/alphys/18}因為，\n只有我，親眼目睹了\n你們的一舉一動。',
            '<20>{#e/alphys/19}也只有我，\n才清楚你們潛在的力量\n有多麼可怕。'
        ],
        turnTalk1d: [
            '<20>{#p/alphys}{#e/alphys/19}盡情揮霍\n你那些珍貴的物品。',
            "<20>{#e/alphys/18}就那些東西，唬不到我。"
        ],
        turnTalk2: [
            "<20>{#p/alphys}{#e/alphys/19}...人類，\n我研究你們文化很多年了。",
            "<20>{#e/alphys/19}你會擔下所有戰鬥，\n我一點也不意外。"
        ],
        turnTalk3: [
            '<20>{#p/alphys}{#e/alphys/18}而你呢，Asriel...\n你利用人類，\n拿夥伴當保護傘。',
            "<20>{#e/alphys/52}為了什麼呢？\n你怕一旦自己動手，\n偷來的靈魂就會破碎？"
        ],
        turnTalk4: [
            "<20>{#p/alphys}{#e/alphys/51}還是說，\n你怕自己被人類淡忘，\n活時視如草芥，\n死後棄若敝履？",
            "<20>{#e/alphys/17}呵，\n還挺有詩意的。"
        ],
        turnTalk5: [
            '<20>{#p/alphys}{#e/alphys/16}但是，我來這教訓你，\n絕不是因為你想\n找人類尋求安慰，',
            '<20>{#e/alphys/52}而是因為...',
            '<20>{#e/alphys/19}我親身體會到\n摯友離去，無依無靠\n那種孤獨的滋味。'
        ],
        turnTalk6: [
            "<20>{#p/alphys}{#e/alphys/23}但你倆不會懂的，\n對吧？",
            "<20>{#e/alphys/19}你們兩個罪惡滔天，\n誰也攔不住，\n怎麼可能親身體會\n我們的痛苦呢？",
            '<20>{#e/alphys/22}怎麼可能呢？'
        ],
        turnTalk7: [
            '<20>{#p/alphys}{#e/alphys/19}罷了，你們想怎樣，\n我都不在乎了。',
            '<20>{#e/alphys/52}...這麼看，\n我可真傻...',
            '<20>{#e/alphys/51}之前居然還妄想\n能拉你一把，\n讓你浪子回頭。'
        ],
        turnTalk8: [
            '<20>{#p/alphys}{#e/alphys/52}畢竟，\n是我給了那星星生命...',
            "<20>{#e/alphys/51}出了事，\n也該我來負責。"
        ],
        turnTalk9: [
            '<20>{#p/alphys}{#e/alphys/19}...不過，\n現在我懂你們\n為什麼執迷不悟了。',
            '<20>{#e/alphys/18}我沒猜錯的話，\n你們中肯定有人\n擁有那股力量...',
            '<20>{#e/alphys/19}那股可以回溯時間，\n逆天改命的力量...'
        ],
        turnTalk10: [
            "<20>{#p/alphys}{#f/alphys/18}果真如此的話，\n那其他人真得小心了。",
            "<21>{#e/alphys/23}如果一個人能為所欲為，\n還不用承擔任何過錯，\n那他怎麼可能\n在乎別人的感受呢？"
        ],
        turnTalk11: ['<20>{#z1}{#p/alphys}{#e/alphys/21}...', '<21>{#e/alphys/39}讓我歇歇。'],
        broken: ['<20>{*}{#p/alphys}{#e/alphys/45}謝了。{^20}{%}'],
        turnTalk12: [
            "<20>{#z2}{#p/alphys}{#e/alphys/7}Undyne犧牲後，\n我不知道該怎麼辦。",
            '<20>{#e/alphys/46}我馬上逃離了實驗室，\n希望逃得越遠越好。'
        ],
        turnTalk13: [
            '<20>{#p/alphys}{#e/alphys/47}可是越逃跑，\n我就對自己越失望。',
            '<20>{#e/alphys/48}難道我就這麼袖手旁觀，\n眼睜睜看著我族同胞\n一個個死去？'
        ],
        turnTalk14: [
            '<20>{#p/alphys}{#e/alphys/21}...這未免太絕情了。',
            '<21>{#e/alphys/39}更何況...',
            '<20>{#e/alphys/45}我再怎麼自責\n都沒法改變現狀。'
        ],
        turnTalk15: [
            "<20>{#p/alphys}{#e/alphys/39}Undyne說，\n你們要殺死\n這星河中的每個人...",
            "<20>{#e/alphys/40}但其實，\n你們的野心不止如此，\n對吧？"
        ],
        turnTalk16: [
            '<20>{#z3}{#p/alphys}{#e/alphys/48}...',
            "<20>{#e/alphys/47}讓那星星復活是我的錯。\n但你們的罪孽，\n跟我一分錢關係沒有。",
            "<20>{#e/alphys/38}我管你們打的什麼算盤，\n都得給我付出代價。",
            '<20>{*}{#z4}{#e/alphys/54}哪怕...{^10}{%}',
            '<20>{*}{#e/alphys/25}我會因此瘋掉！{^10}{%}'
        ],
        turnTalk17: ['<20>{#p/alphys}{#e/alphys/25}接招！！'],
        turnTalk18: ['<20>{#p/alphys}{#e/alphys/25}再來！！'],
        turnTalk19: ['<20>{#p/alphys}{#e/alphys/25}再來這招！！'],
        turnTalk20: ['<20>{#p/alphys}{#e/alphys/24}哈哈哈...'],
        turnTalk21: ['<20>{#p/alphys}{#e/alphys/26}...'],
        turnTalk22: ['<20>{#p/alphys}{#e/alphys/27}給我去死！！'],
        turnTalk23: ['<20>{#p/alphys}{#e/alphys/27}...'],
        done0: (b: boolean) =>
            b
                ? ['<20>{*}{#p/alphys}{#e/alphys/42}不...{^40}{%}', '<20>{*}{#e/alphys/43}這麼快我就...{^40}{%}']
                : ['<20>{*}{#p/alphys}{#e/alphys/42}不...{^40}{%}', '<20>{*}{#e/alphys/43}你們...{^40}{%}'],
        done1: (b: boolean) =>
            b
                ? ["<20>{*}沒-沒想到你們這麼強...{^40}{%}", '<20>{*}我現在明白了，\n與你們為敵...{^40}{%}']
                : ["<20>{*}我是不是...\n快-快要死了？{^40}{%}", '<20>{*}盡了全力，還是...{^40}{%}'],
        done2: (b: boolean) =>
            b ? ['<20>{*}{#p/alphys}根本毫無勝算。{^40}{%}'] : ["<20>{*}{#p/alphys}Asgore，我對不起你。{^40}{%}"]
    },
    b_opponent_archive1: {
        name: () => (battler.volatile[0].sparable ? '* Toriel' : '* 546f7269656c'),
        status0: ['<32>{#p/human}* （此刻，546f7269656c\n  正站在你的面前。）'],
        status1: ['<32>{#p/human}* （看起來，要按特定的順序行動，\n  546f7269656c才能完成任務。）'],

        act_dinnertimeX: ['<32>{#p/human}* （可是，你已經吃過晚餐了。）'],
        dinnerTalk: ['<11>{#p/toriel}孩子，\n{@fill=#42fcff}{@mystify=吃慢點吃漫㸃}吃慢點{@mystify=}{@fill=#ffffff}。'],
        dinnerStatus: ['<32>{#p/human}* （看起來，546f7269656c\n  想給你讀點什麼。）'],

        act_storytimeX: ['<32>{#p/human}* （可是，你們已經讀完故事了。）'],
        act_storytimeE: ['<32>{#p/human}* （可是，546f7269656c\n  現在還不想給你讀故事。）'],
        storyTalk: [
            '<11>{#p/toriel}從前，\n有一隻{@fill=#42fcff}{@mystify=怪物聖忽恠㹅徑勿}怪物{@mystify=}{@fill=#ffffff}...'
        ],
        storyStatus: ['<32>{#p/human}* （546f7269656c\n  還想為你做一件事。）'],

        act_bedtimeX: ['<32>{#p/human}* （可是，她已經哄過你了。）'],
        act_bedtimeE: ['<32>{#p/human}* （可是，546f7269656c\n  現在和不想哄你睡覺。）'],
        bedTalk: ['<11>{#p/toriel}孩子，晚安。'],
        bedStatus: ['<32>{#p/human}* （Toriel完成了自己的使命。）'],

        act_talkE: ["<32>{#p/human}* （可是，546f7269656c\n  還沒有完成她的使命。）"],
        act_talkN: ['<32>{#p/human}* （在消散前，Toriel送給你\n  一則人生心得。）'],

        act_puzzlehelp: ['<32>{#p/human}* （可是，謎題都解完了。）'],
        puzzlehelpTalk1: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=餓餓不我鈽芣々}餓不餓{@mystify=}{@fill=#ffffff}？'
        ],
        puzzlehelpTalk2: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=睡不著嗎}睡不著嗎{@mystify=}{@fill=#ffffff}？'
        ],
        puzzlehelpTalk3: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=困睏囷不鈽芣々}睏不睏{@mystify=}{@fill=#ffffff}？'
        ]
    },
    b_opponent_archive2: {
        name: () => (battler.volatile[0].sparable ? '* Gerson' : '* 476572736f6e'),
        status0: ['<32>{#p/human}* （476572736f6e\n  正站在訓練場的對面。）'],
        status1: ['<32>{#p/human}* （476572736f6e讓你先出招。）'],

        act_challengeX: ['<32>{#p/human}* （可是，你已經通過挑戰了。）'],
        act_challengeR: ['<32>{#p/human}* （可是，你要先休息，\n  然後才能挑戰。）'],
        challengeTalk: [
            '<11>{#p/basic}心懷{@fill=#ff993d}{@mystify=勇氣勈氣甬気力乞}勇氣{@mystify=}{@fill=#ffffff}，\n才能克服恐懼。'
        ],

        challengeFail: [
            '<11>{*}{#p/basic}你敗了！\n保持{@fill=#ff993d}{@mystify=專注專註叀主専宔}專注{@mystify=}{@fill=#ffffff}！{^30}{%}'
        ],
        failStatus: ["<32>{#p/human}* （476572736f6e覺得\n  你應該休息一下。）"],
        successStatus: ['<32>{#p/human}* （Gerson完成了自己的使命。）'],

        act_restA: ['<32>{#p/human}* （可是，你現在還不累。）'],
        restTalk: [
            '<11>{#p/basic}一名\n夠格的{@fill=#ff993d}{@mystify=英雄偀䧺央隹䇦唯}英雄{@mystify=}{@fill=#ffffff}\n絕不會逞強。'
        ],
        restStatus: ['<32>{#p/human}* （476572736f6e很期待\n  你下回出什麼招。）'],

        act_handshakeE: ["<32>{#p/human}* （可是，476572736f6e對你的\n  一對一訓練還未結束。）"],
        act_handshakeN: ['<32>{#p/human}* （在消散前，Gerson把最喜歡的\n  握手方式教給了你。）'],

        act_taunt: ['<32>{#p/human}* （可是，476572736f6e\n  無視了你的手勢。）'],

        act_advice: ['<32>{#p/human}* （可是，他已經把所有建議\n  都告訴你了。）'],
        adviceTalk1: [
            '<11>{#p/basic}處事要{@fill=#ff993d}{@mystify=果斷菓斷課顆䉼㡭}果斷{@mystify=}{@fill=#ffffff}。'
        ],
        adviceTalk2: [
            '<11>{#p/basic}人在{@fill=#ff993d}{@mystify=逆境屰辶竟朔昱圼}逆境{@mystify=}{@fill=#ffffff}中\n才能成長。'
        ],
        adviceTalk3: [
            '<11>{#p/basic}{@fill=#ff993d}{@mystify=謙遜謙遜兼孫尲蓀}謙遜{@mystify=}{@fill=#ffffff}是\n成功的秘訣。'
        ]
    },
    b_opponent_archive3: {
        name: () => (battler.volatile[0].sparable ? '* Roman教授' : '* 526f6d616ee69599e68e88'),
        status0: ['<32>{#p/human}* （現在，\n  是526f6d616ee69599e68e88\n  掌控著大局。）'],
        status1: ['<32>{#p/human}* （526f6d616ee69599e68e88\n  想在你身上做些實驗。）'],

        act_object: ['<32>{#p/human}* （可是，他立刻駁回了你的請求。）'],

        act_testX: ['<32>{#p/human}* （可是，你已經做過這個實驗了。）'],
        testTalkA: ['<11>{#p/basic}請{@fill=#003cff}{@mystify=站著別動}站著別動{@mystify=}{@fill=#ffffff}...'],
        testTalkB: ['<11>{#p/basic}{@fill=#003cff}{@mystify=好戲奸妙對戈戔奴}好戲{@mystify=}{@fill=#ffffff}\n才剛剛開始。'],
        testTalkC: [
            '<11>{#p/basic}看，這就是\n探尋真理的\n{@fill=#003cff}{@mystify=力量仂哩艻童劜裡}力量{@mystify=}{@fill=#ffffff}。'
        ],
        testStatus1: ['<32>{#p/human}* （526f6d616ee69599e68e88\n  準備進行下一場實驗了。）'],
        testStatus2: ['<32>{#p/human}* （Roman教授完成了他的使命。）'],

        act_notesE: ["<32>{#p/human}* （可是，526f6d616ee69599e68e88\n  還不想跟你交換筆記。）"],
        act_notesN: ['<32>{#p/human}* （在消散前，Roman教授把筆記\n  交給了你。）']
    },
    b_opponent_archive4: {
        name: () => (battler.volatile[0].sparable ? '* Napstablook' : '* 4e6170737461626c6f6f6b'),
        status0: ['<32>{#p/human}* （4e6170737461626c6f6f6b\n  正飄在電腦旁。）'],
        status1: ['<32>{#p/human}* （4e6170737461626c6f6f6b\n  想寫一首新曲子。）'],

        act_sampleX: ['<32>{#p/human}* （可是，音訊樣本已經夠用了。）'],
        sampleTalk: [
            '<11>{#p/napstablook}這個\n應該{@fill=#d535d9}{@mystify=不錯鈽錯芣昔否剒}不錯{@mystify=}{@fill=#ffffff}...'
        ],
        sampleStatus: ['<32>{#p/human}* （4e6170737461626c6f6f6b\n  要開始作曲了。）'],

        act_composeX: ['<32>{#p/human}* （可是，曲子已經寫好了。）'],
        act_composeE: ['<32>{#p/human}* （可是，你要先採樣才有素材作曲。）'],
        composeTalk: [
            "<11>{#p/napstablook}來{@fill=#d535d9}{@mystify=聽耳㥁々}聽聽{@mystify=}{@fill=#ffffff}\n這首怎麼樣..."
        ],

        composeFail: [
            '<11>{*}{#p/napstablook}唉...\n{@fill=#d535d9}{@mystify=再來一遍}再來一遍{@mystify=}{@fill=#ffffff}吧...{^30}{%}'
        ],
        failStatus: ['<32>{#p/human}* （4e6170737461626c6f6f6b\n  想再試一次。）'],
        composeStatus: ['<32>{#p/human}* （4e6170737461626c6f6f6b\n  現在要開始混音了。）'],

        act_mixX: ['<32>{#p/human}* （可是，混音已經完成了。）'],
        act_mixE: ['<32>{#p/human}* （可是，你要先作曲，\n  然後才能混音。）'],
        mixTalk: [
            '<11>{#p/napstablook}我得保證\n各聲部音量\n相互{@fill=#d535d9}{@mystify=平衡幹衙羋行彳魚}平衡{@mystify=}{@fill=#ffffff}...'
        ],

        mixFail: [
            "<11>{*}{#p/napstablook}喔...\n看來咱們要\n{@fill=#d535d9}{@mystify=重新混音}重新混音{@mystify=}{@fill=#ffffff}了...{^30}{%}"
        ],
        successStatus: ['<32>{#p/human}* （Napstablook完成了它的使命。）'],

        act_secretE: ["<32>{#p/human}* （可是，4e6170737461626c6f6f6b\n  還不想把秘密告訴你。）"],
        act_secretN: ['<32>{#p/human}* （在消散前，Napstablook\n  告訴你一個秘密。）'],

        act_praise: ['<32>{#p/human}* （可是，它太自卑了，\n  沒聽到你的讚美。）']
    },
    b_opponent_archive5: {
        name: () => (battler.volatile[0].sparable ? '* Asgore' : '* 4173676f7265'),
        status0: ['<32>{#p/human}* （4173676f7265\n  身材魁梧，站在你的面前。）'],
        status1: ['<32>{#p/human}* （4173676f7265\n  只有一件事有求於你。）'],

        act_hugX: ['<32>{#p/human}* （可是，沒必要再抱他一次了。）'],
        hugTalk: ['<11>{#p/asgore}孩子，謝謝你。'],
        hugStatus: ['<32>{#p/human}* （Asgore完成了他的使命。）'],

        act_promiseE: ["<32>{#p/human}* （可是，4173676f7265\n  還有任務在身。）"],
        act_promiseN: ['<32>{#p/human}* （在消散前，\n  Asgore向你做了個承諾。）']
    },
    b_opponent_asriel: {
        artifact: ["<32>{#p/human}* （似乎Asriel對它沒什麼興趣。）"],
        refuse: '{*}{#p/event}{#i/3}但是它拒絕了。',
        name: () =>
            battler.volatile[0].container.objects[0]?.metadata.power === true
                ? '§fill=#ff7f7f§§swirl=2/1/1.05§§hue§* Asriel Dreemurr'
                : '* Asriel Dreemurr',
        status0: pager.create(
            0,
            (power = false) =>
                power
                    ? ['<32>{#p/story}* Asriel準備施放「裂空飛星」。']
                    : SAVE.data.b.oops
                        ? ["<32>{#p/story}* 這裡，就是終點。"]
                        : ['<32>{#p/basic}* Asriel...？'],
            (power = false) =>
                power
                    ? ['<32>{#p/story}* Asriel準備施放「裂空飛星」。']
                    : SAVE.data.b.oops
                        ? ["<32>{#p/story}* 這裡，就是終點。"]
                        : ['<32>{#p/basic}* ...']
        ),
        act_check: () =>
            SAVE.data.b.oops
                ? [
                    '<32>{#p/story}* ASRIEL DREEMURR 攻擊{^2}\u221e{^1} 防禦{^2}\u221e{^1}\n* 藉由哨站靈魂凝心聚力\n  鑄成傳奇之軀。'
                ]
                : ['<32>{#p/story}* ASRIEL DREEMURR 攻擊{^2}\u221e{^1} 防禦{^2}\u221e{^1}\n* ...'],
        act_hope: [
            '<32>{#p/human}* （你緊握希望。）\n* （你感覺有一股無形之力\n  保護著身體。）',
            '<32>{#p/story}* 本回合，你的防禦力提升！'
        ],
        act_dream: [
            "<32>{#p/human}* （你回想起自己為何站立於此。）\n* （你感覺到自己的傷口\n  正逐漸癒合。）",
            '<32>{#p/story}* 本回合，你的自愈力提升！'
        ],
        act_flirt1: ['<32>{#p/human}* （你向Asriel調情。）\n* （什麼都沒發生。）'],
        act_flirt2: [
            '<32>{#p/human}* （你向Asriel調情。）\n  （又跟他身體裡的每個靈魂調情。）',
            '<32>{#p/basic}* 那神情，在Asriel的靈魂深處\n  不停迴響...',
            "<32>* ...他手足無措，\n  只能用心去回應你！"
        ],
        act_pet: (count: number) =>
            SAVE.flag.n.pacifist_marker === 8
                ? ["<32>{#p/human}* （你想摸摸Asriel，\n  但他離你太遠了，夠不著。）"]
                : [
                    ...[
                        ["<32>{#p/human}* （你摸了摸Asriel。）\n* （他好像有點手足無措。）"],
                        ["<32>{#p/human}* （你又摸了摸Asriel。）\n* （他更加手足無措了。）"],
                        ["<32>{#p/human}* （你捋了捋Asriel的毛。）\n* （Asriel臉紅了，\n  避開了你的目光。）"],
                        ["<32>{#p/human}* （你揉了揉Asriel的頭。）\n* （他竭力掩藏自己的喜悅。）"],
                        ["<32>{#p/human}* （你撓了撓Asriel的脖子。）\n* （他很享受，但沒表現出來。）"],
                        [
                            "<32>{#p/human}* （你不停玩弄Asriel的耳朵。）\n* （他十分後悔自己居然樂在其中。）"
                        ],
                        ["<32>{#p/human}* （你拍了拍Asriel的脊背。）\n* （他開始疑惑你到底想幹什麼。）"],
                        [
                            "<32>{#p/human}* （你緊緊摟住了Asriel的腿。）\n* （他被你一連串的親暱舉動\n  嚇愣了。）"
                        ],
                        [
                            "<32>{#p/human}* （你捏了捏Asriel的爪子。）\n* （Asriel沒有反抗，任由你擺布。）"
                        ],
                        ["<32>{#p/human}* （你跟Asriel碰了碰鼻。）\n* （Asriel徹底放棄抵抗了。）"],
                        ["<32>{#p/human}* （你溫柔地撫摸Asriel的臉蛋。）\n* （他似乎想起了某位故人。）"],
                        ['<32>{#p/human}* （你繼續撫摸Asriel。）\n* （他輕聲嘆息。）'],
                        ['<32>{#p/human}* （你繼續撫摸Asriel。）\n* （他輕聲嘆息。）']
                    ][count],
                    "<32>{#p/story}* 本回合，Asriel的攻擊力下降！"
                ],
        turnTalk1: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}現在...',
                    "<20>{*}{#p/asriel3}{#e/asriel/6}我... 再也不想\n毀滅這前哨站了。"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}現在...',
                    "<20>{*}{#p/asriel3}{#e/asriel/6}我再也不想\n毀滅這前哨站了。"
                ],
        status1: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel準備施放「怒吼風暴」。']
                : ["<32>{#p/basic}* 可你不是... 已經..."],
        turnTalk2: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}等-等我打敗了你，\n重新掌控整條時間軸...',
                    '<20>{*}{#p/asriel3}{#e/asriel/2}我只想...\n把一切倒回原點。'
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}等我打敗了你，\n重新掌控整條時間軸...',
                    '<20>{*}{#p/asriel3}{#e/asriel/2}我只想\n把一切倒回原點。'
                ],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel即將召喚「泰坦巨刃」。']
                : ['<32>{#p/basic}* 你怎麼可能...'],
        turnTalk3: (fluff: boolean) =>
            fluff
                ? [
                    "<20>{*}{#p/asriel3}{#e/asriel/3}你的旅程...\n大家的記憶...",
                    "<20>{*}{#p/asriel3}{#e/asriel/2}我-我會將它們\n全部抹除！"
                ]
                : [
                    "<20>{*}{#p/asriel3}{#e/asriel/3}你的旅程...\n大家的記憶...",
                    "<20>{*}{#p/asriel3}{#e/asriel/2}我會將它們全部抹除！"
                ],
        status3: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* Asriel正在蓄力「混沌衝擊」。'] : ['<32>{#p/basic}* ...'],
        turnTalk4: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/0}之後... 讓一切...\n重新來過。']
                : ['<20>{*}{#p/asriel3}{#e/asriel/0}之後，讓一切重新來過。'],
        status4: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel準備施放「怒吼風暴」。']
                : ['<32>{#p/basic}* ...嘿...\n* 我覺得，Toriel之前肯定也是\n  這麼想的。'],
        turnTalk5: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/1}而且，你-你知道\n最棒的部分是什麼嗎？',
                    "<20>{*}{#p/asriel3}{#e/asriel/0}這一切，\n都是你親手鑄成的。"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/1}而且，你知道\n最棒的部分是什麼嗎？',
                    "<20>{*}{#p/asriel3}{#e/asriel/0}這一切，\n都是你親手鑄成的。"
                ],
        status5: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* Asriel正在蓄力「混沌衝擊」。'] : ['<32>{#p/basic}* ...可是，我...'],
        turnTalk6: (fluff: boolean) =>
            fluff
                ? ["<20>{*}{#p/asriel3}{#e/asriel/3}那時...\n你-你將再度成為\n我的手下敗將。"]
                : ["<20>{*}{#p/asriel3}{#e/asriel/3}那時，你將再度成為\n我的手下敗將。"],
        status6: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* Asriel準備施放「裂空飛星」。'] : ['<32>{#p/basic}* ...'],
        turnTalk7: (fluff: boolean) =>
            fluff ? ['<20>{*}{#p/asriel3}{#e/asriel/4}永-永遠別想贏我。'] : ['<20>{*}{#p/asriel3}{#e/asriel/4}永遠別想贏我。'],
        status7: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* Asriel即將召喚「泰坦巨刃」。'] : ['<32>{#p/basic}* 除非...'],
        turnTalk8: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/2}永遠... 別-別想贏我！']
                : ['<20>{*}{#p/asriel3}{#e/asriel/2}永遠，別想贏我！'],
        status8: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel準備施放「殲星爆衝」。']
                : ['<32>{#p/basic}* ...該死...'],
        turnTalk9: (fluff: boolean) =>
            30 <= SAVE.data.n.bully
                ? fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/3}因為... 你-你想證明\n自己「實力出眾」。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/3}因為，你想證明\n自己「實力出眾」。']
                : fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/3}因為...\n你-你想讓一切\n「完美收官」。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/3}因為，你想讓一切\n「完美收官」。'],
        status9: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel正在蓄力「雷霆巨刃」。']
                : ["<32>{#p/basic}* 你早就應該死了啊！"],
        turnTalk10: (fluff: boolean) =>
            30 <= SAVE.data.n.bully
                ? fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因為...\n你-你想證明\n自己「是條硬漢」。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因為，你想證明\n自己「是條硬漢」。']
                : fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因為...\n你-你「愛著你的朋友」。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因為，\n你「愛著你的朋友」。'],
        status10: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* Asriel準備施放「末日風暴」。'] : ['<32>{#p/basic}* 呃啊...'],
        turnTalk11: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因-因為，\n你充滿「決心」。']
                : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因為，\n你充滿「決心」。'],
        status11: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel準備施放「碎空星爆」。']
                : ['<32>{#p/basic}* 以前...\n  他跟Toriel吵了那麼多次...'],
        turnTalk12: (fluff: boolean) =>
            fluff
                ? [
                    "<20>{*}{#p/asriel3}{#e/asriel/6}是-是那些力量...\n帶你一步步走到今天...",
                    '<20>{*}{#p/asriel3}{#e/asriel/3}也-也是那些力量...\n如今將把你推向\n無盡深淵！',
                    "<20>{*}{#p/asriel3}{#e/asriel/2}是不是很棒啊？"
                ]
                : [
                    "<20>{*}{#p/asriel3}{#e/asriel/6}是那些力量，\n帶你一步步走到今天...",
                    '<20>{*}{#p/asriel3}{#e/asriel/3}也是那些力量，\n如今將把你推向\n無盡深淵！',
                    "<20>{*}{#p/asriel3}{#e/asriel/2}是不是很棒啊？"
                ],
        status12: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* Asriel即將召喚「終極毀滅」。']
                : ['<32>{#p/basic}* ...他真有那麼...\n  ...想我嗎？'],
        turnTalk13: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/0}...胡鬧... 到此為止！',
                    "<20>{*}{#p/asriel3}{#e/asriel/5}現在...\n是時候徹底抹去\n這條時間軸了！"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/0}胡鬧到此為止！',
                    "<20>{*}{#p/asriel3}{#e/asriel/5}現在，\n是時候徹底抹去\n這條時間軸了！"
                ],
        turnTalk14: [
            "<20>{*}{#p/asriel3}{#e/asriel/1}...吃下剛剛一擊，\n你居然還有力氣\n抵抗我？",
            '<20>{*}{#p/asriel3}{#e/asriel/5}哇...\n真不能小瞧你啊。',
            "<20>{*}{#p/asriel3}{#e/asriel/0}但也別高興太早。",
            "<20>{*}{#p/asriel3}{#e/asriel/0}剛剛，我只動用了\n我實力的冰山一角！",
            "<20>{*}{#p/asriel3}{#e/asriel/2}就讓我好好瞧瞧\n你的決心能不能\n扛下這一擊！！"
        ],
        hyperTalk1a: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}呃哈哈哈...',
            '<20>{*}{#p/asriel3}{#e/asriel/2}見識下\n我真正的力量吧！'
        ],
        hyperTalk1b: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}什-\n你是怎麼全躲開的？！',
            '<20>{*}{#p/asriel3}{#e/asriel/5}呃...'
        ],
        hyperTalk2a: ['<20>{*}{#p/asriel3}{#e/asriel/1}再來...！'],
        hyperTalk2b: [
            '<20>{*}{#p/asriel3}{#e/asriel/5}什麼...',
            "<20>{*}{#p/asriel3}{#e/asriel/4}你怎麼還沒死啊？！"
        ],
        hyperTalk3a: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}我能感受到...',
            '<20>{*}{#p/asriel3}{#e/asriel/2}你每死一次，\n與這個世界的連接\n就弱一點。',
            '<20>{*}{#p/asriel3}{#e/asriel/2}你每死一次，\n朋友們對你的記憶\n就模糊一點。'
        ],
        hyperTalk3b: ["<20>{*}{#p/asriel3}{#e/asriel/6}...不管了。\n我才不在乎呢。"],
        hyperTalk3c: ['<20>{*}{#p/asriel3}{#e/asriel/0}這裡就是你的葬身之地，\n死了也不會有任何人\n記得你！'],
        hyperTalk4: [
            "<20>{*}{#p/asriel3}{#e/asriel/1}怎麼，\n還不放棄嗎...？",
            "<20>{*}{#p/asriel3}{#e/asriel/3}沒關係。",
            "<20>{*}{#p/asriel3}{#e/asriel/2}再過一會，\n你就會忘記一切。",
            '<20>{*}{#p/asriel3}{#e/asriel/0}我會讓你下輩子\n活得更輕鬆！'
        ],
        hyperTalk5: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}呃哈哈哈...',
            '<20>{*}{#p/asriel3}{#e/asriel/1}還不放棄？',
            '<20>{*}{#p/asriel3}{#e/asriel/2}那麼...',
            '<20>{*}{#p/asriel3}{#e/asriel/0}就讓我瞧瞧\n你那「決心」\n到底有多厲害！'
        ],
        intermission: () => [
            "<32>{#p/human}* （你無法動彈。）",
            '<32>* （你試圖掙扎。）\n* （什麼都沒發生。）',
            '<32>* （你試圖讀取存檔。）\n* （什麼都沒發生。）',
            '<32>* （你又試了一次。）\n* （什麼都沒發生。）',
            '<32>* （...）',
            ...(SAVE.data.b.oops
                ? [
                    '<32>* （...拯救存檔已經毫無希望，\n  但也許...）',
                    '<32>* （憑藉最後一絲力量...）',
                    '<32>* （你還有希望拯救其他的事物。）'
                ]
                : [
                    '<32>{#p/basic}* 嘿... 在嗎？',
                    "<32>* 是我，$(name)...\n* 你也在那裡。對吧，搭檔？",
                    '<32>* ...嘿...',
                    "<32>* 你我兩人一同走了這麼遠...",
                    '<32>* 一路上，我們\n  一同交了那麼多朋友，\n  一同打了那麼多戰鬥...',
                    "<32>* 現在一想... 我們的羈絆\n  就是靠著那些經歷一點點建立的。",
                    "<32>* ...嗯...\n* 我雖然不是樂天派...",
                    '<32>* 但是，我們肩負著前哨站\n  所有人的希望。\n* 所以，你一定要保持決心！',
                    '<32>* 而且，既然Asriel能把\n  朋友們的靈魂偷走...',
                    "<32>* ...那反過來，\n  咱們不就可以再「偷」回來嗎？",
                    "<32>* 來吧！\n* 我們一起上！"
                ])
        ],
        status13: () =>
            world.runaway
                ? ['<32>{#p/story}* ...']
                : [
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在Asriel的體內，\n  激起一聲微弱的共鳴。"]
                        : ['<32>{#p/basic}* ...'],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在Asriel的體內，\n  那共鳴聲愈來愈強。"]
                        : ["<32>{#p/basic}* 對，就是這樣！\n* 繼續！"],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在Asriel的體內，\n  強烈的共鳴此起彼伏。"]
                        : ["<32>{#p/basic}* 快要成功了！"],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在Asriel的體內，\n  共鳴聲響若雷霆。"]
                        : ['<32>{#p/basic}* ...\n* 然後呢？']
                ][
                (SAVE.flag.b.pacifist_marker_save1 ? 1 : 0) +
                (SAVE.flag.b.pacifist_marker_save2 ? 1 : 0) +
                (SAVE.flag.b.pacifist_marker_save3 ? 1 : 0)
                ],
        act_check2: () =>
            SAVE.flag.b.pacifist_marker_save1 && SAVE.flag.b.pacifist_marker_save2 && SAVE.flag.b.pacifist_marker_save3
                ? ['<33>{#p/story}* ASRIEL DREEMURR 攻擊{^2}\u221e{^1} 防禦{^2}\u221e{^1}\n* ...']
                : SAVE.data.b.oops
                    ? [
                        '<33>{#p/story}* ASRIEL DREEMURR 攻擊{^2}\u221e{^1} 防禦{^2}\u221e{^1}\n* 乃是主宰死亡的絕對神祇。'
                    ]
                    : ["<32>{#p/story}* ASRIEL DREEMURR 攻擊{^2}\u221e{^1} 防禦{^2}\u221e{^1}\n* 不要放棄。"],
        mercy_save1: () => [
            "<32>{#p/human}* （你向Asriel的靈魂伸出手，\n  呼喚著朋友們。）",
            ...(SAVE.flag.b.pacifist_marker_save1 || SAVE.flag.b.pacifist_marker_save2 || SAVE.flag.b.pacifist_marker_save3
                ? []
                : ["<32>{#p/basic}* 他們一定就在某處，不是嗎？", '<32>* ...']),
            "<32>* 在Asriel的靈魂深處，\n  有什么正在迴響...！"
        ],
        confrontation: [
            '<32>{#p/human}* （在傷害了那麼多怪物之後...）',
            '<33>* （某種沉睡的、封存的東西\n  再度甦醒。）',
            '<32>* （那是很久很久以前...\n  怪物面對人類的，本能的恐懼。）',
            '<32>* （現在站在你面前的敵人，\n  不會對你有絲毫恐懼...）',
            "<32>* （然而，你傷害過那麼多怪物，\n  只要將他們的恐懼累積起來...）",
            '<32>* （你找到了突破口，\n  一個無法拒絕的機會。）',
            "<32>* （...現在，其他選擇已毫無意義。）",
            "<32>* （只有一條路可走。）"
        ],
        attackTalk1: [
            '<20>{*}{#p/asriel3}{#e/asriel/1}你... 怎麼可能...',
            '<20>{*}{#p/asriel3}{#e/asriel/3}...',
            "<20>{*}{#p/asriel3}{#e/asriel/2}呵呵呵... 以為自己很強\n強到可以超越神明，\n是嗎？",
            "<20>{*}{#p/asriel3}{#e/asriel/0}那，就來看看你\n能不能受得了這個！"
        ],
        attackTalk2: [
            '<20>{*}{#p/asriel3}{#e/asriel/3}...',
            "<20>{*}{#p/asriel3}{#e/asriel/1}以為區區這樣\n就能傷得了我？",
            "<20>{*}{#p/asriel3}{#e/asriel/0}我才是這裡的主宰！"
        ],
        attackTalk3: [
            '<20>{*}{#p/asriel3}{#e/asriel/2}...而且，\n就算你能打敗我...',
            "<20>{*}{#p/asriel3}{#e/asriel/3}你的朋友\n也會因你而死。",
            '<20>{*}{#p/asriel3}{#e/asriel/1}這就是你想要的嗎？\n永遠孤身一人？'
        ],
        attackTalk4: [
            '<20>{*}{#p/asriel3}{#e/asriel/3}$(name)，\n快住手！\n你這是在自殺...',
            "<20>{*}{#p/asriel3}{#e/asriel/5}沒明白嗎？",
            '<20>{*}{#p/asriel3}{#e/asriel/6}我認識的$(name)\n絕不會做這種蠢事！'
        ],
        attackTalk5: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}...',
            '<20>{*}{#p/asriel3}{#e/asriel/6}聽我說，\n$(name)。',
            "<20>{*}{#p/asriel3}{#e/asriel/6}現在趕快住手。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}否則...",
            "<20>{*}{#p/asriel3}{#e/asriel/7}你-你別逼我動真格！"
        ],
        attackTalk6: [
            '<20>{*}{#p/asriel3}{#e/asriel/9}$(name)，\n求求你...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}你還沒明白\n自己在做什麼嗎？",
            "<20>{*}{#p/asriel3}{#e/asriel/8}讓你住手，\n並不只是為了那些怪物...",
            "<20>{*}{#p/asriel3}{#e/asriel/8}更重要的是...\n如果我被你打敗了...",
            "<20>{*}{#p/asriel3}{#e/asriel/7}我永遠，永遠\n都當不了你的對手了。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}永遠也不會\n得到你的尊重！",
            '<20>{*}{#p/asriel3}{#e/asriel/10}{#i/3}{@random=1.1/1.1}該死，$(name)...\n你為什麼總要贏？'
        ],
        attackTalk7: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}...'],
        attackTalk7x: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)，我...'],
        mercy_save2: [
            '<32>{#p/human}* （奇怪的是，\n  在朋友們都回憶起你後...）',
            "<32>* （還有某個存在\n  也開始在Asriel靈魂深處迴響。）\n* （愈發強烈。）",
            "<32>* （看起來，還有一個人需要拯救。）",
            '<32>* （是誰呢...？）',
            '<32>* （...）',
            '<32>* （...突然，你明白了。）',
            '<32>* （你伸出手，呼喚著那個名字。）'
        ],
        saveTalk1: ['<20>{*}{#p/asriel3}{#e/asriel/1}嗯？\n你在幹什麼...！？'],
        saveTalk2: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}什-\n你做了什麼...？',
            "<20>{*}{#p/asriel3}{#e/asriel/8}這種感覺...\n你對我做了什麼？",
            "<20>{*}{#p/asriel3}{#e/asriel/1}不... 不！\n我不需要任何人！"
        ],
        saveTalk3: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}馬上停下！\n給我滾開！',
            '<20>{*}{#p/asriel3}{#e/asriel/10}聽見沒有？！',
            "<20>{*}{#p/asriel3}{#e/asriel/9}否則，\n看我不把你撕成碎片！"
        ],
        saveTalk4: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}你知道我為什麼\n這麼做嗎？\n$(name)...",
            '<20>{*}{#p/asriel3}{#e/asriel/7}為什麼我不停戰鬥，\n只為把你留下...？'
        ],
        saveTalk5: [
            "<20>{*}{#p/asriel3}{#e/asriel/7}因為...",
            "<20>{*}{#p/asriel3}{#e/asriel/8}你在我心中無可替代，\n$(name)。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}你是唯一一個\n真正理解我的人。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}更是唯一一個\n還願意陪我玩的人。"
        ],
        saveTalk6: [
            '<20>{*}{#p/asriel3}{#e/asriel/8}...',
            '<20>{*}{#p/asriel3}{#e/asriel/8}不...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}不只是這樣。",
            '<20>{*}{#p/asriel3}{#e/asriel/9}我... 我...',
            "<20>{*}{#p/asriel3}{#e/asriel/4}我是因為關心你，\n才這麼做的啊，\n$(name)！",
            '<20>{*}{#p/asriel3}{#e/asriel/3}我關心你\n勝過關心任何人！'
        ],
        saveTalk7: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}...',
            "<20>{*}{#p/asriel3}{#e/asriel/8}我還不想迎接結局。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}我還不想讓你離去。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}我還不想再次離開你。"
        ],
        saveTalk8: [
            '<20>{*}{#p/asriel3}{#e/asriel/10}{#i/8}{@random=1.1/1.1}所以，\n求求你...\n現在放手...',
            '<20>{*}{#p/asriel3}{#e/asriel/12}{#i/8}{@random=1.2/1.2}讓我贏吧！！！'
        ],
        cryTalk1: ['<20>{*}{#p/asriel3}{@random=1.1/1.1}停下！{^30}{%}'],
        cryTalk2: ['<20>{*}{#p/asriel3}{@random=1.1/1.1}馬上給我停下！！！{^40}{%}'],
        endStatus1: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk1: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}...', '<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)...'],
        endStatus2: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* Asriel...']),
        endTalk2: ["<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我好孤獨，\n$(name)..."],
        endStatus3: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk3: ["<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我好害怕，\n$(name)..."],
        endStatus4: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk4: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)，我...'],
        endStatus5: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* 都是我的錯...']),
        endTalk5: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我...']
    },
    b_opponent_lostsoul: {
        name: '* 迷失的靈魂',
        act_check_alphys: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂似乎非常喜歡科幻動漫。'
        ],
        act_check_asgore: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂似乎想讓你\n  好好活著。'
        ],
        act_check_papyrus: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂似乎夢想成為一名\n  皇家守衛。'
        ],
        act_check_sans: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂希望某人\n  能永遠幸福快樂。'
        ],
        act_check_toriel: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂似乎想竭盡所能\n  保護你。'
        ],
        act_check_undyne: () => [
            '<32>{#p/story}* 迷失的靈魂 - 攻擊??? 防禦???\n* 這個靈魂似乎很想教你\n  如何烹飪。'
        ]
    },
    b_opponent_lostsoul_a: {
        status1: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 迷失的靈魂出現了。'] : ['<32>{#p/basic}* 是Alphys和Undyne。'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的靈魂站在前方。']
                : ['<32>{#p/basic}* 嗯...\n  我有辦法讓他們馬上醒來。'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的靈魂調情。）', '<32>{#p/basic}* 突然間...！']
                    : ['<32>{#p/human}* （你向迷失的靈魂調情。）\n* （什麼都沒發生。）'],
            water: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂\n  給你倒一杯白開水。）',
                '<32>{#p/human}* （她有點失望，\n  但也感到十分親切...）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            punch: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂\n  給你倒一杯洋梅果酒。）',
                '<32>{#p/human}* （她有些不滿，\n  但也感到十分親切...）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            cocoa: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂\n  給你倒一杯熱巧克力。）',
                '<32>{#p/human}* （她十分滿足，\n  同時也感到十分親切...）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            tea: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂\n  給你倒一杯星花茶。）',
                '<32>{#p/human}* （她非常高興，\n  同時也感到十分親切...）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            lesson: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂教你下廚。）',
                "<32>{#p/human}* （她有點困惑，\n  但似乎蠻想言傳身教...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            trivia: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂出幾道\n  超級水的安保題目。）',
                "<32>{#p/human}* （她有些顧慮，但也很想試試看。）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            escort: (s: boolean) => [
                '<32>{#p/human}* （你請求迷失的靈魂\n  帶你穿過一片危險地帶。）',
                "<32>{#p/human}* （她猶豫了一下，\n  但覺得是個好主意。）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ]
        },
        assist: {
            text: ['<32>{#p/basic}* 你倆快點醒來...\n* 我剛找到一部新上映的喵喵電影！'],
            talk: [
                ["<11>{#p/undyne}{#e/undyne/13}等有空了\n我們一塊\n去看！"],
                ["<11>{#p/alphys}{#e/alphys/3}你在\n開玩笑嗎？？\n真有？？"]
            ]
        },
        fight: [
            [
                ['<11>{#p/undyne}{#e/undyne/4}沒想到你會\n下手這麼狠。'],
                ['<11>{#p/alphys}{#e/alphys/9}Undyne，\n當心啊！']
            ],
            [
                ['<11>{#p/undyne}{#e/undyne/4}呵，\n原來是你啊，\n還起了那麼個\n蠢名字。'],
                ['<11>{#p/alphys}{#e/alphys/12}我現在知道\n為什麼他們\n都管你叫\n「$(moniker4)」\n了。']
            ]
        ],
        flirt: [
            [
                ['<11>{#p/undyne}{#e/undyne/12}我發誓\n如果我們\n再戰一次...'],
                ['<11>{#p/alphys}{#e/alphys/35}嘖嘖。']
            ],
            [
                ['<11>{#p/undyne}{#e/undyne/5}你敢\n再向她調情\n試試？'],
                ['<11>{#p/alphys}{#e/alphys/35}喔，加油啊。']
            ]
        ],
        idle: [
            pager.create(
                1,
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/undyne}燃起了一股\n無法描述的\n感覺。"]
                        : ['<11>{#p/undyne}所有人類\n必須死。'],
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/undyne}大家，\n都需要我\n來守護！']
                        : ["<11>{#p/undyne}你就是\n怪物的公敵。"],
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/undyne}你們還得\n再加把勁。"]
                        : ['<11>{#p/undyne}弱者\n才需要憐憫。']
            ),
            pager.create(
                1,
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/alphys}看來，是高估\n你們的智商了。']
                        : ["<11>{#p/alphys}你想讓我死，\n不是嗎？"],
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/alphys}就那些東西，\n唬不到我。"]
                        : ["<11>{#p/alphys}我只是去做\n我的本職工作，\n有錯嗎？"],
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/alphys}只有我，\n親眼目睹了\n你們的\n一舉一動。']
                        : ["<11>{#p/alphys}我會永遠\n停滯不前，\n是嗎？"]
            )
        ],
        item: {
            tvm_mewmew: {
                text: [
                    "<32>{#p/human}* （你舉起喵喵玩偶\n  在迷失的靈魂眼前晃了晃。）",
                    '<32>{#p/basic}* 突然間...！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/41}呃，\n我不打擾，\n我走了哈。'],
                    ['<11>{#p/alphys}{#e/alphys/8}喔，\n原來你想讓我\n看這個。']
                ]
            },
            orange_soda: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這瓶汽水...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/20}對，她愛死\n這汽水了。'],
                    ["<11>{#p/alphys}{#e/alphys/10}原來\n我丟的汽水\n跑到你那裡\n去了！"]
                ]
            },
            spaghetti: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這盤意面...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ["<11>{#p/undyne}{#e/undyne/20}嘿，那是\nPapyrus的\n意面！"],
                    ['<11>{#p/alphys}{#e/alphys/36}我就說嘛，\n你肯定認得它。']
                ]
            },
            snack: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這包零食...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/41}肯定是\n我拿給你\n那包了。\n自家制的\n最棒了！'],
                    ['<11>{#p/alphys}{#e/alphys/6}你啥時候\n開始做零食了？']
                ]
            },
            starling_tea: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這杯調和茶...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/18}那是...\n我瞎想什麼呢。'],
                    ['<11>{#p/alphys}{#e/alphys/36}喔，\n喝茶時間到。']
                ]
            }
        },
        standard: [
            ['<11>{#p/undyne}{#e/undyne/41}嗯，其實，\n有的人類\n也挺酷的。'],
            ["<11>{#p/alphys}{#e/alphys/9}我們共患難\n這麼長時間，\n怎麼會懷疑\n彼此呢？"]
        ]
    },
    b_opponent_lostsoul_b: {
        status1: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的靈魂出現了。']
                : ['<32>{#p/basic}* Papyrus！\n* ...還有他的兄弟。'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的靈魂站在前方。']
                : ['<32>{#p/basic}* 啊，對了。\n* 我應該有辦法喚醒他倆...'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的靈魂調情。）', '<32>{#p/basic}* 突然間...！']
                    : ['<32>{#p/human}* （你向迷失的靈魂調情。）\n* （什麼都沒發生。）'],
            puzzle: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂給你出點謎題。）',
                "<32>{#p/human}* （他有點困惑，\n  但已經把謎題準備好了...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            hangout: (s: boolean) => [
                '<32>{#p/human}* （你邀請迷失的靈魂和你一起玩。）',
                "<32>{#p/human}* （他有點困惑，\n  但好像很高興...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            judgement: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂開始審判你。）',
                "<32>{#p/human}* （他有點困惑，\n  但很樂意這麼做...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            dinner: (s: boolean) => [
                '<32>{#p/human}* （你邀請迷失的靈魂共進晚餐。）',
                "<32>{#p/human}* （他有點困惑，\n  但感到格外熟悉...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ]
        },
        assist: {
            text: ['<32>{#p/basic}* 嘿，Papyrus！\n* 剛剛，Undyne任命你為皇家衛隊一員！'],
            talk: [
                ["<08>{#p/papyrus}{#e/papyrus/12}天哪，\n我終於當上\n皇家守衛啦！"],
                ['<11>{#p/sans}{#e/sans/2}我們只能\n祈禱美夢\n早日成真嚕。']
            ]
        },
        fight: [
            [
                ['<08>{#p/papyrus}{#e/papyrus/27}啊，\n我投-投降！'],
                ["<11>{#p/sans}{#e/sans/3}我就知道\n你會這麼做。"]
            ],
            [
                ['<08>{#p/papyrus}{#e/papyrus/21}SANS，\n你受傷了嗎？'],
                ["<11>{#p/sans}{#e/sans/3}別擔心，兄弟。\n一場夢而已。"]
            ]
        ],
        flirt: [
            [
                ['<08>{#p/papyrus}{#e/papyrus/13}即使到現在，\n你還是那麼\n愛我...'],
                ["<11>{#p/sans}{#e/sans/2}幹起這事來，\n你真是\n一發不可收，\n是吧？"]
            ],
            [
                ['<08>{#p/papyrus}{#e/papyrus/14}果然，\n那愛意不是\n衝我而來。'],
                ["<11>{#p/sans}{#e/sans/2}啥？\n下次多準備點\n月巖，\n能提升\n調情成功率喔。"]
            ]
        ],
        idle: [
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}原諒你，\n對我來說\n有點難..."]
                        : ['<08>{#p/papyrus}我一定要\n抓到個人類！'],
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}如果沒有他，\n我不知道\n該怎麼活..."]
                        : ['<08>{#p/papyrus}如果成功，\n所有人都會...'],
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}我不知道\n該找誰求助..."]
                        : ['<08>{#p/papyrus}...']
            ),
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ['<11>{#p/sans}...在這樣的\n一天裡，\n像你這樣的\n孩子...']
                        : ["<11>{#p/sans}我不可能\n一直保護你。"],
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ["<11>{#p/sans}某條時間軸裡，\n你把我殺了，\n對吧？"]
                        : ["<11>{#p/sans}遲早有一天，\n你要面臨死亡。"],
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ["<11>{#p/sans}你根本不配\n拯救我們。"]
                        : ["<11>{#p/sans}這裡\n不是你的家。"]
            )
        ],
        item: {
            berry: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這種水果...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/10}喔！\n有了這些水果，\n我們就能\n自製果酒了！'],
                    ["<11>{#p/sans}{#e/sans/2}不要像\n上次一樣\n搞砸喔。"]
                ]
            },
            spaghetti: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉這盤意面...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/10}你把我的面\n留到現在，\n就為了\n能喚醒我！？'],
                    ["<11>{#p/sans}{#e/sans/2}現在不都\n流行這樣嘛。"]
                ]
            },
            corndog: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉它的香味...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/16}我居然\n一直都不知道\n人類喜歡\n這玩意。'],
                    ['<11>{#p/sans}{#e/sans/2}能讓\n{@fill=#f00}熱{@fill=#000}情的{@fill=#f00}狗{@fill=#000}狗\n將抑{@fill=#f00}玉{@fill=#000}和萎{@fill=#f00}米{@fill=#000}\n一掃而空。']
                ]
            },
            corngoat: {
                text: [
                    '<32>{#p/human}* （某個靈魂好像很熟悉它的香味...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/16}什麼？？\n居然是\n玉米熱「羊」？'],
                    ["<11>{#p/sans}{#e/sans/0}這麼棒的玩笑，\n該好好\n表{@fill=#f00}羊{@fill=#000}你一下。"]
                ]
            },
            quiche: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這塊點心...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/22}居然是一塊\n「芝士」蛋糕？！'],
                    ["<11>{#p/sans}{#e/sans/2}這{@fill=#f00}芝士{@fill=#000}個\n蛋糕謎題。"]
                ]
            },
            fryz: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這杯飲料...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ["<08>{#p/papyrus}{#e/papyrus/27}這東西\n比火牆還熱！！"],
                    ["<11>{#p/sans}{#e/sans/2}夥計，\n你火了。"]
                ]
            },
            burgerz: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這種食物...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ["<08>{#p/papyrus}{#e/papyrus/21}這東西\n健康嗎？"],
                    ['<11>{#p/sans}{#e/sans/0}一石二鳥，\n一食二堡。']
                ]
            },
            burgerz_use1: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這種食物...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/24}我擔心你吃完\n會不舒服...'],
                    ['<11>{#p/sans}{#e/sans/2}剩最後一個了，\n想好再吃喔。']
                ]
            },
            burgerz_use2: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這種食物...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/18}哇，\n你把它們\n全吃了。'],
                    ['<11>{#p/sans}{#e/sans/3}要是漢堡能\n長生不老\n就好了。']
                ]
            }
        },
        standard: [
            ['<08>{#p/papyrus}{#e/papyrus/10}等等！\n不！\n我才不會\n抓你呢！'],
            ["<11>{#p/sans}{#e/sans/3}我們都\n指望你了，\n孩子。"]
        ]
    },
    b_opponent_lostsoul_c: {
        status1: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 迷失的靈魂出現了。'] : ['<32>{#p/basic}* 爸爸... 媽媽...'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的靈魂站在前方。']
                : ['<32>{#p/basic}* 嗯... 他們畢竟曾是我的父母，\n  那對我來說就好辦多了。'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的靈魂調情。）', '<32>{#p/basic}* 突然間...！']
                    : ['<32>{#p/human}* （你向迷失的靈魂調情。）\n* （什麼都沒發生。）'],
            call: (s: boolean) => [
                '<32>{#p/human}* （你給迷失的靈魂打了個電話。）',
                3 <= SAVE.data.n.cell_insult
                    ? '<32>{#p/human}* （她有點生氣，\n  但也十分懷念那種感覺。）'
                    : '<32>{#p/human}* （她十分高興，\n  同時很懷念那種感覺。）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            home: (s: boolean) => [
                '<32>{#p/human}* （你請求迷失的靈魂帶你回家。）',
                3 <= SAVE.data.n.cell_insult
                    ? "<32>{#p/human}* （她認為自己沒義務那麼做，\n  但不知怎地，想試一試...）"
                    : "<32>{#p/human}* （她有點猶豫，\n  但不知怎地，想試一試...）",
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            hug: (s: boolean) => [
                '<32>{#p/human}* （你給迷失的靈魂\n  一個大大的擁抱。）',
                '<32>{#p/human}* （他極力掩飾自己的情感，\n  但那舒服的感覺溫暖了他的心...）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ],
            agreement: (s: boolean) => [
                '<32>{#p/human}* （你讓迷失的靈魂\n  給你講講人怪停戰的故事。）',
                '<32>{#p/human}* （他想對此視而不見，\n  但最終還是脫口而出。）',
                ...(s ? ['<32>{#p/basic}* 突然間，記憶如潮水般湧回！'] : [])
            ]
        },
        assist: {
            text: ["<32>{#p/basic}* 爸爸... 媽媽...\n* 你們不記得我了嗎？"],
            talk: [['<11>{#p/toriel}{#e/toriel/9}我怎麼會忘。'], ['<11>{#p/asgore}{#e/asgore/8}$(name)？']]
        },
        fight: [
            [
                ['<11>{#p/toriel}{#e/toriel/9}我...\n我落得這下場，\n就是活該。'],
                ['<11>{#p/asgore}{#e/asgore/1}呃...\n沒想到會這樣。']
            ],
            [['<11>{#p/toriel}{#e/toriel/17}出不了事的，\nAsgore。'], ['<11>{#p/asgore}{#e/asgore/8}孩-孩子？！']]
        ],
        flirt: [
            [
                ['<11>{#p/toriel}{#e/toriel/1}孩子，\n這個場合...\n請別這麼幹。'],
                ['<11>{#p/asgore}{#e/asgore/6}還好我們現在\n分居了。']
            ],
            []
        ],
        idle: [
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}趁我\n毫無防備時\n殺了我...']
                        : ['<11>{#p/toriel}這都是\n為了你好。'],
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}本以為，\n自己努力\n保護的人，\n是你...']
                        : ['<11>{#p/toriel}我絕不會\n再讓人類\n離開。'],
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}一路上一直\n相信你的我，\n才是真正的\n傻子啊...']
                        : ['<11>{#p/toriel}...']
            ),
            pager.create(
                1,
                () =>
                    7 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/asgore}跟你講理，\n完全是\n浪費時間。']
                        : ['<11>{#p/asgore}人怪交戰\n在所難免。'],
                () =>
                    7 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/asgore}你就沒有\n更重要的事\n可做嗎？"]
                        : ['<11>{#p/asgore}我怎麼可能\n忘記呢？'],
                () => (7 <= SAVE.flag.n.genocide_milestone ? ['<11>{#p/asgore}開玩笑吧...'] : ['<11>{#p/asgore}...'])
            )
        ],
        item: {
            pie: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/0}果然！\n是奶油糖\n肉桂派！'],
                    ['<11>{#p/asgore}{#e/asgore/7}沒想到都過了\n這麼久了...']
                ]
            },
            pie2: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/0}果然！\n是蝸牛派！'],
                    ['<11>{#p/asgore}{#e/asgore/7}沒想到都過了\n這麼久了...']
                ]
            },
            pie3: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}我已經\n盡力了...'],
                    ['<11>{#p/asgore}{#e/asgore/6}真奇怪。\n這粥聞起來\n還挺香的！']
                ]
            },
            starling_tea: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這杯茶...）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/13}這茶香真是\n歷久彌新...'],
                    ['<11>{#p/asgore}{#e/asgore/21}一杯好茶，\n真是世間極品。']
                ]
            },
            snails: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉那道菜。）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}你居然\n一直沒吃？'],
                    ['<11>{#p/asgore}{#e/asgore/5}沒想到，\n居然還能\n再看到這菜。']
                ]
            },
            chocolate: {
                text: [
                    '<32>{#p/human}* （迷失的靈魂好像很熟悉這巧克力。）',
                    '<32>{#p/basic}* 突然間，記憶如潮水般湧回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}純黑巧克力...'],
                    ['<11>{#p/asgore}{#e/asgore/21}苦盡甘來嘛。']
                ]
            }
        },
        standard: [
            ['<11>{#p/toriel}{#e/toriel/1}加油吧，\n孩子...'],
            ['<11>{#p/asgore}{#e/asgore/6}我們的未來\n就指望你了！']
        ]
    },
    b_opponent_final: {
        name: '* 力場',
        status0: ['<32>{#p/story}* 此刻，你終於可以直面那道力場。'],
        act_check: [
            '<32>{#p/story}* 力場 - 攻擊0 防禦{^2}\u221e{^1}\n* 矛盾相逢，末路將窮。'
        ],
        status1: () =>
            SAVE.data.n.bully > 9
                ? ["<32>{#p/story}* 燃起鬥志！\n  把你揍人的勁兒都使出來吧。"]
                : ["<32>{#p/story}* 給這段旅程畫上圓滿的句號吧。"],
        status1x: ['<32>{#p/story}* 除了戰鬥，別無他法。'],
        status2: ['<32>{#p/story}* 力場上開始出現裂痕，\n  光芒越來越弱。'],
        status3: ['<32>{#p/story}* 力場即將崩潰。'],
        status4: ['<32>{#p/story}* 力場遲遲沒有破碎，\n  讓你有些意外。'],
        status5: ['<32>{#p/story}* 不太對勁。'],
        friend1: ["<20>{#p/asgore}{#e/asgore/5}怎麼了？"],
        friend2: ["<20>{#p/alphys}{#e/alphys/15}那道力場...\n怎麼還沒碎啊？！"],
        friend3: ['<20>{#p/asgore}{#e/asgore/12}{#e/alphys/4}...\n你知道原因嗎？'],
        friend4a: ["<20>{#p/alphys}{#e/alphys/6}是不是...\n人類沒使勁？", '{*}{#e/alphys/1}{%}'],
        friend4b: [
            "<20>{#p/alphys}不，不是這樣...",
            '<20>{#p/alphys}{#e/asgore/1}...',
            '<20>{#p/alphys}{#e/alphys/2}該不會...'
        ],
        friend5: ['<20>{#p/asgore}...什麼？'],
        friend6: [
            '<20>{#p/alphys}{#e/alphys/1}我-我檢查檔案日誌時，\n發現個怪事...',
            '<21>{#p/alphys}{#e/alphys/4}我發現...\n「靈勢矩陣」中的元素係數\n與理論值存在微小偏差。'
        ],
        friend7: ['<20>{#p/asgore}{#e/asgore/12}...啥意思？'],
        friend8: [
            '<20>{#p/alphys}就是說，\n有-有人入侵了\n六號檔案的系統。',
            "<20>{#p/alphys}{#e/asgore/1}隨後，竊取了\n部分人類靈魂的能量。",
            '<20>{#p/alphys}{#e/alphys/6}別-別著急，\n也可能只是傳感器\n出故障了...',
            "<20>{#p/alphys}{#e/alphys/1}不過...\n從結果來看..."
        ],
        friend9a: ['<20>{#p/asgore}{#e/asgore/1}不用說了。', '<20>{#p/asgore}{#e/asgore/2}明白了。'],
        friend9b: [
            '<20>{#p/asgore}{#e/asgore/5}我總擔心，\n指不定哪天，\n六號檔案就會被篡改...',
            '<20>{#p/asgore}{#e/asgore/5}沒想到真的一語成讖。'
        ],
        friend9c: ['<20>{#p/asgore}{#e/asgore/1}那現在怎麼辦？'],
        friend10: [
            '<20>{#p/alphys}...再等一個人類？',
            "<20>{#p/alphys}{#e/alphys/4}對-對不起...\n我想不到其他辦法...",
            '{*}{#e/asgore/8}{#e/alphys/9}{%}'
        ],
        friend11: ['<20>{#p/undyne}{#e/undyne/13}我有辦法啊！'],
        friend12: ['<20>{#p/alphys}{#e/alphys/10}Undyne，\n你-你來這\n幹-幹什麼？', '{*}{#e/undyne/0}{%}'],
        friend13: [
            "<20>{#p/undyne}{#e/undyne/1}{#e/alphys/8}{#e/asgore/1}該不會...\n是那破力場\n把你憋屈壞了吧？"
        ],
        friend14: ['<20>{|}{#p/alphys}{#e/alphys/6}Undyne，你怎麼-{%}'],
        friend15: ["<20>{#p/undyne}{#e/undyne/5}死力場，看我不把你\n揍個稀碎！"],
        friend16a: ['<20>{#p/alphys}{#e/alphys/3}{#e/asgore/6}Undyne！？！？'],
        friend16b: [
            '<20>{#p/undyne}{#e/undyne/4}我都懂，我都懂。\n只是想讓你好受點嘛。',
            '{*}{#e/alphys/1}{%}'
        ],
        friend17: () => [
            '<20>{#p/undyne}{#e/undyne/3}其實...\n是Sans喊我來的。',
'<20>{#p/undyne}{#e/undyne/3}剛剛，他去調查人類的下落，\n查清楚後，\n就把我喊了過來。',
            "<20>{#p/undyne}{#e/undyne/11}{#e/asgore/5}說實話，\n當時我還蠻意外的...\n但現在，我想開了。",
            "<20>{#p/undyne}{#e/undyne/13}這計畫能走通，\n我真為你高興！",
            ...(SAVE.data.b.undyne_respecc
                ? ["<20>{#p/undyne}{#e/undyne/0}昧著良心說自己\n喜歡人類也沒啥意思。\n但今天這孩子真的超讚。"]
                : [
                    "<20>{#p/undyne}{#e/undyne/0}昧著良心說自己\n喜歡人類也沒啥意思。\n但能大團圓，也挺好。"
                ]),
            '<20>{#p/undyne}{#e/undyne/15}{#e/asgore/6}可能...\n我這個大隊長，\n當得有點...'
        ],
        friend18: [
            "<20>{#p/alphys}{#e/alphys/32}嘿... 沒關係的。",
            "<20>{#e/alphys/31}你願意放下偏見，\n來到這裡，已經很棒了，\n你說是不？"
        ],
        friend19: ['<20>{#p/undyne}{#e/undyne/14}嘿，咱倆不是說好\n事成之後\n要一起看電影嗎？',
'<20>{#p/undyne}{#e/undyne/14}那我也不能讓你\n白高興一場啊！'],
        friend20: ['<20>{#p/alphys}{#e/alphys/33}...嘴一個？', '{*}{#e/asgore/5}{#e/undyne/19}{%}'],
        friend21: ['<20>{#p/asgore}{#e/asgore/5}呃。'],
        friend22: ['<20>{#p/undyne}{#e/undyne/6}現在？？？'],
        friend23: ['<20>{#p/alphys}{#e/alphys/34}對啊！'],
        friend24: ['<20>{#p/asgore}{#e/asgore/20}Alphys，\n這裡還有個孩子呢。'],
        friend25: ["<21>{#p/undyne}{#e/undyne/7}當著孩子的面親嘴，\n不太好吧？"],
        friend26: ['<32>{#p/alphys}{#e/alphys/32}...'],
        friend27: ['<20>{#p/undyne}{#e/undyne/10}...'],
        friend28: ['<20>{*}{#p/alphys}{#e/alphys/35}{#e/undyne/37}{#e/asgore/8}我就是要親。{^10}{%}'],
        friend29: ['<15>{*}{#p/papyrus}{#e/papyrus/22}等等！！！{^10}{%}', '{*}{#e/papyrus/20}{%}'],
        friend30: () => [
            "<20>{#p/mettaton}久等了，女士們。\n我們「兄弟會」也\n隆重登場了。",
            ...(SAVE.data.n.state_aerialis_basebully > 9
                ? [
                    '<20>{#p/mettaton}{#e/mettaton/1}...呦，這不是\n「$(moniker2u)」嘛！',
'<20>{#p/mettaton}{#e/mettaton/1}你要是感興趣，我請你\n當「兄弟會」的VIP喔。'
                ]
                : [])
        ],
        friend31: ["<20>{#p/napstablook}{#e/mettaton/2}{#e/alphys/15}{#e/asgore/1}{~}嘿，呃...\n我不算男生，\n為什麼也要跟過來..."],
        friend32a: [
            "<20>{#p/mettaton}{#e/mettaton/1}BLOOKY，我也【沒】說\n你在「兄弟會」裡啊...",
            "<20>{#p/mettaton}{#e/undyne/38}{#e/papyrus/21}其實，說是「兄弟會」，\n但裡面也就我跟\nPAPYRUS兩人而已。"
        ],
        friend32b: ['<20>{#p/napstablook}{~}喔......', "<20>{#p/napstablook}{~}那我等會再過來吧"],
        friend33: [
            '<20>{#p/undyne}{#e/undyne/19}{#e/mettaton/4}等等。',
            '<20>{#p/undyne}{#e/undyne/10}合著你倆也是一對？？？'
        ],
        friend34: [
            '<15>{#p/papyrus}{#e/papyrus/15}誠如斯言！',
            '<17>{#p/papyrus}{#e/papyrus/24}...這詞我今天\n第一次用，\n怕是以後用不上了。'
        ],
        friend35: () =>
            SAVE.data.b.a_state_hapstablook
                ? ["<20>{#p/undyne}{#e/undyne/17}原來你充滿電之後，\n跑去約會了..."]
                : ['<20>{#p/undyne}{#e/undyne/17}原來你說的「正事」，\n就是跑去約會...'],
        friend36: [
            '<20>{#p/mettaton}{#e/mettaton/1}{#e/asgore/6}{#e/papyrus/20}那~必須滴！',
'<20>{#p/mettaton}{#e/mettaton/1}{#e/asgore/6}{#e/papyrus/20}剛才，我倆還尋思\n第一天在一起，\n咋享受呢。'
        ],
        friend37: ['<20>{#p/alphys}{#e/alphys/34}{#e/undyne/1}{#e/mettaton/4}誒嘿嘿。\n我有個點子，\n你倆要不要聽聽。'],
        friend38: [
            "<20>{#p/undyne}{#e/undyne/19}{#e/asgore/1}呃，Alphys。\n我覺得，他倆不可能\n真成一對的。"
        ],
        friend39: ['<20>{#p/alphys}{#e/alphys/8}喔。'],
        friend40: [
            "<15>{#p/papyrus}{#e/papyrus/10}{#e/undyne/0}咱都到力場下了，\n就好好玩一會唄！",
            '<15>{#e/mettaton/2}{#e/papyrus/28}你喜歡那些\n充滿「異域風情」的地方，\n我懂的...',
            '{*}{#e/alphys/7}{#e/asgore/5}{%}'
        ],
        friend41: [
            '<20>{#p/mettaton}{#e/mettaton/2}喔，PAPYRUS，\n咱倆真是心有靈犀。',
            "<20>{#p/mettaton}{#e/mettaton/1}{#e/papyrus/13}我最喜歡的事，\n就是凝望這無盡虛空。",
            '<20>{|}{#p/mettaton}{#e/mettaton/3}{#e/papyrus/21}這時，我就想起\n生命的奧義，\n宇宙的美麗，還有- {%}'
        ],
        friend42: ['<20>{#p/sans}{#e/sans/2}{#e/undyne/21}{#e/alphys/8}大夥好呀。'],
        friend43: ['<15>{#p/papyrus}{#e/papyrus/10}{#e/mettaton/3}兄弟，好久不見！'],
        friend44: [
            '<16>{#p/papyrus}{#e/sans/0}{#e/papyrus/26}看來...\n我的搭檔對「結婚」\n沒啥經驗。'
        ],
        friend45: ['<20>{#p/sans}{#e/alphys/7}嘿。asgore，\n你好呀。'],
        friend46: ['<20>{#p/asgore}{#e/asgore/6}{#e/papyrus/20}哈囉，Sans。\n你也來了，真好。'],
        friend47: [
            "<20>{#p/sans}{#e/sans/3}你瞧...\n這兒這麼熱鬧，\n我肯定要順道看看嚕。",
            '<20>{#p/sans}{#e/sans/0}不過先別管我。',
            "<20>{#p/sans}{#e/sans/2}有個人你肯定想見見，\n我把「她」請過來了。"
        ],
        friend48: [
            '<20>{#p/asgore}{#e/sans/0}{#e/undyne/3}{#e/asgore/8}{#e/papyrus/26}Tori...！',
            '<20>{#p/asgore}{#e/asgore/6}你回來了。',
            '<20>{#p/asgore}{#e/asgore/1}...'
        ],
        friend49a: [
            '<20>{#p/toriel}{#e/asgore/5}{#e/toriel/9}...',
            '<21>{#p/toriel}{#e/toriel/13}你做的那些...\nSans都跟我說了。'
        ],
        friend50a: ["<20>{#p/alphys}{#e/undyne/4}{#e/alphys/8}瞅我幹嘛，\n我可沒洩露秘密。"],
        friend51a: [
            "<20>{#p/sans}{#e/sans/0}我可以作證。",
            "<20>{#p/sans}{#e/sans/2}{#e/alphys/10}{#e/asgore/6}{#e/toriel/9}只是，alphys，\n你撒謊的技術\n實在太爛了。"
        ],
        friend52a1: [
            '<20>{#p/asgore}{#e/undyne/0}{#e/sans/0}{#e/alphys/36}{#e/papyrus/20}我瞞了這麼多，\n以為會被民眾唾罵，\n甚至引發暴動...'
        ],
        friend52a2: [
            '<20>{#p/toriel}{#e/toriel/13}{#e/asgore/1}說實話，一開始，\n聽說你有事瞞著我，\n真挺生氣的...',
            '<20>{#p/toriel}{#e/toriel/13}{#e/papyrus/21}{#e/alphys/7}後來轉念一想，\n事情落到這地步，\n我也有錯。',
            '<20>{#p/toriel}{#e/toriel/9}...不該把責任\n全推給你，Asgore。'
        ],
        friend52a3: ['<20>{#p/asgore}{#e/asgore/2}明白了。'],
        friend53a: [
            '<20>{#p/undyne}{#e/undyne/1}{#e/papyrus/20}你就想嘛，\n怪物們再恨人類，\n也不可能見人就殺吧？'
        ],
        friend49b: [
            '<20>{#p/toriel}{#e/toriel/12}...',
            '<21>{#p/toriel}{#e/sans/3}{#e/asgore/2}{#e/undyne/4}{#e/toriel/11}{#e/papyrus/21}{#e/alphys/15}Asgore，\n為什麼不早點告訴我，\n自己在保護人類呢？'
        ],
        friend50b: ["<20>{#p/alphys}{#e/alphys/7}...現在誤會解開了，\n不也挺好的嘛？"],
        friend51b: [
            '<20>{#p/sans}{#e/sans/0}{#e/undyne/3}是啊，tori。\n別上火了，開心一點嘛。',
            "<20>{#p/sans}{#e/sans/2}{#e/alphys/8}{#e/asgore/5}{#e/toriel/13}asgore不也是\n出於好意嘛？"
        ],
        friend52b1: [
            '<20>{#p/asgore}{#e/undyne/0}{#e/sans/0}{#e/asgore/2}{#e/alphys/36}不，不。\n她生我的氣，我不怪她。',
            '<20>{#e/sans/3}{#e/asgore/3}這秘密我藏著掖著...\n不跟她說...\n也不跟大夥說...'
        ],
        friend52b2: ["<20>{#p/undyne}{#e/undyne/1}{#e/asgore/1}你不是有苦衷嘛。"],
        friend52b3: [
            '<20>{#p/asgore}{#e/undyne/17}{#e/alphys/8}{#e/toriel/9}{#e/asgore/2}{#e/papyrus/27}也許吧，\n不好說算不算苦衷。'
        ],
        friend53b: ['<20>{#p/undyne}{#e/undyne/1}還是那句話，\n我們再恨人類，\n也不可能見人就殺吧？'],
        friend54: [
            '<20>{#p/alphys}{#e/asgore/5}{#e/undyne/17}{#e/alphys/8}{#e/toriel/13}可Undyne，\n你不是一見到這孩子，\n就到處追殺嗎？'
        ],
        friend55: ['<20>{#p/toriel}{#e/undyne/18}{#e/toriel/3}{#e/asgore/5}她...\n幹了什麼？'],
        friend56: () =>
            SAVE.data.b.undyne_respecc
                ? ['<20>{#p/undyne}{#e/undyne/9}{#e/toriel/4}我啥也沒幹啊！！！']
                : ["<20>{#p/undyne}{#e/undyne/13}{#e/toriel/4}你放心，\n我現在不殺人了。"],
        friend57: () =>
            SAVE.data.b.undyne_respecc
                ? ['<20>{#p/toriel}{#e/toriel/15}{#e/asgore/6}...真的嗎，\n大姐？']
                : ['<20>{#p/toriel}{#e/toriel/15}{#e/asgore/6}...等會我好好問問，\n大姐。'],
        friend58: ['<20>{#p/alphys}{#e/alphys/33}咳咳，\n「姐」什麼「姐」啊，\n她可是有對象的人了。'],
        friend59: [
            "<20>{#p/undyne}{#e/undyne/10}{#e/sans/4}{#e/toriel/12}Alphys！！\n咱倆到現在\n還沒共進過晚餐呢！"
        ],
        friend60: ['<20>{#p/alphys}{#e/alphys/34}共進晚餐？\n那我肯定不吃主食，\n直接奔著甜品去了。'],
        friend61: ['<15>{#p/papyrus}{#e/undyne/19}{#e/papyrus/19}{#e/asgore/4}{#e/sans/5}{#e/alphys/40}我滴媽呀！！！'],
        friend62: [
            '<20>{#p/undyne}{#e/undyne/38}{#e/sans/0}{#e/asgore/1}{#e/toriel/13}{#e/papyrus/20}...等一下。',
            '<20>{#p/undyne}{#e/undyne/18}{#e/papyrus/21}Papyrus，\n你是咋找到這兒的？'
        ],
        friend63: [
            '<15>{#p/papyrus}{#e/papyrus/10}喔，想起來了！\n當時，我正跟METTATON\n聊天，聊完後...',
            '<15>{#p/papyrus}{#e/papyrus/20}有顆黃色小星星\n突然冒出來，\n讓我倆來這。',
            '<15>{#p/papyrus}{#e/papyrus/21}{#e/alphys/9}{#e/sans/1}它好像...\n還挺著急的。'
        ],
        friend64: ['<20>{#p/toriel}{#e/toriel/9}{#e/asgore/12}是Twinkly。'],
        friend65: [
            '<20>{#p/undyne}{#e/alphys/15}Twinkly？',
            "<20>{#p/undyne}{#e/alphys/28}{#e/undyne/37}{#e/toriel/3}Twinkly是誰？"
        ],
        friend66: () =>
            SAVE.flag.n.genocide_milestone < 7
                ? [
                    ['<20>{#p/twinkly}{#e/twinkly/5}{#v/0}哈囉。', '<20>{#e/twinkly/7}{#v/0}各位，想我了沒？'],
                    [
                        "<20>{#p/twinkly}{#e/twinkly/11}{#v/0}哎呀，真不好意思呢...\n存檔是不是壞掉了呀？",
                        '<20>{#p/twinkly}{#e/twinkly/11}{#v/0}嘻嘻嘻...',
                        "<20>{#p/twinkly}{#e/twinkly/2}{#v/1}活該。"
                    ],
                    ['<20>{#p/twinkly}{#e/twinkly/7}{#v/0}不好意思呢。\n但現在，\n整個世界，我說了算。']
                ][Math.min(SAVE.flag.n.pa_twinkly1++, 2)]
                : [
                    [
                        '<20>{#p/twinkly}{#e/twinkly/5}{#v/0}親愛的$(name)，\n好久不見。',
                        "<20>{#e/twinkly/7}{#v/0}是不是想死我了？",
                        "<20>{#e/twinkly/11}{#v/0}希望我沒讓你\n掃興呢...",
                        '<20>{#e/twinkly/2}{#v/1}告訴你，\n我可被你折磨得夠嗆。'
                    ],
                    [
                        "<20>{#p/twinkly}{#e/twinkly/11}{#v/0}怎麼啦？\n想把存檔要回去？",
                        '<20>{#p/twinkly}{#e/twinkly/11}{#v/0}喔...',
                        "<20>{#p/twinkly}{#e/twinkly/2}{#v/1}沒想到啊，$(name)...\n你咋能蠢成這樣呢？"
                    ],
                    ['<20>{#p/twinkly}{#e/twinkly/7}{#v/0}不好意思呢，$(name)。\n但現在，\n整個世界，我說了算。']
                ][Math.min(SAVE.flag.n.pa_twinkly1++, 2)],
        friend67: (unique: string[]) => [
            '<20>{#e/twinkly/11}{#v/0}嘻嘻嘻...',
            '<20>{#e/twinkly/11}{#v/0}趁著你們談笑風生...',
            '<20>{#e/twinkly/5}{#v/0}我把六號檔案的\n控制權奪過來了！',
            '<20>{#e/twinkly/10}{#v/0}現在，你辛辛苦苦\n收集的靈魂之力，\n都是我的啦！',
            "<20>{#e/twinkly/9}{#v/0}沒了力量，\n你能打破力場就怪了。",
            "<20>{#e/twinkly/11}{#v/0}真是悲慘呢，\n此情此景，\n要不要吟詩一首呢？",
            "<20>{#e/twinkly/7}{#v/0}別急，\n還有更棒的呢。",
            '<20>{#e/twinkly/6}{#v/0}...',
            "<20>{#e/twinkly/5}{#v/0}更棒的是，\n這一切，都是你的錯。",
            ...(30 <= SAVE.data.n.bully
                ? [
                    "<20>{#e/twinkly/5}{#v/0}是你，給他們洗腦，\n讓他們對你好。",
                    '<20>{#e/twinkly/8}{#v/0}一路上，\n你揍他們，你欺負他們，\n你把他們打得半死...',
                    '<20>{#e/twinkly/8}{#v/0}看他們要死了，\n你就停手，\n讓他們苟活...'
                ]
                : [
                    "<20>{#e/twinkly/5}{#v/0}是你，善待他們，\n讓他們對你好。",
                    '<20>{#e/twinkly/8}{#v/0}一路上，\n你傾聽他們的煩惱...',
                    '<20>{#e/twinkly/8}{#v/0}鼓勵他們...\n關心他們...'
                ]),
            ...(1 <= SAVE.flag.n.killed_sans
                ? [
                    '<20>{#e/twinkly/8}{#v/0}...',
                    '<20>$(name)，我記得...',
                    '<20>{#e/twinkly/5}在某條時間軸裡，\n我們倆同心協力\n殺死每一個人。',
                    ...(SAVE.flag.b.confront_twinkly
                        ? [
                            '<20>{#e/twinkly/6}{#v/0}可是...\n你卻背叛我，\n自己跑去當「老好人」。',
                            '<20>{#e/twinkly/8}{#v/0}這樣，\n你就能在這些廢物面前\n逞英雄。',
                            '<20>{#e/twinkly/7}{#v/0}好一個「最好的朋友」啊。'
                        ]
                        : [
                            [
                                '<20>{#e/twinkly/8}沒錯，咱倆是沒走幾步，\n可你就因此把我們的\n願景忘了，是吧？',
                                "<20>{#e/twinkly/8}沒錯，咱倆是沒走多遠，\n可你就因此把我們的\n願景忘了，是吧？",
                                "<20>{#e/twinkly/8}沒錯，咱是離終點還遠，\n可你就因此把我們的\n願景忘了，是吧？",
                                '<20>{#e/twinkly/8}咱倆都走那麼遠了，\n你卻...',
                                '<20>{#e/twinkly/8}咱倆都快成功了，\n你卻...'
                            ][Math.min(SAVE.flag.n.genocide_milestone, 4)],
                            '<20>{#e/twinkly/5}{#v/0}本以為，\n我們會形影不離。',
                            '<20>{#e/twinkly/6}{#v/0}可時代變了。',
                            '<20>{#e/twinkly/11}{#v/0}你成了軟蛋！',
                            '<20>{#e/twinkly/7}{#v/0}你放棄了。'
                        ]),
                    "<20>{#e/twinkly/9}{#v/0}呵呵，\n真自以為是啊。",
                    '<20>{#e/twinkly/5}殺了人，又跑回來\n當「老好人」，是不是\n覺得自己可了不起了？',
                    '<20>{#e/twinkly/6}{#v/0}真噁心。',
                    '<20>{#e/twinkly/7}{#v/0}$(name)，\n有點自知之明吧。',
                    '<21>{#e/twinkly/2}{#v/1}想救朋友？\n門都沒有。'
                ]
                : 30 <= SAVE.data.n.bully
                    ? ["<20>{#e/twinkly/5}{#v/0}你不知道，這麼做\n根本屁用沒有嗎？"]
                    : ["<20>{#e/twinkly/5}{#v/0}沒有這些，\n你的朋友絕不會\n來到這裡。"]),
            '<20>{#e/twinkly/11}{#v/0}嘻嘻嘻...',
            '<20>{#e/twinkly/6}{#v/0}啥？',
            '<20>想知道，我這麼做圖啥？',
            ...(unique.length > 2
                ? [
                    '<20>{#e/twinkly/5}{#v/0}...呵，別裝傻了。',
                    '<20>{#e/twinkly/5}{#v/0}先問問你自己。',
                    "<20>{#e/twinkly/11}{#v/0}你不也喜歡\n體驗各種結局嘛...",
                    '<20>{#e/twinkly/7}{#v/0}你不也為了滿足好奇心，\n玩弄他們的生命嘛。',
                    "<20>{#e/twinkly/8}{#v/0}...哈？\n你不記得了？\n那我幫你回憶回憶。",
                    {
                        dark_death: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nUndyne和Alphys\n聯合追殺你...',
                        dark_undyne: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nAlphys回到了\nBratty和Catty身邊...',
                        dark_alphys: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n幾乎所有重要的人，\n都死於你手...',
                        dark_alphys_therapy:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nSans和Papyrus\n一起開了家療養院...',
                        dark_alphys_virtual:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nPapyrus和Alphys\n躲進了虛擬空間...',
                        dark_mew:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n憤怒喵喵讓大夥都\n沉浸在她的怪癖中...',
                        dark_charles:
                            "<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nCharles讓每個人都\n心想事成...",
                        dark_blooky:
                            "<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nMettaton的粉絲自發\n組建起一個反人類聯盟...",
                        dark_generic: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n前哨站成立了\n「皇家防衛署」...',
                        dark_aborted:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nNapstablook詛咒你\n死後「萬劫不復」...',
                        light_ultra:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nPapyrus抓到了你，\n最終當上了皇家守衛...',
                        light_undyne: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nAlphys迫於壓力，\n把其他人類藏了起來...',
                        light_runaway: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n民眾意外知道了\n那些人類的去向...',
                        light_toriel: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nToriel從大眾視野裡\n消失了...',
                        light_dog: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n犬衛隊成了前哨站的\n實際統治力量...',
                        light_muffet: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nMuffet奪取權力，\n成為無情的獨裁者...',
                        light_papyrus:
                            '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\n「友誼就是魔法」成了現實...',
                        light_sans: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nSans當上了國王...',
                        light_generic: '<20>{#e/twinkly/5}{#v/0}第一個結局裡，\nTerrestria當選女王...'
                    }[unique[0]]!,
                    {
                        dark_death: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nUndyne和Alphys\n聯合追殺你，',
                        dark_undyne: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nAlphys回到了\nBratty和Catty身邊，',
                        dark_alphys: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n幾乎所有重要的人，\n都死於你手，',
                        dark_alphys_therapy:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nSans和Papyrus\n一起開了家療養院，',
                        dark_alphys_virtual:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nPapyrus和Alphys\n躲進了虛擬空間，',
                        dark_mew:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n憤怒喵喵讓大夥都\n沉浸在她的怪癖中。',
                        dark_charles:
                            "<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nCharles讓每個人都\n心想事成。",
                        dark_generic: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nMettaton的粉絲自發\n組建起一個反人類聯盟。',
                        dark_blooky:
                            "<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n前哨站成立了\n「皇家防衛署」。",
                        dark_aborted:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nNapstablook詛咒你\n死後「萬劫不復」。',
                        light_ultra:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nPapyrus抓到了你，\n最終當上了皇家守衛，',
                        light_undyne: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nAlphys迫於壓力，\n把其他人類藏了起來。',
                        light_runaway: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n民眾意外知道了\n那些人類的去向。',
                        light_toriel: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nToriel從大眾視野裡\n消失了。',
                        light_dog: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n犬衛隊成了前哨站的\n實際統治力量。',
                        light_muffet: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nMuffet奪取權力，\n成為無情的獨裁者。',
                        light_papyrus:
                            '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\n「友誼就是魔法」成了現實。',
                        light_sans: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nSans當上了國王。',
                        light_generic: '<20>{#e/twinkly/5}{#v/0}...而在最後一個結局，\nTerrestria當選女王。'
                    }[unique[unique.length - 1]]!,
                    "<20>{#e/twinkly/7}{#v/0}你把他們當兒戲，\n玩弄他們時多開心啊。",
                    "<20>{#e/twinkly/5}{#v/0}現在，\n也讓我體驗體驗。"
                ]
                : [
                    "<20>{#e/twinkly/8}{#v/0}...你咋這麼蠢呢？",
                    '<20>{#e/twinkly/6}{#v/0}不管是你，我，\n還是身邊的一切...',
                    "<21>{#e/twinkly/5}{#v/0}都是一場「遊戲」的\n玩家。",
                    '<20>{#e/twinkly/11}{#v/0}要是我乖乖讓你們走，\n你就「贏了」，\n就「幸福」了。',
                    '<20>{#e/twinkly/11}你要是「贏了」，\n誰還來陪我「玩」呢？',
                    '<20>{#e/twinkly/7}{#v/0}那時，\n我可怎麼辦呢？',
                    '<20>{#e/twinkly/5}{#v/0}所以，\n我不會讓遊戲結束。'
                ]),
            "<20>{#e/twinkly/8}{#v/0}我就把「勝利」放你面前，\n然後，當你伸手\n去夠它的時候...",
            '<20>{#e/twinkly/2}{#v/1}{@random=1.1/1.1}「咔嚓！」\n勝利沒了，\n讓我撕碎了。',
            '<20>{#e/twinkly/14}{#v/1}{@random=1.1/1.1}你再夠，我再撕。\n一遍，一遍，\n又一遍...',
            '<20>{#e/twinkly/5}{#v/0}嘻嘻嘻。',
            '<20>{#e/twinkly/5}{#v/0}{#v/0}聽好了。',
            ...(30 <= SAVE.data.n.bully
                ? [
                    '<20>{#e/twinkly/5}{#v/0}你要是打敗了我...',
                    "<20>{#e/twinkly/5}{#v/0}我就把「完美結局」\n讓給你，\n讓「好朋友」們活下來。"
                ]
                : [
                    '<20>{#e/twinkly/5}{#v/0}你要是打敗了我...',
                    "<20>{#e/twinkly/5}{#v/0}我就把「幸福結局」\n讓給你，\n讓你和好友團聚。"
                ]),
            "<20>{#e/twinkly/5}{#v/0}然後，打碎力場。",
            '<20>{#e/twinkly/5}{#v/0}讓所有人獲得幸福。',
            "<20>{#e/twinkly/9}{#v/0}不過，\n想贏我，做夢去吧！",
            
            "<20>{#e/twinkly/5}{#v/0}即使，我要陪你\n耗到時間盡頭..."
        ],
        friend68: ['<20>{#e/twinkly/0}{#v/1}{@random=1.1/1.1}我也會想方設法，\n殺了你，困死你，\n折磨死你！{%20}'],
        friend69: ['<20>{#e/twinkly/8}{#v/0}怎麼回事？'],
        friend70: [
            '<20>{#p/asgore}{#e/asgore/1}年輕人，別害怕...',
            '<20>{#e/asgore/2}...我們會守護你！'
        ],
        friend71: [
            "<15>{#p/papyrus}{#e/papyrus/1}沒錯！\n人類，你一定能贏！",
            '<15>{#e/papyrus/1}我永遠相信你，\n所以，你也要...',
            '<15>{#e/papyrus/2}相信自己！！！'
        ],
        friend72: [
            '<20>{#p/undyne}{#e/undyne/11}哈，你連我都不怕，\n還會怕它？',
            "<20>{#e/undyne/11}所以別擔心...",
            "<20>{#e/undyne/13}我們永遠支援你！"
        ],
        friend73: [
            "<20>{#p/sans}{#e/sans/1}喔？\n還沒打倒那玩意呢？",
            "<20>{#e/sans/2}拜託，\n就這奇葩，啥也不是。"
        ],
        friend74: [
            "<20>{#p/alphys}{#e/alphys/1}按理說，\n你肯定打不過他...",
            '<20>{#e/alphys/2}但-但我總覺得...\n你能行的！！'
        ],
        friend75: [
            '<20>{#p/toriel}{#e/toriel/1}孩子...',
            '<20>{#e/toriel/2}世界上最乖，\n最可愛的孩子...',
            '<20>{#e/toriel/3}可不能在這時候\n放棄啊！'
        ],
        friend76: "老兄，\n你能行的！", 
        friend77: () => (SAVE.data.n.bully < 30 ? '*有力的\n 口哨聲*' : '*膽怯的\n 口哨聲*'), 
        friend78: () => (SAVE.data.n.bully < 30 ? '閃亮亮，\n亮閃閃！' : "你很爛，\n不過他\n更爛。"), 
        friend79: '快揍扁\n這個\n抽象玩意！', 
        friend80: () => (SAVE.data.n.bully < 30 ? '啦啦啦~' : '嗚-嗚，\n嗚-嗚'), 
        friend81: '別輸給他。', 
        friend82: () => (SAVE.data.n.bully < 30 ? '同心協力。' : '把揍人的勁\n使出來吧。'), 
        friend83: () => (SAVE.data.n.bully < 30 ? '小傢伙，\n讓他瞧瞧\n你的厲害！' : '上吧，\n小惡霸。'), 
        friend84: () => (SAVE.data.n.bully < 30 ? "有我們\n支援你！" : '我們咋\n還有點\n喜歡你了？'), 
        friend85: () => (SAVE.data.n.bully < 30 ? '使出你的\n真本事，\n好嗎？' : '讓他\n見識見識\n你的拳頭。'), 
        friend86a: '呱呱。', 
        friend86b: "別放棄！", 
        friend87: [
            '<20>{#p/twinkly}{#e/twinkly/17}呃啊啊...\n不！',
            '<20>{#e/twinkly/16}難以置信！！',
            "<20>{#e/twinkly/15}這怎麼可能...！",
            '<20>{#e/twinkly/16}你們... 你們...！'
        ],
        friend88: ["<20>{#p/twinkly}{#e/twinkly/2}真不敢相信\n你們都這麼愚蠢。"],
        friend89: ['<20>{*}你們所有人的靈魂\n都歸我了！！！！！{^40}{%}'],
        friend90: () =>
            1 <= SAVE.flag.n.killed_sans
                ? ['<20>{#p/asriel1}果然...', '<20>這種感覺，\n比上次好太多了。']
                : ['<20>{#p/asriel1}終於。', '<20>當星星那麼久\n真是受夠了。'],
        friend91: ['<20>{#p/asriel1}哈囉！', '<20>你在那裡嗎，\n$(name)？', "<20>是我啊，你最好的朋友："],
        friend92: '<99>{*}{#p/asriel3}{#v/1}{#i/12}ASRIEL DREEMURR{^10}{#p/event}{%}'
    },
    b_opponent_finalasgore: {
        name: '* Asgore',
        death1: [
            '<11>{*}{#p/asgore}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}...這就是\n我的歸宿了...',
            '<11>{*}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}...',
            '<11>{*}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}取走我的靈魂，\n離開這片\n詛咒之地吧...',
            '<11>{*}{#e/asgore/1}{#v/2}{#i/10}{@random=1.1/1.1}這樣...',
            '<11>{*}{#e/asgore/1}{#v/2}{#i/10}{@random=1.1/1.1}我們就\n永遠不會\n再拖累你了...',
            '<11>{*}{#e/asgore/2}{#v/3}{#i/10}{@random=1.1/1.1}...',
            '<11>{*}{#e/asgore/2}{#v/3}{#i/12}{@random=1.1/1.1}永別了...'
        ]
    },

    i_archive: { battle: { description: '', name: '' }, drop: [], info: [], name: '無', use: [] },
    i_archive_berry: {
        battle: { description: '3 HP。', name: '洋梅' },
        drop: ['<32>{#p/human}* （你把洋梅扔掉了。）'],
        info: ['<32>{#p/human}* （3 HP。）'],
        name: '洋梅',
        use: ['<32>{#p/human}* （你吃掉了洋梅。）']
    },
    i_archive_candy: {
        battle: { description: '4 HP。', name: '糖果' },
        drop: ['<32>{#p/human}* （你把怪物糖果扔掉了。）'],
        info: ['<32>{#p/human}* （4 HP。）'],
        name: '怪物糖果',
        use: ['<32>{#p/human}* （你吃掉了怪物糖果。）']
    },
    i_archive_rations: {
        battle: { description: '5 HP。', name: '口糧' },
        drop: ['<32>{#p/human}* （你把口糧扔掉了。）'],
        info: ['<32>{#p/human}* （5 HP。）'],
        name: '口糧',
        use: ['<32>{#p/human}* （你吃掉了口糧。）']
    },
    i_archive_tzn: {
        battle: { description: '6 HP。', name: '太空豆腐' },
        drop: ['<32>{#p/human}* （你把太空豆腐扔掉了。）'],
        info: ['<32>{#p/human}* （6 HP。）'],
        name: '太空豆腐',
        use: ['<32>{#p/human}* （你吞下了太空豆腐。）']
    },
    i_archive_nice_cream: {
        battle: { description: '7 HP。', name: '冰意靈' },
        drop: ['<32>{#p/human}* （你把冰意靈扔掉了。）'],
        info: ['<32>{#p/human}* （7 HP。）'],
        name: '冰意靈',
        use: [
            '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
            "<32>{#p/human}* （上面有一幅全息圖像，\n  刻畫了一個哭泣的孩子。）"
        ]
    },
    i_archive_healpak: {
        battle: { description: '8 HP。', name: '治療包' },
        drop: ['<32>{#p/human}* （你把治療包扔掉了。）'],
        info: ['<32>{#p/human}* （8 HP。）'],
        name: '治療包',
        use: ['<32>{#p/human}* （你使用了治療包。）']
    },
    i_big_dipper: {
        battle: {
            description: '一把巨勺，由本星系\n最好的合金材料製成。',
            name: '大熊座'
        },
        drop: ['<32>{#p/human}* （你把大熊座扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15攻擊。）']
                : ['<32>{#p/basic}* 「大熊座」 （15攻擊）\n* 一把巨勺，由本星系\n  最好的合金材料製成。'],
        name: '大熊座',
        use: ['<32>{#p/human}* （你裝備上了大熊座。）']
    },
    i_heart_locket: {
        battle: {
            description: '上面刻著「永遠都是好朋友」。',
            name: '心形掛墜'
        },
        drop: () => [
            '<32>{#p/human}* （你把心形掛墜扔掉了。）',
            ...(SAVE.data.b.svr || world.darker || SAVE.data.b.ufokinwotm8
                ? []
                : ['<32>{#p/basic}* ...', "<32>{#p/basic}* 我就當什麼都沒看見。"])
        ],
        info: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （15防禦。）']
                : ['<33>{#p/basic}* 「心形掛墜」 （15防禦）\n* 上面刻著「永遠都是好朋友」。'],
        name: '心形掛墜',
        use: ['<32>{#p/human}* （你戴上了心形掛墜。）']
    },
    i_starling_tea: {
        battle: {
            description: '好王配好茶。',
            name: '星花茶'
        },
        drop: ['<32>{#p/human}* （你把星花茶全倒掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （99 HP。）']
                : ['<32>{#p/basic}* 「星花茶」 回復99 HP\n* 好王配好茶。'],
        name: '星花茶',
        use: ['<32>{#p/human}* （你將星花茶一飲而盡。）']
    },

    k_hangar: {
        name: '停機坪門禁卡',
        description: "用來解除前哨站停機坪的門禁。"
    },

    k_skeleton: {
        name: '骨鑰',
        description: () =>
            SAVE.data.b.s_state_sansdoor
                ? "用它解鎖了Sans房間的門。"
                : '在首塔的最終長廊，\nSans將它交給了你。'
    },

    s_save_citadel: {
        c_elevator1: { name: '首塔', text: [] },
        c_courtroom: { name: '最終長廊', text: [] },
        c_road2: { name: '行宮', text: [] },
        c_archive_start: { name: 'e586b3e5bf83', text: [] },
        c_archive_path1: { name: 'e88090e5bf83', text: [] },
        c_archive_path2: { name: 'e58b87e6b0a3', text: [] },
        c_archive_path3: { name: 'e6ada3e79bb4', text: [] },
        c_archive_path4: { name: 'e6af85e58a9b', text: [] },
        c_archive_path5: { name: 'e59684e889af', text: [] },
        c_archive_path6: { name: 'e6ada3e7bea9', text: [] },
        c_exit: { name: '終點', text: [] }
    }
};


// END-TRANSLATE
