import { asrielinter, epilogueOverride } from '../../../code/common';
import { blookGone, dateready, papreal, roomready, solo, trueSpaghettiState } from '../../../code/starton/extras';
import { game, renderer } from '../../../code/systems/core';
import {
    battler,
    calcHP,
    calcLV,
    choicer,
    fetchCharacters,
    instance,
    pager,
    player,
    postSIGMA,
    roomKills,
    world
} from '../../../code/systems/framework';
import { SAVE } from '../../../code/systems/save';
import { CosmosKeyed, CosmosProvider, CosmosUtils } from '../../../code/systems/storyteller';

// START-TRANSLATE

export default {
    a_starton: {
        telescope1: () => [
            ...(SAVE.data.b.svr ? [] : ['<32>{#p/basic}* 標準規格的長焦望遠鏡，皇家出品。\n* 251X年前後製成。']),
            choicer.create('* （使用望遠鏡？）', '使用', '算了')
        ],
        telescopeMeetup1: ['<25>{#p/kidd}{#f/2}* 你在看星星嗎？'],
        telescopeMeetup2: [
            '<25>{#p/kidd}{#f/1}* 喲... 我打賭\n  你肯定看到了很酷的東西。',
            '<25>{#f/7}* 上次我用望遠鏡的時候，\n  我甚至看到了一顆超新星！'
        ],
        telescopeMeetup3: [
            '<25>{#p/kidd}{#f/3}* 給。\n* 拿上這個。',
            '<32>{#s/equip}{#p/human}* （你把高級會員卡\n  掛到了鑰匙串上。）',
            '<25>{#p/kidd}{#f/7}* 現在你可以使用\n  任何望遠鏡了，\n  連「最高級」的都能用！',
            '<25>{#f/1}* 那個矮骷髏之前\n  給了我好多這個。',
            '<25>{#f/2}* 他甚至花了很多錢\n  送了我一些數字藏品...',
            '<25>{#f/1}* 我猜他真的很喜歡我，哈哈。'
        ],
        telescopeMeetup4: [
            '<25>{#p/kidd}{#f/3}* 總之，我剛才給了你一張券。',
            '<25>{#f/1}* 希望你能看到更酷的東西！'
        ],
        telescopeMeetup5: ["<25>{#p/kidd}{#f/1}* 我要回鎮上了！"],
        telescope2: () =>
            SAVE.data.b.svr
                ? ['<25>{#p/asriel1}{#f/17}* 看到什麼喜歡的東西了嗎？']
                : SAVE.data.b.oops || SAVE.data.b.s_state_chargazer
                    ? ['<32>{#p/basic}* 在太空中觀星...\n  確實，這也是種打破\n  思維定勢的想法。']
                    : ((SAVE.data.b.s_state_chargazer = true),
                        [
                            '<32>{#p/basic}* ...',
                            '<32>* 以前，我和Asriel就有一架\n  這樣的望遠鏡。',
                            "<32>* 我們把鏡筒對著\n  天空的各個角落，\n  期待能發現意想不到的驚喜...",
                            '<32>* ...可惜，希望總是落空。',
                            "<32>* 儘管觀星收穫寥寥，\n  但Asriel並不在意...",
                            '<32>* 我挖空心思從星空尋找寶藏。\n  但對他而言...\n  我的陪伴才是真正的「寶藏」。',
                            '<32>* ...',
                            '<32>{#p/human}* （你聽到一聲嘆息。）',
                            "<32>{#p/basic}* ...唉，別在意。\n  咱們繼續幹正事吧。"
                        ]),
        notv: ["<32>{#p/basic}* 沒什麼好看的。"],
        nicecreamScoreReaction1a: ['<32>{#p/basic}* 畢竟第一次玩，\n  這樣挺不錯了...'],
        nicecreamScoreReaction1b: ['<32>{#p/basic}* 畢竟第一次玩，\n  這樣也挺不錯。'],
        nicecreamScoreReaction2a: ['<32>{#p/basic}* 加把勁吧...'],
        nicecreamScoreReaction2b: ['<32>{#p/basic}* 可以再加把勁。'],
        nicecreamScoreReaction3a: [
            "<32>{#p/basic}* ...打破紀錄了？\n* 以前沒見過有人成功..."
        ],
        nicecreamScoreReaction3b: [
            "<32>{#p/basic}* 打破紀錄了？\n* 從來沒見過你這麼厲害的！"
        ],
        nicecreamScoreReaction4a: ['<33>{#p/basic}* 你挺會玩的...'],
        nicecreamScoreReaction4b: ['<32>{#p/basic}* 你挺會玩啊。'],
        nicecreamScoreReaction5a: ['<32>{#p/basic}* 你打破了你的紀錄...？'],
        nicecreamScoreReaction5b: ['<32>{#p/basic}* 看，新紀錄！'],
        nicecreamScoreReaction6a: ['<32>{#p/basic}* 有那麼一瞬間，我以為你打破了記錄...'],
        nicecreamScoreReaction6b: [
            "<32>{#p/basic}* 哇喔，你差點就破紀錄了！\n* 你能堅持下去嗎？"
        ],
        nicecreamScoreReaction7a: ['<32>{#p/basic}* 你可能得多練練...'],
        nicecreamScoreReaction7b: ['<32>{#p/basic}* 多練練就好了。'],
        nicecreamScoreReaction8a: ["<32>{#p/basic}* 比上次好..."],
        nicecreamScoreReaction8b: ["<32>{#p/basic}* 這才像話。"],
        nicecreamScoreReaction9a: [
            '<32>{#p/basic}* ...第一次玩就打破紀錄了？\n* 怎麼做到的...'
        ],
        nicecreamScoreReaction9b: ["<32>{#p/basic}* 第一次玩就打破紀錄了？\n* 你簡直是天才！"],
        nicecreamScoreReaction10a: ["<32>{#p/basic}* 畢竟第一次玩，\n  這個分挺高了..."],
        nicecreamScoreReaction10b: ["<32>{#p/basic}* 畢竟第一次玩，\n  這個分挺高的！"],
        nicecreamScoreReaction11a: ['<32>{#p/basic}* 就差一點了...'],
        nicecreamScoreReaction11b: ['<32>{#p/basic}* 天哪，你馬上就要破紀錄了...\n* 你能做到的！'],
        noteleport: ["<32>{#p/human}* （似乎是沒電了。）"],
        evac: ['<32>{#p/human}* （你感覺周圍的怪物越來越少了。）'],
        shopclosed: ['<32>{#p/human}* （沒必要再踏足了。）'],
        jukebox0: ["<32>{#p/basic}* 不能使用了。"],
        jukebox1: () => [
            SAVE.data.b.svr
                ? '<32>{#p/human}* （你去碰點唱機...）'
                : "<32>{#p/basic}* 點唱機只放你聽過的音樂。",
            choicer.create(
                '* （放一首音樂嗎？）',
                SAVE.data.b.napsta_performance ? '曲目01' : '？？？',
                2 <= SAVE.data.n.state_foundry_swansong ? '曲目02' : '？？？',
                2 <= SAVE.data.n.state_starton_trashprogress ? '曲目03' : '？？？',
                '取消'
            )
        ],
        jukebox1x1: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，這首曲子你還沒聽過，\n  無法播放。）"]
                : ["<32>{#p/basic}* 唱片封面上有個幽靈DJ，\n  人們正在聽它表演。\n* 你應該沒聽過這首。"],
        jukebox1x2: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，這首曲子你還沒聽過，\n  無法播放。）"]
                : ["<33>{#p/basic}* 唱片封面上有個幽靈DJ，\n  它正飄在電腦前。\n* 你應該沒聽過這首。"],
        jukebox1x3: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，這首曲子你還沒聽過，\n  無法播放。）"]
                : [
                    "<32>{#p/basic}* 唱片封面上有隻小白狗，\n  它被圍在一堆垃圾裡。\n* 你應該沒聽過這首。"
                ],
        jukebox1y: ['<32>{*}{#p/human}* （你想聽聽這首...）{^40}{%}'],
        jukebox2: () => [
            SAVE.data.b.svr
                ? '<32>{#p/human}* （現在放的就是這首。）'
                : [
                    '<32>{#p/basic}* 現在播放的是「曲目01」',
                    '<32>{#p/basic}* 現在播放的是「曲目02」',
                    '<32>{#p/basic}* 現在播放的是「曲目03」'
                ][SAVE.data.n.state_starton_jukebox - 1],
            choicer.create('* （停止播放嗎？）', '停止播放', '繼續播放')
        ],
        jukebox3a1: ["<32>{#p/basic}{#npc/a}* 這才像樣！"],
        jukebox3a2: ['<32>{#p/basic}{#npc/a}* （我們都喜歡這種音樂。）'],
        jukebox3b: ['<32>{#p/basic}{#npc/a}* 這音樂在舞蹈俱樂部裡面流行嗎？'],
        jukebox3c: [
            '<32>{#p/basic}* ...\n* ...\n* ...',
            "<32>{#npc/a}* Grillbz說\n  他曾經在哪聽過這首歌。"
        ],
        jukebox3d: [
            '<32>{#p/basic}{#npc/a}* 孩子，你肯定很懂即興音樂...',
            '<32>* 挺有品味。'
        ],
        shockpapyrus0a: [
            '<15>{#p/papyrus}{#e/papyrus/27}這裡到底發生啥了？？',
            '<15>{#p/papyrus}{#e/papyrus/21}剛才我在陽臺，\n有個電話打過來\n叫我來這...',
            '<15>{#p/papyrus}{#e/papyrus/19}結果就看到你倆！？',
            "<15>{#p/papyrus}{#e/papyrus/14}告訴你們，我可是\n皇家衛隊的預備隊員！",
            '<15>{#p/papyrus}{#e/papyrus/15}不管你倆\n想幹什麼...'
        ],
        shockpapyrus0b: [
            '<15>{#p/papyrus}{#e/papyrus/24}...等等，這個聲音...',
            '<15>{#p/papyrus}{#e/papyrus/22}原來喊我來這的\n就是你啊！？'
        ],
        shockpapyrus0c: [
            '<15>{#p/papyrus}{#e/papyrus/20}...對！\n這就說得通了！',
            "<15>{#p/papyrus}{#e/papyrus/10}那...\n很高興認識你。",
            '<15>{#p/papyrus}{#e/papyrus/24}說實話，\n你長得有點像...',
            '<15>{#p/papyrus}{#e/papyrus/20}...嘿，等一下！！',
            '<15>{#p/papyrus}{#e/papyrus/22}你帶了個【人類】\n過來嗎！？！？',
            '<15>{#p/papyrus}{#e/papyrus/10}哇！！\n今天好事連連啊！！',
            '<15>{#p/papyrus}{#e/papyrus/20}話說回來，\n你喊我來這幹嘛呢？'
        ],
        shockpapyrus1: () =>
            [
                [
                    '<32>{#p/asriel2}* 準備好了嗎，$(name)？',
                    choicer.create('* （Asriel應該怎麼做？）', '仁慈', '行動', '魔法', '戰鬥')
                ],
                ["<32>{#p/asriel2}* 我們速戰速決吧。"]
            ][Math.min(SAVE.flag.n.ga_asrielPapyrus, 1)],
        shockpapyrus2a: [
            '<32>{#p/asriel2}* 仁慈，嗯？',
            '<32>{#p/asriel2}* 仁慈...？\n  這真是個好聽的詞。',
            '<32>{#p/asriel2}* 那咱們就給他來點「仁慈」吧。'
        ],
        shockpapyrus2b: [
            "<32>{#p/asriel2}* 行動...？\n* 看好了，什麼才叫行動。",
            '<32>{#p/asriel2}* 首先，舉起手臂...',
            '<32>{#p/asriel2}* 接著...！'
        ],
        shockpapyrus2c: [
            '<32>{#p/asriel2}* 魔法，\n  它可化為紐帶，\n  讓怪物們團結一心。',
            '<32>{#p/asriel2}* 不過，反過來...',
            '<33>{#p/asriel2}* 它也能成為利刃，\n  刺穿他們的肉體。'
        ],
        shockpapyrus2d: ['<32>{#p/asriel2}* 戰鬥... 真是不二之選。', '<32>{#p/asriel2}* 嘻嘻嘻...'],
        sansDeath1: ["<15>{#p/papyrus}{#e/papyrus/27}SANS！\n你受傷了！"],
        sansDeath2: ["<20>{#p/sans}papyrus，\n我不是讓你待在家裡嗎？", '{*}{#e/papyrus/21}{%}'],
        sansDeath3: ["<20>{#p/sans}...別擔心，兄弟。\n這只是我最喜歡的\n雅莫萬用醬。", '{*}{#e/papyrus/26}{%}'],
        sansDeath4: ["<15>{#p/papyrus}{#e/papyrus/21}但你真的\n傷得很重..."],
        sansDeath5: [
            "<20>{#p/sans}是啊，因為「不祥的預感」\n就離開家亂跑，\n就是這下場。",
            '<20>{#p/sans}...這樣的傷口，\n應該是沒辦法了。',
            '{*}{#e/papyrus/21}{%}'
        ],
        sansDeath6: [
            '<20>{#p/sans}看樣子...',
            "<20>恐怕...\n只能陪你到這了。",
            '<20>...',
            '<20>只是...',
            "<20>答應我，哪怕我不在，\n你也要好好活下去，\n兄弟。",
            "<20>答應我，你還會做\n那個最-{^5}最棒的你。",
            '<20>...',
            '<20>畢竟...'
        ],
        sansDeath7: ["<20>{|}{#p/sans}你可是...\n偉大的p-{^5}papyrus。"],
        sansDeath8: ['<15>{#p/papyrus}{#e/papyrus/33}不-不...{^40}{%}'],
        fast_food1: () => [
            SAVE.data.b.fryz
                ? "<32>{#p/human}{#npc}* （你拿走了烈焰Grillby。）"
                : '<32>{#p/human}{#npc}* （你拿走了三個小漢堡。）'
        ],
        fast_food2: ["<32>{#p/human}{#npc}* （你帶的東西太多了。）"],
        aussie: pager.create(
            0,
            () =>
                SAVE.data.n.state_starton_trashprogress < 1
                    ? [
                        '<25>{#p/sans}{#f/0}* 終於。',
                        "<25>{#f/3}* 我一直在想你\n  什麼時候會出現呢。",
                        '<25>{#f/0}* 不知道你還記不記得，\n  當我們第一次\n  見面的時候...',
                        '<25>{#f/0}* 我告訴papyrus遇到困難\n  負「重力」爭才能致遠。',
                        '<25>{#f/0}* 你問我是什麼意思？',
                        '<25>{#f/3}* 嗯。',
                        "<25>{#f/2}* 你馬上就{@fill=#003cff}知道{@fill=#fff}了。"
                    ]
                    : ['<25>{#p/sans}{#f/0}* 歡迎回來。', '<25>{#f/2}* 準備好知道等待你的\n  是什麼了嗎？'],
            () =>
                SAVE.data.n.state_starton_trashprogress < 1
                    ? ['<25>{#p/sans}{#f/0}* 來嘛，過來看看。', "<25>{#f/2}* 就在上面呢，小鬼頭。"]
                    : ["<25>{#p/sans}{#f/2}* 就在上面呢，小鬼頭。"],
            () =>
                SAVE.data.n.state_starton_trashprogress < 2
                    ? ["<25>{#p/sans}{#f/2}* 別擔心，那東西\n  一點也不危險... 雖然\n  看起來讓人感覺很危險。"]
                    : ['<25>{#p/sans}{#f/2}* 多謝你的幫助。']
        ),
        trashhunt1: [
            '<25>{#p/sans}{#f/0}* 所-以...\n  你現在是怎麼想的？',
            '<25>{#f/3}* 我管這個叫「垃圾星球」。',
            "<25>{#f/0}* ...事實上，這東西的體積\n  已經有段時間在一直\n  變大了。",
            '<25>{#f/0}* 要是再繼續大下去，\n  那...',
            "<25>{#f/2}* 我只能說要有\n  {@fill=#ff0}倒懸{@fill=#fff}之急了。",
            "<25>{#f/0}* 但別擔心。\n* 有了你的幫助，\n  它很快就會消失的。",
            '<25>{#f/2}* 我還給你找了首音樂，\n  能讓你更有動力。'
        ],
        trashhunt2: '* 反覆按[Z]，\n  清走所有垃圾！',
        trashhunt3: () => [
            '<25>{#p/sans}{#f/3}* 哇。\n* 一氣呵成，是吧？',
            "<25>{#f/2}* ...我真是佩服到絕倒了。",
            '<25>{#f/0}* 感覺我得給你點什麼\n  作為回報。',
            '<25>{#f/0}* ...\n* 給。\n* 把這個拿上。',
            '<32>{#p/human}* （Sans丟給你了一樣東西。）',
            ...(SAVE.storage.inventory.size < 8
                ? ['<32>{#s/equip}{#p/human}* （你獲得了玉狗聖劍。）', '<25>{#p/sans}{#f/2}* 好好用它。']
                : [
                    "<32>{#p/human}* （你帶的東西太多了。）",
                    '<25>{#p/sans}{#f/3}* 沒空間了，嗯？',
                    "<25>{#p/sans}{#f/2}* 沒關係。\n* 等你有空間了，\n  就來我房間拿。"
                ])
        ],
        gravo1: () =>
            SAVE.data.b.svr
                ? [
                    '<32>{#p/human}* （你好奇地打量\n  這個不知道幹什麼用的裝置。）',
                    ...[["<25>{#p/asriel1}{#f/17}* 真可惜啊，我們沒有\n  這東西的遙控器。"], []][
                    Math.min(asrielinter.gravo1++, 1)
                    ]
                ]
                : ['<32>{#p/basic}* 這是個「重力轉換器」。', '<32>* 管它什麼意思。'],
        gravo3: () => [
            '<32>{#p/human}* （你嘗試用遙控器\n  激活重力轉換器。）\n* （什麼都沒發生。）',
            ...(SAVE.data.b.svr
                ? [["<25>{#p/asriel1}{#f/21}* 他們可能正在關掉\n  那些非必要裝置。"], []][
                Math.min(asrielinter.gravo3++, 1)
                ]
                : ['<32>{#p/basic}* 它肯定離線了...'])
        ],
        gravo2: ['<32>{#p/human}* （你用遙控器激活了重力轉換器。）'],
        sansdoor1: () =>
            SAVE.data.b.svr || world.runaway
                ? ['<32>{#p/human}* （被封死了。）']
                : ["<32>{#p/basic}* 鎖住了。"],
        sansdoor2: ['<32>{#p/human}* （你用骨鑰打開了房門。）'],
        sanscab1: () => [
            ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 信封裡有個奇怪的遙控器。"]),
            '<32>{#s/equip}{#p/human}* （你把重力轉換器的遙控器\n  掛到了鑰匙串上。）'
        ],
        sanscab2: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （可是，信封裡的東西\n  已經被你全拿走了。）']
                : ["<32>{#p/basic}* 只是個空信封。"],
        sanscab3: () => [
            ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 信封裡有個奇怪的... 東西。"]),
            SAVE.storage.inventory.size < 8
                ? '<32>{#s/equip}{#p/human}* （你獲得了玉狗聖劍。）'
                : "<32>{#p/human}* （你帶的東西太多了。）"
        ],
        cream_get: ['<32>{#p/human}* （你得到了冰意靈。）'],
        cream_deny: ['<32>{#p/basic}* 什麼都沒有。'],
        cream_full: ["<32>{#p/human}* （你帶的東西太多了。）"],
        cream_get_archive: [
            '<32>{#p/human}* （你把手伸進了冰淇淋車。）',
            '<32>{#p/human}{#s/equip}* （你得到了冰意靈。）'
        ],
        cream_empty_archive: ['<32>{#p/human}* （你把手伸進了冰淇淋車。）', '<32>{#p/human}* （...）'],
        cream_full_archive: ["<32>{#p/human}* （你帶的東西太多，\n  不方便把手伸進去。）"],
        bunbun: pager.create(
            0,
            () =>
                SAVE.data.n.plot === 72
                    ? ["<32>{#p/basic}* 媽媽說我們很快就要去新家園了。", "<32>* ...新家園是什麼啊？"]
                    : [
                        '<32>{#p/basic}* 媽媽說，睡覺可以把你的\n  生命值恢復到{@fill=#ff0}HP上限以上{@fill=#fff}。',
                        "<32>* ...HP上限是什麼啊？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? ['<32>{#p/basic}* 人類也有家園嗎？']
                    : ['<32>{#p/basic}* 這是母親才有的東西嗎？']
        ),
        emptytable1: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （這張桌子讓你感到很孤獨。）']
                : ["<32>{#p/basic}* 只是張孤零零的桌子。\n* 上面有糖霜的味道。"],
        emptytable2: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （這張桌子讓你感到很孤獨。）']
                : ["<32>{#p/basic}* 一張孤零零的桌子。\n* 上面有毛髮的味道。"],
        balcony0: () => ['<18>{#p/papyrus}景色不錯吧？', choicer.create('* （你要怎麼回答？）', '景色很美', '沒啥好看的')],
        balcony1: [
            "<18>{#p/papyrus}{#f/9}太好了！\n終於，有人懂這種感覺了。",
            '<18>{#f/7}幾乎就沒見過SANS\n往窗外看風景！！！'
        ],
        balcony2: [
            "<18>{#p/papyrus}{#f/5}喔...\n好吧，沒事...",
            '<18>{#f/4}（唉...）\n起碼，你願意走出房間，\n到陽臺看看。',
            "<18>{#f/7}SANS才不會這麼幹！！！"
        ],
        bedbook1: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你好像有點看不懂內容。）"]
                : ["<32>{#p/basic}* 一本用古文寫成的書。"],
        bedbook3a: ['<32>{#p/basic}* 想讓我幫你讀一下嗎？'],
        bedbook3b: ['<32>{#p/basic}* 再讀一遍？'],
        bedbook4: () => [choicer.create('* （讓$(name)給你讀一下嗎？）', '讀一下', '算了')],
        bedbook5: [
            '<32>{#p/basic}* 好，我看看...',
            '<32>* 「很久很久以前，\n   太陽系由兩個種族統治著：\n   人類和怪物。」',
            '<32>* 「起初，怪物們只是造訪了一下，\n   不久就回到了他們自己的星系。」',
            '<32>* 「但怪物們被人類文明所吸引，\n   想和他們共同生活。」',
            '<32>* 「因此，他們和人類分享了他們的科技，\n   並與人類結成了同盟。」',
            '<32>* 「接下來數百年間，\n   怪物與人類和平共處。」',
            '<32>* 「有一天，人類開始對\n   怪物的某種東西產生恐懼...」',
            '<32>* 「一種沒有傑出的領導力\n   就會失控的恐懼。」',
            '<32>* 「隨著時間的推移，\n   兩個物種之間爆發了戰爭。」',
            '<32>* 「那時星際間會發生許多戰鬥和衝突。」',
            '<32>* 「但是人類們，\n   充滿了恐懼與決心的人類們，\n   很容易佔據了上風。」',
            '<32>* 「然後，\n   在那對未來有著重大影響的一天，\n   一件強大的武器向怪物的家園發射了。」',
            '<32>* 「在怪物們的母星被摧毀之後，\n   人類獲得了勝利。」',
            '<32>* 「兩個物種間籤訂了和約，然後...」',
            '<32>* 「剩下的怪物被驅逐到了\n   一個廢棄的前哨站。」',
            '<32>* 「接著，人類集結了七位精英。」',
            '<32>* 「他們一同制定了一個計畫，最後...」',
            '<32>* 「一個強大的力場被建立了起來，\n   怪物們被困在其中。」',
            "<32>* 嗯，這就是故事的內容了。"
        ],
        bedbook6: ['<32>{#p/basic}* 好吧，如果你想讓我讀，就告訴我。'],
        beddoor1: ["<32>{#p/basic}{#npc/a}* 如果你想訂房間，\n  你得先問我一聲。"],
        beddoor2: ["<32>{#p/basic}{#npc/a}* 如果你還想訂房間，\n  你得先問我一聲。"],
        beddoor3: ['<32>{#p/basic}{#npc/a}* 抱歉，小傢伙！\n* 這裡已經滿人了！'],
        candy1: () =>
            postSIGMA()
                ? ["<32>{#p/basic}* 不能使用了。"]
                : [
                    SAVE.data.b.svr
                        ? '<32>{#p/human}* （你走近了自動售貨機。）'
                        : "<32>{#p/basic}* 這是一臺專門售賣\n  高檔洋梅的自動售貨機。",
                    choicer.create('* （花8G買串洋梅嗎？）', '買', '不買')
                ],
        candy2: ["<32>{#p/human}* （你的錢不夠。）"],
        candy3: ["<32>{#p/human}* （你帶的東西太多了。）"],
        candy4: ['<32>{#p/human}* （你買了一小串洋梅。）'],
        candy5: ['<32>{#p/human}* （你決定先不買。）'],
        capstation1: [
            '<32>{#p/human}* （你看了眼哨站後面，\n  並發現了一把鑰匙。）',
            '<32>{#s/equip}{#p/human}* （你把生鏽的鑰匙\n  掛到了鑰匙串上。）',
            '<32>* （打開「手機」來查看\n  所有獲得的鑰匙。）'
        ],
        capstation2: ['<32>{#p/human}* （你看了眼哨站後面。）', '<32>{#p/basic}* 沒有新東西。'],
        crossword0: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}* 喔，你來了。',
                    '<25>{#p/sans}{#f/2}* 如果你喜歡上一個謎題的話，\n  估計這個也能合你胃口。'
                ]
                : [
                    '<18>{#p/papyrus}{#f/9}人類！！',
                    '<18>{#f/9}你已經看到\n我的謎題了。',
                    '<18>{#f/4}但你接下來\n將要看到的是...'
                ],
        crossword1: () =>
            world.edgy
                ? [
                    '<26>{#p/sans}* 其實也不需要了。\n* 走過來瞧瞧吧。',
                    "<25>{#p/sans}* 喏，它就在地上呢。"
                ]
                : [
                    "<18>{#p/papyrus}{#f/7}SANS！！\n謎題在哪！？",
                    "<25>{#p/sans}* 就在你眼皮底下呢。",
                    '<18>{#p/papyrus}{#f/1}啥？\n就地上躺的那塊板子？',
                    '<18>{#f/4}行吧...'
                ],
        crossword2: (check: boolean) =>
            world.edgy
                ? [
                    check
                        ? '<25>{#p/sans}* 咋了？\n  謎題讓你{@fill=#ff0}鬱{@fill=#fff}罷不能嗎？'
                        : "<25>{#p/sans}* 看都不願意看一眼，是吧？",
                    "<25>* 真不該對你期望太高。",
                    '<26>{#f/3}* 好吧。\n* 說不定，數謎更適合你。',
                    '<26>{#f/0}* 跑題了。'
                ]
                : [
                    check
                        ? "<18>{#p/papyrus}{#f/7}SANS！！！\n那根本沒有用啊！"
                        : "<18>{#p/papyrus}{#f/7}SANS！！！\n那個人類連\n看都沒看一眼！",
                    '<25>{#p/sans}* 啊呀。',
                    "<25>{#f/3}* 我就知道我應該用\n  今天的數和謎題代替的。",
                    '<18>{#p/papyrus}{#f/1}啥！？數和！？',
                    "<18>{#f/9}我真不敢相信\n你居然會提到它！！",
                    '<18>{#f/4}在我看來...',
                    '<18>{#f/0}數獨無疑才是最難的。',
                    '<25>{#p/sans}* 什麼？你認真嗎，兄弟？\n* 那個簡單到爆的\n  數字排列組合？',
                    "<25>{#f/4}* 那是給骷髏寶寶玩的。",
                    '<18>{#p/papyrus}{#f/4}真。難以置信。',
                    '<18>{#f/9}人類！！！\n你來評評理！',
                    choicer.create('* （哪邊更難？）', '數獨', '數和')
                ],
        crossword3a: [
            '<18>{#p/papyrus}哈！哈！好！',
            '<18>要是人類也覺得\n數獨更難的話！',
            '<18>那他們一定\n非常聰明！',
            '<18>{#f/9}捏！嘿！嘿！嘿！'
        ],
        crossword3b: [
            '<18>{#p/papyrus}{#f/9}你們兩個真怪！',
            '<18>{#f/0}數和謎題\n真的太簡單了。',
            "<18>每次的解法\n都是一樣的。",
            '<18>{#f/4}我只要把每個空白鍵\n都填上字母「Z」\n就好了...',
            '<18>{#f/4}因為我\n每做一道數和...',
            '<18>{#f/9}除了打瞌睡\n我什麼都做不了！！！'
        ],
        crossword3c: [
            '<25>{#p/sans}{#f/3}* 順便提一嘴，\n  我之前看到有兩隻狗\n  在這邊跑來跑去...',
            "<25>{#f/0}* 如果我是你的話，\n  我會小心點的。"
        ],
        crossword4a: pager.create(0, ['<25>{#p/sans}* 嘿，你要去哪，小子？'], ['<25>{#p/sans}* 回來。']),
        crossword4b: pager.create(0, ["<25>{#p/sans}* 你認真？\n* 也沒那麼難吧。"], ['<25>{#p/sans}* 你認真？']),
        crossword5a: [
            '<25>{#p/sans}* 感謝你為了安撫我兄弟\n  回答說「數獨更難」。',
            '<25>{#f/4}* 昨天他還試圖「破解」\n  星象圖，結果被難住了呢。'
        ],
        crossword5b: [
            '<25>{#p/sans}* papyrus...\n* ...他總會在令人\n  意想不到的地方碰壁。',
            '<25>{#f/4}* 昨天他還試圖「破解」\n  星象圖，結果被難住了呢。'
        ],
        crossword6a: [
            "<25>{#p/sans}{#f/3}* 我早就料到\n  你會直接跳過的。",
            "<25>{#f/0}* 這不就是你碰到謎題時\n  常用的伎倆麼？"
        ],
        crossword6b: [
            "<25>{#p/sans}{#f/3}* 挺驚訝的。\n* 我以為你會看都不看一眼\n  直接跳過。",
            "<25>{#f/2}* 也許，你還沒有爛到骨子裡。"
        ],
        crossword6c: ['<25>{#p/sans}{#f/2}* 嘿嘿，\n  你還是去看了一眼。'],
        crossword6d: [
            "<25>{#p/sans}{#f/3}* 挺驚訝的。\n* 我以為你壓根不感興趣。",
            "<25>{#f/2}* 也許，你還沒有爛到骨子裡。"
        ],
        doggo1: [
            '<32>{#p/basic}* 好像有啥動了下？\n* 是我的錯覺嗎？',
            '<32>* 如果確實有什麼在動...\n* 比如說，一個人類...',
            "<32>* 我絕不會讓他\n  再從我眼皮子底下溜走！"
        ],
        doggo2: [
            [
                "<32>{#p/basic}* 有什麼沒-沒-沒在動的東西...\n* 摸-摸-摸了我...！",
                "<32>* 我得吃點狗糧壓壓驚。"
            ],
            ['<32>{#p/basic}* 啊？不-不-不知道從哪\n  突然冒出來了個扳手！？！？', '<32>{#p/basic}* ...真是奇妙的一天！'],
            [],
            [
                '<32>{#p/basic}* 有-有個人類突-突然過來...\n  揍了我一頓...！',
                "<32>{#p/basic}* 我...\n* 我去休息了。"
            ]
        ],
        doggo3: pager.create(
            0,
            ['<32>{#p/basic}* 你好？\n* 有人在嗎...？'],
            ['<32>{#p/basic}* 你倆是在整我嗎？\n* 真好笑啊，夥計。'],
            ['<32>{#p/basic}* 大塊頭？\n* 是你嗎？\n* 拜託...'],
            ["<32>{#p/basic}* 嗯，看來並不是那個\n  高個子骷髏...\n* 他太吵了。"],
            ['<32>{#p/basic}* 我不管你是誰，趕緊停下！！！'],
            ['<32>{#p/basic}* ...']
        ),
        doggo3x: ['<32>{#p/basic}* （呼嚕... 呼嚕...）'],
        drop_chip: [
            '<32>{#p/basic}* 你剛剛是不是...\n  把我給你的晶片給扔了？',
            '<32>* 我真無語了...\n* 給我滾！'
        ],
        drop_cream: ["<32>{#p/basic}* 你真該慶幸我在忙著做宣傳。"],
        eat_chip: [
            '<32>{#p/basic}* 你剛剛是不是...\n  把我給你的晶片給吃了？',
            '<32>* 我真無語了...\n* 給我滾！'
        ],
        eat_cream: ['<32>{#p/basic}* 很開心你可以暢享冰意靈！\n* 非常開心！'],
        genotext: {
            asriel1: () =>
                [['<25>{#p/asriel2}{#f/9}* 跟我走就行。'], ['<25>{#p/asriel2}{#f/16}* 走吧。']][
                Math.min(SAVE.flag.n.ga_asriel1++, 1)
                ],
            asriel2: () =>
                [
                    ["<25>{#p/asriel2}{#f/2}* 哎，前面站著的，\n  不是偉大的Papyrus嗎？"],
                    ['<25>{#p/asriel2}{#f/3}* 嗯... 再來一次吧。']
                ][Math.min(SAVE.flag.n.killed_sans, 1)],
            asriel3: () =>
                [
                    ["<25>{#p/asriel2}{#f/1}* 咱們去做個「自我介紹」，\n  怎麼樣？"],
                    ['<25>{#p/asriel2}{#f/4}* 你知道該幹什麼。']
                ][Math.min(SAVE.flag.n.killed_sans, 1)],
            asriel4: ['<25>{*}{#p/asriel2}{#f/5}* 哈囉！{^5}{%}'],
            asriel5: ['<18>{*}{#p/papyrus}{#f/1}幹啥- {%}'],
            asriel6: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/13}* 嘿... $(name)...',
                        '<25>{#f/17}* 要不，從現在開始\n  你來動手吧？',
                        "<25>{#f/15}* 我... 我沒事，真沒事。",
                        "<25>{#f/16}* 我只是覺得，\n  幹這活，你比我更擅長...",
                        "<25>{#f/17}* 對，就是這個原因！\n* 這種事，肯定你來做更合適。"
                    ],
                    ["<25>{#p/asriel2}{#f/16}* 呃，好吧。\n* ...之後你來動手。"],
                    ['<25>{#p/asriel2}{#f/15}* 那麼... 前進吧？'],
                    ['<25>{#p/asriel2}{#f/15}* ...']
                ][Math.min(SAVE.flag.n.ga_asriel6++, 3)],
            asriel9: ["<25>{#p/asriel2}{#f/8}* 噓，等一下，\n  看看他會做些什麼。"],
            asriel10: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* 哇，\n  Papyrus這麼頹廢的樣子...',
                        "<25>{#f/16}* 我真是頭一次見到。",
                        '<25>{#f/13}* 嘿，$(name)...',
                        "<25>{#f/1}* 我感覺接下來有好戲看了。"
                    ],
                    ['<25>{#p/asriel2}{#f/16}* 真是可憐。']
                ][Math.min(SAVE.flag.n.ga_asriel10++, 1)],
            asriel17: () =>
                [["<25>{#p/asriel2}{#f/16}* 天吶，$(name)...\n  有些怪物就是聽不懂話。"], ['<25>{#p/asriel2}{#f/4}* 切。']][
                Math.min(SAVE.flag.n.ga_asriel17++, 1)
                ],
            asriel24: () =>
                [['<25>{#p/asriel2}{#f/4}* 真是浪費時間。'], ['<25>{#p/asriel2}{#f/3}* 呵呵。']][
                Math.min(SAVE.flag.n.ga_asriel24++, 1)
                ],
            asriel26: () =>
                [
                    [
                        "<26>{#p/asriel2}{#f/3}* 好了，那群蠢狗\n  已經全軍覆沒了。",
                        '<26>{#p/asriel2}{#f/4}* 再過一座橋，就到小鎮了。',
                        '<25>{#f/1}* ...跟我來。'
                    ],
                    ['<25>{#p/asriel2}{#f/3}* 我們去鎮上。']
                ][Math.min(SAVE.flag.n.ga_asriel26++, 1)],
            asriel28: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/6}* 好，$(name)，\n  現在整個鎮子都是你的了。",
                        "<25>{#f/7}* 而我要去忙點別的事，\n  之後會派上用場。",
                        "<25>{#f/1}* 別擔心，我去去就回。"
                    ],
                    ['<25>{#p/asriel2}{#f/1}* 鎮子出口見。']
                ][Math.min(SAVE.flag.n.ga_asriel28++, 1)],
            asriel29: () =>
                [
                    SAVE.data.b.papyrus_secret
                        ? [
                            '<25>{#p/asriel2}{#f/2}* 嘻。\n* 嘻。\n* 嘻....',
                            "<25>{#f/10}* ...等等，Papyrus在哪？",
                            '<25>{#f/10}* ...',
                            "<25>{#f/4}* 天吶，$(name)，\n  沒想到你下手這麼快。"
                        ]
                        : [
                            '<25>{#p/asriel2}{#f/2}* 嘻。\n* 嘻。\n* 嘻....',
                            "<25>{#f/1}* 天吶，那個蠢骨頭\n  那麼想原諒你...",
                            '<25>{#f/13}* 最後還是嘗到了仁慈的後果。',
                            "<25>{#f/16}* 不過，先別管他了。",
                            "<25>{#f/1}* 一會，咱們還要拉長線，\n  釣大魚呢。"
                        ],
                    ['<25>{#p/asriel2}{#f/13}* 哎呀，這蠢骷髏\n  又白白送死了。'],
                    [
                        "<25>{#p/asriel2}{#f/13}* 俗話說，好鐵要經三回爐。",
                        '<25>{#f/16}* 但很遺憾，他一回就不行了。'
                    ],
                    [
                        "<25>{#p/asriel2}{#f/6}* 你已經殺了他四次了。",
                        "<25>{#f/8}* 看來你很享受這種快感啊..."
                    ],
                    ['<25>{#p/asriel2}{#f/15}* 又來...？']
                ][Math.min(SAVE.flag.n.ga_asriel29++, 4)],
            asriel30: () => [
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#f/1}* 哈囉，Asriel。',
                '<25>{#f/2}* ...',
                '<25>{#f/3}* 我們談一下吧。',
                ...[
                    [
                        '<25>{#p/asriel2}{#f/6}* 談談？\n* 跟你有什麼好談的？',
                        '<25>{#f/6}* 還有，你怎麼在這？',
                        "<25>{#f/7}* 既然早晚我都要\n  送你下地獄...",
                        '<25>{#f/8}* 那不如... {%15}'
                    ],
                    [
                        "<25>{#p/asriel2}{#f/8}* 你想談談？\n* 別來浪費我的時間。",
                        "<25>{#f/6}* 放個全息投影，還想蒙我？",
                        '<25>{|}{#p/asgore}{#f/5}* 你怎麼- {%}',
                        '<25>{#p/asriel2}{#f/1}* 少問。'
                    ]
                ][Math.min(SAVE.flag.n.ga_asriel30x, 1)]
            ],
            asriel30a: [
                '<25>{#p/asriel2}{#f/8}* 開玩笑嗎？\n* 這只是個全息投影？',
                '<25>{#f/6}* 我知道你是個懦夫，\n  可你竟然還能慫出個新境界。'
            ],
            asriel30b: [
                '<25>{#p/asgore}{#f/1}* 你就沒有更重要的事可做嗎？',
                '<25>{#p/asriel2}{#f/8}* ...',
                '<25>{|}{#p/asgore}{#f/3}* 聽著，兒子，我只是- {%}',
                "<25>{#p/asriel2}{#f/7}* 我不是你兒子。\n* 我早就不是你兒子了。",
                '<25>{#p/asgore}{#f/2}* ...',
                '<25>{#p/asgore}{#f/1}* 好吧，Asriel。\n* 你知不知道自己\n  正變成什麼樣？',
                "<25>{#f/2}* 鐵石心腸，罪不可赦...",
                "<25>{#p/asriel2}{#f/8}* 哼，別裝的好像\n  你很在乎我似的，爹。",
                '<25>{#p/asgore}{#f/5}* ...',
                '<25>{#p/asriel2}{#f/9}* 不好意思，\n  剛不該叫你「爹」的，\n  Asgore。',
                '<25>{#f/1}* 真是抱歉。',
                '<25>{#p/asgore}{#f/3}* ...\n* 開玩笑吧...',
                '<25>{#f/5}* 好好想想你的所作所為，\n  這可不是為了我們...',
                '<25>{#f/6}* 是為了你好！',
                '<25>{#p/asriel2}{#f/8}* ...',
                '<25>{#p/asriel2}{#f/7}* ...讓我緩緩。',
                "<26>{#f/6}* 顯然你來這只是想氣我。",
                '<25>{#p/asgore}{#f/3}* ...',
                '<25>{#p/asriel2}{#f/6}* ...',
                '<25>{#p/asgore}{#f/7}* 你得意識到\n  你的選擇是有份量的！',
                "<25>{#p/asriel2}{#f/15}* 不然？\n  沒份量不就飄起來了嗎？\n  誰還看得到？",
                "<25>{#f/16}* $(name)，我們走。\n  我受夠他了。"
            ],
            asriel30c: ['<25>{*}{#p/asgore}{#f/8}* Asriel，求你別走！\n* 我只是想幫你！{^999}'],
            asriel30d: () =>
                [
                    ['<25>{#p/asriel2}{#f/3}* 做好準備，$(name)。', "<26>{#f/4}* 這兒可是Undyne的地盤。"],
                    ['<25>{#p/asriel2}{#f/4}* 帶路吧。']
                ][Math.min(SAVE.flag.n.ga_asriel30d++, 1)],
            papyrusSolo1a: [
                '<18>{#p/papyrus}{#f/31}SANS？\n那是個人類嗎？',
                "<18>{#f/5}應該是的吧？",
                '<18>{#f/32}捏...\nUNDYNE總算會...',
                "<18>{#p/papyrus}{#f/31}我能加入皇家衛隊了...",
                "<18>{#f/5}你會以我為榮的吧？",
                "<25>{#p/asriel2}{#f/3}* 你騙不了自己的，Papyrus。\n* 他已經死了。",
                '<18>{|}{#p/papyrus}{#f/5}可是- {%}',
                "<25>{#p/asriel2}{#f/3}* 夠了。\n* 你再怎麼使勁呼喚，\n  他也聽不見的。", 
                "<18>{#p/papyrus}{#f/6}不會的...\nSANS他...",
                '<18>{#f/31}他向我承諾過的...',
                "<25>{#p/asriel2}{#f/8}* 那個蠢骨頭\n  要能遵守承諾就怪了。",
                "<26>{#f/9}* 雖然我也不比他好到哪兒去。", 
                '<18>{#p/papyrus}{#f/31}...',
                "<18>{#f/3}對不起。\n我得走了..."
            ],
            papyrusSolo2a: [
                '<18>{#p/papyrus}{#f/31}唉，我剛從\nUNDYNE那回來...',
                '<18>{#f/31}她說國王找你有事。',
                '<25>{#p/asriel2}{#f/6}* ...',
                '<18>{#p/papyrus}{#f/3}他原話是\n「我想見見我兒子」。',
                '<18>{#f/7}...',
                
                "<18>{#f/7}我們的王子竟然\n殺了我兄弟，\n真是難以置信！",
                '<25>{|}{#p/asriel2}{#f/8}* 其實你才是我們原本想- {%}',
                '<18>{#p/papyrus}{#f/7}真是夠了！！',
                '<18>{#f/7}你出賣集體，背叛同胞！',
                '<18>{#f/7}為了啥呢！？',
                '<18>{#f/7}就為了取悅自己嗎？',
                "<25>{#p/asriel2}{#f/16}* 對啊，Papyrus。\n* 就是因為這麼做很爽。",
                '<18>{#p/papyrus}{#f/7}扯淡！！！',
                '<18>{#p/papyrus}{#f/4}還有你，人類...',
                "<18>{#f/7}別以為我不知道\n事態會怎麼發展。",
                "<18>{#f/7}顯而易見，你才是主謀。",
                '<25>{#p/asriel2}{#f/8}* 你真有眼力。',
                '<25>{#f/7}* 眼下我們是不是該\n  就地投降才好呢？',
                '<18>{#p/papyrus}{#f/31}...',
                '<25>{#p/asriel2}{#f/4}* 先說明了，你這股努力的勁兒\n  確實令我佩服。',
                "<25>{#f/3}* 但我們自有打算。",
                "<18>{#p/papyrus}{#f/4}你要知道，UNDYNE可能\n正盯著我們呢。",
                '<25>{#p/asriel2}{#f/3}* 你想說什麼？',
                "<25>{#f/4}* ...告訴你，Papyrus，\n  你和其他人做什麼，\n  跟我們都毫無關係。",
                '<25>{#f/1}* 只要在一起，\n  誰都無法把我們分開。',
                '<18>{#p/papyrus}{#f/7}...我呸！！'
            ],
            papyrusSolo3: ['<25>{#p/asriel2}{#f/3}* 哈囉！'],
            papyrusSolo3a: () => [
                '<18>{#p/papyrus}{#f/31}你知道嗎...',
                '<18>{#f/31}我偶然聽到ALPHYS博士\n自言自語...',
                '<18>{#f/5}從她的話中我聽到個詞，\n好像是「時間回溯」？',
                "<18>{|}{#f/32}{#x1}我不確定，但好像你們- {%}",
                '<25>{#p/asriel2}{#f/6}* 沒門。',
                '<18>{|}{#p/papyrus}{#f/6}但她說了你們能- {%}',
                ...(SAVE.flag.n.genocide_milestone < 5
                    ? ['<25>{#p/asriel2}{#f/6}* 沒門。']
                    : SAVE.flag.n.genocide_milestone < 6
                        ? ["<25>{#p/asriel2}{#f/6}* 沒門，不過我要是那麼做的話\n  她會很高興的。"]
                        : ["<25>{#p/asriel2}{#f/6}* 沒門，反正她最後\n  也要跟著去見閻王。"]),
                '<18>{#p/papyrus}{#f/31}可是，假如你真能\n回溯時間，抹掉過去...',
                '<18>{#f/5}為什麼不去試試呢？',
                "<18>{#f/31}下一條時間軸裡，\n讓-讓我代他去死。",
                "<18>{#f/3}那樣，他就能活下來了，\n對吧？",
                "<25>{#p/asriel2}{#f/6}* ...\n* 跟你說，我早就看過\n  那條線了。",
                "<25>{#f/7}* 無聊至極。",
                '<18>{#p/papyrus}{#f/3}...',
                '<18>{#f/6}那麼，我給你看看\n這個謎題吧？',
                '<18>{#f/32}說不定，\n它能讓你不那麼無聊...',
                '<25>{#p/asriel2}{#f/15}* ...',
                '<25>{#p/asriel2}{#f/15}* 你要是喜歡這麼做的話，\n  那就隨你的便。',
                '<18>{#p/papyrus}喔，喔！',
                "<18>{#f/0}太好了！！",
                "<18>{#f/0}你開始改變想法了！",
                '<25>{#p/asriel2}{#f/8}* ...',
                '<18>{#p/papyrus}{#f/6}...',
                '<18>{|}{#f/5}那麼，規則是這樣的- {%}',
                '<25>{#p/asriel2}{#f/7}* 我們早就知道了，蠢貨。',
                '<18>{#p/papyrus}{#f/31}...喔...',
                '<18>{#f/6}呃，好吧！！\n那我就不解釋了...',
                "<18>{#f/9}看看我們的\n隨機數字是多少吧！！"
            ],
            papyrusSolo4a: [
                '<18>{#p/papyrus}{#f/3}ASRIEL。',
                '<25>{#p/asriel2}{#f/6}* Papyrus。',
                '<18>{#p/papyrus}{#f/31}...',
                '<18>{#f/31}為什麼？',
                '<18>{#f/31}為什麼你要這麼做？',
                "<18>{#f/3}一個怪物不應該\n會變成這樣啊...",
                "<18>{#f/5}你的愛去哪了？\n你的同情心去哪了？",
                '<18>{#f/31}你的... 仁慈...',
                '<25>{#p/asriel2}{#f/2}* ...\n* 喔，您可真是\n  文曲星下凡啊...',
                '<25>{#f/1}* 在我的靈魂中，\n  這些東西早就化為烏有了。',
                "<18>{#p/papyrus}{#f/31}但...\n我不明白...",
                '<18>{#f/5}一個有著這般\n純潔心靈的怪物...',
                '<18>{#f/31}...怎麼會\n徹底墮入黑暗呢？',
                '<25>{#p/asriel2}{#f/1}* 你真想知道嗎？',
                '<18>{#p/papyrus}{#f/3}...',
                '<18>{#f/3}對...',
                '<25>{#p/asriel2}{#f/10}* 你確實是真心想知道嗎？',
                '<18>{#p/papyrus}{#f/31}對。',
                '<25>{#p/asriel2}{#f/3}* 說大點聲。',
                '<18>{#p/papyrus}{#f/5}對！',
                '<26>{#p/asriel2}{#f/1}* 對我說，{@fill=#ff0}洋{@fill=#fff}求我\n  把{@fill=#ff0}梅{@fill=#fff}說的都告訴你。',
                '<18>{#p/papyrus}{#f/7}好！{@fill=#ff0}洋{@fill=#fff}求你\n把{@fill=#ff0}梅{@fill=#fff}說的都告訴我吧！\n該死！',
                '<25>{#p/asriel2}{#f/1}* 嘻嘻嘻...',
                "<25>{#f/1}* 那好，就讓我來告訴你吧。",
                "<25>{#f/15}* 其實答案很簡單...",
                '<18>{#p/papyrus}{#f/4}我的天哪，快說吧...'
            ],
            papyrusSolo4b: [
                '<25>{*}{#p/asriel2}{#f/14}{@random=1.1/1.1}{@fill=#f00}* $(name)。{%100}',
                '<18>{#p/papyrus}{#f/32}...！',
                '<25>{#p/asriel2}{#f/5}* 哈！\n* 哈哈哈！\n* 看看你什麼表情！'
            ],
            papyrusSolo4c: ['<18>{#p/papyrus}{#f/31}我...', '<18>{#f/3}...不...'],
            papyrusSolo4d: [
                "<18>{#p/papyrus}{#f/7}不，你錯了。",
                "<18>{#f/7}一直想方設法把我擊垮的，\n是你。",
                "<18>{#f/7}那個滿嘴謊話的，還是你。",
                '<18>{#f/9}但是我，PAPYRUS...',
                '<18>{#f/9}總算認清了{@fill=#f00}真相{@fill=#fff}。',
                "<25>{#p/asriel2}{#f/13}* 喔？\n* 真相是什麼呢？"
            ],
            papyrusSolo4e: ["<18>{#p/papyrus}{#f/34}你才不是{@fill=#f00}ASRIEL{@fill=#fff}。"],
            papyrusSolo4f: [
                '<18>{#f/5}{@fill=#f00}ASRIEL{@fill=#fff}絕不可能\n幹出這種事！',
                '<18>{#f/31}因為，{@fill=#f00}ASRIEL{@fill=#fff}心地善良，',
                '<18>{#f/5}信賴同胞...',
                '<18>{#f/31}比誰都相信人類！',
                '<18>{#f/4}而你呢...',
                '<18>{#f/7}你不過是個為了\n一己私慾利用人類的\n卑鄙小人！',
                "<18>{#f/4}我告訴你，\n你愛說啥就說啥，\n我不在乎。",
                '<18>{#f/9}但是，我還相信著\n那個人類。',
                "<25>{#p/asriel2}{#f/8}* 哼，你要真這麼信任他...",
                '<25>{#f/7}* 那就證明給我看看。',
                "<25>{#f/3}* 我會離開一會，\n  讓你倆單獨對峙。",
                "<25>{#f/3}* 他要是饒恕你，\n  那我就認栽。",
                '<25>{#f/4}* 否則，他要是\n  「不小心」殺了你...',
                "<25>{#f/1}* 你就知道你大錯特錯了。\n  而那個懶骨頭死得就\n  一文不值。",
                '<25>{#f/1}* 這主意如何？',
                '<18>{#p/papyrus}{#f/9}...\n我接受。',
                '<25>{#p/asriel2}{#f/3}* 那可太好了。',
                '<25>{#f/4}* 永別了。'
            ]
        },
        houz: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （你把手搭在了劃痕累累的門上。）']
                : ['<32>{#p/basic}* 門上布滿了貓的抓痕。'],
        gonezo: () =>
            world.bulrun ? ['<32>{#p/basic}* ...但是大家都逃走了。'] : ['<32>{#p/basic}* ...但是誰也沒有來。'],
        garbanzo: ['<32>{#p/human}* （但是誰也沒坐在這兒。）'],
        doggonopoggo: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （但是誰也不在這兒。）']
                : (game.room === 's_doggo' && SAVE.data.n.state_starton_doggo === 2) || // NO-TRANSLATE

                    (game.room === 's_dogs' && SAVE.data.n.state_starton_dogs === 2) || // NO-TRANSLATE

                    (game.room === 's_pacing' && SAVE.data.n.state_starton_lesserdog === 2) // NO-TRANSLATE

                    ? ['<32>{#p/basic}* ...但是誰也沒有來。']
                    : ["<32>{#p/basic}* 沒人在家。"],
        housebloc: () =>
            SAVE.data.b.svr ? ["<32>{#p/human}* （你好像沒法進去。）"] : ["<32>{#p/basic}* 鎖住了。"],
        innkeep1a: pager.create(
            0,
            () => [
                "<32>{#p/basic}{#npc/a}* 歡迎來到星光旅館！\n* 星港的一流旅館！",
                '<32>* 每住宿一晚花費60G。',
                choicer.create('* （訂一間房嗎？）', '訂', '不訂')
            ],
            () => [
                '<32>{#p/basic}{#npc/a}* 改變主意了嗎？',
                '<32>* 記住了，一個晚上60G。',
                choicer.create('* （訂一間房嗎？）', '訂', '不訂')
            ]
        ),
        innkeep1b: pager.create(
            0,
            () => [
                '<32>{#p/basic}{#npc/a}* 又回來了嗎？\n* 記住，一個晚上60G。',
                choicer.create('* （再訂一間房嗎？）', '訂', '不訂')
            ],
            () => ['<32>{#p/basic}{#npc/a}* 改變主意了嗎？', choicer.create('* （再訂一間房嗎？）', '訂', '不訂')]
        ),
        innkeep1c: pager.create(
            0,
            () => [
                '<33>{#p/basic}{#npc/a}* 又回來了嗎？\n* 想待多久都可以的。',
                choicer.create('* （再訂一間房嗎？）', '訂', '不訂')
            ],
            () => ['<32>{#p/basic}{#npc/a}* 改變主意了嗎？', choicer.create('* （再訂一間房嗎？）', '訂', '不訂')]
        ),
        innkeep2a: [
            "<32>{#p/basic}{#npc/a}* ...你連60G都沒有嗎？",
            "<32>* 噢！你真可憐。\n* 我能想像到您經歷了些什麼。",
            '<32>* 樓上有一間空房，\n  您可以免費住，好嗎？'
        ],
        innkeep2b: ["<32>{#p/basic}{#npc/a}* 這是您的房間鑰匙。\n* 小心別著涼！"],
        innkeep2c: ["<32>{#p/basic}{#npc/a}* 抱歉，您的錢不夠..."],
        innkeep3a: ['<32>{#p/basic}{#npc/a}* 您好呀！\n* 您看起來睡得很舒服。'],
        innkeep3b: ['<32>* 挺不可思議的...\n* ...因為您在上面\n  只待了幾分鐘。'],
        innkeep3c: ['<32>* 要是累了請隨時回來休息。'],
        innkeep3d: ["<32>* 我把錢退給您。\n* 想過夜的話，可以再付給我喔。"],
        innkeep4: ["<32>{#p/basic}{#npc/a}* 現在還不困？\n* 沒關係，只要您需要，\n  我隨時為您服務！"],
        innkeep5: [
            '<32>{#p/basic}{#npc/a}* 您好！\n* 抱歉，\n  現在沒有時間可供小睡了...',
            '<32>* 星光旅館已經停業了，\n  我們要離開這裡，\n  去尋找新家園了。'
        ],
        innkeep6: [
            "<32>{#p/basic}{#npc/a}* 噢，是你啊。\n* 我一直在擔心你呢！",
            '<32>* 你聽說了嗎？\n  一切都在變得更加順利。',
            "<32>* 我們很快就會在新家園安頓下來...",
            "<32>* 那裡肯定會有\n  屬於你的容身之處的！"
        ],
        kidd1: pager.create(
            2,
            ["<25>{#p/kidd}{#f/1}* 怎麼了嗎？"],
            ['<25>{#p/kidd}{#f/1}* 喲，近來可好？'],
            ['<25>{#p/kidd}{#f/1}* 嘿，嘿！'],
            ['<25>{#p/kidd}{#f/1}* 很高興見到你，哈哈。'],
            ["<25>{#p/kidd}{#f/1}* 哇，老兄，怎麼了嗎？"]
        ),
        kidd2: pager.create(
            0,
            () =>
                game.room === 's_town1' // NO-TRANSLATE

                    ? [
                        "<25>{#p/kidd}{#f/1}* 喲，你也是個孩子，\n  對吧？",
                        "<25>{#p/kidd}{#f/1}* 我看得出來，\n  因為你穿著條紋衫。"
                    ]
                    : [
                        '<25>{#p/kidd}{#f/7}* 等下，你也讀書的嗎！？',
                        '<25>{#p/kidd}{#f/1}* 那個圖書倌教會了我所有\n  關於怪物歷史的知識！',
                        "<25>{#p/kidd}{#f/3}* 星球生活到底是怎樣的呢？\n  想像不出來啊..."
                    ],
            () =>
                game.room === 's_town1' // NO-TRANSLATE

                    ? ['<25>{#p/kidd}{#f/1}* 我尋思著那個矮個子骷髏\n  有沒有成年。']
                    : ['<25>{#p/kidd}{#f/3}* 你有在星球上生活過嗎？']
        ),
        marriage1: [
            "<32>{#p/basic}* 什麼氣味？\n* （哪裡來的氣味？）",
            "<32>* 如果你是這個氣味...\n* （...證明你的氣味！）"
        ],
        marriage2: [
            "<32>{#p/basic}* 嗯...\n* 這就是那個怪氣味。",
            '<32>* 這氣味讓我想把它消滅掉...',
            '<32>* （...把你消滅掉！）'
        ],
        marriage3a: [
            '<32>{#p/basic}* 狗狗可以摸其它狗狗？？？\n* （一扇新世界的大門\n  向我們敞開了...）',
            '<32>* 謝謝你，怪狗狗！'
        ],
        marriage3b: [
            '<32>{#p/basic}* 怪氣味也能帶來好東西嘛...\n* （拋接遊戲真有趣！）',
            '<32>* 謝謝你，怪氣味！\n* （太意外了！\n  真是非同一「扳」得好玩！）'
        ],
        marriage3c: [
            "<32>{#p/basic}* 聞東西越來越費勁了...\n* （感覺自己快瞎了...）",
            "<32>* 咱們快逃吧！"
        ],
        marriage3d: [
            '<32>{#p/basic}* 那隻怪狗狗突然竄出來...\n* （差點弄死了我們...）',
            "<32>* 咱們快逃吧！"
        ],
        marriage3e: [
            "<32>{#p/basic}* 狗狗之間竟然可以相互撫摸\n  並一起玩拋接遊戲？？？\n* （這簡直太犯規了...）",
            '<32>* 謝謝你，怪狗狗！\n* （以後，\n  我們的生活將徹底改變！）'
        ],
        marriage4: [
            "<32>{#p/basic}* 王子在哪？\n* （沒走錯路吧？）",
            '<32>* 必須阻止那個惡魔...\n* （...還有他的人類幫兇！）'
        ],
        marriage5: ['<32>{#p/basic}* 呃...\n* 他們在這...', "<32>* （抓住他們！）"],
        maze1: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}{#f/0}* 歡迎回來。',
                    "<25>{#p/sans}{#f/3}* 真是太遺憾了...",
                    "<25>{#p/sans}{#f/2}* 這個謎題\n  papyrus精心準備了好久...\n* 但現在他有事，來不了了。",
                    "<25>{#p/sans}{#f/0}* 不過，沒關係。",
                    "<25>{#p/sans}{#f/0}* 我答應過他，會讓你解謎的。\n* 那麼，開始吧。"
                ]
                : [
                    '<18>{#p/papyrus}喔吼，\n那個人類來了！',
                    '<18>我和我的兄弟\n整了些謎題。',
                    '<18>{#f/9}你準備好接受\n挑戰了嗎，人類！？',
                    choicer.create('* （你要怎麼回答？）', '準備好了', '沒準備好'),
                    '<18>{#p/papyrus}回答正確！\n因為你也看到了...'
                ],
        maze2a: [
            '<18>{#x4}{#f/9}從來沒有一個工匠\n做的陷阱可以跟我的\n相提並論！',
            "<18>{#f/0}可以讓人無法抗拒！",
            "<25>{#x1}{#p/sans}{#f/2}* 也許你才是那個讓人\n  無法抗拒的人。",
            '<18>{#p/papyrus}{#f/1}真的嗎！？'
        ],
        maze2b: [
            '<18>{#x4}{#f/9}沒有人類能解開由\n偉大的PAPYRUS\n所製作的謎題！',
            '<25>{#x1}{#p/sans}{#f/4}* 也沒人有機會去解，兄弟。',
            "<18>{#p/papyrus}{#x3}{#f/7}呃啊，這不是重點！！"
        ],
        maze3: ['<18>{#x1}{#f/0}不論如何，\n我把這個謎題叫做...'],
        maze3a: [
            '<18>「躲避烈火之牆」！！',
            '<25>{#p/sans}* 你直接叫它「防火牆」\n  不就行了嗎？\n* 這樣多省事。',
            "<18>{#p/papyrus}{#f/4}ALPHYS博士肯定要\n吐槽你瞎用術語了。",
            "<25>{#p/sans}* 這我不清楚，兄弟。\n  不過，博士真的超級喜歡\n  這個謎題。",
            "<30>{#f/2}* 畢竟... 這東西多讓人\n  {@fill=#ff0}熱{@fill=#fff}血沸騰啊。"
        ],
        maze4: ['<18>{#p/papyrus}{#x3}{#f/7}別說了，SANS！！'],
        maze5: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}{#f/0}* 這是「火牆」。',
                    "<25>{#p/sans}{#f/2}* 把它聯想成\n  電腦的「防火牆」就行。",
                    '<25>{#p/sans}* 到達對面，你就過關了。',
                    '<25>{#p/sans}* 很簡單，對吧？',
                    "<25>{#p/sans}{#f/3}* 不過，我之前親自嘗試過\n  這個謎題，只能說...",
                    "<25>{#p/sans}{#f/2}* 它可沒你想得那麼簡單。"
                ]
                : [
                    '<18>{#p/papyrus}...總之，\n這個謎題背後的想法\n其實非常簡單。',
                    '<18>因為你應該做的...',
                    '<18>{#f/9}只有成功到達另一邊！！',
                    '<18>{#f/0}祝你好運！！\n捏嘿嘿！！'
                ],
        maze6: pager.create(
            0,
            () =>
                world.edgy
                    ? [
                        '<25>{#p/sans}{#f/0}* 嗯？你要回哪去？',
                        '<25>{#p/sans}{#f/3}* 試試嘛，\n  起碼配合一下。'
                    ]
                    : ["<18>{#p/papyrus}{#x2}{#f/7}你往哪裡走呢！？"],
            () => (world.edgy ? ['<25>{#p/sans}{#f/0}* 真要走？'] : ['<18>{#p/papyrus}{#x2}{#f/7}快回來！！'])
        ),
        maze7: [
            [
                '<18>{#p/papyrus}你是怕火嗎？？',
                "<18>{#f/4}不用擔心，\n這火其實燒不到你。",
                '<18>{#f/0}用SANS的話來說，\n那些火「暖暖的，很舒服」。',
                '<25>{#p/sans}* 事實上，這句話是我\n  從一個朋友那學來的。',
                '<18>{#p/papyrus}{#f/4}...喔。'
            ],
            [
                '<18>{#p/papyrus}你在擔心解不了謎題嗎？？',
                "<18>如果是那樣的話，\n那你一定得知道...",
                '<18>{#x4}{#f/9}我，偉大的PAPYRUS，\n不會因此而評判你！',
                '<18>{#f/0}就像每個明星大廚\n都知道的那樣，\n心意是最重要的。',
                '<18>{#x1}所以，來吧，\n盡力就好！'
            ],
            [
                '<18>{#p/papyrus}{#f/4}（SANS，那個人類\n在幹什麼啊？？）',
                '<25>{#p/sans}* 可能在研究路線吧。',
                '<18>{#p/papyrus}{#f/4}（喔，確實。）',
                '<18>{#f/9}那樣的話，\n準備好了就前進吧！'
            ]
        ],
        maze8: () =>
            world.edgy
                ? ['<25>{#p/sans}{#f/0}* 哎呀，真可惜。\n* 不過別灰心。']
                : [
                    '<18>{#p/papyrus}捏嘿嘿！\n那好吧。',
                    "<18>{#f/9}看來你被\n偉大的PAPYRUS戲弄了！",
                    '<18>{#f/0}但別擔心！',
                    '<18>你也看到了，\n我的陷阱可不差。',
                    "<18>{#f/9}你不能因為輕易失敗\n就受到指責！！"
                ],
        maze9: () =>
            world.edgy
                ? ["<25>{#p/sans}{#f/0}* 不錯嘛。\n* 沒看出來，你還挺機靈的。"]
                : [
                    '<18>{#p/papyrus}{#f/1}啥！？',
                    '<18>{#f/7}你咋做到的！？！？',
                    '<18>這謎題是個人都過不去啊！',
                    '<18>{#f/9}...哎呀，行吧！\n我得快點布置自己的謎題了！'
                ],
        maze10: () =>
            world.edgy
                ? [
                    "<25>{#p/sans}{#f/0}* 好了，謎題結束了。",
                    '<25>{#p/sans}{#f/3}* ...總之，感謝遊玩。',
                    "<25>{#p/sans}{#f/0}* 現在，\n  我要去準備下個謎題。",
                    "<25>{#p/sans}{#f/2}* 待會見。"
                ]
                : [
                    '<18>{#f/4}無論如何...',
                    '<18>{#f/0}我很期待\n接下來的發展！',
                    '<18>{#f/4}一個令人\n十分困惑的謎題...',
                    "<18>{#f/1}連TERRESTRIA自己\n都解決不了！！",
                    "<25>{#p/sans}* terrestria？\n* 是那個在世\n  最長壽的怪物嗎？",
                    '<18>{|}{#p/papyrus}{#f/1}呃...\n是這樣沒錯，但- {%}',
                    "<25>{#p/sans}* 媽呀，我都不知道\n  原來你對我的評價這麼高。",
                    '<18>{#p/papyrus}{#f/4}啥。',
                    "<25>{|}{#p/sans}* 就是說，\n  如果連她都解不了，\n  那- {%}",
                    '<18>{#p/papyrus}{#f/7}{#x3}我懂你的意思了！！'
                ],
        maze11: ['<18>{#p/papyrus}{#f/7}SANS，\n我們還有謎題要準備呢！！', '<18>快來吧！'],

        nicecreamSc1: [
            "<32>{#p/basic}* 我搞不懂為什麼\n  這些東西賣不出去...",
            "<32>* 這可是享受這些東西的\n  絕佳聖地..."
        ],
        nicecreamSc2: () => [
            SAVE.data.n.plot > 20.2
                ? '<32>{#p/basic}* 喔！！！！\n* ...你回來了！'
                : SAVE.data.b.s_state_scorereaction1 || SAVE.data.n.plot === 20.2
                    ? "<32>{#p/basic}* 等一下！！！！\n* 也許你會喜歡這些東西！"
                    : '<32>{#p/basic}* 喔！！！！\n* 一個顧客！！',
            '<32>* 你好！\n* 想來根冰意靈嗎？',
            SAVE.data.b.s_state_million
                ? '<32>* 作為榜上的第一名，\n  可以給你打個骨折！\n* 每根冰意靈只要6G！'
                : "<32>* 這可是能點燃你內心的冰凍甜品！\n* 現在只要12G。"
        ],
        nicecreamSc3: () => [
            "<32>{#p/basic}* 冰意靈！\n* 能點燃你內心的冰凍甜品！",
            SAVE.data.b.s_state_million ? '<32>* 你的話，只要6G！' : '<32>* 現在只要12G。'
        ],
        nicecreamPrompt1: () => [choicer.create('* （花$(x)G買根冰意靈嗎？）', '買', '不買')],
        nicecreamPrompt2: () => [choicer.create('* （要兌換一根冰意靈嗎？）', '兌換', '算了')],
        nicecreamSc4: [
            '<32>{#p/basic}* 那好吧...\n* 告訴你的朋友...',
            "<32>* 在荒郊野外...\n* 有個買冰淇淋的地方..."
        ],
        nicecreamFc1: ['<32>{#p/basic}* 我換了個地方擺攤，\n  可還是沒有顧客...'],
        nicecreamFc2: [
            "<32>{#p/basic}* 幸運的是，\n  我想到了一個解決方案！！",
            '<32>* 明信片！',
            '<32>* 你每買一根冰意靈，\n  就可以從箱子裡\n  拿一張明信片。',
            '<32>* 如果你有了三張明信片，\n  你就可以換一根\n  免費的冰意靈！',
            "<32>* 這些明信片\n  肯定會給我帶來回頭客的！",
            '<32>* 喔，嗯，\n  你想來根冰意靈嗎？',
            "<32>* 這可是能點燃你內心的冰凍甜品！\n* 現在只要10G。"
        ],
        nicecreamFc3a: [
            "<32>{#p/basic}* 冰意靈！\n* 能點燃你內心的冰凍甜品！",
            "<32>* 你已經有三張明信片了，\n  想要兌換一根冰意靈嗎？"
        ],
        nicecreamFc3b: [
            "<32>{#p/basic}* 冰意靈！\n* 能點燃你內心的冰凍甜品！",
            '<32>* 現在只要10G。'
        ],
        nicecreamFc4: [
            '<32>{#p/basic}* 那好吧...\n* 告訴你的朋友...',
            '<32>* 冰意靈買三贈一...'
        ],
        nicecreamFc5: ["<32>{#p/basic}* 別忘了從箱子裡\n  拿一張明信片！"],
        nicecreamNoFun1: ["<32>{#p/basic}* 嗯？\n* 你的口袋裡沒有\n  空地方了..."],
        nicecreamNoFun2: ['<32>{#p/basic}* 我也希望\n  能把冰意靈做得好放點...'],
        nicecreamNoMun1: ["<32>{#p/basic}* 嗯？\n* 你的錢不太夠..."],
        nicecreamNoMun2: ['<32>{#p/basic}* 我也希望\n  做冰意靈不用花錢...'],
        nicecreamFree1: ['<32>{#p/basic}* 告訴你一個好訊息，\n  這第一根可以免費送你。'],
        nicecreamFree2: ['<32>{#p/basic}* 希望你喜歡...'],
        nicecreamReturnWithGoods: ['<32>{#p/basic}* 沒關係，\n  你隨時都可以回來買。'],
        nicecreamReturnWithNeeds: ["<32>{#p/basic}* 喔，沒關係的。", '<32>* 晚點再來啊，孩子！'],
        nicecreamPurchase: ['<32>{#p/basic}* 拿好了！\n* 願你有個星光璀璨的夜晚！'],
        nicecreamGet: ['<32>{#s/equip}{#p/human}* （你得到了冰意靈。）'],
        nicecreamK1a: ['<25>{#p/kidd}{#f/1}* 喲，可以給我來一根\n  冰意靈嗎？'],
        nicecreamK1b: ["<32>{#p/basic}* 當然沒問題，孩子。\n* 只要你有錢的話。"],
        nicecreamK1c: ['<25>{#p/kidd}{#f/2}* （噓，把這個給他。）'],
        nicecreamK1d: [
            '<25>{#p/kidd}{#f/7}* 喲，這兒有\n  免費的冰意靈吃啊！？',
            '<25>{#p/kidd}{#f/1}* 也給我來一根！'
        ],
        nicecreamK2: ['<32>{#p/basic}* 你... 你是從哪裡\n  拿到這個的？'],
        nicecreamK3a: ['<32>* 沒-沒問題，孩子...\n  給你！'],
        nicecreamK3b: [
            '<32>{#s/equip}{#p/human}* （你把冰意靈遞給了怪物小孩。）',
            '<25>{#p/kidd}{#f/7}* 太棒了...'
        ],
        nicecreamE: pager.create(
            0,
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}* 恐怕我又賣光了！\n* 大家都跑來買東西\n  來慶祝重獲自由了！",
                        ...(world.population_area('s') < 6 || world.population_area('f') < 6 || world.population < 2 // NO-TRANSLATE

                            ? [
                                "<32>* 就算我沒賣光，\n  我也不會賣給你的...",
                                '<32>* 如果我把冰意靈賣給一個惡霸，\n  我的聲譽就全毀了！'
                            ]
                            : [
                                "<32>* 最近生意不錯，\n  我就開始反思過去，\n  並想起了我的父親。",
                                "<32>* 如果不是他發明了冰意靈，\n  我現在可能還在賣廉價的氣球呢。"
                            ])
                    ]
                    : [
                        "<32>{#p/basic}* 嘿，孩子！\n* 我真的很想給你一根冰意靈，\n  但我已經全賣光了！",
                        '<32>* 生意從來沒像今天在這裡\n  這麼火爆過！',
                        "<32>* 我都要供不應求了！"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? world.population_area('s') < 6 || world.population_area('f') < 6 || world.population < 2 // NO-TRANSLATE

                        ? ['<32>{#p/basic}* 當然，我沒有針對你的意思。']
                        : [
                            '<32>{#p/basic}* 據說，\n  他是在星港的全息森林裡\n  賣出了他的第一根冰意靈。'
                        ]
                    : ['<32>{#p/basic}* 也許是時候開一家我\n  夢寐以求的「冰意靈」\n  連鎖店了...']
        ),
        faunX: () =>
            [
                ['<32>{#p/basic}{#npc/a}* 我看得出來，\n  你對生命毫無敬畏之心。\n* 幹得真好啊，贏家。'],
                ['<32>{#p/basic}{#npc/a}* 再接再厲啊，贏家。\n* 看看你這樣下去\n  最後會怎樣。'],
                ['<32>{#p/basic}{#npc/a}* 你真繼續啊，贏家？']
            ][Math.min(roomKills().s_greater++, 2)],
        snowdrakeX: [
            '<32>{#p/basic}{#npc/a}* 嚕？\n* 你剛才...',
            "<32>{#p/basic}{#npc/a}* ...\n* 這，呃，可不咋酷。"
        ],
        moonrocksX1: ['<32>{#p/basic}{#npc/a}* 什麼-\n* 為什麼要那樣做？'],
        moonrocksX2: ['<32>{#p/basic}{#npc/b}* 不是~\n* 到底怎麼回事？'],
        npcinter: {
            s_snowdrake: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 嘿。\n* 你真的很酷。",
                            '<32>* 總之，不管你是要和神\n  還是其他什麼人幹架...',
                            "<32>* 都要記得按住[X]\n  可以讓移動的速度慢一倍。\n* 這很重要。"
                        ]
                        : roomKills().s_doggo > 0
                            ? ["<32>{#p/basic}{#npc/a}* 你離我遠點！\n* 我不喜歡你。"]
                            : SAVE.data.n.plot < 19
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我聽說，如果你在戰鬥中按住[X]，\n  移動的速度會比正常慢一倍！",
                                    '<32>* 我懂... 你覺得沒用，是嗎？',
                                    "<32>* 但我告訴你一個秘密。\n* 那邊那條狗... 他巴不得你\n  移動速度快呢。",
                                    '<32>* 如果你邊按住[X]邊靠近他，\n  你就不會被他發現！',
                                    '<32>* 嚕呵呵... 祝你好運。'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 所以你回來找我聊天了，嗯？',
                                    "<32>* 還挺酷。",
                                    '<32>* 雖然沒我酷，但也算很酷了。'
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 很重要。']
                        : roomKills().s_doggo > 0
                            ? ["<32>{#p/basic}{#npc/a}* 你聾嗎？\n* 走開！"]
                            : SAVE.data.n.plot < 19
                                ? ["<32>{#p/basic}* 你肯定用得到的。"]
                                : ["<32>{#p/basic}* 我很高冷的。"]
            ),
            s_genokid: pager.create(
                0,
                () =>
                    world.genocide
                        ? [
                            '<25>{#p/kidd}{#f/3}{#npc/a}* 剛才，有個小孩走過來\n  往我腦袋裡插了什麼東西。',
                            '<25>{#f/3}* 之後，他就去鑄廠了，\n  說要去「增強訊號」。',
                            '<25>{#f/4}* ...有些小孩真是奇怪。'
                        ]
                        : [
                            '<25>{#p/kidd}{#f/3}{#npc/a}* 喲，大家都去逃難了。',
                            '<25>{#f/3}* 我說，成年人有時候\n  就是這麼蠢，哈哈...',
                            "<25>{#f/1}* 他們難道不知道\n  Undyne會保護我們嗎！？"
                        ],
                () =>
                    world.genocide
                        ? ["<25>{#p/kidd}{#f/7}{#npc/a}* 不過，你可不奇怪，\n  而且長得超酷的！"]
                        : ["<25>{#p/kidd}{#f/1}{#npc/a}* Undyne就是我們的堅實後盾！"]
            ),
            g_beautifulfish: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            "<32>{#p/basic}{#npc/a}* 孩子，你居然還敢來這兒。\n  膽子還真是不小啊。",
                            '<32>* 我們都看到電視上發生的事了。'
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 上次發生那樣的事之後，\n  Sans又回來了，\n  真讓人驚訝。",
                                "<32>* ...實際上，可能也\n  沒那麼讓人驚訝。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 到最後，\n  我的語音信箱裡也沒有收到\n  任何「女孩」的留言。',
                                    '<32>* 所以啊，孩子，\n  聽我一句勸...',
                                    "<32>* 不要妄想能用語音信箱\n  來釣到神奇的太空生物。"
                                ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* Sans到底上哪兒去了？',
                                        '<32>* 他告訴我他有一張星象圖，\n  可以給我用來找女孩...',
                                        '<32>* 我是覺得這多半是個惡作劇，\n  但我想知道這到底\n  是個什麼惡作劇！'
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我今天發了條帖子，\n  看看能不能釣到點「女孩」。',
                                        '<32>* 有人告訴我說\n  漫天群星蘊含著無限可能性...',
                                        "<32>* 所以，我很認真地\n  聽取了那個建議...",
                                        "<32>* 我真的要和一個太空生物\n  卿卿我我了。"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 要聽聽我的感想嗎？',
                            '<32>* ...只有那個機器人會讓我產生\n  想找男朋友而不是女朋友的想法。',
                            "<32>* 看到他走了，我很難過。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 你跟我說話的口氣\n  好像你想知道\n  內幕訊息似的。",
                                "<32>{#p/basic}{#npc/a}* 抱歉孩子。\n* 看來你只能等下一條新聞了。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 不過啊，我有一個未接來電...',
                                    '<32>* ...是個叫「ONIONSAN」的打來的。',
                                    "<32>* 不過這人沒有給我留言。"
                                ]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 你知道Sans在哪兒嗎？']
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我覺得我可以問問Undyne。\n* 但她好像已經喜歡別人了。'
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ["<32>{#p/basic}{#npc/a}* 希望以後還能出現\n  像他一樣可愛的帥哥..."]
                        : SAVE.data.n.plot === 33
                            ? ["<32>{#p/basic}{#npc/a}* 你該不會沒有\n  域外網帳號吧..."]
                            : SAVE.data.n.plot === 72
                                ? ["<32>{#p/basic}{#npc/a}* 到底啥是onionsan啊？"]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 你看到他的話，告訴我一聲...']
                                    : ['<32>{#p/basic}{#npc/a}* 我還能找到真愛嗎？']
            ),
            g_bigmouth: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 嗯...',
                            '<32>* 我在想機器人\n  會喜歡吃怎樣的食物。',
                            '<32>* 他們難道吃都不吃嗎？',
                            "<32>* ...如今我們永遠也無法知道了。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* Sans從第一天起\n  就是這裡的常客了。',
                                ...(papreal()
                                    ? [
                                        '<32>* 他通常會點選單上最難吃的菜...',
                                        '<32>* 不過今天早些時候...',
                                        '<32>* ...他點了選單上第二難吃的菜。',
                                        "<32>* 挺稀奇的，對吧？"
                                    ]
                                    : [
                                        '<32>* 他總是點選單上最難吃的菜，\n  而且從不付帳。',
                                        '<32>* 不過看在他吸引了\n  這麼多其他顧客的份上...',
                                        '<32>* Grillby甚至給他特別\n  安排了點東西。',
                                        '<32>* ...所以「雅莫萬用醬」\n  到底是什麼東西？'
                                    ])
                            ]
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我在想人類惡霸的味道\n  會是怎樣的...',
                                        "<32>* 那人是越壞越好吃嗎？\n* 還是反過來？"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 雖然我很想嘗嘗人類的食物...",
                                        "<32>* 但新世界的食物...\n  肯定要更好吃點。"
                                    ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 嗯，Sans差不多該來了。',
                                        '<32>* 然後，再過一會兒，\n  他的兄弟也會來。',
                                        '<32>* 對，他的兄弟。\n* Papyrus。',
                                        '<32>* 他以前總是點牛奶，\n  但現在，\n  他每次都點不同的東西...',
                                        "<32>* 那個複製器真是個神奇的東西，\n  不是嗎？",
                                        "<32>* 可惜它只能製造怪物的食物。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 嗯...\n* 人類的食物和怪物的\n  應該是不一樣的吧？",
                                        '<32>* 聽說會「變質」什麼的。',
                                        '<32>* 而且不像怪物的食物一樣\n  可以直接轉化為能量...',
                                        '<32>* 人類的食物必須\n  要先通過他們的身體。',
                                        '<32>* 就算在低重力的環境\n  也是這樣。',
                                        "<32>* 真詭異。\n* 我找時間也想試試。"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 真不幸。']
                        : SAVE.data.n.plot === 33
                            ? papreal()
                                ? world.dead_skeleton
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 仔細想想，\n  今天發生的令人不快的事\n  還不止這一件..."
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 真奇怪。']
                                : ["<32>{#p/basic}{#npc/a}* 我們身邊有這樣的人，\n  真是太幸運了。"]
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 說不定，\n  在最後一刻的良心發現，\n  讓那人變成了最美味的。'
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 說不定，新世界的食物\n  比人類的食物壞得更快呢。'
                                    ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我希望他今天能來。\n* 他和他的兄弟\n  都很擅長逗我們笑。'
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 我還聽說他們有\n  叫做「廁所」的東西。'],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 真不幸。']
                        : SAVE.data.n.plot === 33
                            ? papreal()
                                ? ['<32>{#p/basic}{#npc/a}* 真奇怪。']
                                : ['<32>{#p/basic}{#npc/a}* 真開心。']
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? ['<32>{#p/basic}{#npc/a}* 真... 出乎意料。']
                                    : ['<32>{#p/basic}{#npc/a}* 真... 美味。']
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 骷髏真酷。']
                                    : ['<32>{#p/basic}{#npc/a}* 人類真奇怪。']
            ),
            g_bunbun: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* M-mettaton是這裡\n  最-最燒的帥哥了...',
                            '<32>* 沒有他，\n  前哨站冷清了好多好多！'
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* Sansyyyy...\n* 快回來坐我旁邊...！',
                                "<32>* 有你在的時候，\n  一切都那麼有-有-有趣..."
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 我-我在想，\n  新-新世界那有沒有燒男...',
                                    '<32>* 以-以及好喝的東-東...',
                                    "<32>* 噢噢噢噢噢，我已經迫不及待了！"
                                ]
                                : papreal()
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 嘿-嘿，\n  Sansy現在是不是該來晃悠了？",
                                        "<32>* 快來嘛，Sansy！\n* 你可是派對的靈魂人物啊..."
                                    ]
                                    : world.dead_dog
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 這裡也太-太-太安靜了。",
                                            '<32>* 大家開心點嘛！\n* ...',
                                            "<32>* 我有點開始討厭這個地方了。"
                                        ]
                                        : [
                                            "<32>{#p/basic}{#npc/a}* 不論我去到哪裡，\n  看到的都是一樣的選單，\n  遇到的都是一樣的人...",
                                            "<32>* 服務員！\n* 我想再來點喝的，\n  再來點燒-燒-燒-燒男！"
                                        ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 好-好冷清...']
                        : SAVE.data.n.plot === 33
                            ? ['<32>{#p/basic}{#npc/a}* Sansyyyy...']
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}{#npc/a}* 超級超級期待！']
                                : papreal() || world.dead_dog
                                    ? ['<32>{#p/basic}{#npc/a}* ...']
                                    : ["<32>{#p/basic}{#npc/a}* 我感覺那個酒保\n  就挺燒-燒-燒-燒的..."]
            ),
            g_dogamy: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        "<32>{#p/basic}{#npc/a}* 關於Mettaton的事，\n  大家已經吵翻了天，\n* 我的話...",
                        SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                            ? '<32>{#p/basic}{#npc/a}* 我只想知道\n  其他的狗狗都去哪了。'
                            : SAVE.data.n.state_starton_doggo === 2
                                ? '<32>{#p/basic}{#npc/a}* 我還是在想Doggo發生了什麼事。'
                                : SAVE.data.n.state_starton_greatdog === 2
                                    ? '<32>{#p/basic}{#npc/a}* 我還是很懷念\n  那個大傢伙在我們身邊的日子。'
                                    : papreal()
                                        ? '<32>{#p/basic}{#npc/a}* 我還是很懷念\n  Sans和他的兄弟\n  在我們身邊的日子。'
                                        : '<32>{#p/basic}{#npc/a}* 我只希望\n  Sans能回來再摸摸我們的頭。'
                    ]
                    : SAVE.data.n.plot === 33
                        ? ['<32>{#p/basic}{#npc/a}* 噓，我在期待Sans\n  能過來摸摸我們的頭。']
                        : SAVE.data.n.plot === 72
                            ? world.population < 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我們自由啦！\n* 也許現在，Sans終於可以來\n  摸摸我們的頭了。",
                                    "<32>* 這比擔憂著\n  在鎮上肆意橫行的惡霸\n  要好得多了。"
                                ]
                                : [
                                    "<32>{#p/basic}{#npc/a}* 我們自由啦！\n* 也許現在，Sans終於可以來\n  摸摸我們的頭了。",
                                    "<32>* 或許我們新公司的客戶\n  可以代為摸頭。"
                                ]
                            : SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? ['<32>{#p/basic}{#npc/a}* 聞起來有些... 安靜。']
                                : SAVE.data.n.state_starton_doggo === 2
                                    ? ["<32>{#p/basic}{#npc/a}* 我不敢相信Doggo居然失蹤了..."]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? ["<32>{#p/basic}{#npc/a}* 那個大傢伙去哪了？\n* 它不來我們沒法開始玩啊。"]
                                        : papreal()
                                            ? ["<32>{#p/basic}{#npc/a}* Sans去哪了...\n* 他本應該來摸我的頭的..."]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 你最好盯緊了你坐的地方，\n  孩子。',
                                                '<32>* 那個大傢伙隨時都會\n  跳到你的大腿上，\n  給你滿滿的愛和關注。'
                                            ],
            g_dogaressa: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}{#npc/a}* （我和我老公\n  只想讓大家冷靜下來。）',
                        "<32>{#p/basic}{#npc/a}* （Mettaton的死是個悲劇，\n  但他只是個電視人物而已！）"
                    ]
                    : SAVE.data.n.plot === 33
                        ? ['<32>{#p/basic}{#npc/a}* （我喜歡Sans。）\n* （有的時候他會在桌子底下\n  餵我們一些殘羹剩飯。）']
                        : SAVE.data.n.plot === 72
                            ? world.population < 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* （既然我們自由了，\n  我們打算開一家婚姻諮詢公司。）",
                                    '<32>* （我們的第一個課程將會叫做\n  「處於虐待關係中\n   意味著什麼」。）'
                                ]
                                : [
                                    "<32>{#p/basic}{#npc/a}* （既然我們自由了，\n  我們打算開一家婚姻諮詢公司。）",
                                    '<32>* （我們的第一個課程將會叫做\n  「和你的母親結婚的\n   注意事項」。）'
                                ]
                            : SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* （今天這裡好冷清啊。）\n* （如果我們的朋友不來，\n  你願意和我們一起玩嗎？）"
                                ]
                                : SAVE.data.n.state_starton_doggo === 2
                                    ? ["<32>{#p/basic}{#npc/a}* （Doggo去哪了？）\n* （希望他這回沒有迷路。）"]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? ["<32>{#p/basic}{#npc/a}* （Canis Major去哪了？）\n* （他本應該在這裡\n  和我們一起玩遊戲的。）"]
                                        : papreal()
                                            ? ['<32>{#p/basic}{#npc/a}* （那些骷髏去哪了？）\n* （我想從他們那兒弄根骨頭...）']
                                            : [
                                                "<32>{#p/basic}{#npc/a}* （我們是哨兵，\n  但我們從來沒得到\n  一點尊重。）",
                                                '<32>* （真希望那幾個骷髏可以\n  丟幾根骨頭給我們。）',
                                                '<32>* （我們最喜歡骨頭了。）'
                                            ],
            g_doggo: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}{#npc/a}* 失去Mettaton真是太糟糕了，\n  你能懂嗎？',
                        '<33>* 整個前哨站裡，\n  就他最震天動地了！',
                        "<32>* 沒有他，電視上可能就\n  只會出現那些動都不動的人了。"
                    ]
                    : SAVE.data.n.plot === 33
                        ? [
                            '<32>{#p/basic}{#npc/a}* 嗯？\n* 你和Sans什麼時候\n  成為朋友了？',
                            "<32>* 我不太喜歡那傢伙...",
                            '<32>* 他喜歡一動不動地出現。'
                        ]
                        : SAVE.data.n.plot === 72
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我已經很久沒有被抱過了，\n  但終於有人向我張開了懷抱。",
                                '<32>* 冰狼現在是我的新狼了。'
                            ]
                            : SAVE.data.n.state_starton_dogs === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 有時候大夥喜歡捉弄我。\n  他們一動不動地坐著，\n  讓我察覺不到。",
                                    '<32>* 他們肯定就在這附近，\n  拿我開涮呢。',
                                    "<32>* 我就等著他們中的誰承認吧..."
                                ]
                                : SAVE.data.n.state_starton_dogs === 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 另外那倆去哪了？\n* 就我一個可沒法和這個大傢伙玩...",
                                        "<32>* 那樣可太困難了！"
                                    ]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 那個大傢伙去哪了？\n* 就我一個可沒法和這倆玩...",
                                            "<32>* 那樣可太簡單了！"
                                        ]
                                        : papreal()
                                            ? ['<32>{#p/basic}{#npc/a}* Papyrus？\n* 是你嗎？\n* 快過來...']
                                            : [
                                                "<32>{#p/basic}{#npc/a}* 我在考慮把頭髮留長一點，\n  來彰顯我的個性。",
                                                '<32>* 它代表著：「請給我一個\n  大大的、溫柔的擁抱，\n  摟摟我。」'
                                            ],
            g_grillby: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}* ...\n* ...\n* ...',
                        '<32>{#npc/a}* Grillbz說壓軸好戲\n  對生意有好處。',
                        "<32>* 不過，我不確定他\n  是不是真的喜歡這樣。"
                    ]
                    : SAVE.data.n.plot === 33
                        ? SAVE.data.b.item_fast_food
                            ? [
                                '<32>{#p/basic}* ...\n* ...\n* ...',
                                '<32>{#npc/a}* Grillbz說他只讓Sans\n  免費吃飯，因為他幫著吸引了\n  其他顧客。',
                                "<32>* 我感覺硬說的話\n  好像還真是這麼回事..."
                            ]
                            : [
                                '<32>{#p/basic}* ...\n* ...\n* ...',
                                '<32>{#npc/a}* Grillbz建議你\n  在他把食物扔掉之前\n  把它們帶走。'
                            ]
                        : SAVE.data.n.plot === 72
                            ? world.population < 4
                                ? ['<32>{#p/basic}* ...\n* ...\n* ...好吧。']
                                : ['<32>{#p/basic}* ...\n* ...\n* ...好樣的。']
                            : postSIGMA()
                                ? [
                                    '<32>{#p/basic}* ...\n* ...\n* ...',
                                    '<32>{#npc/a}* Grillbz說酒吧的一些裝置\n  最近壞掉了。',
                                    "<32>* 我們本來想花錢找人修的，\n  但自從Mettaton取消了\n  他的表演什麼的...",
                                    "<32>* 我們的利潤每分鐘都在減少。"
                                ]
                                : world.population < 4
                                    ? [
                                        '<32>{#p/basic}* ...\n* ...\n* ...',
                                        '<32>{#npc/a}* 今天店裡這麼冷清，\n  Grillbz實在很對不起。',
                                        "<32>* 我看，那些老主顧可能就是怕了...",
                                        '<32>* 怕那個惡霸。\n* 當然嘍。'
                                    ]
                                    : [
                                        '<32>{#p/basic}* ...\n* ...\n* ...',
                                        '<32>{#npc/a}* Grillbz說他是在一本\n  電子雜誌上找到他的\n  新顏色的。',
                                        "<32>* 我個人還是更喜歡Grillbz\n  原始的那個橘色。\n* 僅個人觀點。"
                                    ],
            g_punkhamster: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            "<32>{#p/basic}{#npc/a}* 你真把那個大人物機器人\n  給教訓了一頓，是不是？",
                            "<32>* ...可是，他讓我有點同情他。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* Sans當然知道該怎麼逗你笑，\n  對吧？',
                                '<32>* 那是肯定的。\n* 這裡的帳單幾乎都是\n  那個骷髏付的。'
                            ]
                            : SAVE.data.n.plot === 72
                                ? world.population < 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 你知道嗎，孩子，\n  我喜歡你的鬥志。",
                                        "<32>* 本來以為我們都回到了鎮上，\n  可以成為很好的朋友。",
                                        "<32>* ...但是我們又要搬走了，對吧？",
                                        "<32>* 也是。\n* 畢竟這裡終究成不了\n  強者的天堂啊。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 如果我們自由了，\n  人們就不用\n  從首塔搬到這裡來了！",
                                        "<32>* 看來不用擔心\n  我們的地方文化會消失了。",
                                        "<32>* ...只是我們都要搬走了，對吧？",
                                        "<32>* 也是。\n* 畢竟「世間安得兩全法，\n  不負自由不負卿」嘛。"
                                    ]
                                : papreal() || world.dead_canine || world.population < 6
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 首塔的人口越來越多了，\n  所以我聽說他們打算\n  搬到這裡來。",
                                        "<32>* ...誰知道呢？\n* 也許我們有地方容納他們。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 首塔的人口越來越多了，\n  所以我聽說他們打算\n  搬到這裡來。",
                                        "<32>* 嗯...\n* 我不想看到我們的\n  地方文化被抹去。",
                                        "<32>* 但是教那些城裡人\n  我們的生活方式\n  肯定很有趣！"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ["<33>{#p/basic}{#npc/a}* 我在這件事上有點矛盾。"]
                        : SAVE.data.n.plot === 33
                            ? ["<32>{#p/basic}{#npc/a}* 常客？\n* 你說誰，我嗎？\n* 不至於，我只能算半個常客。"]
                            : SAVE.data.n.plot === 72
                                ? world.population < 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 我想起來了，孩子，\n  你給了我靈感。\n* 我要成立一個搏殺俱樂部。"
                                    ]
                                    : ["<32>{#p/basic}{#npc/a}* 我們只需要\n  再想出點新東西就好了，\n  對吧？"]
                                : ["<32>{#p/basic}{#npc/a}* 哈，儘管來吧！"]
            ),
            g_redbird: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 呼呼呼！\n* 那可真是太精彩了！',
                            "<32>{#p/basic}{#npc/a}* ...呃，難道只有我覺得\n  這一切都只是個騙局嗎？"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* Sans是皇家哨兵，\n  但別被他的頭銜騙了。",
                                '<32>* 大家都知道他\n  坐在全息森林邊上\n  讀著懸浮車手冊。'
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 哇，是嶄新的世界啊...',
                                    '<32>* 我以後可能沒機會\n  再給Grillbz做翻譯了...',
                                    "<32>* ...也或許還有機會！\n* Grillbz，\n  你打算把這家店搬到那裡去嗎？",
                                    '<32>{#npc}* ...\n* ...\n* ...',
                                    ...(world.population < 4
                                        ? [
                                            "<32>{#npc/a}* Grillbz說他相當樂意。",
                                            '<33>* 他肯定還在怕你呢。'
                                        ]
                                        : ["<32>{#npc/a}* Grillbz說他會考慮的。"])
                                ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* Grillby越來越緊張了。',
                                        "<32>* Sans是他的頭號常客，\n  今天卻一直沒出現..."
                                    ]
                                    : world.dead_dog
                                        ? [
                                            '<32>{#p/basic}{#npc/a}* 那些狗是皇家衛隊的成員，\n  是由...',
                                            '<32>* 欸？\n* 他們去哪了？\n* 奇怪...'
                                        ]
                                        : world.population < 4
                                            ? [
                                                "<32>{#p/basic}{#npc/a}* 聽傳言說，有個瞎晃悠的惡霸，\n  路上的人全都被他揍了。",
                                                '<32>* 不過我和Grillbz可不打算關店跑路。',
                                                "<32>* 區區惡霸，怎能逼得走咱們！"
                                            ]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 那些狗是皇家衛隊的成員，\n  是由UNDYNE領導的\n  軍事集團。',
                                                "<32>* 她粗魯，吵鬧，\n  誰不尊重她，她就揍誰...",
                                                "<32>* 難怪所有小孩子都希望\n  長大要像她那樣呢！"
                                            ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 鬼知道那些\n  又粗魯又吵鬧的電視主持人\n  葫蘆裡賣的什麼藥。']
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 別問我他為什麼\n  那麼做。",
                                "<32>* 不過如果一定要我猜的話，\n  我覺得這和Papyrus有關。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 如果他真的在新家園\n  開了一家Grillby's...",
                                    ...(world.population < 4
                                        ? ['<32>* 我們只能祈禱\n  那裡的旅客會更友善一些。', "<32>* ...我不好說你。"]
                                        : [
                                            "<32>* 我們只能祈禱那裡的水不多。",
                                            "<32>* ...水多了會很危險。"
                                        ])
                                ]
                                : papreal() || world.dead_dog
                                    ? ['<32>{#p/basic}{#npc/a}* 感覺有點不對勁。']
                                    : world.population < 4
                                        ? ["<32>{#p/basic}{#npc/a}* 至少那人沒在外頭搞屠殺。"]
                                        : ['<32>{#p/basic}{#npc/a}* 我長大了也要像UNDYNE那樣！\n* 吼吼吼！']
            ),
            l_cupjake: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 既然我們現在自由了，\n  那位可愛的女士\n  也總該離開了吧。",
                            '<32>* 然後，我就能親自了解\n  那本{@fill=#f00}奇怪的書{@fill=#fff}裡的內容了...'
                        ]
                        : [
                            "<32>{#p/basic}{#npc/a}* 這裡有一本{@fill=#f00}奇怪的書{@fill=#fff}，\n  它會隨機出現和消失...",
                            '<32>* 但那位可愛的女士\n  似乎總是妨礙我去拿！',
                            '<32>* 你知道該怎麼樣\n  才能把她嚇跑嗎？'
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 跟你講，\n  我很快就能拿到那本書了。', '<32>* 很快就能了。']
                        : ["<32>{#p/basic}{#npc/a}* 我知道你在想什麼。", "<32>* 你別試。"]
            ),
            l_kakurolady: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<32>* 這將是我們的最後一期新聞了...",
                            '<32>* 不如我們直接在封面上\n  寫個大大的「劇終」，\n  然後收工算了？'
                        ]
                        : [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            '<33>* 我上學的時候，如果我們沒有作業，\n  老師會給我們布置一些\n  「找不同」的謎題。',
                            '<32>* 我那時候覺得那是在浪費時間。\n* 但看看現在的我...',
                            "<33>* 我現在是前哨站第一的\n  「找不同」謎題設計師了！"
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<32>* 哎呀，乾脆我們現在\n  就辭職不幹了吧？"
                        ]
                        : [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<33>* 相信我，孩子。\n* 你不會想來幹這行的。"
                        ]
            ),
            l_librarian: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 歡迎來到圖書倌。',
                            ...(world.population === 0
                                ? ["<32>* 如果你再敢打人，\n  你會後悔的。"]
                                : ["<32>* 今天是我們最後一天營業，\n  所以你想怎麼吵就怎麼吵吧。"])
                        ]
                        : postSIGMA()
                            ? [
                                "<32>{#p/basic}{#npc/a}* 歡迎來到圖書倌。\n* 這裡是鎮上唯一用不著電的地方。",
                                '<32>* 考慮到最近停電了，\n  這還是蠻重要的。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 歡迎來到圖書倌。\n* 老實說，這名字\n  來源於一次拼寫錯誤。',
                                '<32>* 久而久之，\n  所有人都這麼叫了...'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population === 0
                            ? ["<32>{#p/basic}{#npc/a}* 你也是有感情的吧？"]
                            : ["<32>{#p/basic}{#npc/a}* 也不是說以前有人不讓你吵..."]
                        : ["<32>{#p/basic}{#npc/a}* 如果你懶得去修正一些細小的問題，\n  就會發展成現在這樣的狀況。"]
            ),
            l_sweetie: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 噢我的天哪，\n  有好多新聞要報導，\n  我都不知道該從何說起了！",
                            '<32>* 標題要不就寫...\n* 「怪物終於逃離了前哨站」。',
                            "<32>* 嗯，\n  感覺這個標題還是不夠吸引人...",
                            '<32>* 「你絕對想不到\n   是誰幫我們逃離了前哨站」，\n  這個怎麼樣！'
                        ]
                        : postSIGMA()
                            ? [
                                '<32>{#p/basic}{#npc/a}* 最近，\n  新聞推送的工作\n  變得越來越麻煩了。',
                                "<32>{#p/basic}{#npc/a}* 很多時候，\n  我甚至無法登入\n  我自己的帳戶！",
                                '<32>{#p/basic}{#npc/a}* 為了解決這個問題，\n  我可能得親自去\n  休閒迴廊的伺服器那邊看看了...'
                            ]
                            : world.dead_dog || world.population < 6
                                ? SAVE.data.b.killed_mettaton
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 新聞推送的工作\n  變得越來越沒意思了。',
                                        '<32>* 先是之前的可怕新聞，\n  現在又是那個名流的事...',
                                        "<32>* 我在考慮要不要辭職了。"
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我喜歡做新聞推送的工作。',
                                        "<32>* 不過，我最近不得不\n  報導一些可怕的事...",
                                        "<32>* 我開始懷疑我的人生選擇了。"
                                    ]
                                : SAVE.data.b.killed_mettaton
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我喜歡做新聞推送的工作。',
                                        '<32>* 唯一的問題是，\n  如果有什麼名流去世了...',
                                        "<32>* 接下來一段時間裡，\n  大家就只會想讓我\n  報導這相關的事了。"
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我喜歡做新聞推送的工作。',
                                        "<32>* 因為沒有什麼可報導的，\n  所以我們就用漫畫和遊戲\n  來填充版面。",
                                        '<32>* 真希望大家不會看膩。'
                                    ],
                () =>
                    world.dead_dog || world.population < 6 || SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 你有沒有覺得\n  你的人生就像是在原地打轉？']
                        : ["<32>{#p/basic}{#npc/a}* 你有沒有覺得\n  好像缺了點什麼？"]
            ),
            s_faun: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我們都自由了？",
                                "<32>* 好好好...\n* 我還以為我們會遍體鱗傷呢。",
                                "<33>* 真是沒想到啊。\n* 相信那隻狗狗不會介意\n  你以前幹了什麼了。"
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 我們都自由了？",
                                "<32>* 好好好...\n* 我就不再閒逛了。\n* 那隻狗狗知道嗎？",
                                "<33>* 嗯，我會去告訴它的。"
                            ]
                        : roomKills().s_greater > 0
                            ? ["<32>{#p/basic}{#npc/a}* 抱歉，孩子。\n* 現在可不是聊天的時候。"]
                            : 30 <= SAVE.data.n.plot
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 聽說那隻狗狗\n  玩4D撲克牌...',
                                    '<32>* 不知道它贏過沒？\n* 我挺想知道的。'
                                ]
                                : [
                                    [
                                        '<32>{#p/basic}{#npc/a}* 就在剛剛，\n  一隻靈感爆發的狗衝了進來。',
                                        '<32>* 它一直試圖創作一幅全息影像\n  來表達自己的情感...',
                                        '<32>* 但是，他越是創作，\n  就越是興奮...',
                                        '<32>* 它的脖子變得越來越長，\n  作品也越來越亮，\n  直到...',
                                        "<32>* 看得我很傷心，\n  但我無法移開視線。"
                                    ],
                                    [
                                        "<32>{#p/basic}{#npc/a}* 你說之前那隻狗狗...？\n* 它大概在Grillby's。\n* 我覺得。",
                                        '<32>* 下班後，\n  那幫狗狗都會去那一起打牌。',
                                        "<32>* 但那隻狗狗\n  不太懂得表達自己。",
                                        '<32>* 所以，它最後只能一個人玩，\n  沒有去融入其他的狗狗...'
                                    ],
                                    [
                                        "<32>{#p/basic}{#npc/a}* 那隻狗狗去哪了？",
                                        '<32>* 它每天下班後\n  通常都會從這裡經過的...'
                                    ],
                                    [
                                        '<32>{#p/basic}{#npc/a}* 剛有隻狗狗經過這兒，\n  身上全是傷...',
                                        '<32>* 到底是有多沒良心，\n  才能對小可愛下毒手啊？'
                                    ]
                                ][SAVE.data.n.state_starton_lesserdog],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ["<32>{#p/basic}{#npc/a}* 別擔心，孩子。\n* 現在大部分狗狗\n  估計已經原諒你了。"]
                            : ["<32>{#p/basic}{#npc/a}* 別擔心，孩子。\n* 我會幫你搞定的。"]
                        : roomKills().s_greater > 0
                            ? ['<32>{#p/basic}{#npc/a}* ...']
                            : 30 <= SAVE.data.n.plot
                                ? ["<32>{#p/basic}{#npc/a}* 等那隻狗狗\n  贏下一把4D撲克牌，\n  估計我們都早歸西了。"]
                                : [
                                    ['<32>{#p/basic}{#npc/a}* 對那狗狗來說挺糟糕吧，嗯？'],
                                    ['<32>{#p/basic}{#npc/a}* 對那狗狗來說很糟糕吧，嗯？'],
                                    ['<32>{#p/basic}{#npc/a}* 你見過它嗎？'],
                                    ['<32>{#p/basic}{#npc/a}* 惡劣，真惡劣。']
                                ][SAVE.data.n.state_starton_lesserdog]
            ),
            s_moonrocks1: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                '<32>{#p/basic}{#npc/a}* 哈-\n* 不可思議-',
                                '<32>* 我確實知道\n  我的月巖是真貨-',
                                "<32>* 但就連我自己都沒想到，\n  居然是你的殘忍行徑\n  導致我獲得了承認-"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 切-\n* 難以置信-',
                                "<32>* 我居然要和那傢伙共事-",
                                '<32>* 至少我們的銷售業績\n  應該能大幅增長-'
                            ]
                        : roomKills().s_pacing > 0
                            ? ["<32>{#p/basic}{#npc/a}* 切-\n* 對不起，我不跟你這種人做生意-"]
                            : SAVE.data.b.killed_mettaton
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 夥計-\n* Mettaton發生了那樣的事，\n  真是太糟糕了-",
                                    "<32>* 但我願意為了這件事\n  出售我的特別版月巖-",
                                    '<32>* 不像那傢伙，\n  只會給他的普通月巖降價-'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 切-\n* 難以置信-',
                                    '<32>* 我從月亮上弄到了真正的月巖，\n  長得可比那傢伙在電話裡說的垃圾\n  強多了-',
                                    "<32>* 那傢伙的石頭，\n  一點都不像月亮-"
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ['<32>{#p/basic}{#npc/a}* 是啊，我還得謝謝你呢-']
                            : ["<32>{#p/basic}{#npc/a}* 這對生意有所好處-"]
                        : roomKills().s_pacing > 0
                            ? ["<32>{#p/basic}{#npc/a}* 切-\n* 對不起，我不跟你這種人做生意-"]
                            : ['<32>{#p/basic}{#npc/a}* 那傢伙真挺有種啊-']
            ),
            s_moonrocks2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                "<32>{#p/basic}{#npc/a}* 呃啊啊~ \n* 夥計，我實在受不了了~",
                                "<32>* 又被他糾纏，\n  又被你欺負，\n  我真是受夠了~",
                                "<32>* 也許他的月巖並不真，\n  但認了他能讓我清靜點~"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 噗~\n* 啊對對~',
                                "<32>* 我們終於可以一同工作啦~",
                                "<32>* 現在我們都賣的是\n  我的正品月巖了呢~"
                            ]
                        : roomKills().s_pacing > 0
                            ? ['<32>{#p/basic}{#npc/a}* 噗~\n* 別想從我這買月巖~']
                            : SAVE.data.b.killed_mettaton
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 那個前哨站明星\n  也真是夠慘的~',
                                    "<32>* 不過別擔心~\n* 我不像左邊的那哥們，\n  我可不會漲價~",
                                    '<32>* 我的月巖反而在搞促銷呢~'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 噗~\n* 啊對對~',
                                    "<32>* 我左邊的那哥們\n  在賣假到不行的月巖呢，\n  笑死~",
                                    "<32>* 他說的話你一句也別信~"
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ['<32>{#p/basic}{#npc/a}* 啊對對~\n* 事情發展到了這個地步，\n  真是抱歉啦~']
                            : ['<32>{#p/basic}{#npc/a}* 是啊，他的才是假月巖~']
                        : roomKills().s_pacing > 0
                            ? ['<32>{#p/basic}{#npc/a}* 噗~\n* 別想從我這買月巖~']
                            : ["<32>{#p/basic}{#npc/a}* 那哥們真挺有膽啊~"]
            ),
            t_bunny: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我的小肉桂總有一天會長大的...",
                            "<32>* 因為他是我弟弟，\n  我只能希望他一切都好。",
                            '<32>* 我真希望他\n  能在我們的新家園快樂成長。'
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 啊，這日子真是安靜祥和呀...",
                                '<32>* 那些平時煩我的人\n  現在都忙著在電視機前\n  哭哭啼啼呢！'
                            ]
                            : papreal()
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 啊，這日子真是安靜祥和呀...",
                                    '<32>* 平時本都有一個骷髏\n  追著我的小肉桂跑來跑去的。'
                                ]
                                : world.dead_canine
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 啊，這日子真是安靜祥和呀...",
                                        '<32>* 平時本都有一隻狗狗\n  追著我的小肉桂跑來跑去的。'
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 我的小肉桂是最可愛的！",
                                        '<32>* 小兔兔真的太可愛了...\n* 嘻嘻！'
                                    ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}{#npc/a}* 時間過得真快啊，小兔兔..."]
                        : SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 我想知道發生了什麼事...']
                            : papreal() || world.dead_canine
                                ? ['<32>{#p/basic}{#npc/a}* 我想知道他們去哪了...']
                                : ['<32>{#p/basic}{#npc/a}* 兔-兔-兔-兔-兔...']
            ),
            t_icewolf: () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#npc/a}* 冰狼今天很開心。\n* 可愛的Doggo終於\n  被冰狼抱在懷裡了。",
                        '<32>* 冰狼如今是他的新狼了。'
                    ]
                    : SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 冰狼注意到小鎮的士氣正在下降。',
                            '<32>* 冰狼只希望大家都能開心。'
                        ]
                        : world.dead_canine
                            ? [
                                "<32>{#p/basic}{#npc/a}* 冰狼今天沒有見到\n  冰狼的狗狗朋友們。",
                                '<32>* 冰狼很傷心。'
                            ]
                            : SAVE.data.n.state_starton_doggo === 2
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 冰狼今天沒有見到\n  可愛的Doggo。',
                                    '<32>* 冰狼很孤單。'
                                ]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 冰狼今天\n  一個骷髏也沒有見到。', '<32>* 冰狼很擔憂。']
                                    : SAVE.data.n.state_starton_doggo === 1 &&
                                        SAVE.data.n.state_starton_dogs === 1 &&
                                        SAVE.data.n.state_starton_greatdog === 1 &&
                                        SAVE.data.n.state_starton_lesserdog === 1
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 冰狼要和冰狼的狗狗朋友們\n  玩拋接遊戲了。",
                                            '<32>* 冰狼很激動。'
                                        ]
                                        : world.population < 6
                                            ? [
                                                world.bullied
                                                    ? '<32>{#p/basic}{#npc/a}* 冰狼想知道\n  為什麼這麼多怪物受傷了。'
                                                    : '<32>{#p/basic}{#npc/a}* 冰狼想知道\n  為什麼這麼多怪物不見了。',
                                                '<32>* 冰狼很擔憂。'
                                            ]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 冰狼在思考為什麼\n  自己沒有冰可扔的時候，\n  冰狼還叫冰狼。',
                                                '<32>* 冰狼很疑惑。'
                                            ],
            t_imafraidjumitebeinagang: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我去找了找Papyrus，\n  想問問他的棉絲收藏是哪來的，\n  結果他說他會幫我也弄一些！",
                            "<32>* 他真是棒極了不是嗎？"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我的MTT牌牙刷又壞了，\n  這次我還修不好一點。",
                                "<32>* ...結果他們現在還不再生產了。"
                            ]
                            : papreal()
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我去找了找Papyrus，\n  想問問他的棉絲收藏是哪來的，\n  結果他壓根不在。",
                                    '<32>* 你知道是怎麼回事嗎？'
                                ]
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 我可以借你我的MTT牌牙刷...",
                                        "<32>* ...不過我感覺\n  你會把它弄得粉碎。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 那些MTT牌的牙刷\n  質量真的爛透了。",
                                        '<32>* 我還沒拿它刷牙呢，\n  只是輕輕一咬，就碎了！'
                                    ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我去找了找Papyrus，\n  想問問他的棉絲收藏是哪來的，\n  結果他說他會幫我也弄一些！",
                            "<32>* 他真是棒極了不是嗎？"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 看來我以後只能\n  用質量好點的牙刷了。"]
                            : papreal()
                                ? ['<32>{#p/basic}{#npc/a}* 嗯...\n* 我想知道骷髏是怎麼刷牙的。']
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 在酒吧附近晃悠晃悠，\n  你就能摸清這地方的底細了...\n* 好壞兩方面都能了解清楚。'
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 不過話說回來，\n  這是最便宜的選擇了...']
            ),
            t_kabakk: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                "<32>* ...你真怪。",
                                '<32>* 你讓我們受罪，\n  然後自己又為了\n  拯救我們大家而受罪。',
                                "<32>* 我不明白。",
                                '<32>* ...',
                                '<32>* ...',
                                "<32>* 哎呀我壓根不知道\n  該怎麼處理這種情況！\n* 耶！"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                "<32>* ...你真酷。",
                                '<32>* 你為了拯救我們大家而受罪了，\n  感謝你。',
                                '<32>* 你真是太牛了。',
                                '<32>* ...',
                                '<32>* ...',
                                '<32>* 新領袖萬歲！\n* 耶！'
                            ]
                        : world.meanie
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                '<32>* 欸孩子，你最近都在幹啥？',
                                "<32>* 你咋這副兇相...",
                                '<32>* ...',
                                '<32>* ...',
                                '<32>* 尊重我的權威！\n* 耶！'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                '<32>* 你以為你能站在那\n  盯著我看嗎？',
                                "<32>* 行吧，我告訴你個壞訊息，\n  夥計。",
                                "<32>* 我是個執法人員。",
                                '<32>* 所以，呃...',
                                '<32>* 尊重我的權威！\n* 耶！'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? ['<32>{#p/basic}{#npc/a}* ...']
                            : ['<32>{#p/basic}{#npc/a}* 為新領袖歡呼吧，夥計。']
                        : ['<32>{#p/basic}{#npc/a}* 尊重下吧，夥計。']
            ),
            t_loverboy: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿嘿...',
                                "<32>* ...儘管你做了那些事，\n  你仍然選擇了...",
                                "<32>* 噢... 噢天呀...\n* 我感覺我快要哭了，\n  但我不想讓你看到...",
                                "<32>* ...等等，別傷害我！"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿嘿...',
                                "<32>* ...多虧了你，我們都...",
                                "<32>* 噢... 噢天呀...\n* 我感覺我快要哭了，\n  但我不想讓你看到...",
                                '<32>* ...呃，我可以哭嗎？'
                            ]
                        : papreal() || world.dead_canine || SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 嘿嘿，\n  為什麼鎮上的人都這麼難過？",
                                '<32>* 發生了什麼事嗎？'
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 嘿嘿，什麼東西都無法改變\n  我的生活！",
                                '<32>* 哈... 哈...'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ["<32>{#p/basic}{#npc/a}* 我仍然覺得你很酷...！\n* 求求你別傷害我。"]
                            : ['<32>{#p/basic}{#npc/a}* 我愛你...！']
                        : papreal() || world.dead_canine || SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 也許只是我的錯覺吧。"]
                            : ["<32>{#p/basic}{#npc/a}* 也許我是瘋了吧。"]
            ),
            t_politics: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 我聽說國王揭露了\n  他「殺害」人類們的真相。',
                            "<32>* 大家都為自己以前不清楚\n  而感到難過。\n* 他們都給了國王一個大大的擁抱。",
                            '<32>* 然後他們就把人類帶走了，\n  並親自收養了他們。',
                            '<32>* 現在，那些人類將會\n  和我們一起生活。',
                            "<32>* 這-就-是-政治啊！"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 嗯，\n  最近大家都在談論電視，\n  真是奇怪。",
                                "<32>* 發生什麼事了...？\n* 我希望這不會影響到\n  我們的政治體系..."
                            ]
                            : papreal()
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 嗯，\n  Papyrus通常會在這個時候\n  去見Undyne的。',
                                    '<32>* 他去哪了...？\n* 我能感覺到\n  我們的政治體系正在崩潰...'
                                ]
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 這個鎮上沒有真正的警察。\n* 但也許那些假警察能嚇跑惡霸們。',
                                        '<32>* 政治還在繼續...'
                                    ]
                                    : world.trueKills > 0 || SAVE.data.n.bully > 0
                                        ? [
                                            '<32>{#p/basic}{#npc/a}* 這個鎮上沒有鎮長。',
                                            '<32>* 但是，\n  如果發生什麼事，\n  有個骷髏會告訴一位魚女士。',
                                            "<32>* 這-就-是-政治啊！"
                                        ]
                                        : [
                                            '<32>{#p/basic}{#npc/a}* 這個小鎮總是那麼沉悶。',
                                            "<32>* 但是，如果事情\n  繼續這樣發展下去的話，\n  也許這種情況會改變。",
                                            '<32>* 這就是政治吧？'
                                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}{#npc/a}* 看到了吧？\n* 政治也能帶來好事..."]
                        : SAVE.data.b.killed_mettaton || papreal() || world.popmax(0) - world.population > 4
                            ? ['<32>{#p/basic}{#npc/a}* 政治...']
                            : world.trueKills > 0 || SAVE.data.n.bully > 0
                                ? ['<32>{#p/basic}{#npc/a}* 政治。']
                                : ['<32>{#p/basic}{#npc/a}* 政治？']
            ),
            t_rabbit: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 很久以前，\n  我聽說他們沒有「力場」\n  這種高級玩意。',
                            '<32>* 我只想說...\n  能夠回到從前那樣\n  真是太好了。'
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                '<32>{#p/basic}{#npc/a}* 很久以前，\n  我聽說電視名人到處都是。',
                                "<32>* 現在，\n  他們似乎要成為過去了。"
                            ]
                            : papreal()
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 很久以前，\n  我聽說這個前哨站\n  是一個沉悶的地方。',
                                    "<32>* 照這樣下去...\n  我們又會遇到同樣的問題。"
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 很久以前，\n  我聽說他們把小鎮\n  一分為二了。',
                                    '<32>* 我想知道這裡原來\n  是什麼樣子的...？'
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 謝謝你帶我們回到了從前那樣。']
                        : SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 可惜我們不能用魔法\n  把他們變回來。"]
                            : papreal()
                                ? ["<32>{#p/basic}{#npc/a}* 可惜我們不能用魔法\n  解決這些問題。"]
                                : ['<32>{#p/basic}{#npc/a}* 我們可能永遠都\n  無從得知了。']
            ),
            t_smileguy: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                "<32>{#p/basic}{#npc/a}* 所以我們自由了，嗯？",
                                "<32>* 我想我不必再一直微笑了...",
                                "<32>* ...奇怪。\n* 我不想不笑，\n  但笑起來又感覺不對勁。",
                                "<32>* 這太難理解了。\n* 我還是堅持做我熟悉的事吧。"
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 所以我們自由了，嗯？",
                                "<32>* 我想我不必再一直微笑了...",
                                "<32>* ...嗯。\n* 那我為什麼停不下來？",
                                "<32>* 不知道為什麼，\n  我現在不想停止微笑了！"
                            ]
                        : papreal() || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 就在剛才，\n  我感覺我的笑容消失了片刻。', "<32>* 怎麼回事？"]
                            : [
                                "<32>{#p/basic}{#npc/a}* 我們都知道事情不盡人意，\n  但我們仍舊保持微笑。",
                                '<32>* 你問為什麼？',
                                '<32>* 我們面對著的是現實，\n  所以何必鬱鬱寡歡呢？'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ['<32>{#p/basic}{#npc/a}* 笑一笑吧。']
                            : ['<32>{#p/basic}{#npc/a}* 笑一笑吧！']
                        : papreal() || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 笑一笑吧？']
                            : ['<32>{#p/basic}{#npc/a}* 笑一笑吧。']
            ),
            t_wisconsin: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                '<32>{#p/basic}{#npc/a}* 自由...',
                                "<32>* 這意味著我不必再擔心挨揍了。",
                                '<32>* 哈哈。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 自由...',
                                "<32>* 這意味著我不必再費心講笑話了。",
                                '<32>* ...',
                                '<32>* 當一隻老鼠終於得到奶酪後，\n  它會做什麼？',
                                '<32>* ...',
                                '<32>* 嗯...',
                                "<32>* 它肯定不會費心講笑話，\n  肯定不會。",
                                '<32>* 哈哈。'
                            ]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? [
                                '<32>{#p/basic}{#npc/a}* 感覺就像...',
                                '<32>* 就像一切都在變得越來越糟...\n* 越來越糟。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 每個人都在歡笑、講笑話，\n  試圖忘記我們的現代危機...',
                                '<32>* 死氣沉沉。\n* 人口過剩。\n* 無家可歸。',
                                "<32>* 我也想加入他們，\n  但我並不有趣。"
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ["<32>{#p/basic}{#npc/a}* 抱歉。\n* 那並不好笑。"]
                            : [
                                '<32>{#p/basic}{#npc/a}* 抱歉。\n* 我猜你可以說...',
                                '<32>* 那個笑話有點太「酪」套了。'
                            ]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 越來越糟...']
                            : ["<32>{#p/basic}{#npc/a}* 至少，我不講雙關笑話。"],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ['<32>{#p/basic}{#npc/a}* 你最好在我對你失去耐心前離開。']
                            : ["<32>{#p/basic}{#npc/a}* 對。\n* 那是個雙關。\n* 我現在是一隻雙關酪鼠了。"]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 永無止境...']
                            : ['<32>{#p/basic}{#npc/a}* 暫時吧。']
            ),
            t_zorren: pager.create(
                0,
                () => [
                    "<32>{#p/basic}{#npc/a}* （喔，嘿，是我，Zorren。）",
                    ...(SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? [
                                "<32>* （我們，呃，對你所做的一切\n  感激不盡。）",
                                "<32>* （但是...）\n* （你，呃，不完全算是\n  模範公民。）",
                                "<32>* (你為什麼非要\n  把事情弄得這麼麻煩呢？）"
                            ]
                            : [
                                "<32>* （我們，呃，對你所做的一切\n  感激不盡。）",
                                "<32>* （但是...）\n* （你，呃，大概已經聽夠\n  感謝的話了。）",
                                "<32>* （那我就不打擾你了，\n  繼續做你的事吧。）"
                            ]
                        : world.meanie
                            ? SAVE.data.b.s_state_capstation
                                ? [
                                    "<32>* （你現在，好像有點變了。）",
                                    '<32>* （...）',
                                    "<32>* （是啊，你知道，呃，\n  我現在不大喜歡你了。）",
                                    "<32>* （要是我能把給你的鑰匙收回\n  就好了。）"
                                ]
                                : [
                                    '<32>* （你是，呃，對我們的警察，\n  呃，有意見，還是...？）',
                                    '<32>* （...）',
                                    "<32>* （是啊，你知道，呃，\n  我其實不大喜歡你。）",
                                    "<32>* （只是，感覺，\n  你哪裡有些不對勁。）"
                                ]
                            : [
                                ...(SAVE.data.b.oops
                                    ? [
                                        '<32>* （你是，呃，對我們的警察，\n  呃，有意見，還是...？）',
                                        '<32>* （沒有嗎？）\n* （嘿，還好你呃，沒有。）'
                                    ]
                                    : [
                                        "<32>* （知道嗎，\n  你看起來很會尊重他人。）",
                                        '<32>* （所以，謝謝你，呃，那樣做。）'
                                    ]),
                                ...(SAVE.data.b.s_state_capstation
                                    ? []
                                    : ((SAVE.data.b.s_state_capstation = true),
                                        [
                                            '<32>* （實際上...）',
                                            '<32>* （給你，孩子。）\n* （我們手裡，有個鑰匙。）',
                                            '<32>{#s/equip}{#p/human}* （你把生鏽的鑰匙\n  掛到了鑰匙串上。）',
                                            '<32>* （打開「手機」來查看\n  所有獲得的鑰匙。）',
                                            "<32>{#p/basic}{#npc/a}* （我想，呃，我們應該\n  在什麼地方有個兵工廠。）"
                                        ])),
                                ...(SAVE.data.b.oops
                                    ? [
                                        '<32>* （噓...）\n* （就是，這個警察崗是我和\n  Kabakk兩個人自己建的。）',
                                        '<32>* （很酷，是吧？）'
                                    ]
                                    : [
                                        '<32>* （噓...）\n* （就是，這個警察崗是我和\n  Kabakk兩個人自己建的。）',
                                        '<32>* （很酷，是吧？）'
                                    ])
                            ])
                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? ['<32>{#p/basic}{#npc/a}* （做得更好些吧，我的朋友。）\n* （做得更好些吧。）']
                            : ['<32>{#p/basic}{#npc/a}* （繼續前進吧，我的朋友。）\n* （繼續前進吧。）']
                        : world.meanie
                            ? ['<32>{#p/basic}{#npc/a}* （離開這裡。）']
                            : SAVE.data.b.oops
                                ? ["<32>{#p/basic}{#npc/a}* （沒錯，我們不是真警察。）"]
                                : [
                                    '<32>{#p/basic}{#npc/a}* （也許我們不是真正的警察，\n  但像你這樣的人\n  值得我們的保護和服務。）'
                                ]
            )
        },
        objinter: {
            ctower0: () => [
                '<32>{#p/human}* （你激活了終端。）',
                ...(SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （說明上寫著\n  通過加減十的冪將總數減至零。）'
                    ]
                    : [
                        '<32>{#p/basic}* 顯示器側面釘著一份說明...',
                        '<33>* 上面的字跡全是狂草，你根本\n  看不清楚。\n* 除了一個字，「零」。'
                    ])
            ],
            ctower1: () =>
                SAVE.data.b.s_state_mathpass
                    ? SAVE.data.b.svr
                        ? ['<32>{#p/human}* （可是，你之前已經解開\n  這個謎題了。）']
                        : ['<32>{#p/basic}* 終端已解鎖。']
                    : ["<32>{#p/basic}* 不能使用了。"],
            microwave0: ['<32>{#p/human}* （你看了看微波爐的後面...）', '<32>{#p/basic}* 沒什麼有用的東西。'],
            microwave1: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你看了看微波爐的後面...）',
                        '<32>{#s/equip}{#p/human}* （你按下了開關。）'
                    ]
                    : [
                        '<32>{#p/human}* （你看了看微波爐的後面...）',
                        "<32>{#p/basic}* 這裡有個開關...",
                        '<32>{#s/equip}{#p/human}* （你按下了開關。）'
                    ],
            microwave2: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你看了看微波爐的後面...）',
                        '<32>{#p/human}* （可是，你之前已經按下\n  這個開關了。）'
                    ]
                    : ['<32>{#p/human}* （你看了看微波爐的後面...）', '<32>{#p/basic}* 沒有新東西。'],
            microwave3: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （可是，你沒發現這個電器\n  有什麼特別之處。）"]
                    : [
                        '<32>{#p/basic}* 標準規格的電介質加熱器，\n  首塔製造。\n* 260X年前後製成。',
                        "<32>* 這就是臺微波爐。\n  頂多用了十年。"
                    ],
            microwave4: () => [
                '<32>{#p/basic}* 它似乎在投射某種重力場。',
                ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* 我有點好奇...\n  這附近有沒有開關什麼的..."])
            ],
            papmail1: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （可是，你沒有信要寄。）"]
                    : [
                        '<32>{#p/basic}* 信箱上標注著「PAPYRUS」。',
                        choicer.create('* （看一眼裡邊嗎？）', '看一眼', '算了')
                    ],
            papmail2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你往裡看了一眼...）',
                            world.runaway
                                ? "<32>{#p/basic}* 比以前還空。"
                                : "<32>{#p/basic}* 不是空的？"
                        ]
                        : [
                            '<32>{#p/human}* （你往裡看了一眼...）',
                            "<32>{#p/basic}* 空的。",
                            ...(31 <= SAVE.data.n.plot &&
                                SAVE.data.n.plot_date < 0.1 &&
                                SAVE.data.n.state_starton_papyrus !== 1
                                ? [
                                    '<18>{#p/papyrus}{#f/0}謝謝你幫忙\n檢查了我的郵件！',
                                    "<18>{#p/papyrus}{#f/4}謝天謝地，\n我已經全都整理好了。"
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你往裡看了一眼...）',
                            world.runaway
                                ? "<32>{#p/basic}* 比以前還空。"
                                : "<32>{#p/basic}* 不是空的？"
                        ]
                        : ['<32>{#p/human}* （你往裡看了一眼...）', "<32>{#p/basic}* 空的。"]
            ),
            papmail3: ['<32>{#p/human}* （你決定先不看了。）'],
            puzzlechip: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （可是，你之前已經解開\n  這個謎題了。）']
                    : ['<32>{#p/basic}* 終端已解鎖。'],
            spagtable0: ["<32>{#p/basic}* 一個沒用過的盤子。"],
            spagtable1: [
                '<32>{#p/human}* （你凝視著令人垂涎的\n  義大利麵。）',
                '<32>{#p/human}* （似乎是夠不到它了。）'
            ],
            spagtable2: ['<32>{#p/human}* （你得到了義大利麵。）'],
            spagtable2b: ["<32>{#p/human}* （你帶的東西太多，裝不下它了。）"],
            spagtable3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你對這個曾經盛放過食物的盤子\n  心懷感激。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 咋了。\n* 就一普通盤子。"]
                        : ['<32>{#p/basic}* 曾經承載過\n  一份人間難得的佳餚呢。'],
            xtower1: () => [
                ...(postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （終端似乎已經停機了。）',
                            ...[
                                [
                                    "<25>{#p/asriel1}{#f/13}* 沒電了。\n* 不過想想也正常，\n  肯定得把這玩意關掉。",
                                    "<25>{#f/17}* 要是有人玩遊戲玩過頭，\n  錯過了運輸船，\n  可就完蛋了。"
                                ],
                                [
                                    "<25>{#p/asriel1}{#f/13}* 不過說真的，\n  我覺得他們\n  肯定不會讓人錯過的。",
                                    '<25>{#f/13}* Alphys博士應該有\n  類似能掃描靈魂的裝置，\n  所以...',
                                    "<25>{#f/17}* 他們會知道\n  有沒有人落下的。",
                                    '<25>{#f/15}* 真想知道他們現在\n  能不能看到我們...'
                                ],
                                ["<25>{#p/asriel1}{#f/17}* 別擔心，Frisk。\n* 新家園肯定\n  會有很多遊戲的。"]
                            ][Math.min(asrielinter.xtower1++, 2)]
                        ]
                        : [
                            '<32>{#p/human}* （你激活了終端。）',
                            "<32>{#p/basic}* 這是個遊戲終端...",
                            ...(SAVE.data.n.plot === 72 || world.postnoot
                                ? ['<32>{#p/basic}* 電源被切斷了。']
                                : ['<32>{#p/basic}* 「儘可能快速射擊目標！\n   用[Z]來射擊。」'])
                        ])
            ]
        },
        papbooks1: pager.create(
            0,
            () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （書架上放著謎題指引書，\n  以及兒童故事書。）"]
                    : [
                        '<32>{#p/basic}* 書架上擺滿了關於\n  謎題創作的複雜書籍。',
                        "<32>* 還有兒童讀物。",
                        ...(roomready()
                            ? [
                                '<18>{#p/papyrus}我把一部分\n我最喜歡的書\n都放在那個書架上。',
                                '<18>{#f/4}比如《為聰明人\n設計的高級\n謎題結構》。',
                                '<18>{#f/0}我另一本最愛呢？',
                                '<18>{#f/4}是《和毛茸茸的兔兔\n捉迷藏》。',
                                '<18>{#f/8}結局每次都會\n打動到我！'
                            ]
                            : [])
                    ],
            () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （書架上放著謎題指引書，\n  以及兒童故事書。）"]
                    : ["<32>{#p/basic}* 複雜的手冊和兒童讀物。"]
        ),
        papbooks2: pager.create(
            1,
            [
                '<32>{#p/human}* （你取下了一本書...）',
                '<32>{#p/basic}* 「奠定謎題互動價值的，\n   是玩家的配合程度。」',
                '<32>* 「每個玩家都有探索、前進\n   和完成既定任務的\n   內在動力。」',
                '<32>* 「那些具有挑戰性、能夠\n   吸引這些動力的謎題...」',
                '<32>* 「能夠確保玩家始終\n   專注於任務，直到最後一刻。」',
                '<32>{#p/human}* （你把書放回了書架。）'
            ],
            [
                '<32>{#p/human}* （你取下了一本書...）',
                '<32>{#p/basic}* 「『來玩躲貓貓吧！』\n   人類從牆後出現，\n   對小兔兔說道。」',
                '<32>* 「毛茸茸的兔兔又驚又喜，\n   興奮地看著眼前的人類。」',
                '<32>* 「然後，人類離開了...\n   毛茸茸的兔兔看不到人類了，\n   它非常地傷心。」',
                '<32>* 「它的身體顫抖著，\n   思考著自己是多麼孤單。」',
                '<32>* 「它很想哭，\n   覺得自己被永遠拋棄了...」',
                '<32>* 「但後來，人類又出現了，\n   世界又恢復了正常。」',
                '<32>* 「人類和兔兔給了彼此\n   一個大大的、毛茸茸的擁抱。」',
                '<32>{#p/human}* （你把書放回了書架。）'
            ],
            () =>
                world.runaway
                    ? [
                        '<32>{#p/human}* （你取下了一本書...）',
                        '<23>{#p/papyrusnt}「親愛的日計：\n 力場已經被摧毀了。」',
                        '<23>「FRISK，那個幾天前\n剛到前哨站的人類...」',
                        '<23>「現在成了前哨站所有人\n所恐懼的對象。」',
                        '<23>「趁那人還沒醒來，\n我們都得馬上離開。」',
                        '<23>「其他人好像都樂意\n讓那人自生自滅。」',
                        '<23>「但我內心深處還是希望\n那人也能逃出前哨站，\n找到一條生路。」',
                        '<32>{#p/human}* （你把書放回了書架。）'
                    ]
                    : SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<23>{#p/papyrusnt}「親愛的日計：\n 力場已經被摧毀了。」',
                            '<23>「FRISK，那個幾天前\n剛到前哨站的人類...」',
                            '<23>「克服了重重困難，\n把處於毀滅邊緣的我們\n給救了回來。」',
                            '<23>「說不定這件事\n能讓SANS也振作起來。」',
                            '<23>「我之所以會提到這個，\n是因為我從來不知道\n他所謂的哨兵工作...」',
                            '<23>「居然那麼輕鬆。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
                        : [
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<23>{#p/papyrusnt}「親愛的日計：\n SANS剛剛被任命為\n 正式的皇家哨兵。」',
                            '<23>「最開始，\n 我對他非常地不解...」',
                            '<23>「畢竟，為什麼一個\n 這麼懶的人會想\n 承擔這個工作？」',
                            '<23>「算了，\n 我就不去追問什麼了。」',
                            '<23>「事實上，我為他感到\n 非常驕傲！！！」',
                            '<23>「只有時間才能證明\n 這會帶來什麼\n 偉大的事情。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
        ),
        papcomputer1: pager.create(
            0,
            () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : [
                        ...(roomready()
                            ? [
                                "<18>{#p/papyrus}域外網！\n我在那上面\n超有人氣的。",
                                "<18>{#f/4}再有12個追蹤...",
                                '<18>{#f/0}我的粉絲數\n就到兩位數了！'
                            ]
                            : []),
                        SAVE.data.b.svr
                            ? '<32>{#p/human}* （你走向了電腦...）'
                            : "<32>{#p/basic}* 電腦的瀏覽器\n  打開了一個\n  社交媒體網站。",
                        choicer.create("* （登入Papyrus的帳號嗎？）", '登入', '算了')
                    ],
            () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : [
                        SAVE.data.b.svr
                            ? '<32>{#p/human}* （你走向了電腦...）'
                            : "<32>{#p/basic}* 電腦的瀏覽器\n  打開了一個\n  社交媒體網站。",
                        choicer.create("* （登入Papyrus的帳號嗎？）", '登入', '算了')
                    ]
        ),
        papcomputer2: ['<32>{#p/human}* （你決定先不登入。）'],
        papcomputer3: {
            a: '酷炫骷髏95',
            b: '粉絲數 -2',
            c: '這個賬戶屬於\n偉大的\nPAPYRUS。\n只PO高質量\n貼文！',
            d: '- 新聞 -',
            e: () =>
                world.runaway
                    ? '突發新聞：\n..\n..\n..\n..我們得走了。'
                    : SAVE.data.n.plot === 72
                        ? '突發新聞：\n我們能走了。\n...真正意義上的。\n新聞來源：\n看看外頭吧，\n各位！'
                        : "突發新聞：\n《喵喵星火》\n評分..\n一塌糊塗。\n新聞來源：\n就，這是真的嗎？"
        },
        papcomputer4: [
            () =>
                world.runaway
                    ? {
                        a: '哈囉！',
                        b: '自求多福吧...',
                        c: ''
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '哈囉！',
                            b: '網路連接失敗...',
                            c: ''
                        }
                        : {
                            a: '哈囉！',
                            b: '分享你的想法...',
                            c: ''
                        },
            () =>
                world.runaway
                    ? {
                        a: 'ALPHYS',
                        b: '今天',
                        c: '< 訊息已刪除 >'
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '系統訊息',
                            b: '今天',
                            c: '域外網於今日關停。'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: 'NAPSTABLOOK22',
                                b: '今天',
                                c: '再也不上網了...\n太沒勁了...'
                            }
                            : world.genocide
                                ? {
                                    a: 'NAPSTABLOOK22',
                                    b: '今天',
                                    c: "沒關係的...\n我是幽靈..."
                                }
                                : world.dead_skeleton
                                    ? {
                                        a: 'NAPSTABLOOK22',
                                        b: '今天',
                                        c: "嗯...\n我還是去忙這首曲子的\n混音吧..."
                                    }
                                    : {
                                        a: '懶骨。',
                                        b: '今天',
                                        c: "咱們快祈禱他別把\n我們的靈~魂\u4dc1\n也抓走嚕~ \u4dc3\u4dc3",
                                        d: true
                                    },
            () =>
                world.runaway
                    ? {
                        a: '懶骨。',
                        b: '今天',
                        c: '< 訊息已刪除 >',
                        d: true
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: 'ALPHYS',
                            b: '今天',
                            c: '哎呀，\n我忘了關伺服器了'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: '壯魚91',
                                b: '昨天',
                                c: '嗯... 你不是每天都這麼說嗎，\nPapyrus？'
                            }
                            : world.genocide
                                ? {
                                    a: '壯魚91',
                                    b: '今天',
                                    c: 'blooky，快點離開這。\n我不想看到你也跟著受傷。'
                                }
                                : world.dead_skeleton
                                    ? {
                                        a: '壯魚91',
                                        b: '今天',
                                        c: 'blooky，papyrus不在了。\n我會讓那人類血債血償。'
                                    }
                                    : {
                                        a: '壯魚91',
                                        b: '今天',
                                        c: '呃，沒抓到...\n不過，他成功俘獲了我們\n每個人的心！呋呼呼！！'
                                    },
            () =>
                world.runaway
                    ? {
                        a: '酷炫骷髏95',
                        b: '今天',
                        c: '< 訊息已刪除 >'
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '_舟亢忝行_',
                            b: '今天',
                            c: '< 使用者名稱更新 >\n原名：_摋掱亾耦_\n現在：_舟亢忝洐_'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: '酷炫骷髏95',
                                b: '昨天',
                                c: "今天，\n就是我要抓到人類的日子！\n我能從骨子裡感覺到！"
                            }
                            : world.genocide
                                ? {
                                    a: 'NAPSTABLOOK22',
                                    b: '今天',
                                    c: '呃...\n我有什麼能幫忙的嗎？\n事情變得更糟了...'
                                }
                                : {
                                    a: 'NAPSTABLOOK22',
                                    b: '今天',
                                    c: '所以... papyrus\n抓到人類了嗎？還是...'
                                }
        ] as (() => { a: string; b: string; c: string; d?: boolean })[],
        papcomputer5: () =>
            world.runaway
                ? ['FRISK', "你敢", '跟過來', '試試']
                : SAVE.data.n.plot === 72
                    ? ['對不起', "但我們", '停服啦', '笑死']
                    : ['刷新頁面', '查看訊息', '聊天設定', '登出'],
        papcouch0: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你在沙發裡什麼都找不到。）"]
                : ["<32>{#p/basic}* 已經被清理乾淨了。"],
        papcouch1: pager.create(
            0,
            () => [
                '<32>{#p/human}* （你聽到沙發裡\n  有叮噹的聲音。）',
                SAVE.data.b.svr
                    ? '<32>{#p/human}* （好像這裡留了一堆硬幣...）'
                    : '<32>{#p/basic}* 裡面有一堆硬幣...',
                choicer.create('* （拿走這些硬幣嗎？）', '拿走', '算了')
            ],
            () => [
                SAVE.data.b.svr
                    ? "<32>{#p/human}* （硬幣並沒有長出腿跑了。）"
                    : '<32>{#p/basic}* 硬幣還在。',
                choicer.create('* （拿走這些硬幣嗎？）', '拿走', '算了')
            ]
        ),
        papcouch2: ['<32>{#p/human}* （你決定什麼也不拿。）'],
        papcouch3: ['<32>{#p/human}* （你找到了10G。）'],
        papcouch3a: [
            "<18>{#p/papyrus}{#f/1}你在幫我們\n清理沙發！？",
            '<18>{#p/papyrus}{#f/5}...還不求回報，\n你真是個大善人...',
            '<18>{#p/papyrus}{#f/6}多麼慷慨！！！'
        ],
        paproom1: [
            '<18>{#p/papyrus}{#f/6}啊！？\n你怎麼...',
            '<18>{#p/papyrus}{#f/5}突然出現在\n我面前的！'
        ],
        paproom2: ['<18>{#p/papyrus}{#f/4}SANS是不是教了你\n走什麼捷徑...？'],
        paproom3: ['<18>{#p/papyrus}{#f/7}...呃！\n別再這樣了！！'],
        paproom4: ["<18>{#p/papyrus}{#f/0}你這是在自找麻煩，\n人類。"],
        paproom5: ['<18>{#p/papyrus}{#f/4}（唉...）'],
        papdate0: () => [
            SAVE.data.b.flirt_papyrus
                ? "<18>{#p/papyrus}{#f/5}哇，你真的\n好渴望約會啊..."
                : "<18>{#p/papyrus}{#f/5}哇，你真的\n好渴望找我玩啊...",
            "<18>{#f/5}甚至要搶在\n我前面進我家！",
            "<18>{#f/6}你真的\n很重視啊！"
        ],
        papdate1x: pager.create(
            0,
            [
                '<18>{#p/papyrus}{#f/0}你好，人類！',
                '<18>{#f/5}希望你過得愉快。',
                '<18>{#f/6}到鎮上隨便走走...',
                '<18>{#f/0}...或者來我家看看\n都行！'
            ],
            ["<18>{#p/papyrus}{#f/4}不過，離SANS的房間\n遠一點。"]
        ),
        papdate1: () => [
            SAVE.data.b.flirt_papyrus
                ? '<18>{#p/papyrus}所以你回來\n跟我約會了！'
                : '<18>{#p/papyrus}所以你回來\n看我了！',
            ...(world.dead_dog || world.population < 6
                ? [
                    "<18>{#f/0}太好了！！",
                    "<18>{#f/5}說實話，\n今天感覺有點孤單...",
                    '<18>{#f/5}今天，好多居民\n離奇失蹤了...',
                    "<18>{#f/0}不過，你還在這！！",
                    '<18>{#f/0}你肯定不同於常人，\n對吧？？'
                ]
                : ['<18>{#f/4}你肯定非常\n看重這件事...']),
            "<18>{#f/5}我會帶你去一個\n很特別的地方...",
            '<18>{#f/0}一個我願意花大把\n時間流連忘返的\n地方！！！'
        ],
        papdate2: ['<18>{#p/papyrus}我家！！！'],
        papdate3: pager.create(
            0,
            ['<18>{#p/papyrus}歡迎來我豪華的\n家裡做客！', '<18>好好享受，\n慢慢參觀！！！'],
            ["<18>{#p/papyrus}如果你看完了，\n就上樓來我的房間！"]
        ),
        papdate3a: ['<18>{#p/papyrus}{#f/6}哇！當個好主人\n可真是個體力活！'],
        papdate3b: [
            "<18>{#p/papyrus}{#f/5}哎呀，我腿都麻了...",
            "<18>{#f/0}那肯定證明了\n我是個好主人！！！"
        ],
        papdate4: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}那是我的房間！",
                "<18>{#f/4}如果這裡的東西\n你都看完了，\n那我們就進去...",
                '<18>{#f/4}然後...',
                SAVE.data.b.flirt_papyrus
                    ? '<18>{#f/9}做大家會在\n約會的時候\n做的事！'
                    : '<18>{#f/9}像一對酷酷的朋友\n一樣「消遣」吧！',
                choicer.create('* （你要怎麼回答？）', '開始吧', '再等等')
            ],
            () => ['<18>{#p/papyrus}準備好了嗎？', choicer.create('* （你要怎麼回答？）', '開始吧', '再等等')]
        ),
        papdate4a: ["<18>{#p/papyrus}好，我們進去吧！"],
        papdate4b: ["<18>{#p/papyrus}那我就繼續\n在這兒等著啦！"],
        papdate5: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}所以，呃...',
                "<18>{#f/5}如果你看完了\n所有東西...",
                SAVE.data.b.flirt_papyrus
                    ? '<18>{#f/6}那你想開始\n約會嗎？'
                    : '<18>{#f/6}那你想開始\n消遣嗎？',
                choicer.create('* （你要怎麼回答？）', "開始吧", "再等等")
            ],
            () => ['<18>{#p/papyrus}{#f/6}準備開始了嗎？', choicer.create('* （你要怎麼回答？）', '開始吧', '再等等')]
        ),
        papdate5a: () => [
            SAVE.data.b.flirt_papyrus
                ? '<18>{#p/papyrus}好！！！\n約會開始！！！'
                : "<18>{#p/papyrus}好！！！\n我們開始消遣叭！！！"
        ],
        papdate5b: ["<18>{#p/papyrus}慢慢看，不著急。\n我會等你的。"],
        papdate6: () => [
            SAVE.data.b.flirt_papyrus
                ? '<#32>{#p/story}           約會    開始！'
                : '<#32>{#p/story}           消遣    開始！'
        ],
        papdate7: () => [
            '<15>{#p/papyrus}{#f/10}我們！！',
            SAVE.data.b.flirt_papyrus ? '<15>{#f/20}開始約會了！！' : '<15>{#f/20}開始消遣了！！',
            "<15>{#f/24}我實際上之前\n從來沒做過\n這種事。",
            "<15>{#f/10}但別擔心！！！",
            '<15>{#f/20}我的（個人）詞典裡\n可是有「準備」\n這個詞的！'
        ],
        papdate8: () => [
            '<15>{#f/20}你問我手裡\n拿的是什麼？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#p/papyrus}{#f/10}這是本官方的\n約會指南，我直接\n從圖書倌借來的！'
                : '<15>{#p/papyrus}{#f/10}這是本官方的\n消遣指南，我直接\n從圖書倌借來的！',
            "<15>{#f/20}有了這個，\n我們一定會玩得\n很開心！"
        ],
        papdate9: () => [
            "<15>{#p/papyrus}{#f/25}讓我看看...",
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/25}第一步：\n按下C或CTRL鍵\n打開{@fill=#f00}約會面板{@fill=#000}。'
                : '<15>{#f/25}第一步：\n按下C或CTRL鍵\n打開{@fill=#f00}消遣面板{@fill=#000}。'
        ],
        papdate10: () => [
            '<15>{#p/papyrus}{#f/24}...等下。',
            '<15>{#f/22}你早就\n按好了！？！？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/11}哇，你肯定\n很愛我吧！'
                : '<15>{#f/11}哇，你肯定\n很喜歡我吧！',
            "<15>{#f/10}那麼，\n開始第二步！"
        ],
        papdate11: [
            '<15>{#p/papyrus}{#f/24}...',
            "<15>{#f/24}呃，反正\n我們也不需要。",
            '<15>{#f/20}來看第二步！'
        ],
        papdate12: [
            '<15>{#p/papyrus}{#f/11}哇，我感覺\n充滿了資訊！',
            "<15>{#f/24}事實上，我認為\n我們已經可以\n進入第二步了..."
        ],
        papdate13: () => [
            SAVE.data.b.flirt_papyrus
                ? '<15>{#p/papyrus}{#f/25}第二步：\n邀請約會對象。'
                : '<15>{#p/papyrus}{#f/25}第二步：\n邀請消遣對象。'
        ],
        papdate13a: () => [
            '<15>{#f/24}「咳咳。」',
            '<15>{#f/20}人類！\n我，偉大的\nPAPYRUS...',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/10}想和你一起\n約會！'
                : '<15>{#f/10}想和你一起\n消遣！'
        ],
        papdate14: () => [choicer.create('* （你要怎麼回答？）', '嗯嗯！', '不！')],
        papdate15a: ['<15>{#p/papyrus}{#f/12}真-真的？？？', '<15>{#f/11}哇！！！'],
        papdate15a1: ["<15>{#f/24}我想，這意味著\n是時候開始\n第三步了..."],
        papdate15b: ['<15>{#p/papyrus}{#f/21}喔...', '<15>{#f/27}還-還好，\n上面只說了\n要邀請。'],
        papdate15c: ["<15>{#f/24}那無論如何，\n是時候開始\n第三步了..."],
        papdate16: ['<15>{#p/papyrus}{#f/25}第三步：\n穿上漂亮的衣服\n表示你在乎。'],
        papdate16a: ['<15>{#p/papyrus}{#f/24}...', '<15>{#f/24}等一下。'],
        papdate17: () => [
            '<15>{#f/24}漂亮的衣服...',
            (
                {
                    spacesuit: "<15>{#f/26}你正穿著件\n舊太空衣呢...",
                    halo: '<15>{#f/26}你正頂著個\n漂亮的光環呢...',
                    eye: '<15>{#f/26}你正開著一道\n力場護盾呢...',
                    eye_x: '<15>{#f/26}你正開著一道\n力場護盾呢...',
                    temyarmor: "<15>{#f/26}你正披著\n一件盔甲呢...",
                    goggles: '<15>{#f/26}你正戴著臺\nAR裝置呢...',
                    goggles_x: '<15>{#f/26}你正戴著臺\nAR裝置呢...',
                    visor: '<15>{#f/26}你正戴著\n一個護目鏡呢...',
                    visor_x: '<15>{#f/26}你正戴著\n一個護目鏡呢...',
                    sonic: "<15>{#f/26}你正扛著個\n奇怪的裝置呢...",
                    heart_locket: '<15>{#f/26}你正戴著個吊墜呢...'
                } as Partial<CosmosKeyed<string>>
            )[SAVE.data.s.armor] || '<15>{#f/26}你身上的\n那個東西...',
            "<15>{#f/20}你現在就\n穿著衣服呢！！！",
            '<15>{#f/24}不僅如此...',
            '<15>{#f/20}今天早些時候，\n你也穿著衣服呢！'
        ],
        papdate17a: () => [
            '<15>{#f/12}不會吧...！\n這是不是說？？？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/13}你打從一開始\n就打算和我\n約會了？？？'
                : '<15>{#f/13}你打從一開始\n就打算和我\n做朋友了？？？'
        ],
        papdate18a: () => [
            '<15>{#p/papyrus}{#f/22}不！！',
            '<15>{#f/22}這一切都在你\n計畫之內！！！',
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/22}你可能都比我更\n擅長約會！！！',
                    '<15>不-不！！！你的\n{@fill=#003cff}約會能量{@fill=#000}...！！！'
                ]
                : [
                    '<15>{#f/22}你可能都比我更\n擅長消遣！！！',
                    '<15>不-不！！！你的\n{@fill=#003cff}友誼能量{@fill=#000}...！！！'
                ])
        ],
        papdate18b: () => [
            '<15>{#p/papyrus}{#f/24}喔...',
            '<15>{#f/21}不過，你嘴上那麼說...',
            '<15>{#f/21}...但這一整天，\n你還是好好穿了衣服？',
            "<15>{#f/24}也就是說...",
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/13}你對我的愛\n是命中注定的~',
                    '<15>{#f/22}不‐不！！！你的\n{@fill=#003cff}約會能量{@fill=#000}...！！！'
                ]
                : [
                    '<15>{#f/13}你對我的友情\n是命中注定的~',
                    '<15>{#f/22}不—不！！！你的\n{@fill=#003cff}友誼能量{@fill=#000}...！！！'
                ])
        ],
        papdate19: ['<15>{#p/papyrus}{#f/15}捏！', '<15>{#f/15}捏嘿嘿！！！'],
        papdate20: () => [
            "<15>{#p/papyrus}{#f/15}別以為你已經\n打敗我了！",
            '<15>{#f/20}我，偉大的\nPAPYRUS...',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/20}之前從來沒有\n在約會上輸過...'
                : '<15>{#f/20}之前從來沒有\n在消遣上輸過...',
            '<15>{#f/15}以後也不會！！',
            '<15>{#f/10}我很容易就\n可以跟上你的\n節奏！！！',
            '<15>{#f/24}實際上...',
            '<15>{#f/20}我在平常的\n衣服下面...',
            '<15>{#f/20}一直穿著我的\n「特別」服裝！！',
            '<15>{#f/15}你等著！！'
        ],
        papdate21: ['<15>{#p/papyrus}{#f/15}你覺得我的\n秘密穿搭\n怎麼樣？'],
        papdate22: () => [choicer.create('* （你要怎麼回答？）', '很棒', '很差勁')],
        papdate23a: ['<15>{#p/papyrus}{#f/13}不！！！', '<15>{#f/13}發自內心的\n讚美...！'],
        papdate23b: ['<15>{#p/papyrus}{#f/13}不！！！', '<15>{#f/13}你在批評我...\n你果然真心為我好！'],
        papdate24: [
            '<15>{#p/papyrus}{#f/24}然而...',
            "<15>{#f/20}你根本不明白\n這身衣服背後\n{@fill=#f00}隱藏的力量{@fill=#000}！",
            '<15>{#f/26}因此...'
        ],
        papdate24a: () => [
            '<15>{#f/15}你剛才的回答\n無效！！',
            SAVE.data.b.flirt_papyrus
                ? "<15>{#f/15}這場約會不會\n再有更多\n進展了！"
                : "<15>{#f/15}這場消遣不會\n再有更多\n進展了！",
            '<15>{#f/24}除非...',
            '<15>{#f/20}你能找到我的\n{@fill=#f00}秘密{@fill=#000}。',
            "<15>{#f/15}但那是不會\n發生的！！"
        ],
        papdate24b: '* 移動並用[Z]互動。',
        papdate25: [
            
            '<15>{#p/papyrus}{#f/21}我頭上的\n假髮...？',
            '<15>{#f/16}我頭上的假髮。',
            '<15>{#f/10}我頭上的...\n假髮！！！',
            "<15>{#f/10}捏嘿嘿！\n看來真的\n很明顯！"
        ],
        papdate25a: [
            '<15>{#p/papyrus}{#f/21}被我的閃亮的\n「星」服裝驚呆了嗎？',
            '<15>{#f/24}不‐不，我理解。',
            "<15>{#f/20}但是你\n不能退縮！！！"
        ],
        papdate25b: [
            '<15>{#p/papyrus}{#f/26}這件襯衫上\n本來沒有寫著\n「閃亮」的...',
            '<15>{#f/20}但是我\n改良了一下！',
            '<15>{#f/10}專家提示：\n所有的衣服都\n可以通過這種\n方式改良。',
            "<15>{#f/20}...但這裡可\n沒藏什麼秘密！\n再試試吧！"
        ],
        papdate25c: [
            '<15>{#p/papyrus}{#f/24}我懂，我懂。',
            '<15>{#f/24}你喜歡用一顆\n漂浮的心\n感受我的\n手臂靠枕。',
            "<15>{#f/20}但是誰又\n不喜歡呢！？\n再試試吧！"
        ],
        papdate25d: [
            "<15>{#p/papyrus}{#f/13}你握住我的手，\n想讓我把答案\n告訴你...？",
            '<15>{#f/14}我-我不，\n我必須忍住！！',
            '<15>{#f/20}再試試吧！'
        ],
        papdate25e: [
            "<15>{#p/papyrus}{#f/26}不管有沒有靠枕，\n我的腿\n都沒有秘密。",
            '<15>{#f/10}只有勤奮和毅力！',
            '<15>{#f/20}再試試吧！'
        ],
        papdate25f: [
            '<15>{#p/papyrus}{#f/24}這裡的「潮流」\n或許確實\n無人能敵...',
            '<15>{#f/20}但要是期待這裡\n有什麼秘密是\n完全不可能的！',
            '<15>{#f/20}再試試吧！'
        ],
        papdate25g: [
            '<15>{#p/papyrus}{#f/20}啊這個！\n這是我的\n頂級運動服！',
            "<15>{#f/24}你在這裡可\n找不到任何\n秘密，因為...",
            "<15>{#f/20}我就沒有口袋\n可以裝！！！",
            '<15>{#f/20}再試試吧！'
        ],
        papdate25h: () => [
            '<15>{#p/papyrus}{#f/24}我的肩膀...',
            '<15>{#f/10}你是想讓我\n把你背到\n肩上嗎？？',
            SAVE.data.b.flirt_papyrus
                ? "<15>{#f/24}如果我們沒在\n忙著約會的話，\n我肯定會同意的。"
                : "<15>{#f/24}如果我們沒在\n忙著消遣的話，\n我肯定會同意的。",
            '<15>{#f/20}所以現在不行！\n再試試吧！'
        ],
        papdate25i: [
            '<15>{#p/papyrus}{#f/14}你認真嗎？？',
            "<15>{#f/19}我沒想就這麼\n【告訴】你\n秘密的...",
            "<15>{#f/20}你還必須得\n再加把勁！"
        ],
        papdate25j: () =>
            calcLV() > 2
                ? [
                    '<15>{#p/papyrus}{#f/24}既然你的{@fill=#f00}LV{@fill=#000}這麼高，\n那就表示...',
                    SAVE.data.b.flirt_papyrus
                        ? '<15>{#f/28}你對我的@fill=#f00}愛{@fill=#000}\n一定情深意重！'
                        : "<15>{#f/28}你的{@fill=#f00}戀愛{@fill=#000}經驗\n一定身經百戰！",
                    "<15>{#f/24}但是！\n這是你\n自己的秘密！",
                    '<15>{#f/20}再試試吧！'
                ]
                : calcLV() === 2
                    ? [
                        '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}2？',
                        '<15>{#f/27}這是不是代表...',
                        ...(SAVE.data.b.flirt_papyrus
                            ? [
                                '<15>{#f/28}你有一個秘密的\n第二{@fill=#f00}愛好{@fill=#000}...？',
                                '<15>{#f/20}然而，\n你還是沒有\n找到我的秘密！！'
                            ]
                            : [
                                '<15>{#f/28}你對我的愛\n深入骨髓？',
                                '<15>{#f/28}原來在你的內心\n深處，你對我{@fill=#f00}愛意綿綿{@fill=#000}嗎？',
                                '<15>{#f/14}不‐不...！\n我不能向\n你的詭計屈服！'
                            ]),
                        '<15>{#f/20}再試試吧！'
                    ]
                    : SAVE.data.b.oops
                        ? [
                            '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}1？',
                            '<15>{#f/26}這是不是\n代表著...',
                            "<15>{#f/28}我是你的\n一生{@fill=#f00}摯愛{@fill=#000}...？",
                            ...(SAVE.data.b.flirt_papyrus
                                ? ['<15>{#f/14}不‐不...！\n我不能向\n你的詭計屈服！']
                                : [
                                    "<15>{#f/24}好吧，如果我們\n只是朋友關係，\n那就說不通了。",
                                    '<15>{#f/14}但‐但是不！\n我不能向\n你的詭計屈服！'
                                ]),
                            '<15>{#f/20}再試試吧！'
                        ]
                        : [
                            '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}0？',
                            "<15>{#f/26}好吧，那就怪了。",
                            "<15>{#f/21}SANS告訴我\n人類的{@fill=#f00}LOVE{@fill=#000}\n是從1開始的。",
                            '<15>{#f/24}額...',
                            '<15>{#f/24}這是你的秘密嗎？',
                            '<15>{#f/20}然而，\n你還是沒有\n找到我的秘密！',
                            '<15>{#f/20}再試試吧！'
                        ],
        papdate25k: () => [
            ...(SAVE.data.n.hp > calcHP()
                ? [
                    '<15>{#p/papyrus}{#f/22}啥？\n你的HP咋【爆表】了？！',
                    '<15>{#f/10}你可真是\n有備而來啊！',
                    '<15>{#f/24}但是這和\n我的秘密\n有什麼關係呢？'
                ]
                : [
                    '<15>{#p/papyrus}{#f/24}儘管你的HP\n也許是滿的，\n但這並非與秘密\n有任何聯繫，\n所以...\n',
                    "<15>{#f/20}你仍然一無所獲！"
                ]),
            '<15>{#f/20}再試試吧！'
        ],
        papdate25l: [
            "<15>{#p/papyrus}{#f/20}原來是這樣...",
            '<15>{#f/24}你想\n抓撓我的脖子...',
            '<15>{#f/21}然後叫我\n「好孩子...」',
            "<15>{#f/24}我會像狗那樣\n對你興奮叫喚。",
            '<15>{#f/20}最後強調一次，\n我是一個骷髏！\n所以再試試吧！'
        ],
        papdate26: () => [
            '<15>{#p/papyrus}{#f/27}那-那好吧...',
            '<15>{#f/27}你找到我的\n秘密了！',
            '<15>{#f/24}我覺得我沒有\n什麼別的選擇，\n只能承認\n事實了。',
            "<15>{#f/24}這是個...",
            ['<15>{#f/27}只-只送給你的\n禮物！！！', '<15>{#f/27}給我們兩個\n分享的禮物！！！'][
            (SAVE.data.n.state_papyrus_spaghet + 1) % 2
            ],
            '<15>{#f/10}快！\n快打開！'
        ],
        papdate27: () => [choicer.create('* （你該怎麼辦？）', '打開', '不要')],
        papdate28: [
            "<15>{#p/papyrus}{#f/21}你甚至都\n捨不得拆開\n我精緻的包裝？",
            '<15>{#f/27}不-不...\n居然來這招...',
            "<15>{#f/13}真的好厲害！",
            '<15>{#f/14}但-但是...\n啊哈！\n看我的反擊！',
            "<15>{#f/15}我自己拆\n不就好了！！"
        ],
        papdate29: ['<15>{#p/papyrus}{#f/20}你知道【這】是\n什麼嗎？'],
        papdate30: () => [choicer.create('* （你知道這是什麼嗎？）', '知道', '不知道')],
        papdate31a: [
            '<15>{#p/papyrus}{#f/26}義大利麵。',
            "<15>{#f/24}這是你現在\n腦子裡的想法，\n沒錯吧？",
            '<15>{#f/20}對了！',
            '<15>{#f/15}但是也-\n錯了！'
        ],
        papdate31b: [
            "<15>{#p/papyrus}{#f/20}捏嘿嘿！\n這才對嘛。",
            '<15>{#p/papyrus}{#f/15}你根本想不到！',
            '<15>{#f/24}雖然這看起來\n是義大利麵...'
        ],
        papdate32: () => [
            "<15>{#p/papyrus}{#f/20}這可不是什麼\n普通的意面！",
            "<15>{#f/20}這是一個\n大師的傑作！",
            '<15>{#f/24}絲般柔滑的意面，\n在時間膨脹\n單元之中\n精細陳化。',
            '<15>{#f/20}然後再由我，\n主廚PAPYRUS\n來加工！',
            "<15>{#f/15}人類！！！\n是時候結束這\n一切了！！",
            "<15>我們不能再這樣\n僵持下去了！",
            ...[["<15>{#f/20}我們一起來吃\n這盤義大利麵\n吧！！！"], ['<15>{#f/20}盡情享受我的\n終極廚藝吧！！']][
            (SAVE.data.n.state_papyrus_spaghet + 1) % 2
            ]
        ],
        papdate33: () => [choicer.create('* （你該怎麼辦？）', '吃掉', '留著')],
        papdate33a: () => [
            '<32>{#p/human}* （你咬了一小口。）\n* （味道讓你臉紅了。）',
            "<32>{#p/basic}* 真的好好吃...！",
            ...(SAVE.data.n.state_papyrus_spaghet === 1
                ? ['<32>{#p/basic}* Papyrus看起來也吃得很開心。']
                : [])
        ],
        papdate34a: () => [
            '<15>{#p/papyrus}{#f/10}多麼充滿激情的\n表達！！',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/12}你肯定真心愛著\n我的廚藝！'
                : '<15>{#f/12}你肯定真心喜歡\n我的廚藝！',
            ...[
                [
                    '<15>{#f/24}那個，雖然\n我也這樣...',
                    SAVE.data.b.flirt_papyrus
                        ? '<15>{#f/20}但我覺得你甚至\n比我更愛我的\n廚藝！！！'
                        : '<15>{#f/20}但我覺得你甚至\n比我更喜歡我的\n廚藝！！！'
                ],
                ['<15>{#f/10}甚至\n因而愛上了我！', '<15>{#f/20}搞不好\n你比我自己\n還要愛我！！！']
            ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2],
            "<15>{#f/27}但... 那是\n不可能的...！",
            '<15>{#f/12}你是怎麼\n做到的！？！？'
        ],
        papdate34b: () => [
            '<15>{#p/papyrus}{#f/21}你的意思是...',
            "<15>{#f/18}你要留給我吃？",
            ...[
                [
                    '<15>{#f/24}我以為你之前\n說要分享...',
                    '<15>{#f/20}你會至少想自己\n嘗一小口。',
                    '<15>{#f/27}但你不是\n這樣的，\n你都留給我了...',
                    '<15>{#f/12}你想讓我，\n讓【我】來，\n全都吃掉！！！'
                ],
                [
                    '<15>{#f/21}即使你之前\n說過...',
                    '<15>{#f/21}你想自己品嘗\n我的義大利麵...',
                    '<15>{#f/27}就在你馬上要\n實現的時候，\n你...',
                    '<15>{#f/12}你要放棄\n全留給我？？？'
                ]
            ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2]
        ],
        papdate35: ['<15>{*}{#p/papyrus}{#f/22}啊！！！{%15}'],
        papdate36: ['<15>{*}{#p/papyrus}{#f/22}呃！！！{%15}'],
        papdate37: ['<15>{*}{#p/papyrus}{#f/22}不啊啊啊！！！{%15}'],
        papdate38: () => [
            "<18>{#p/papyrus}{@random=1.1/1.1}人類。\n一切都清晰明了了。",
            SAVE.data.b.flirt_papyrus
                ? "<18>{@random=1.1/1.1}你已經痴狂地\n愛上了我。"
                : "<18>{@random=1.1/1.1}你已經完全\n被我迷住了。",
            '<99>{@random=1.1/1.1}你做的每一件事。\n你說的每一個字。',
            "<18>{@random=1.1/1.1}一切的一切\n都是為了我。",
            '<18>{@random=1.1/1.1}人類。\n我也想讓你，\n感到快樂。',
            "<18>{@random=1.1/1.1}現在輪到我\n來表達我的\n感情了...",
            "<18>{@random=1.1/1.1}輪到我來告訴你\n我的真心話了。"
        ],
        papdate39: () =>
            SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/21}人類，我的\n真心話是...',
                    "<15>{#f/21}我就是不\n像你那樣\n喜歡我。",
                    '<15>{#f/24}我是說，\n浪漫的那種。',
                    '<15>{#f/27}我是說，我已經\n很努力了！',
                    '<15>{#f/27}我覺得因為你\n跟我調情過了...',
                    '<15>{#f/27}我就該跟你\n約一次會。',
                    '<15>{#f/10}然後，在我們\n約會的過程中，\n感情就會開花\n結果！！！',
                    '<15>{#f/20}我就能配得上\n你對我的熱情！',
                    '<15>{#f/21}但是...\n我，偉大的\nPAPYRUS...',
                    '<15>{#f/21}失敗了。',
                    '<15>{#f/21}我跟之前相比\n沒什麼兩樣。',
                    '<15>{#f/27}最壞的部分是，\n跟你約會之後...',
                    '<15>{#f/22}我只會把你拉進\n更深的愛裡！',
                    '<15>{#f/21}那是激情的\n黑暗牢籠，\n無處可逃。',
                    '<15>{#f/27}我怎麼能這樣\n對我親愛的\n朋友呢...？',
                    '<15>{#f/27}...',
                    '<15>{#f/27}...不...'
                ]
                : ['<15>{#f/24}人類，實際上...'],
        papdate39a: () => [
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    "<15>{#f/20}不！\n不是這樣的！",
                    "<15>{#f/17}我不會在任何\n事情上失敗！！！",
                    "<15>{#f/20}人類！！！\n我會幫助你度過\n這段艱難的\n時光！！！",
                    "<15>{#f/24}我可以繼續當你\n酷酷的朋友...",
                    '<15>{#f/20}然後把發生的\n這一切忘掉。',
                    '<15>{#f/10}畢竟，你也，\n很偉大。',
                    '<15>{#f/20}失去你的友誼\n會是一場悲劇！',
                    '<15>{#f/21}所以，拜託...',
                    "<15>{#f/21}不要因為我不能\n親吻你而哭泣...",
                    "<15>{#f/19}因為，我根本\n沒有嘴唇！！！",
                    ...(SAVE.data.n.plot < 48
                        ? [
                            "<15>{#f/10}嘿，總有一天，\n你會找到和我\n一樣好的人。",
                            "<15>{#f/24}呃，不。\n那是不可能的。",
                            "<15>{#f/20}但我也會接受\n你找個第二好的\n人！！！"
                        ]
                        : ["<15>{#f/10}對了，\nUNDYNE的家\n離這不遠。", '<15>{#f/20}我們可以約她\n一起消遣！'])
                ]
                : [
                    '<15>{#f/10}我也喜歡你！',
                    '<15>{#f/10}畢竟你是個\n超級大好人。',
                    '<15>{#f/21}但也許...',
                    "<15>{#f/21}如果你多為\n自己而活的話，\n你會過得更好的。",
                    '<15>{#f/21}不能只為了\n我而活。',
                    '<15>{#f/10}很幸運的是，\n我知道解決\n方案！！！',
                    '<15>{#f/20}那就是跟我的上司，\nUNDYNE一起消遣！！！',
                    '<15>{#f/24}我覺得如果你\n可以把你的友誼能量\n分散一點...',
                    "<15>{#f/10}你的生活方式\n就會更健康。",
                    ...(SAVE.data.n.plot < 48
                        ? ["<15>{#f/20}等準備好了\n我就告訴你！"]
                        : ["<15>{#f/20}所以讓我們！\n一起加油吧！！"])
                ]),
            '<15>{#f/20}捏嘿嘿\n嘿嘿！！！'
        ],
        papdate40: () => [
            '<15>{#f/24}喔，如果你還想\n找我的話...',
            "<15>{#f/10}這是我的\n{@fill=#f00}電話號碼{@fill=#000}。",
            '<15>{#f/11}歡迎你隨時\n打給我！',
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/24}當然，\n是柏拉圖式的。',
                    ...(SAVE.data.n.plot < 48
                        ? ['<15>{#f/10}那麼，\n我先走啦！']
                        : ["<15>{#f/10}那麼，我們\n在UNDYNE的房子那裡\n見面吧！"])
                ]
                : SAVE.data.n.plot < 48
                    ? ['<15>{#f/10}那麼，\n我先走啦！']
                    : ["<15>{#f/20}那麼，我們\n在UNDYNE的房子那裡\n見面吧！"]),
            '<15>{#f/20}捏嘿嘿！'
        ],
        papdate41: {
            a: () => (SAVE.data.b.flirt_papyrus ? '浪漫' : '友誼'),
            b: '功率\n水平',
            c: '日期：克歷615年9月',
            d: '速度',
            e: '星系\n地圖',
            f: '緊張感'
        },
        pappuzzle1: [
            '<18>{#p/papyrus}{#f/0}人類！',
            '<18>{#f/0}下一個謎題\n是我最喜歡的\n謎題之一。',
            "<18>{#f/4}這就像我兄弟的\n棉球收藏一樣...",
            '<18>{#f/0}不論哪個地方\n都讓人滿意！',
            "<18>{#f/9}我【儘量】不告訴你\n解決方法。"
        ],
        pappuzzle1a: ['<18>{#p/papyrus}{#f/0}試試吧！'],
        pappuzzle1b: [
            
            '<18>{#p/papyrus}{#f/4}看起來這個謎題...\n有誰趁我不注意時\n把它解開了。',
            '<18>{#p/papyrus}{#f/4}而且他\n還沒經過我同意。',
            "<18>{#p/papyrus}{#f/0}好吧，今天\n某個人要倒霉了。",
            '<18>{#p/papyrus}{#f/5}...',
            '<18>{#p/papyrus}{#f/5}運氣好的話，\n下個謎題就\n不會有人來破壞了。',
            "<18>{#p/papyrus}{#f/6}...我在\n下個區域等你。"
        ],
        pappuzzle2: ['<18>{#p/papyrus}哇！\n你解開了啊！！'],
        pappuzzle2a: ['<18>而且不用我的幫忙\n你就解開了！！！'],
        pappuzzle2b: ["<18>而且根本沒用我\n幫你太多\n你就解開了！"],
        pappuzzle2c: ['<18>雖然需要一點鼓勵，\n但你真的做到了！'],
        pappuzzle2d: [
            '<18>你一定跟我一樣\n很在意謎題吧！',
            "<18>那麼，我覺得你肯定\n會愛上下個謎題的！",
            '<18>可能對你而言\n都算太簡單了！！',
            '<18>捏！\n嘿嘿！\n嘿嘿嘿！！！'
        ],
        papsink0: () =>
            SAVE.data.b.svr
                ? [
                    '<32>{#p/human}* （這個水槽內的狗剩\n  看起來像一顆愛心。）',
                    '<32>* （不知為何，\n  這讓你感到放鬆。）'
                ]
                : SAVE.data.n.plot < 72
                    ? ["<32>{#p/basic}* 水槽太高了，\n  你都沒辦法洗手..."]
                    : ["<32>{#p/basic}* 水槽內有一堆狗剩。"],
        papsink1: [
            '<18>{#p/papyrus}{#f/9}厲害吧？\n我增加了水槽的高度。',
            '<18>{#f/0}現在我可以在下邊\n放更多骨頭了！\n你快看看！'
        ],
        papsink2: ['<18>{#p/papyrus}{#f/8}不！是那條狗！'],
        papsink3: ['<18>{#p/papyrus}{#f/31}喔，好可憐\n好可憐的小狗狗...', '<18>{#f/9}給你，嘗嘗我的\n特殊攻擊！'],
        papsink4: ['<18>{#p/papyrus}哇！！！\n它喜歡誒！！！'],
        papsink5: ['<18>{#p/papyrus}{#f/7}SANS！', '<18>別再用配樂\n打擾我的生活了！！'],
        papsink6: ['<18>{#p/papyrus}{#f/4}現在那條狗\n在我的攻擊下\n消失了。', '<18>喔好吧...'],
        papsolu1: [
            '<18>{#p/papyrus}看起來你需要\n一個提示。',
            '<18>{#f/4}嗯...',
            "<18>{#f/0}喏，我會注意\n這幾條電路的。",
            "<18>{#f/0}但這只是\n我自己的見解喔。"
        ],
        papsolu2: [
            '<18>{#p/papyrus}{#f/5}還是困惑嗎？',
            '<18>{#f/5}呃... 或許...',
            '<18>{#f/6}你用電路一點點\n推出答案呢？？？',
            "<18>{#f/5}我在儘量不給你\n把答案透露出來了..."
        ],
        papsolu3: [
            '<18>{#p/papyrus}{#f/6}還來？？？',
            '<18>{#f/0}我覺得，\n我應該完全可以\n告訴你解法了。',
            "<18>{#f/4}雖然我其實\n不想掃興..."
        ],
        papsolu3a: () => [
            '<18>{#p/papyrus}{#f/9}你真的，真的想要\n謎題的解法嗎？？？',
            choicer.create('* （你要怎麼回答？）', "告訴我", "再想想")
        ],
        papsolu3a1: () => [
            '<18>{#p/papyrus}解！法！就是！',
            '<18>{#f/4}（請腦補一段\n敲鼓聲...）',
            SAVE.data.b.s_state_pretrick
                ? '<18>{#f/0}...在這個區域\n左下角的那個終端！'
                : '<18>{#f/0}...在你右側那盞燈\n旁邊的那棵\n全息投影樹！',
            '<18>快去看看叭！！！'
        ],
        papsolu3a2: [
            "<18>{#p/papyrus}哇... 你真是個\n謎題愛好者！",
            "<18>我被你的熱情\n給打動了！",
            '<18>你做得到的，\n人類！！！'
        ],
        papsolu4: ["<18>{#p/papyrus}{#f/4}你忘記我給你的\n解法了嗎...？"],
        papsolu5: ['<18>{#f/0}{#p/papyrus}就快完成了！\n只剩下一條電路\n就要激活了！'],
        papspaghet1: (take: boolean) => [
            '<18>{#p/papyrus}{#f/1}什麼！？\n你是怎麼避開\n我的陷阱的？',
            '<18>{#f/4}還有，比起這個...',
            '<18>{#f/0}有給我留點嗎？？？',
            choicer.create('* （你要怎麼跟Papyrus說\n  關於他做的義大利麵的事？）', take ? '拿走了' : '留在那了', '吃掉了'),
            '<18>{#p/papyrus}真的！？'
        ],
        papspaghet1a: () => [
            '<18>{#p/papyrus}{#f/1}什麼！？\n你是怎麼避開\n我的陷阱的？',
            '<18>{#f/4}還有，比起這個...',
            '<18>{#f/0}有給我剩...',
            '<18>{#f/4}...等下。',
            "<18>{#f/0}你帶著它呢！！",
            '<18>{#f/9}人類，你怎麼打算的？',
            choicer.create("* （你要拿Papyrus的意面怎麼辦呢？）", '一起吃', '自己獨享'),
            '<18>{#p/papyrus}真的！？'
        ],
        papspaghet2a: [
            "<18>{#f/5}你忍著沒吃\n我做的義大利麵...",
            '<18>{#f/6}就是因為想跟我\n一起吃嗎？？？',
            '<18>{#f/9}那好吧！！',
            '<18>別擔心！這盤意面\n你先留著吧！',
'<18>因為我，\n偉大的PAPYRUS...',
            '<18>會為你和我二人\n做各種我們想吃的\n義大利麵的！',
            '<18>{#f/0}嘿嘿嘿嘿嘿嘿捏！'
        ],
        papspaghet2b: [
            '<18>{#f/5}哇...',
            '<19>{#f/6}之前幾乎從來沒有人\n欣賞過我的廚藝...',
            '<18>{#f/9}那好吧！！',
            '<18>別擔心！這盤意面\n你先留著吧！',
'<18>因為我，\n偉大的PAPYRUS...',
            '<18>會為你做你想吃的\n各種義大利麵的！',
            '<18>{#f/0}嘿嘿嘿嘿嘿嘿捏！'
        ],
        paptv: pager.create(
            0,
            () => [
                ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                    ? ["<18>{#p/papyrus}喔，這是我\n最喜歡的電視節目！"]
                    : []),
                ...(SAVE.data.n.plot < 67.1
                    ? ['<33>{#p/mettaton}* 「敬請期待新節目！」']
                    : SAVE.data.b.killed_mettaton
                        ? ['<33>{#p/mettaton}* 「網路連接錯誤。」']
                        : world.bad_robot
                            ? ['<33>{#p/mettaton}* 「抱歉，各位！」\n* 「節目取消了！」']
                            : ['<32>{#p/mettaton}* 「希望各位喜歡這個節目！」']),
                ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                    ? [
                        "<18>{#p/papyrus}{#f/7}什麼！！！\n平常都比這個\n精彩的！",
                        '<18>{#f/4}單純就是這一期\n質量不好。',
                        "<18>{#f/7}你不許酸我！！！"
                    ]
                    : [])
            ],
            ['<33>{#p/mettaton}* 「敬請期待新節目！」']
        ),
        papyrus1: ['<18>{#p/papyrus}所以，在我說到\nUNDYNE的時候...'],
        papyrus2: [
            '<18>{#p/papyrus}SANS！！\n我的天啊！！\n那是個...',
            '<18>人類嗎！？！？',
            "<25>{#p/sans}{#f/2}* 才不是咧，那就是個\n  長得像人的全息投影。"
        ],
        papyrus3: [
            '<18>{#p/papyrus}{#f/4}喔。',
            '<18>{#f/4}...',
            '<18>{#f/4}等一下...',
            "<18>{#f/7}你騙我！！",
            '<25>{#p/sans}{#f/2}* 哎呀，嘴滑了，那其實是個\n  「長得像全息投影的人」。',
            '<18>{#p/papyrus}{#f/0}...SANS，我們\n終於做到了！',
            '<18>{#f/9}UNDYNE現在【肯定】會讓我\n加入皇家衛隊了！！！',
            '<18>{#f/6}我們只需要...',
            '<18>{#f/5}去...',
            '<18>{#f/4}...',
            "<18>{#f/4}我好像忘了些啥。",
            '<25>{#p/sans}{#f/2}* 演講，還記得嗎？',
            '<18>{#p/papyrus}{#f/4}喔，對對對。\n...「咳咳」。',
            "<18>{#f/9}人類！你可能以為\n你來到這裡就安全了。",
            '<18>{#f/9}但我，\n偉大的PAPYRUS，\n打算扭轉你的想法！',
            "<18>{#f/4}首先，我要用\nALPHYS博士的謎題\n讓你眼花繚亂...",
            '<18>{#f/4}然後，\n在你最意想不到的時候...',
            '<19>{#f/9}哇嗚！\n抓到你了！\n押去首塔！',
            '<18>{#f/9}我們的戰鬥\n將一如既往地傳奇！',
            '<18>{#f/4}無論如何...',
            '<18>{#f/9}來吧...\n只要你夠膽！'
        ],
        papyrus4: ['<18>{#f/0}捏嘿嘿嘿嘿\n嘿嘿嘿！！！'],
        papyrus5: [
            '<25>{#p/sans}* 不錯，進展很順利。',
            "<25>* 別擔心，夥計。",
            "<25>{#f/2}* 我會用眼窩\n  替你盯著的。"
        ],
        papyrus6x1: ['<18>{#p/papyrus}{#f/5}人-人類？\n你就是那個人類嗎...？'],
        papyrus6x2: [
            "<15>{#p/papyrus}{#e/papyrus/20}我的天哪！\n我終於見到你啦！",
            "<18>{#p/papyrus}{#f/0}自打聽說你來了星港，\n我就夢想著能見你一面！",
            "<18>{#p/papyrus}{#f/4}...你問，\n為啥SANS沒跟我\n在一起？",
            '<18>{#p/papyrus}{#f/6}唉，我有理由懷疑...',
            '<18>{#p/papyrus}{#f/5}...他好像\n刻意想讓我躲著你。',
            '<18>{#p/papyrus}{#f/7}真不愧是他！！！',
            '<18>{#p/papyrus}{#f/0}但是，\n只要你不說，我不說~',
            "<18>{#p/papyrus}{#f/9}那懶骨頭\n就甭想知道【一丁點】\n咱們的「地下情誼」！"
        ],
        papyrus6x3: [
            "<18>{#p/papyrus}{#f/5}不過，我現在得走了。\n絕不能讓他發現\n我偷偷溜出來了。",
            "<18>{|}{#p/papyrus}{#f/9}待會見，人-{%}"
        ],
        papyrus6x4: ['<32>{#p/without}* ...papyrus？'],
        papyrus6: () => [
            '<18>{#p/papyrus}{#f/9}人類！！',
            world.nootflags.has('s_puzzle2') // NO-TRANSLATE

                ? '<18>{#f/4}你之前的謎題興許過\n得很輕鬆。'
                : '<18>{#f/4}你可能已經過了\n我很多別的挑戰。',
            "<18>{#f/9}但現在，你就\n絕對要束手無策了！",
            '<18>你也看到了，\n出這個謎題的\n不是別人...',
            '<18>{#f/0}正是那個大名鼎鼎的\nALPHYS博士！',
            '<18>實際上，\n規則很簡單。',
            '<18>這個顯示器會\n隨機讀出一個數字。',
            '<18>{#f/9}...這數字就是\n你度過這裡\n所需要的秒數！',
            '<18>{#f/0}如果數字是奇數，\n你就必須躲避子彈。',
            '<18>以1結尾的數\n是星形的子彈...',
            '<18>以3結尾的數\n是月亮形狀的子彈...',
            '<18>{#f/4}5是彗星的，\n7是類星體的...',
            "<18>{#f/9}如果是9結尾的，\n就是完全隨機！",
            '<18>{#f/0}如果數字是質數，\n重力就會翻轉。',
            "<18>{#f/4}（不過，\n小於10的質數\n一般不會觸發。）",
            '<18>{#f/0}如果數字是偶數，\n你一開始會\n平安無事...',
            '<18>{#f/9}但你接下來就要\n遭遇到隨機的怪物！',
            '<18>並且，如果是\n2的整數冪，會使\n怪物數量翻倍！！',
            '<18>{#f/0}如果某個數字\n重複了兩次...',
            '<18>{#f/0}等待的時間\n就會乘以這個數字！',
            '<18>{#f/0}如果數字是\n按順序排列的，\n譬如1-2-3...',
            '<18>{#f/0}房間就會搖搖晃晃，\n讓你連走都走不動！',
            '<18>{#f/0}然後，如果\n包含一個數字4...',
            '<18>{#f/9}SANS就會隨機用\n藍色魔法\n讓你浮起來！',
            "<25>{#p/sans}{#f/6}* 你看吧，\n  這就是我特殊的黃色眼睛。",
            '<18>{#p/papyrus}{#f/7}現在不行，SANS！！',
            '<25>{#p/sans}* 喔，嘿嘿。\n* 看來我有些{@fill=#ff0}浮{@fill=#fff}躁了，嗯？',
            '<18>{#p/papyrus}{#f/4}好好好...',
            '<18>{#f/9}總之！\n你理解我的\n解釋了嗎？',
            choicer.create('* （你要怎麼回答？）', "聽懂了", "沒聽懂")
        ],
        papyrus7: () => [
            "<18>{#p/papyrus}{#f/9}好，\n那我們回顧一遍！",
            '<18>{#f/0}這個顯示器會隨機\n生成一個秒數。',
            '<18>也就是，\n你要等多少秒\n才能通過的時間。',
            '<18>奇數要躲子彈。',
            "<18>尾數決定\n子彈的種類。",
            '<18>1是星星，3是月亮，\n5是類星體，\n7是...',
            '<18>{#f/5}等等，\n哪個數字是\n類星體來著？',
            '<18>{#f/9}呃，然後，\n如果尾數是9，\n就是完全隨機！',
            '<18>{#f/0}質數會改變重力...',
            '<18>{#f/0}偶數會\n遭遇隨機戰鬥...',
            '<18>{#f/5}等等，\n我剛才是說\n重力會改變嗎！？，',
            '<18>{#f/7}呃，我是說顛倒！！',
            '<18>{#f/0}但是2的整數冪\n會使遭遇數翻倍。',
            '<18>數字按順序排列的\n會讓房間搖晃，\n然後4是...',
            '<18>{#f/6}呃，我忘記\n4會發生什麼了。',
            "<25>{#p/sans}* 你這不是在暗示我嗎？",
            '<18>{#p/papyrus}{#f/6}可能吧？？？',
            '<18>{#f/7}管他呢！！\n你現在理解了嗎！？',
            choicer.create('* （你要怎麼回答？）', '當然', '更糊塗了')
        ],
        papyrus8: [
            '<18>{#p/papyrus}{#f/9}那... 好吧...',
            "<18>{#f/9}這樣吧，\n我把規則放在這！",
            '<18>{#f/0}這樣，你就可以\n按自己的節奏\n自己讀了。',
            '<18>祝你好運，人類！！',
            '<18>{#f/5}捏... 嘿嘿...'
        ],
        papyrus9: [
            '<18>{#p/papyrus}{#f/9}太奈斯了！',
            '<18>{#f/9}好，廢話少說...',
            "<18>讓我們看看\n會是什麼隨機數！！"
        ],
        papyrus10: [
            '<18>{#p/papyrus}{#f/9}人類！',
            '<18>{#f/9}準備好面對你\n最嚴峻的挑戰了嗎？',
            '<18>{#f/9}特此介紹...\n致命恐怖大挑戰！'
        ],
        papyrus11: [
            '<18>{#p/papyrus}{#f/9}一旦我下達命令，\n一切都會動起來！',
            '<18>雷射掃射！\n線圈發電！\n刀劍揮舞！',
            '<18>一切都會以精確的、\n戰術性的方式進行！',
            '<18>{#f/4}不精確的一點是，\n你肯定會失敗。',
            '<18>{#f/9}那麼！！！\n你準備好了嗎！？！？',
            '<18>因為！',
            '<18>我！',
            '<18>就！',
            '<18>要！',
            '<18>啟動了！'
        ],
        papyrus12: [
            '<25>{#p/sans}* 怎麼了？\n* 我們到底還進不進行了？',
            '<18>{#p/papyrus}{#f/7}...',
            "<25>{#p/sans}{#f/3}* 那條煩人的狗\n  在上面會不耐煩的。",
            '<18>{#p/papyrus}{#f/7}隨時都會進行的！'
        ],
        papyrus13: [
            '<25>{#p/sans}* 準備好了就開始吧。',
            '<18>{#p/papyrus}{#f/6}我...',
            "<18>{#f/6}我現在在想...",
            '<18>{#f/6}這個挑戰...',
            '<18>{#f/6}可能...',
            '<18>{#f/6}...',
            '<18>{#f/4}...有點不算個\n好主意了。',
            '<18>{#f/5}一想到\n我設計的這個挑戰\n可以這麼...',
            '<18>{#f/9}但是，不用害怕！',
            '<18>{#f/9}我是個\n有原則的骷髏！',
            '<18>{#f/4}就是，坦白來說，\n一個你根本不可能\n活著通過的挑戰...',
            '<18>{#f/7}就實在是太做作了！',
            '<18>走你！！'
        ],
        papyrus14: [
            '<18>{#p/papyrus}{#f/7}你看什麼看！？',
            '<18>{#f/9}這只是PAPYRUS的\n又一次決定性的\n勝利罷了！！',
            '<18>捏！',
            '<18>嘿！',
            '<18>{#f/4}...',
            '<18>...嘿？'
        ],
        papyrusFinal1: [
            '<23>{#p/papyrus}{#f/30}人類。',
            '<23>請允許我傾訴\n一些複雜的情感。',
            '<23>就像...'
        ],
        papyrusFinal2: () =>
            world.genocide
                ? [
                    '<23>失去至親的悲痛。',
                    '<23>無能為力的自責。',
                    '<23>陰陽兩隔的懷念。',
                    '<23>這些情感...'
                ]
                : papreal()
                    ? [
                        '<23>眾生罹難的心痛。',
                        "<23>無能為力的絕望。",
                        '<23>改過自新的理想。',
                        '<23>這些情感...'
                    ]
                    : [
                        '<23>找到另一個\n意面愛好者的喜悅。',
                        "<23>對另一個人\n解謎技巧的欽佩。",
                        '<23>想有一個很酷、\n很聰明的人認為你\n也同樣很酷的渴望。',
                        '<23>這些情感...'
                    ],
        papyrusFinal3: () =>
            world.genocide || papreal()
                ? [
                    '<18>{#f/31}肯定正縈繞在你心頭。',
                    '<18>{#f/32}很難想像這些情感\n究竟是怎樣的...',
                    '<18>{#f/6}畢竟，我很... 偉大...',
                    '<18>{#f/32}{#x1}...',
                    '<18>{#f/31}人類，儘管你做了\n很多錯事...\n我...',
                    '<18>{#f/5}我仍然相信你！',
                    '<18>{#f/31}我知道，\n你可以浪子回頭。',
                    '<18>{#f/31}我知道，\n你願意變得更好。',
                    ...(world.genocide
                        ? ["<18>{#f/4}不管那個「ASRIEL」\n說了什麼荒唐的話，"]
                        : ['<18>{#f/5}不管你覺得自己\n多麼不可救藥，']),
                    "<18>{#f/6}{#x2}但我知道，在內心深處，\n你還是個好人！",
                    '<18>{#f/0}我會讓你的善良重見天日！',
                    '<18>{#f/0}我會讓你的潛能盡數釋放！',
                    '<18>{#f/4}最終...',
                    '<18>{#f/9}我會讓你知道，\n你仍然是最棒的！！！',
                    '<18>{#f/0}我，PAPYRUS，\n敞開雙臂歡迎你！'
                ]
                : [
                    '<18>{#f/0}一定就是你\n現在的情感！！',
                    '<18>{#f/4}我很難想像這些情感\n究竟是怎樣的...',
                    '<18>{#f/4}畢竟，我十分偉大。',
                    '<18>我從來不好奇\n有很多朋友的感覺\n是怎樣的。',
                    '<18>{#f/5}我很同情你，\n孤單的人類...',
                    '<18>{#f/0}但不要擔心！！！\n你再也不會孤單了！',
                    '<18>{#f/9}因為我，\n偉大的PAPYRUS，\n會成為你的...',
                    '<18>{#f/5}{#x1}...',
                    '<18>不...',
                    '<18>{#f/7}{#x2}不，不該是這樣的！',
                    '<18>我不能成為\n你的「朋友」...',
                    '<18>你是個人類！\n我必須逮捕你！！！',
                    '<18>{#f/9}然後，我就可以實現\n我畢生的夢想！！！',
                    '<18>力量強大！\n受人愛戴！\n聲名遠揚！！！',
                    "<18>那就是PAPYRUS！！！",
                    '<18>{#f/4}皇家守衛中...',
                    '<18>{#f/9}最閃亮的新星！！！'
                ],
        papyrusFinal4: (b: boolean) =>
            world.edgy || world.killed0
                ? [
                    '<18>{#p/papyrus}{#f/0}哇！\n你做到了！',
                    "<18>{#p/papyrus}{#f/5}沒有動用任何暴力！",
                    '<18>{#p/papyrus}{#f/6}其實，\n剛才我有點害怕...',
                    "<18>{#p/papyrus}{#f/0}不過沒關係！\n你已經重回正軌啦！",
                    "<18>{#p/papyrus}{#f/8}我為你驕傲，人類！",
                    "<18>{#p/papyrus}{#f/4}...等等，我是不是\n該抓你來著？",
                    "<18>{#p/papyrus}{#f/0}嗨，隨它去吧。",
                    '<18>{#p/papyrus}{#f/0}只要你能成為最棒的自己，\n我就滿足啦。',
                    "<18>{#p/papyrus}{#f/5}過去的事，\n就讓它成為{@fill=#ff0}骨{@fill=#fff}事吧，\n好嗎？",
                    "<18>{#p/papyrus}{#f/9}我還要告訴你\n怎麼離開這裡！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/5}扭嗚呼呼...',
                    ...(b
                        ? ["<18>我沒有足夠的力量\n阻止你..."]
                        : ["<18>連像你這樣\n弱小的人\n我都阻止不了..."]),
                    "<18>{#f/7}UNDYNE一定會\n對我非常失望的！",
                    "<18>{#f/5}我也永遠不能\n加入皇家衛隊了...",
                    '<18>{#f/7}而且...\n我的粉絲數也會\n就這樣停滯不前！',
                    choicer.create('* （你要怎麼回答？）', "我們做\n朋友吧", '真是個\n廢柴')
                ],
        papyrusFinal4a1: (b: boolean) =>
            b
                ? [
                    '<18>{#p/papyrus}{#f/5}真-真的嗎？\n你想跟我做朋友？',
                    '<18>{#f/6}即使發生了\n那樣的事情？？？',
                    "<18>{#f/0}那，好吧！！\n我們做朋友吧！！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/1}真的嗎！？\n你想跟我做朋友？？？',
                    '<18>{#f/6}那...\n我覺得...',
                    '<18>{#f/0}我可以給你\n一個照應了！'
                ],
        papyrusFinal4a2: (b: boolean) =>
            b
                ? [
                    '<18>{#p/papyrus}{#f/5}嗯？你是...\n想責備我嗎？？？',
                    "<18>{#f/6}是因為我不夠強大，\n不配做你的朋友嗎？",
                    '<18>{#f/5}...不...',
                    '<18>{#f/7}喔，我在說什麼啊！！\n我當然很強大！',
                    "<18>{#f/9}我會通過跟你交朋友\n證明給你看！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/1}啊？為啥你要那麼大聲地\n罵自己呢？？？',
                    '<18>{#f/4}是不是因為...',
                    "<18>{#f/7}你感覺自己不夠優秀，\n不配做我的朋友？",
                    "<18>{#f/9}錯啦，你其實很棒！\n我會成為你的朋友的！！！"
                ],
        papyrusFinal4b1: [
            '<18>{#f/0}好耶！！',
            '<18>我交到一個新朋友啦！！',
            '<18>{#f/4}誰能想到，成為好朋友...'
        ],
        papyrusFinal4b2: [
            '<18>{#f/0}好耶！！',
            "<18>{#f/0}我們還沒有進行\n第一次約會...",
            "<18>{#f/0}就已經成為\n好朋友了！！！",
            '<18>{#f/4}誰能想到，成為好朋友...'
        ],
        papyrusFinal4c1: [
            '<18>{#f/0}只需要先出幾個\n抽象的謎題，\n再來打一架呢？',
            '<18>你教會了我很多，\n人類。',
            '<18>{#f/9}我特此\n允許你通過！',
            "<18>{#f/0}我會引導你\n離開這裡。"
        ],
        papyrusFinal4c2: [
            '<18>繼續前進。',
            '<18>等你到首塔的時候，\n跳進一艘飛船，穿過{@fill=#ff0}力場{@fill=#fff}。',
            "<18>{#f/4}那就是把我們\n困在前哨站的東西。",
            '<18>力場誰都進得來，\n但都出不去...',
            '<18>{#f/9}...除非，那個人擁有\n強大的靈魂。',
            '<18>{#f/0}就比如你！！！'
        ],
        papyrusFinal4d: [
            '<18>{#f/4}喔，我差點忘了說...',
            '<18>你要到達出口，\n就必須要通過...',
            '<18>{#f/7}{@fill=#ff0}國王{@fill=#fff}那關。',
            '<18>{@fill=#ff0}所有怪物的王...',
            '<18>{@fill=#ff0}他是...',
            '<18>{@fill=#ff0}{#f/6}...呃...'
        ],
        papyrusFinal4e: [
            "<18>{#f/0}他是個毛茸茸的\n好好先生！！！",
            '<18>大家都很喜歡他。',
            '<18>{#f/4}我很相信，\n只要你跟他說...',
            '<18>「不好意思，\nDREEMURR先生...\n我可以回家嗎？」',
            "<18>{#f/0}他就會親自帶你\n去發射艙的！",
            "<18>{#f/9}總之！！！\n廢話少說！！！",
            "<18>{#f/0}我會在家裡\n做你酷酷的朋友。"
        ],
        papyrusFinal4f1: ['<18>{#f/9}歡迎過來\n跟我一起玩！！！'],
        papyrusFinal4f2: ['<18>{#f/9}歡迎過來\n跟我約會！！！'],
        papyrusFinal4f3: ['<18>{#f/9}歡迎過來\n跟我打個招呼！！！'],
        papyrusFinal4g: ['<18>捏嘿嘿嘿\n嘿嘿嘿！！！'],
        papyrusFinal5: [
            '<18>{#p/papyrus}{#f/5}喔，那個人類\n到哪裡去了呢...',
            '<18>{#f/4}...\n等等。',
            "<18>{#f/1}就在我面前！！！",
            '<18>{#f/0}你好啊！\n我還在擔心你\n是不是迷路了呢！',
            "<18>看到你了，我就\n可以鬆口氣了...",
            '<18>{#f/7}...\n等一下！！！',
            "<18>你不應該逃走的！！！",
            '<18>快回來！！！'
        ],
        papyrusFinal6: [
            '<18>{#p/papyrus}{#f/4}又回來了，嗯？',
            "<18>{#f/5}我覺得應該是\n我的問題...",
            '<18>我之前答應過你，\n我會給你做意面。',
            "<18>不用猜，\n你想見我的原因...",
            '<18>肯定是想讓我給你\n做點意面。',
            '<18>{#f/0}好... 我懂了。',
            '<18>{#f/0}PAPYRUS也很饑渴！',
            '<18>{#f/7}對正義的\n如饑似渴！'
        ],
        papyrusFinal7: () => [
            "<18>{#p/papyrus}{#f/1}你又回來了！？！？",
            '<18>{#f/4}我終於知道\n為什麼了。',
            '<18>{#f/5}你...',
            '<18>你就是太想\n看到我的臉了...',
            '<18>{#f/6}我...',
            "<18>{#f/31}我不太確定自己\n能不能和抱有這種\n感受的人戰鬥。",
            "<18>{#f/4}更何況，我已經\n不太想抓你了。",
            '<18>{#f/5}要不然，\n我們就不戰鬥了...',
            '<18>{#f/5}...我直接放你走。\n怎麼樣？',
            choicer.create('* （你要怎麼回答？）', "放我走吧", "接著打")
        ],
        papyrusFinal7a: ['<18>{#p/papyrus}{#f/31}...\n好...', "<18>{#f/3}我想，我會接受\n我的失敗的。"],
        papyrusFinal7b: ['<18>{#p/papyrus}{#f/4}嗯，既然你都\n這樣說了，那...', '<18>{#f/9}我就\n奉陪到底！！！'],
        papyrusFinal8: () => [
            '<18>{#p/papyrus}{#f/1}還來？？？',
            '<18>{#f/4}...那，好吧...',
            '<18>{#f/9}你這次要\n放棄戰鬥嗎？？',
            choicer.create('* （你要怎麼回答？）', "放我走吧", "接著打")
        ],
        papyrusFinal8a: ['<18>{#p/papyrus}{#f/0}那麼，\n咱們開始吧！'],
        puzzle3: () => [
            '<32>{#p/human}* （你激活了終端。）',
            '<32>{#p/basic}* 屏幕上顯示著一條歷史修改記錄。',
            world.edgy
                ? '<32>* 「最新圖案修改者：ALPHYS」'
                : '<32>* 「最新圖案修改者：\n   酷炫骷髏95」',
            ...(!world.goatbro || SAVE.flag.n.genocide_milestone < 5 || SAVE.flag.n.ga_asrielAlphysCom1++ > 0
                ? []
                : ["<25>{#p/asriel2}{#f/13}* 她真是沒完沒了地為難我們..."]),
            '<32>{#p/basic}* 「要看一眼圖案嗎？」',
            choicer.create('* （看一眼圖案嗎？）', '看一眼', '算了')
        ],
        robotx: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （機器人看起來已經睡著了。）']
                : ["<32>{#p/basic}* 它進入了「休眠」模式。"],
        robot1: pager.create(
            0,
            () => [
                '<32>{#p/basic}* 你好，心地善良的旅行者。\n* 我是一個建築機器人。',
                '<32>* 我想去看看整個星系...\n* 但是我動彈不得。',
                '<32>* 如果你願意幫助我的話...',
                '<32>* 就帶上我的一塊晶片吧，\n  帶它去一個很遠很遠的地方。',
                choicer.create('* （拿走一塊晶片？）', '拿走', '算了')
            ],
            () => [
                '<32>{#p/basic}* 心地善良的旅行者，\n  如果你願意幫助我的話...',
                '<32>* 就帶上我的一塊晶片吧，\n  帶它去一個很遠很遠的地方。',
                choicer.create('* （拿走一塊晶片？）', '拿走', '算了')
            ]
        ),
        robot2: () => [
            '<32>{#p/basic}* 謝謝你... 祝你好運！',
            '<32>{#s/equip}{#p/human}* （你得到了「芯」型洋芋片。）',
            ...(world.goatbro && SAVE.flag.n.ga_asriel98++ < 1
                ? [
                    "<25>{#p/asriel2}{#f/9}* 嘿，真是個\n  可愛又天真的小東西。",
                    "<25>{#p/asriel2}{#f/13}* 天真到對自己的命運\n  一無所知。"
                ]
                : [])
        ],
        robot3: ['<32>{#p/basic}* 看起來你還沒有給我預留足夠的空間。'],
        robot4: () => [
            '<32>{#p/basic}* 好吧。\n* 那麼，祝你旅途愉快。',
            ...(world.goatbro && SAVE.flag.n.ga_asriel98++ < 1
                ? [
                    "<25>{#p/asriel2}{#f/9}* 嘿，真是個\n  可愛又天真的小東西。",
                    "<25>{#p/asriel2}{#f/13}* 天真到對自己的命運\n  一無所知。"
                ]
                : [])
        ],
        robot5: () => [
            '<32>{#p/basic}* 謝謝你照顧我。',
            ...(world.goatbro && SAVE.flag.n.ga_asriel99++ < 1
                ? ["<25>{#p/asriel2}{#f/4}* 行了，這些晶片應該夠用了。"]
                : [])
        ],
        robot6: () => [
            '<32>{#p/basic}* 近況如何？\n* 我是說，我那塊晶片近況如何...',
            '<32>* 啊？你把它弄丟了...？\n* ...那我再給你一塊吧...',
            choicer.create('* （再拿走一塊晶片？）', '拿走', '算了')
        ],
        robot7: [
            '<32>{#p/basic}* 這次小心點。別弄丟了。',
            '<32>{#p/human}{#s/equip}* （你得到了「芯」型洋芋片。）'
        ],
        robot8: ['<32>{#p/basic}* 我理解的。\n* 祝你旅途愉快...'],
        robot9: () => [
            '<32>{#p/basic}* 謝謝你... 照顧我...',
            ...(world.goatbro && SAVE.flag.n.ga_asriel99++ < 1
                ? ["<25>{#p/asriel2}{#f/4}* 行了，這些晶片應該夠用了。"]
                : [])
        ],
        robot10: [
            '<32>{#p/basic}* 晶片還好嗎？',
            '<32>* 啊？又弄丟了...？',
            "<32>* 對不起...\n* 我要是再給你晶片的話，\n  就什麼都不剩了。",
            '<32>* 看來我只能認命。\n* 想到去不了的地方，\n  終究只是幻想。',
            "<32>* 對所有怪物都一樣。",
            '<32>* 怪物們註定要永遠困在這裡，\n  度過餘生...'
        ],
        robot11: ['<32>{#p/basic}* 我真傻，為啥之前那麼輕易\n  就把心掏給你呢？'],
        robot12: ['<32>{#p/basic}* 滾！'],
        sans1: [
            '<99>{#p/darksans}{#i/8}* {@spacing=4/0}{#i/x2}人類。',
            "<99>* {@spacing=4/0}難道你不知道{@spacing=}\n  {@spacing=4/0}怎麼和新朋友{@spacing=}\n  {@spacing=4/0}打招呼嗎？",
            '<99>* {@spacing=4/0}轉過身來{@spacing=}\n  {@spacing=4/0}和我握手。'
        ],
        sans2: () => [
            ...(world.edgy
                ? [
                    "<25>{#p/sans}{#f/0}* 嘿，幹嘛露出這種表情？",
                    "<25>{#p/sans}{#f/2}* ...不喜歡放屁墊的把戲嗎？",
                    '<25>{#f/0}* ...沒關係，人各有志嘛。'
                ]
                : ["<25>{#p/sans}{#f/4}* 嘿嘿...\n  放屁墊把戲真是\n  咋玩都不膩。"]),
            "<25>{#f/0}* 總之，你是個人類，對吧？",
            "<25>{#f/5}* 真酷。",
            "<25>{#f/0}* 我是sans。\n* 骷髏sans。",
            '<25>{#f/3}* 作為一名皇家哨兵，\n  現在我本該抓捕人類的。',
            "<25>{#f/4}* 不過呢...",
            ...(world.edgy
                ? [
                    "<25>{#f/3}* 今天，我沒心思幹這事。",
                    '<25>{#f/0}* 但我有個兄弟...',
                    "<25>{#f/5}* 他對抓人類這事\n  可是熱情滿滿。",
                    '<25>{#f/0}* 所以，為了能讓他\n  安心在家待著...\n  我整整費了三輩子工夫。'
                ]
                : [
                    "<25>{#f/2}* 我有別的事要去忙。",
                    '<25>{#f/0}* 但我有個兄弟...',
                    '<25>{#f/5}* 雖然他還只是個預備哨兵，\n  但他的舉止已經超像一個\n  正式哨兵了。',
                    "<25>{#f/0}* 前面站著的，\n  應該就是他了。"
                ]),
            '<25>* 我有個主意。\n* 跳過那個空隙。',
            '<26>{#f/4}* 別怕，直接跳過去就行。\n* 我兄弟把重力設得很小，\n  肯定掉不下去。'
        ],
        sans3: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}* 到了。',
                    "<25>{#f/3}* 不過...\n  現在我沒啥想給你看的。",
                    "<25>{#f/2}* 我先在這待一會。",
                    "<25>{#f/0}* 等你再往前走走，\n  說不定我就有靈感了。"
                ]
                : ['<25>{#p/sans}* 快，到重力轉換器\n  那裡去。'],
        sans4: ["<25>{#p/sans}* 咋的了，哥們？"],
        sans5: [
            '<18>{#p/papyrus}{#x2}{#f/7}你說「咋的了」，\n兄弟！',
            '<18>你還有謎題要準備！',
            "<18>我明明給了你\n很多餘地，但...",
            '<18>你還是整天無所事事！',
            "<18>即使是現在，你還是在！",
            '<18>無所事事！',
            "<25>{#p/sans}* 實際上，我在擺弄這個\n  重力的玩意呢。",
            "<25>* 這個東西真的很酷的。",
            '<25>{#f/4}* 你要來看看嗎？',
            "<18>{#p/papyrus}{#x3}{#f/7}不！！\n我才沒時間看呢！！",
            '<18>{#x2}要是有人類從這經過，\n我得做好準備！',
            '<18>我必須會！\n我一定會！',
            '<18>{#x1}{#f/9}最終抓到一個人類！',
            '<18>{#x4}{#f/0}那時候，我，\n偉大的PAPYRUS...',
            '<18>會得到我應得的一切！',
            '<18>尊重...\n認可...',
            '<18>{#f/9}我就終於可以加入\n皇家衛隊了！',
            '<25>{#p/sans}* 嗯...',
            '<25>{#f/2}* 沒準這個玩意可以\n  幫到你呢。',
            "<18>{#p/papyrus}{#x3}{#f/7}SANS，那根本沒用！\n你這個懶骨頭！",
            '<18>{#x1}{#f/5}你明明知道，\n你能做的遠不止這些，\n但是...',
            '<18>{#x2}{#f/7}你還是選擇\n整天無所事事！',
            "<18>{#x1}{#f/5}難道你不想讓生活...\n更充實點嗎？",
            "<25>{#p/sans}* 嘿，放輕鬆點。\n* 我雖然懶得活動筋骨，\n  但腦袋裡可充實得很呢。",
            "<25>{#f/4}* 你甚至可以說我...",
            '<25>{#f/2}* 早已{@fill=#ff0}星{@fill=#fff}懷遠志了？'
        ],
        sans6: [
            '<18>{#p/papyrus}{#x3}{#f/7}SANS！！',
            "<25>{#p/sans}{#f/5}* 拜託。\n* 你明明笑了。",
            '<18>{#p/papyrus}{#x2}{#f/7}我確實笑了，\n但我討厭這樣！',
            '<18>{#x1}{#f/4}（唉...）',
            '<18>{#f/5}為什麼像我這樣\n偉大的人...',
            '<18>為了得到認可\n需要做這麼多破事？？',
            '<25>{#p/sans}* 嘿，別傷心嘛...',
            '<25>* 遇到困難，\n  負{@fill=#ff0}重力{@fill=#fff}爭才能致遠嘛。'
        ],
        sans7: [
            '<18>{#p/papyrus}{#x2}{#f/7}呃！！',
            '<18>{#x1}{#f/4}我去專心準備謎題了...',
            '<18>{#f/7}至於你的工作？',
            '<18>{#f/4}我希望你\n從現在起...',
            '<18>{#f/9}專注於你的\n{@fill=#ff0}星{@fill=#fff}工作上！！！',
            '<18>{#f/0}捏嘿嘿嘿嘿嘿\n嘿嘿嘿嘿嘿嘿！！'
        ],
        sans8: ['<18>{#p/papyrus}嘿！'],
        sans9: ['<25>{#p/sans}* 好了，是時候把你\n  弄下來了。'],
        sans10: [
            '<25>{#p/sans}{#f/0}* 嘿，對了...\n* 走之前，我得跟你說...',
            "<25>{#f/3}* 皇家衛隊正在找你呢。",
            "<25>{#f/0}* 不過你別擔心。\n* 他們拿得出手的只有狗狗。",
            "<25>{#f/0}* 你既然是人類，\n  那肯定知道狗狗\n  喜歡什麼，對吧？",
            "<25>{#f/2}* 它們和papyrus差不多，\n  人畜無害。"
        ],
        sansbook0: ['<32>{#p/human}* （看來這本笑話書\n  不會有明確的結局了。）'],
        sansbook1: ['<32>{#p/basic}* 這是本關於非歐幾何的書。\n* 寫著「ALPHYS」的名字。'],
        sansbook2: () => [choicer.create('* （要看一眼裡面嗎？）', '看一眼', '算了')],
        sansbook3: ['<32>{#p/human}* （你往書裡面看...）'],
        sansbook4: ['<32>{#p/basic}* 幾何學書裡面夾著一本\n  笑話書。'],
        sansbook5: ['<32>{#p/basic}* 笑話書裡面夾著\n  另一本幾何學書。'],
        sansbook6: ['<32>{#p/basic}* 幾何學書裡面夾著\n  另一本笑話書。'],
        sansbook7: ["<32>{#p/basic}* 是另一本幾何學書。"],
        sansbook8: ["<32>{#p/basic}* 是另一本笑話書。"],
        sansbook9: ['<32>{#p/human}* （你決定先不看了。）'],
        sansbook10: () => [
            "<32>{#p/basic}* 這是Sans留的字條。",
            '<32>{#p/without}* 「這麼認真幹什麼？」\n* 「這就只是個爛笑話。」',
            '<33>{#p/without}* 「呵...」',
            '<33>{#p/without}* 「別看得太入迷了。」',
            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...這是我見識過的\n  最爛的笑話。'])
        ],
        sansinter: {
            s_sans: pager.create(
                0,
                () =>
                    world.edgy
                        ? ["<25>{#p/sans}* 咋了？"]
                        : [
                            "<25>{#p/sans}* 你想過沒，要不了多久，\n  papyrus就回來了。",
                            "<25>{#f/4}* 我要是你，\n  就直接開溜了...",
                            "<25>{#f/2}* 不然，我就要跟你\n  來場「站逗」了。"
                        ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/3}* 真是太遺憾了...',
                            '<25>{#p/sans}{#f/2}* 這時候，我兄弟正忙著做\n  我布置的數獨習題集呢。',
                            "<25>{#p/sans}* 要是他在這，\n  就有一簍子事情等著咱們了。"
                        ]
                        : [
                            "<25>{#p/sans}* 你瞧，\n  沒什麼好害怕的。",
                            "<25>{#f/2}* papyrus看起來嚇人，\n  但他會是你見過的\n  最好的傢伙的。"
                        ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}* 咋的？\n* 想讓我把他帶過來？',
                            "<25>{#f/3}* 呵，小子。\n* 你是不是沒明白\n  我剛說的是啥意思？",
                            "<25>{#p/sans}{#f/2}* 聽我句勸：\n  最好別得寸進尺，\n  對你我都好。"
                        ]
                        : ['<25>{#p/sans}* 信我的。'],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 別給臉不要臉。",
                            '{*}{#s.resume}{%}'
                        ]
                        : ['<25>{#p/sans}* 信我的。'],
                () => (world.edgy ? [] : ['<25>{#p/sans}* 信我的。'])
            ),
            s_papyrus: pager.create(
                0,
                [
                    "<25>{#p/sans}* 嘿，有件事你得記一下。\n  挺重要的。",
                    '<25>* 我兄弟會一種很\n  {@fill=#00a2e8}特殊的攻擊{@fill=#fff}。',
                    "<25>* 如果看到了{@fill=#ff993d}橙色攻擊{@fill=#fff}，\n  你如果不動，就會受傷。",
                    "<25>{#f/3}* 有種簡單的方式\n  可以幫助你記住。",
                    "<25>{#f/0}* 想像一下燒紅的煤炭。\n* 你肯定不會站在\n  那種東西上吧？",
                    '<25>* 煤炭質地比較堅硬。\n* 所以不妨換成骨質煤炭來想。',
                    '<25>{#f/2}* 非常簡單，對吧？\n* 記得戰鬥的時候想想\n  燒紅的骨質煤炭吧。'
                ],
                [
                    "<25>{#p/sans}{#f/0}* 當然，你如果緩慢移動\n  是不會受傷的。",
                    '<25>{#f/0}* 只要保持移動就可以。',
                    "<25>{#f/2}* 肯定會有人\n  比我解釋得更好的。"
                ],
                ['<25>{#p/sans}{#f/2}* 記住...\n* 燒紅的骨質煤炭。']
            ),
            s_dogs: pager.create(
                0,
                [
                    "<25>{#p/sans}* 鑑於你是人類，\n  你應該從來沒有聽說過\n  ㄑㄋㄇㄉ這個東西吧。",
                    '<25>{#f/2}* 那是「區域性·逆雷射·脈衝·\n  對流層」的縮寫。'
                ],
                [
                    '<25>{#p/sans}* 如果ㄑㄋㄇㄉ出現問題，\n  我們周圍的空氣\n  就會消失不見。',
                    "<25>{#f/3}* 不過別擔心。\n* 我剛才說的那些，\n  從來就不曾{@fill=#ff0}粗{@fill=#fff}現過。"
                ],
                ['<25>{#p/sans}{#f/2}* 突變脈衝對流層技術。']
            ),
            s_jenga: pager.create(
                0,
                [
                    '<25>{#p/sans}* 實際上，\n  早些時候的那份意面...',
                    "<25>{#f/3}* 對我兄弟來說\n  還算好的。",
                    "<25>{#f/0}* 自從他開始上烹飪課，\n  他已經進步很多了。",
                    "<25>{#f/4}* 我敢說如果他堅持下去，\n  他甚至會驚豔到國王。"
                ],
                () =>
                    world.edgy || world.killed5
                        ? ['<25>{#p/sans}{#f/2}* 這絕對是讓他遠離\n  你的好方法。']
                        : ["<25>{#p/sans}{#f/2}* ...那個對意面\n  異常痴迷的男人。"]
            ),
            s_bridge: pager.create(
                0,
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/0}* 希望你喜歡\n  我最後布置的謎題。',
                            '<25>{#f/3}* 時間比較緊，但papyrus\n  堅持讓我設計好謎題，\n  我還是照做了。'
                        ]
                        : world.killed5
                            ? [
                                "<25>{#p/sans}{#f/3}* 我聽說，\n  這裡的怪物都四散而逃了...",
                                "<25>{#f/0}* 奉勸你最好小心點，\n  別把小命丟了。"
                            ]
                            : [
                                "<25>{#p/sans}{#f/3}* 不知道我兄弟\n  現在又要去幹啥。",
                                '<25>{#f/0}* 我覺得，你可以趁這會\n  複習一下{@fill=#ff993d}橙色攻擊{@fill=#fff}。'
                            ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/0}* 怎麼？\n* 怪我不好好設計謎題？',
                            "<25>{#f/3}* 我還得一邊應付你，\n  一邊花時間準備謎題。\n* 能弄好就怪了。"
                        ]
                        : world.killed5
                            ? [
                                '<25>{#p/sans}{#f/0}* 我好歹有親兄弟\n  願意無條件關心我，支援我。',
                                "<25>{#f/2}* 而你..."
                            ]
                            : ['<25>{#p/sans}{#f/2}* 喔，順帶再複習下{@fill=#00a2e8}藍色攻擊{@fill=#fff}。'],
                () =>
                    world.edgy
                        ? ['<25>{#p/sans}{#f/3}* 就是這樣。']
                        : world.killed5
                            ? ['<25>{#p/sans}{#f/0}* 我說錯了？']
                            : ['<26>{#p/sans}{#f/0}* 還有其他攻擊。']
            )
        },
        sansbredgey: () =>
            world.edgy
                ? 6 <= world.population
                    ? [
                        '<25>{#p/sans}* 對了...',
                        "<25>* 我知道，\n  之前待你有些不周...",
                        '<25>{#f/3}* 很高興你願意\n  做個更善良的人。',
                        '<25>{#f/2}* 堅持下去，好嗎？'
                    ]
                    : world.bullied
                        ? [
                            '<25>{#p/sans}* 對了...',
                            "<25>* 我知道，你還在繼續\n  傷害怪物，威脅他們的生命...",
                            '<25>{#f/3}* 但至少，你沒有\n  放任自流，屠殺殆盡。',
                            "<25>{#f/2}* 挺好的，是吧？"
                        ]
                        : [
                            '<25>{#p/sans}* 對了...',
                            '<25>* 你要是不小心\n  遇到了我的兄弟...',
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 敢動他一下試試。",
                            '{*}{#s.resume}{%}'
                        ]
                : 6 <= world.population
                    ? [
                        '<25>{#p/sans}* 對了...',
                        "<25>* 我知道我兄弟\n  有時候蠢蠢的...",
                        "<25>{#f/3}* 謝謝你願意配合\n  他那些瘋狂的計畫。",
                        "<25>{#f/2}* 你真的很棒。"
                    ]
                    : world.bullied
                        ? [
                            '<25>{#p/sans}* 對了...',
                            "<25>* 我知道，你在傷害怪物，\n  威脅他們的生命...",
                            '<25>{#f/3}* 但至少，你沒有\n  放任自流，屠殺殆盡。',
                            "<25>{#f/2}* 挺好的，是吧？"
                        ]
                        : [
                            '<25>{#p/sans}* 對了...',
                            '<25>* 你要是不小心\n  遇到了我的兄弟...',
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 敢動他一下試試。",
                            '{*}{#s.resume}{%}'
                        ],
        sentryPapyrus1: pager.create(
            0,
            () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這個哨站上的文字預示著\n  它的創造者將來的名聲。）']
                    : [
                        "<32>{#p/basic}* 紙殼箱上寫著幾句話。",
                        ...(world.genocide || world.runaway
                            ? [
                                '<23>{#p/papyrus}{#f/30}「求你不要毀掉我的哨站。」',
                                '<23>「我費了好大功夫才搭好它，\n要是它垮了，我會很傷心的。」',
                                '<23>「...此致，\nPAPYRUS。」',
                                '<23>（「註：我還想再寫點，\n但是沒地方了。」）'
                            ]
                            : [
                                '<23>{#p/papyrus}{#f/30}「你仔細打量眼前這個\n精心製作的哨站，心想...」',
                                '<23>「是哪位能工巧匠，\n才能做出這樣的哨站呢？」',
                                '<23>「我敢說，肯定是出自那個\n超-有名的皇家守衛之手！」',
                                SAVE.data.n.plot === 72
                                    ? '<32>{#p/basic}* 最後一行被劃掉了。'
                                    : '<23>（「註：現在還暫時沒當上\n  超有名的皇家守衛。」）',
                                ...(SAVE.data.n.plot < 19 && !(world.edgy || world.killed5 || world.population < 6)
                                    ? [
                                        "<25>{#p/sans}{#f/0}* 在欣賞我兄弟的手工成果，\n  是嗎？",
                                        "<25>{#p/sans}{#f/2}* 我知道的。\n* 真的很酷。"
                                    ]
                                    : [])
                            ])
                    ],
            () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這個哨站上的文字預示著\n  它的創造者將來的名聲。）']
                    : [
                        "<32>{#p/basic}* 紙殼箱上寫著幾句話。",
                        ...(world.genocide || world.runaway
                            ? [
                                '<23>{#p/papyrus}{#f/30}「求你不要毀掉我的哨站。」',
                                '<23>「我費了好大功夫才搭好它，\n要是它垮了，我會很傷心的。」',
                                '<23>「...此致，\nPAPYRUS。」',
                                '<23>（「註：我還想再寫點，\n但是沒地方了。」）'
                            ]
                            : [
                                '<23>{#p/papyrus}{#f/30}「你仔細打量眼前這個\n精心製作的哨站，心想...」',
                                '<23>「是哪位能工巧匠，\n才能做出這樣的哨站呢？」',
                                '<23>「我敢說，肯定是出自那個\n超-有名的皇家守衛之手！」',
                                SAVE.data.n.plot === 72
                                    ? '<32>{#p/basic}* 最後一行被劃掉了。\n* 正該如此。'
                                    : '<23>（「註：現在還暫時沒當上\n  超有名的皇家守衛。」）'
                            ])
                    ]
        ),
        sentryPapyrus2: pager.create(0, () => [
            '<32>{#p/human}* （你往桌板下面看了一眼...）',
            ...(SAVE.data.b.svr
                ? [
                    [
                        "<25>{#p/asriel1}{#f/17}* 那是Papyrus\n  存放他所有古怪東西的地方。",
                        '<25>{#f/20}* 晚上是戰士，\n  ...也是一名工匠。'
                    ],
                    [
                        '<26>{#p/asriel1}{#f/13}* 在某條時間軸，\n  我曾鼓勵過Papyrus去\n  皇家實驗室應職。',
                        
                        '<25>{#f/17}* 但他還是我行我素... \n  致力於自己的小科研\n  而無心出岫。',
                        "<25>{#f/13}* Papyrus他真的好像進入了\n  一種超凡脫俗的境界。"
                    ],
                    [
                        '<26>{#p/asriel1}{#f/13}* Papyrus曾創造出\n  一把存在於傳說中的\n  名為「鶴嘴斧」的工具。',
                        '<25>{#f/17}* 一件多功能工具，\n  可以斬斷任何材料。',
                        '<25>{#f/15}* 其耐久度為...\n  永不磨損。',
                        '<25>{#f/13}* 但他卻把它扔掉了，\n  用他自己的話來說...',
                        '<25>{#f/13}* 「擁有一個萬能工具\n   會使工作失去樂趣！」'
                    ],
                    ['<26>{#p/asriel1}{#f/20}* 所以Papyrus擁有一個\n  獨特的思維方式。']
                ][Math.min(asrielinter.sentryPapyrus2++, 3)]
                : ['<32>* 裡面堆滿了一箱又一箱未使用過的\n  電纜和過時玩意。'])
        ]),
        sentrySans1: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （你覺得\n  這個哨站的作用微不足道。）']
                : world.darker
                    ? ["<32>{#p/basic}* 一個哨站。"]
                    : SAVE.data.n.plot < 31
                        ? [
                            "<32>{#p/basic}* Sans的哨站...",
                            "<32>* 這絕對是皇家守衛\n  最值得的投資。"
                        ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* Sans的哨站...", "<32>* 這項投資的質量一點都沒有改變。"]
                            : ["<32>{#p/basic}* Sans的哨站...", '<33>* 事後看來，這真是\n  一項糟糕的投資。'],
        sentrySans2: pager.create(
            0,
            () => [
                '<32>{#p/human}* （你往桌板下面看了一眼...）',
                ...(SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/15}* 當我還是星星時，\n  總有一些黑暗的角落\n  是我不敢去探索的。',
                            "<25>{#f/20}* 所以，\n  一些陰暗的角落\n  我們最好視而不見。"
                        ],
                        ['<25>{#p/asriel1}{#f/20}* 求你了，\n  你想去任何地方都行\n  就是別來這裡可以嗎？']
                    ][Math.min(asrielinter.sentrySans2++, 1)]
                    : world.edgy
                        ? ["<32>{#p/basic}* 除了一支紅蠟筆外，什麼都沒有。"]
                        : ['<32>{#p/basic}* 這裡儲存了幾瓶蜂蜜，\n  阿爾弗雷多面醬，\n  以及雅莫萬用醬。'])
            ],
            () => [
                '<32>{#p/human}* （你往桌板下面看了一眼...）',
                SAVE.data.b.svr
                    ? '<25>{#p/asriel1}{#f/20}* 求你了，\n  你想去任何地方都行\n  就是別來這裡可以嗎？'
                    : world.edgy
                        ? "<32>{#p/basic}* 那是令人不安的警示。"
                        : "<32>{#p/basic}* 裡面存放著無窮無盡的食物佐料。"
            ]
        ),
        whew1: () =>
            [
                ['<32>{#p/basic}* 狗窩上覆蓋著\n  煩人的白毛。'],
                ['<32>{#p/basic}* 和Papyrus打了兩架後，\n  你有點累了，但還不至於倒頭就睡。'],
                [
                    '<32>{#p/basic}* 連著戰鬥三次後，你精疲力盡了。',
                    choicer.create('* （你該怎麼辦？）', '不睡', '睡覺')
                ],
                [
                    '<32>{#p/basic}* 接連的戰鬥使你精疲力盡了。',
                    choicer.create('* （你該怎麼辦？）', '不睡', '睡覺')
                ]
            ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 3)],
        whew2: ['<32>{#p/human}* （你沒動狗窩。）'],
        whew3: ['<32>{#p/human}* （你睡在了狗窩裡...）'],
        whew4: [
            "<32>{#p/alphys}* 那人真在這裡？",
            '<32>{#p/sans}{#f/7}* 嗯。\n* 我兄弟說的，千真萬確。',
            '<32>{#p/alphys}* 好-好吧...\n* 那我看看...',
            '<32>{#p/human}* （門開的聲音。）',
            '<32>{#p/alphys}* ...',
            '<32>{#p/alphys}* 喔，還真在這裡。',
            "<32>{#p/sans}{#f/7}* 嘿，咱們動作得快。",
            "<32>{#p/sans}{#f/7}* 說不定哪一會\n  Undyne就發現了。",
            '<32>{#p/alphys}* 我-我已經儘快了！'
        ],
        whew5: [
            '<32>{#p/human}* （你感覺有人正努力\n  把你扛起來。）',
            '<32>{#p/alphys}* 天哪，為-為什麼人類\n  都這麼重啊？！'
        ],
        whew6: [
            '<32>{#p/basic}* 嗯？\n* 我們這是到...',
            "<32>* ...Asgore家了。",
            "<32>* 來吧，\n  我們一起去找他..."
        ],
        trivia: {
            s_bbox: ["<32>{#p/basic}* 這是個休眠艙。\n* 有個人類在裡頭..."],
            
            ogkxsaucer: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你把手伸進噴醬機深處。）\n* （感覺有點不禮貌。）"]
                    : ["<32>{#p/basic}* 某種型號的噴醬機。"],
            mousehole: () =>
                [
                    ["<32>{#p/basic}* 這是一個老鼠洞。\n* 裡面的老鼠正在討論\n  你們之間的大戰。"],
                    ["<32>{#p/basic}* 這是一個老鼠洞。\n* 裡面的老鼠正在\n  擔心你的安危。"],
                    ["<32>{#p/basic}* 這是一個老鼠洞。\n* 裡面的老鼠想讓你休息一下。"],
                    ["<32>{#p/basic}* 這是一個老鼠洞。\n* 裡面的老鼠擔心你會神志不清。"]
                ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 3)],
            lamppost: pager.create(
                2,
                ...[
                    ["<32>{#p/basic}* 一盞「彈」燈。"],
                    ['<32>{#p/basic}* 一盞很彈很彈的燈。'],
                    ['<32>{#p/basic}* 如此彈。\n* 如此燈。'],
                    ['<32>{#p/basic}* 燈，彈，燈，彈...'],
                    ['<32>{#p/basic}* 彈燈上下跳動著。'],
                    ['<32>{#p/basic}* ...彈動永不停歇。'],
                    ["<32>{#p/basic}* 所謂「永不停歇」，大抵如此。"]
                ].map(
                    lines => () =>
                        SAVE.data.b.svr
                            ? ['<32>{#p/human}* （你注視著奇怪的燈上下彈跳。）']
                            : world.darker
                                ? ['<32>{#p/basic}* 只是盞燈。']
                                : lines
                )
            ),
            ntower: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 我覺得Alphys大概\n  永遠不會修理這個了。',
                            "<25>{#f/16}* 當然我不怪她。\n* 畢竟這東西的規則\n  簡直像個惡夢。",
                            '<25>{#f/20}* 同樣的，\n  執行這個謎題也需要Sans。',
                            '<25>{#f/15}* 不過讓他參與這個謎題... \n  估計不太可能。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* 對... Sans...\n* 風趣橫生，但不咋活躍。',
                            '<25>{#f/13}* 不咋「活躍」，\n  自然代表「身體」的不活躍。',
                            "<25>{#f/15}* 而「身體」不活躍，\n  意思就是說\n  他幾乎不咋「移動」。",
                            '<25>{#f/16}* 最後不咋「移動」，\n  就是說他從頭到晚\n  都不會起來走一步路。',
                            '<25>{#f/13}* 是的。\n* 除了他走捷徑的時候。',
                            '<25>{#f/15}* 對於這個裝置，\n  我是一點都不知道\n  它是怎麼運作的。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 我猜你會說\n  Alphys不去修這個謎題\n  的理由是...？",
                            '<25>{#f/20}* 如果真去修，那她肯定\n  有個小捷徑可以跳過\n  這個謎題。'
                        ],
                        ['<25>{#p/asriel1}{#f/20}* ...也許我的幽默感\n  有待提高。']
                    ][Math.min(asrielinter.ntower++, 3)]
                    : SAVE.data.b.s_state_puzzlenote || (!world.genocide && world.edgy)
                        ? ["<32>{#p/basic}* 裝置沒激活。"]
                        : postSIGMA()
                            ? ["<32>{#p/basic}* 不能使用了。"]
                            : ['<32>{#p/basic}* 真倒霉。'],
            s_secret_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上提到了\n  某件事物的逃逸。）']
                    : SAVE.data.n.state_starton_trashprogress < 2 && SAVE.data.n.plot < 72
                        ? [
                            '<32>{#p/basic}* 「正在小憩。」',
                            ...(world.goatbro && SAVE.flag.n.ga_asrielDog++ < 1 ? ['<25>{#p/asriel2}{#f/15}* 什麼鬼。'] : [])
                        ]
                        : ['<32>{#p/basic}* 「逃走了。」'],
            grillflower: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （看起來這株植物\n  確實很像霓虹燈。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一株植物。"]
                        : [
                            "<32>{#p/basic}* 這不僅僅是一株植物...\n* 這是一株霓虹植物。",
                            '<32>* 這有什麼區別嗎？\n* 沒有，完全沒有。'
                        ],
            librarbywindow1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （但這裡沒啥有趣的。）']
                    : ["<32>{#p/basic}* 窗戶裡面有一株植物。\n* 真有趣。"],
            librarbywindow2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你夠到了窗戶邊緣，\n  並將雙手搭在了窗戶上。）']
                    : ["<32>{#p/human}* （你夠到了窗戶邊緣，\n  並將雙手搭在了窗戶上。）\n* （但你看不見裡面的任何東西。）"],
            papwindow: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你往窗戶裡面看，\n  看起來沒人在家。）"]
                    : SAVE.data.n.plot_date > 0 && SAVE.data.n.plot_date < 1 && SAVE.data.n.plot < 71.2
                        ? ['<32>{#p/basic}* ...看起來Papyrus\n  正在耐心地等著你。']
                        : ["<32>{#p/basic}* ...看來沒人在家。"],
            s_puzzlenote: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這張便條記述了\n  關於這個複雜挑戰的規則。）']
                    : SAVE.data.b.s_state_puzzlenote
                        ? ["<33>{#p/basic}* 難以辨認的狗爬字。"]
                        : [],
            s_backrooms_lessdog: () =>
                SAVE.data.b.svr
                    ? [
                        "<32>{#p/human}* （你撫摸著一隻想像出來的狗。）\n* （它似乎對此很享受。）",
                        ...[
                            ['<25>{#p/asriel1}{#f/13}* Frisk，你在幹啥？'],
                            ["<25>{#p/asriel1}{#f/13}* Frisk，這裡什麼都沒有。"],
                            ['<25>{#p/asriel1}{#f/15}* ...你還好嗎？'],
                            ['<25>{#p/asriel1}{#f/15}* ...']
                        ][Math.min(asrielinter.s_backrooms_lessdog++, 3)]
                    ]
                    : SAVE.data.n.state_starton_lesserdog === 2 || (world.population === 0 && !world.bullied)
                        ? ['<32>{#p/basic}* ...但是誰也沒有來。']
                        : world.runaway || world.population === 0
                            ? ['<32>{#p/basic}* ...但是大家都逃走了。']
                            : SAVE.data.n.plot < 72
                                ? ["<32>{#p/basic}* 它正在跟自己玩一種\n  撲克牌遊戲。", '<32>* 感覺它要輸了...']
                                : [
                                    "<32>{#p/basic}* 它正在跟自己玩一種\n  撲克牌遊戲。",
                                    '<32>* 不知為何，它好像要贏了...？'
                                ],
            s_backrooms_lesstable: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想知道人類是否可以吃狗糧。）']
                    : ["<32>{#p/basic}* 桌上放了一副4D撲克牌，\n  還有免費狗糧。"],
            s_beddinng_table: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你瞥了一眼桌子。）\n* （然後你移開了目光。）']
                    : ['<32>{#p/basic}* 必備之桌。\n* 雖無所用，卻恰得其所。'],
            s_bh_bone: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你欣賞著這幅\n  極簡主義畫的工藝。）']
                        : [
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}一幅經典的繪畫。',
                                    "<18>它總能讓我想起\n我人生中最重要的東西。"
                                ]
                                : []),
                            "<32>{#p/basic}* 這是一幅極簡主義的\n  卡通骨頭畫。"
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你欣賞著這幅\n  極簡主義畫的工藝。）']
                        : ["<32>{#p/basic}* 這是一幅極簡主義的\n  卡通骨頭畫。"]
            ),
            s_bh_cottonball: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* (你對附著在棉球上的便條\n  上的內容毫不感到驚訝。）'
                    ]
                    : [
                        "<32>{#p/basic}* 這是個髒髒的棉球，\n  上面附著好幾張便條。",
                        '<23>{#p/papyrusnt}「SANS！」\n「把你的棉球撿起來！」',
                        '<32>{#p/without}* 「好的。」',
                        '<23>{#p/papyrusnt}「別把它放回去！」\n「把它挪走！」',
                        '<32>{#p/without}* 「好的。」',
                        '<23>{#p/papyrusnt}「你就挪了兩微米！」\n「把它拿回你的房間！」',
                        '<32>{#p/without}* 「好的。」',
                        '<23>{#p/papyrusnt}「不要再把它拿回來了！」',
                        '<32>{#p/without}* 「好的。」',
                        '<23>{#p/papyrusnt}「它還在這！」',
                        '<32>{#p/without}* 「你剛才不是說，\n   不要把它拿回我的房間嗎？」',
                        '<23>{#p/papyrusnt}「算了！」'
                    ],
            s_paptrash: pager.create(
                0,
                ...[
                    () => [
                        ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                            ? [
                                "<18>{#p/papyrus}{#f/9}我都不知道你還\n喜歡撿垃圾！",
                                '<18>{#f/0}ALPHYS博士會\n對你很感興趣的。'
                            ]
                            : []),
                        world.darker ? "<32>{#p/basic}* 一個垃圾桶。" : '<32>{#p/basic}* 這是個「閃亮」垃圾桶。'
                    ],
                    pager.create(
                        1,
                        ...[
                            [
                                '<32>{#p/basic}* 之所以說這個垃圾桶「閃亮」，\n  是因為它的一邊就寫著\n  「閃亮」兩個字。'
                            ],
                            ['<32>{#p/basic}* 一個「閃亮」星仔\n  對一個「閃亮」垃圾桶。\n* 你還能有什麼想知道的。'],
                            ['<32>{#p/basic}* 小鎮這一帶中\n  最「閃亮」的垃圾桶。'],
                            ['<32>{#p/basic}* 這麼說來，\n  也可以是別的某一帶。'],
                            ['<32>{#p/basic}* 它到底有多「閃亮」？'],
                            ['<32>{#p/basic}* 非常？\n* 非常非常？\n* 比別的任何東西都「閃亮」？'],
                            ["<32>{#p/basic}* 我們還有選擇的餘地，\n  寶貝！"],
                            [
                                '<33>{#p/basic}* 但不管時間如何流逝...\n  這個垃圾桶給你的印象\n  仍然「閃亮」。'
                            ],
                            [
                                '<32>{#p/basic}* 實際上，我越想越覺得，\n  「閃亮」這個形容\n  太浮皮潦草了。'
                            ],
                            ['<32>{#p/basic}* 就比如，也許\n  用「參天」這個詞來形容\n  就更適合一點。'],
                            ["<33>{#p/basic}* 實際上，還是算了吧。\n* 這個詞還是給皇家實驗室的\n  高層留著吧。"],
                            ['<32>{#p/basic}* 嗯...\n* 萬一這個垃圾桶是黑洞偽裝的呢！'],
                            ['<32>{#p/basic}* 一個黑洞垃圾桶...\n* 你會願意冒這個險嗎？'],
                            ["<32>{#p/basic}* 這問題問得有點怪了。"],
                            [
                                '<32>{#p/basic}* 我覺得你現在就可以說，\n  都是因為這個垃圾桶，\n  我思緒完全「升空」了。'
                            ],
                            ["<32>{#p/basic}* 你甚至可以說，\n  我感覺要... 羽化登仙了。"],
                            ['<32>{#p/basic}* ...\n* 你當我最後一句沒說。'],
                            ['<32>{#p/basic}* 實際上，你還是\n  把我說的最後九句全忘了吧。\n  算上這句。'],
                            ["<32>{#p/basic}* 說白了...\n* 這個垃圾桶只能用\n  一個形容詞來形容。"],
                            ["<32>{#p/basic}* 你問是什麼詞？\n* 那，我就告訴你...\n  如果你真的想知道的話。"],
                            ["<32>{#p/basic}* 它不是一個參天的垃圾桶，\n  絕對不是。"],
                            ["<32>{#p/basic}* 從任何角度來看，\n  這也不像是黑洞樣式的..."],
                            ["<32>{#p/basic}* 你還記得嗎？\n* 你還記得我們是從哪裡\n  開始的嗎？"],
                            ['<32>{#p/basic}* 那是我對這個垃圾桶\n  說過的第一句話。'],
                            ['<32>{#p/basic}* ...\n* 我說過...\n* 你等一下...'],
                            ['<32>{#p/basic}* 這是個「閃亮」垃圾桶。']
                        ].map(lines => () => world.darker ? ["<32>{#p/basic}* 一個垃圾桶。"] : lines)
                    )
                ].map(
                    p => () =>
                        SAVE.data.b.svr
                            ? ["<32>{#p/human}* （你看不出來垃圾桶裡有什麼...）"]
                            : CosmosUtils.provide(p)
                )
            ),
            s_bh_fridge: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （冰箱內的食物看起來不錯。）']
                        : world.runaway
                            ? ["<32>{#p/basic}* 底部被掏空了。"]
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 哎呦，全是義大利麵。']
                                : [
                                    ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                        ? [
                                            '<18>{#p/papyrus}{#f/9}啊哈！\n對我的食物博物館\n感興趣了嗎？',
                                            '<18>{#f/0}請隨意參觀我的\n烹飪藝術展。'
                                        ]
                                        : []),
                                    '<32>{#p/basic}* 冰箱的一半都堆滿了\n  標有「義大利麵」的容器。',
                                    '<32>* 另一半則只放了一瓶橙汁汽水。'
                                ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （冰箱內的食物看起來不錯。）']
                        : world.runaway
                            ? ["<32>{#p/basic}* 底部被掏空了。"]
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 哎呦，全是義大利麵。']
                                : [
                                    ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                        ? ["<18>{#p/papyrus}不錯的冰箱，\n是吧？"]
                                        : []),
                                    '<32>{#p/basic}* 瓶子上寫著\n  「ALPHYS」的名字。'
                                ]
            ),
            s_bh_rocktable: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你懷疑這些星塵\n  實際上可以食用。）']
                        : [
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}啊，沒錯，\n這是餐桌。',
                                    '<18>{#f/5}我們之前養過\n一塊月巖...',
                                    '<18>{#f/7}但後來有一天，\n它徹底消失了！',
                                    '<18>{#f/4}最開始，我覺得是\n那隻愛管閒事的\n狗幹的。',
                                    '<18>{#f/7}但後來我發現，\n是SANS用它來測試\n他的...',
                                    '<18>{#f/6}他的... 很有用的\n小玩意。\n哇...',
                                    "<18>{#f/0}所以呢，\n給他就給他了吧。",
                                    '<18>{#f/0}他真的在努力去\n做一件事。',
                                    '<18>{#f/4}即使要我們付出\n那塊寶貴的月巖的\n代價。',
                                    "<18>{#f/0}是啊！！\n努力總比\n不努力強！！"
                                ]
                                : []),
                            "<32>{#p/basic}* 上面覆蓋著\n  可食用的星塵。"
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你懷疑這些星塵\n  實際上可以食用。）']
                        : ["<32>{#p/basic}* 上面覆蓋著\n  可食用的星塵。"]
            ),
            s_bh_stove: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                '<25>{#p/asriel1}{#f/13}* Frisk，我想問一下...',
                                '<25>{#f/13}* 你聽說過被遺棄的\n  芝士蛋糕的悲劇嗎？',
                                '<25>{#f/16}* 就在這個烤盤裡，\n  一個甜點被創造出來...',
                                '<25>{#f/3}* 這讓烘焙師感到出乎意料。'
                            ],
                            [
                                '<25>{#p/asriel1}{#f/3}* 看，Sans創造出了一個\n  多麼甜蜜的芝士蛋糕啊...',
                                '<25>{#f/4}* 任何嘗過這個蛋糕的人，\n  都將對其感到無法自拔。',
                                '<25>{#f/15}* 只要他願意，\n  他的顧客將會遍布前哨站\n  的任何一個區域。'
                            ],
                            [
                                "<25>{#p/asriel1}{#f/13}* 最後，\n  Sans知道這將會\n  出盡他兄弟的風頭。",
                                "<25>{#f/15}* 而且，僅僅通過\n  製作一個芝士蛋糕\n  也太過分了。",
                                '<25>{#f/16}* 所以，他把它藏起來\n  以避免承擔責任。'
                            ],
                            ['<25>{#p/asriel1}{#f/16}* 唉，這就是被遺棄的\n  芝士蛋糕的悲劇。']
                        ][Math.min(asrielinter.s_bh_stove++, 3)]
                        : [
                            "<32>{#p/basic}* 烤箱裡有一個\n  空的錫紙盤。",
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}我兄弟經常\n去外面吃。',
                                    "<18>{#f/4}但最近，他開始\n嘗試去「烘焙」\n一些東西了...",
                                    '<18>{#f/5}我猜那個是...\n芝士蛋糕？',
                                    "<18>{#f/6}我不太能確定。"
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            [
                                '<25>{#p/asriel1}{#f/13}* 總的說來，\n  Sans創造了一個如此甜蜜的\n  芝士蛋糕...',
                                '<25>{#f/16}* 任何嘗過這個蛋糕的人，\n  都將對其感到無法自拔。',
                                '<25>{#f/3}* 只要他願意，\n  他的顧客將會遍布前哨站\n  的任何一個區域。',
                                '<25>{#f/3}* 這個芝士蛋糕，它就像一條...\n  通往成功道路上的捷徑。',
                                '<25>{#f/4}* 但是他的兄弟Papyrus\n  是絕對不會批准\n  讓其通過的！'
                            ],
                            [
                                "<25>{#p/asriel1}{#f/13}* 最後，\n  Sans知道這將會\n  出盡他兄弟的風頭。",
                                "<25>{#f/15}* 而且，僅僅通過\n  製作一個芝士蛋糕\n  也太過分了。",
                                '<25>{#f/16}* 所以，他把它藏起來\n  以避免承擔責任。'
                            ],
                            ['<25>{#p/asriel1}{#f/16}* 唉，這就是被遺棄的\n  芝士蛋糕的悲劇。']
                        ][Math.min(asrielinter.s_bh_stove++, 3)]
                        : ["<32>{#p/basic}* 烤箱裡有一個\n  空的錫紙盤。"]
            ),
            s_chew: ["<32>{#p/basic}* 這是一個吱吱作響的咀嚼玩具，\n  標籤上寫著「特殊攻擊」。"],
            s_crossroads_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上提到了\n  關於箱子的眾多好處。）']
                    : [
                        '<32>{#p/basic}* 「這是一個箱子。」',
                        '<32>* 「你可以把物品放進去\n   或者拿出來。」',
                        '<32>* 「同樣的箱子之後還會出現，\n   不必擔心要回來取東西。」',
                        '<32>* 「謹上，一個箱子愛好者。」'
                    ],
            s_doghouse: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （這個狗屋的內牆\n  似乎被奇怪的圓圈環繞著。）'
                    ]
                    : SAVE.data.n.state_starton_greatdog === 2
                        ? ['<32>{#p/basic}* 這個狗窩內部一定有很大空間。']
                        : world.genocide || world.edgy || world.darker
                            ? ['<32>{#p/basic}* 小狗窩。']
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 我覺得這個狗屋\n  裡有一個時空隧道。']
                                : ['<32>{#p/basic}* 多麼小巧的狗屋啊！', '<32>{#p/basic}* 裡頭看起來比外邊大。'],
            s_doghouse_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你很難理解牌子上的內容。）"]
                    : ['<32>{#p/basic}* 「汪汪。」'],
            s_dogs_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子提到了\n  某些氣味的危險程度分級。）']
                    : [
                        '<32>{#p/basic}* 「氣味危險分級」',
                        '<32>* 「矽膠的氣味 - 機器人」\n* 「白色等級。」\n* 「也可以變成{@fill=#2f2f2f}黑色{@fill=#fff}等級。」',
                        '<32>* 「不可疑的氣味 - 小狗」\n* 「{@fill=#003cff}藍色{@fill=#fff}等級。」\n* 「在地裡打滾的氣味。」',
                        world.runaway
                            ? '<32>* 「古怪的氣味 - 人類」\n* 「{@fill=#00c000}綠色{@fill=#fff}等級。」\n* 「一旦看到，立馬逃跑！」'
                            : SAVE.data.n.plot === 72
                                ? '<32>* 「古怪的氣味 - 人類」\n* 「{@fill=#00c000}綠色{@fill=#fff}等級。」\n* 「不懼神明之力。」'
                                : SAVE.data.n.plot < 31
                                    ? '<32>* 「古怪的氣味 - 人類」\n* 「{@fill=#00c000}綠色{@fill=#fff}等級。」\n* 「不惜一切代價消滅！」'
                                    : '<32>* 「古怪的氣味 - 小狗？」\n* 「{@fill=#00c000}綠色{@fill=#fff}等級。」\n* 「深諳擼狗之道。」'
                    ],
            s_dogstandA: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這個哨站似乎屬於一隻公狗。）']
                    : player.position.y > 50
                        ? ['<32>{#p/basic}* 「他的。」']
                        : ['<32>{#p/basic}* 這裡有一本\n  關於藍灰混搭的花哨毛型雜誌。'],
            s_dogstandB: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這個哨站似乎屬於一隻母狗。）']
                    : player.position.y > 50
                        ? ['<32>{#p/basic}* 「她的。」']
                        : ['<32>{#p/basic}* 這裡有一本\n  關於鈍重型武器的宣傳冊。'],
            s_dogstandC: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這封信上的文字\n  似乎被忽略了。）']
                    : world.genocide
                        ? [
                            '<32>{#p/basic}* 地板上，是一封寫著「果斷撤離」的\n  皇家守衛籤名信。',
                            '<32>{#p/basic}* 信上的「果」字幾乎都被啃掉了...'
                        ]
                        : [
                            '<32>{#p/basic}* 在裡面的地板上\n  放著一封關於統一制服尺寸的\n  皇家守衛籤名信，',
                            "<32>{#p/basic}* 上面全是爪印。"
                        ],
            s_grillbys_beegstool: () =>
                SAVE.data.b.svr
                    ? ['<25>{#p/asriel1}{#f/20}* 我想這把凳子\n  對你來說有點太高了。']
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高腳凳。']
                        : ['<32>{#p/basic}* 一把高腳凳...', '<32>* 高度剛好適合Sans。'],
            s_grillbys_drinks: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你無法辨認\n  摺疊桌下有什麼東西...）"]
                    : SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}* 一張摺疊式餐桌。", '<32>* 底部的攝像頭已經被拿走。']
                        : ["<32>{#p/basic}* 一張摺疊式餐桌。", "<32>* 下面藏了個攝像頭。"],
            s_grillbys_shelf: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<25>{#p/asriel1}{#f/16}* 我不認為\n  品嘗這些是個好主意。",
                            '<25>{#f/15}* 上次有人喝的時候，\n  它們起火了...'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/15}* 劇透警告：\n* 是烈焰Grillby。',
                            "<25>{#f/20}* 天吶。\n* 我今天感到熾烈無比。"
                        ],
                        ["<25>{#p/asriel1}{#f/17}* 不過說真的。\n* 你真不應該喝這些。"]
                    ][Math.min(asrielinter.s_grillbys_shelf++, 2)]
                    : SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}* 這些架子上的飲料\n  有些已經喝完了。']
                        : [
                            '<32>{#p/basic}* 柜子上擺滿了\n  五花八門的派對酒水和噁心的液體。',
                            '<32>{#p/basic}* 唯一的一瓶水貼有\n  「當心明火」的標籤。'
                        ],
            s_grillbys_sidestool: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/20}* 那把凳子\n  對你來說絕對太高了。"]
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高腳凳。']
                        : ['<32>{#p/basic}* 這把高腳凳上標著「PAPYRUS」。'],
            s_grillbys_smolstool: () =>
                SAVE.data.b.svr
                    ? ['<25>{#p/asriel1}{#f/19}* 這把凳子\n  看起來對你來說剛剛好。']
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高腳凳。']
                        : SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 這把高腳凳沒什麼特別的。']
                            : [
                                '<32>{#p/basic}* 我有種感覺\n  這個酒吧凳很特別。',
                                ...(SAVE.data.n.plot === 33 ? ['<32>* 至少與上面的屁墊有關...'] : [])
                            ],
            s_helipad: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/21}* 啊對...\n* 懸浮車終端。',
                            "<25>{#f/4}* 它現在被廢棄了，\n  但是在以前...",
                            '<25>{#f/3}* 操作員在這裡\n  指揮該區域的交通。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/3}* 該終端主要在\n  星港建設期間使用。',
                            '<25>{#f/4}* 對這裡建立的\n  第一個新區域，\n  這是一個明智的預防措施。',
                            
                            '<25>{#f/13}* 從工廠複製器那\n  運送補給的船隻...\n  沒有它幾乎無法安全著陸。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 但慢慢的，\n  這樣的終端\n  卻不再被需要了。",
                            '<25>{#f/20}* 因為這些運輸船駕駛員\n  著陸的技術提升了。',
                            '<25>{#f/13}* 所以，\n  這些終端就被逐漸遺忘了。'
                        ],
                        ['<25>{#p/asriel1}{#f/16}* 這只是\n  眾多被遺忘的對象之一。']
                    ][Math.min(asrielinter.s_helipad++, 3)]
                    : ['<32>{#p/basic}* 一個曾經用來指揮\n  懸浮車著陸的廢棄終端。'],
            s_jenga_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （牌子上寫著：\n  量子臺隨機數生成器\n  已經壞了。）"]
                    : ['<32>{#p/basic}* 「注意：這個顯示臺內置的\n   量子隨機數生成器還沒修好。」'],
            s_library_window: () => [
                '<32>{#p/human}* （你將雙手搭在了窗戶上。）',
                ...(SAVE.data.b.svr ? [] : ['<32>{#p/basic}* 有股油漆的味道。'])
            ],
            s_librarby_blueBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了\n  過去與現在的對比情況。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「舊事重提」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「戰前，怪物每天都要學習魔法。」',
                            '<32>* 「然而，大多數同胞都在戰爭中犧牲，\n   其中就包括許多教師。」',
                            '<32>* 「面對這一問題，剩餘的怪物們\n   開始採用集體學習的方式。」',
                            '<32>* 「當時採用這一方式，是為了讓我們\n   能在前哨站更好地生存。」',
                            '<32>* 「如今，人口不足的問題\n   幾乎不復存在。」',
                            '<32>* 「儘管如此，我們還是\n   堅持新的學習方式，因為...」',
                            '<32>* 「...我們懶得再改回去了。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了\n  過去與現在的對比情況。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「舊事重提」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「以前，\n   怪物使用多種貨幣進行交易。」',
                            '<32>* 「主要流通的是珠寶和『克裡』...\n   但它們只能在母星上使用。」',
                            '<32>* 「與人類進行貿易時，\n   就只能選擇金錢作為貨幣。」',
                            '<32>* 「豐富的金礦資源\n   為我們帶來了許多便利。」',
                            '<32>* 「但也因此導致\n   其他貨幣迅速貶值。」',
                            '<32>* 「如今，金錢成為了\n   我們唯一的貨幣！」\n* 「這就是怪物的作風。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了\n  過去與現在的對比情況。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「舊事重提」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「Erogot死後，國王盡己所能\n   去保留故園的遺存。」',
                            '<32>* 「儘管在儲存途中，\n   他還是把那件最重要的東西\n   弄丟了...」',
                            '<32>* 「但我們早已習慣逆來順受，\n   沒有因此責怪他。」',
                            '<32>* 「過去兩百年間充滿坎坷，\n   但同時自由也離我們越來越近。」',
                            '<32>* 「天使即將降臨...」',
                            '<32>* 「...我們猜想，或許他已經到來，\n   此刻正讀著這本書。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            s_librarby_desk: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到\n  這些借閱記錄積滿了灰塵。）']
                    : ["<32>{#p/basic}* 圖書倌的借閱記錄。"],
            s_librarby_greenBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了一些雜談，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「雜談」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「『域外網』，是國王與\n  皇家科學員共同打造的網路平臺。」',
                            '<32>* 「...不過，主要是皇家\n  科學員的功勞。\n  國王僅僅寫了個歡迎致辭。」',
                            '<32>* 「言歸正傳，\n   域外網作為一個『虛擬廣場』，\n   將前哨站的居民聯繫在一起。」',
                            '<32>* 「想要創建帳戶，你只需要...」',
                            '<32>* 「呃... 好吧...」',
                            "<32>* 「這教程看著清楚，\n   寫的可是不清不楚。」",
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了一些雜談，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「雜談」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「要是你想到前哨站各處逛逛的話，\n   呼叫旅人是你的不二之選。」',
                            '<32>* 「不管你想去哪，他都可以載你一程。」',
                            '<32>* 「...因為，你總可以\n   在最近的停靠站找到他。」',
                            '<32>* 「而且，說真的，\n   他說話有點不知所云。」',
                            '<33>* 「『狗子的公道』到底是個啥？」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （這些書記載了一些雜談，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「雜談」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「怪物們可以自由穿梭於\n   前哨站的各個區域。」',
                            '<32>* 「只有首塔頂端的最終長廊\n   是禁區。」',
                            '<32>* 「除了皇家科學員，\n   任何居民都不得通過那裡。」',
                            '<32>* 「...我們仍不清楚其中的原因。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            s_librarby_ladder: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （梯子上方的暗門似乎被封閉了。）']
                    : ["<32>{#p/basic}* 一把亂放的梯子。\n* 沒什麼好說的。"],
            s_librarby_pinkBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (這些書記載了\n  有關怪物生物學的各種事實。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物生物學」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「理論上講，\n   怪物的葬禮十分酷炫。」',
                            '<32>* 「當怪物老了，\n   然後翹辮子了，\n   他們就會化為塵埃。」',
                            '<32>* 「在葬禮上，我們拿來這些塵埃，\n   灑在他生前最喜歡的東西上。」',
                            '<32>* 「這樣一來，他的精神\n   就會留存在那件物品中...」',
                            '<32>* 「唔，我湊夠字數了嗎？」\n* 「我有點討厭寫這個。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (這些書記載了\n  有關怪物生物學的各種事實。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物生物學」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「怪物的軀體由魔法構成，\n   因此和靈魂密不可分。」',
                            '<32>* 「如果一個怪物蓄意傷人，\n   還對此執迷不悟...」',
                            '<32>* 「他就會變得異常強大。」',
                            '<32>* 「不過大多數我族同胞並不崇尚暴力，\n   至少不是打心底裡。」',
                            '<32>* 「可是，如果我們再次遭受襲擊，\n   能用於自衛的，只有一座前哨站...」',
                            '<32>* ...',
                            '<32>{#p/human}* （你不想再讀下去了。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (這些書記載了\n  有關怪物生物學的各種事實。）'
                        ]
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物生物學」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「怪物的身體主要由魔法構成，\n   而人類的身體主要由水構成。」',
                            '<32>* 「就物質組成來說，\n   人類比我們強大得多。」',
                            '<32>* 「但是，他們永遠不能體會到\n   使用魔法表達自我的樂趣。」',
                            '<32>* 「他們永遠不會收到\n   一張彈幕生日賀卡...」',
                            '<32>* 「也永遠不能\n   使用隱藏術和鷹眼術玩捉迷藏...」',
                            '<32>* 「更無法拿電魔法\n   辦一場炫酷燈光秀！」',
                            '<32>* 「太可憐了。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            s_librarby_purpleBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了\n  怪物家園的歷史。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「故園歷史」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「故園日夜，皆為奇觀。」',
                            '<32>* 「晨曦初露，光塔劃空，天啟新篇。」',
                            '<32>* 「至於白晝，光層共振，輝煌萬丈。」',
                            '<32>* 「能量盡釋，夜幕悄然。」',
                            '<32>* 「星辰降臨，魔力凝聚。」',
                            '<32>* 「日光之能，盡數落地，歸於塵寰。」',
                            '<32>* 「直至光塔重升，耀眼如初。」',
                            '<32>* 「此乃晝夜，永恆循環，主宰光陰。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了\n  怪物家園的歷史。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「故園歷史」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「你知道嗎，怪物們如今的社會結構\n   並非一直存在。」',
                            '<32>* 「很久很久以前，\n   確切來說，距今大約幾千年時...」',
                            '<32>* 「我們的祖先每天漫無目的，\n   肆意嬉戲。」',
                            '<32>* 「不敢相信！\n   那時的怪物甚至連衣服都不穿！」',
                            '<32>* 「不過，隨著時間流逝，\n   我們有了新的追求，渴望進化。」',
                            '<32>* 「在那場偉大的復興運動中，\n   連魔法的本質都被擺上檯面，\n   成為焦點。」',
                            '<32>* 「這些進步奠定了我們的社會結構，\n   乃至如今的生活方式。」',
                            '<32>* 「...我還是不敢相信\n   長達兩千年的歷史中，\n   我們都在裸著亂跑。」',
                            '<32>* 「哪有風度？」\n* 「哪有時尚？」\n* 「太不可思議了。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了\n  怪物家園的歷史。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「故園歷史」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「人怪首次會面時，\n   當政的怪物王是Erogot。」',
                            '<32>* 「在他英明的領導下，\n   兩族和平共處，相安無事。」',
                            '<32>* 「但隨著Erogot壽終正寢...\n   這一切都一去不復返了。」',
                            '<32>* 「Erogot有能力維持兩族長久和平，\n   而王子卻難以承襲此功。」',
                            '<32>* 「於是，一場大戰將在所難免...\n   實在令人痛心。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            s_librarby_yellowBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了怪物的科技技術。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物科技」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「Gerson曾說，\n   前哨站以前只是個小太空站。」',
                            '<32>* 「在受了整整二十年苦之後，\n   有人將目光轉向了那道力場。\n   心想...」',
                            "<32>* 「『這股強大的能量，\n   能否為己所用呢？』」",
                            '<32>* 「這主意簡潔明了，\n   但又十分巧妙。」',
                            '<32>* 「在這一想法的指引下，\n   核心最終建成，\n   我們因此有了穩定的能源。」',
                            '<32>* 「時至今日，我們仍在使用它！」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了怪物的科技技術。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物科技」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「啊，人工智慧真是\n   世界一大奇蹟...」',
                            '<32>* 「...也可能恰恰相反。」',
                            '<32>* 「自從建築機器人K-541.12出了事之後，\n   我們就徹底放棄了研發\n   有自我意識的AI。」',
                            '<32>* 「王后甚至下令，\n   禁止任何人開發新的AI程式。」',
                            '<32>* 「現在，還有能力與資源去搞AI的，\n   只剩一個怪物了。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （這些書記載了怪物的科技技術。）']
                        : [
                            '<32>{#p/basic}* 書架上標著「怪物科技」。',
                            '<32>{#p/human}* （你取下了一本書...）',
                            '<32>{#p/basic}* 「如今，很多人都已經忘了\n   太空中幾乎沒有重力。」',
                            '<32>* 「早在戰前，怪物在科技方面\n   就有許多突破性成果。」',
                            '<32>* 「其中之一，\n   就是先進的重力控制系統。」',
                            '<32>* 「如今，前哨站的每一個角落，\n   不論大小，都安裝了\n   使用這一技術的裝置。」',
                            '<32>* 「現在正在看書的你，\n   可能就站在其中一個裝置上面。」',
                            '<32>{#p/human}* （你把書放回了書架。）'
                        ]
            ),
            s_math_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你對牌子上的內容感到困惑。）"]
                    : ['<32>{#p/basic}* 「警告：狗子的公道」'],
            s_pacing_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （看著牌子上的內容，\n  你不禁揚起嘴角。）"]
                    : ['<32>{#p/basic}* 「留意有狗」\n* 「...請撫摸狗...」'],
            s_phonecard: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （這張便條要求你\n  撥打某個電話號碼。）',
                        '<32>{#s/phone}{#p/event}* 撥號中...',
                        '<32>{#p/human}* （無訊號。）'
                    ]
                    : world.runaway
                        ? [
                            "<32>{#p/basic}* 這是張便條。",
                            '<32>* 「給我打電話！」\n* 「這是我的電話號碼！」',
                            '<32>{#s/phone}{#p/event}* 撥號中...',
                            '<32>{#p/basic}* 電話直接轉接到了\n  語音信箱。',
                            '<32>{#p/basic}* 「你好，孤獨的來電者！」\n* 「你願與我一起離開前哨站嗎？」',
                            '<32>{#s/equip}{#p/event}* 滴...'
                        ]
                        : SAVE.data.n.plot === 72
                            ? [
                                "<32>{#p/basic}* 這是張便條。",
                                '<32>* 「給我打電話！」\n* 「這是我的電話號碼！」',
                                '<32>{#s/phone}{#p/event}* 撥號中...',
                                '<32>{#p/human}* （無訊號。）'
                            ]
                            : [
                                "<32>{#p/basic}* 這是張便條。",
                                '<32>* 「給我打電話！」\n* 「這是我的電話號碼！」',
                                '<32>{#s/phone}{#p/event}* 撥號中...',
                                '<32>{#p/basic}* 電話直接轉接到了\n  語音信箱。',
                                '<32>{#p/basic}* 「你好，孤獨的來電者！」\n* 「我很抱歉沒能在這裡迎接你~」',
                                '<32>{#s/equip}{#p/event}* 滴...',
                                ...(world.goatbro && SAVE.flag.n.ga_asrielVoicemail++ < 1
                                    ? ['<25>{#p/asriel2}{#f/10}* ...莫名其妙。']
                                    : [])
                            ],
            s_sr_cottonball: () =>
                world.darker
                    ? ['<32>{#p/basic}* 一排棉球擋住了儲藏室的門。']
                    : [
                        '<32>{#p/basic}* 這有一排整齊劃一的棉球。',
                        ...(SAVE.data.b.s_state_inverter
                            ? ["<32>{#p/basic}* ...不禁讓人好奇\n  為什麼它們還擋著儲藏室。"]
                            : ["<32>{#p/basic}* ...你想知道\n  Sans的其他垃圾的去向。"])
                    ],
            s_sr_treadmill: ["<32>{#p/basic}* 這是一臺跑步機。", "<32>{#p/basic}* 這是它的最高設定了。"],
            s_sr_lamp: [
                "<32>{#p/basic}* 這是一盞檯燈，\n  裡面掛著一張大字條。",
                '<23>{#p/papyrusnt}「抱歉，我把你在這裡用的\n手電筒拿回去了。」',
                '<23>{#p/papyrusnt}「不是說我介意你用\n我的東西...」',
                '<23>{#p/papyrusnt}「但你用這種不正常的\n方式用就完全沒有\n道理了！」',
                '<23>{#p/papyrusnt}「我不知道你是怎麼想的，\n但據我所知...」',
                '<23>{#p/papyrusnt}「手電筒算不上燈泡！！」'
            ],
            s_sc_book: [
                "<32>{#p/basic}* 這是皇家實驗室的舊日誌。",
                '<32>{#p/human}* （你翻到了打開的那頁...）',
                '<32>{#p/basic}* 「活動日誌，克歷615年7月」',
                '<32>* 「我們已經從花叢中\n   挑選到了理想的對象。」',
                '<32>* 「試驗物質的準備工作\n   將在未來幾天結束。」',
                '<32>* 「很快，實驗對象就會\n   進行注射。」',
                '<32>* 「這樣一來，我們就比以往任何時候\n   都更接近自由...」'
            ],
            s_sc_drawer: [
                "<32>{#p/basic}* 抽屜裡有一本相冊。",
                '<32>{#p/basic}* 相冊裡有Sans和Alphys\n  在皇家實驗室的照片。',
                '<32>{#p/basic}* 有的照片中在做實驗，\n  有的在沉迷看科幻動畫...',
                '<32>{#p/basic}* 他們看起來很開心。'
            ],
            s_sc_diagram: () => [
                "<32>{#p/basic}* 桌子上有一份\n  力場削弱武器的藍圖。",
                '<32>{#p/basic}* 牆上還有其他\n  各種各樣的概念圖...',
                '<33>{#p/basic}* 一臺非線性時空訪問機，\n  一臺蟲洞孔徑穩定儀，\n  還有個被怪物靈魂綁定的人類靈魂。',
                ...(!SAVE.data.b.s_state_charasker
                    ? ((SAVE.data.b.s_state_charasker = true),
                        [
                            '<32>{#p/basic}* ...這是可能的嗎？\n* 一個人類靈魂和一個\n  怪物靈魂共生？',
                            "<32>{#p/basic}* 但是怪物靈魂主人的身份\n  將會丟失...",
                            '<32>{#p/basic}* ...'
                        ])
                    : ['<32>{#p/basic}* ...'])
            ],
            s_pr_papbed: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （總得來說，\n  你很欣賞這張床。）']
                        : [
                            '<32>{#p/basic}* 一張精心製作的超級跑車床。',
                            ...(roomready()
                                ? [
                                    "<18>{#p/papyrus}那是我的床！",
                                    '<18>{#f/4}如果我有機會\n去探索星星的話...',
                                    "<18>{#f/0}我想沿著一條\n漫長的星際公路\n航行。",
                                    '<18>感受髮絲中的靜電，\n和皮膚上映出的\n星光...',
                                    "<18>{#f/4}當然，這都只是\n一場夢罷了。",
                                    '<18>{#f/0}所以我就\n邊打盹邊航行了。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （總得來說，\n  你很感謝這張了不起的床。）']
                        : ['<32>{#p/basic}* 一張精心製作的超級跑車床。']
            ),
            s_pr_papbones: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            "<32>{#p/basic}* （你把手伸進箱子，\n  但骨頭不會對你造成任何傷害。）",
                            ...[
                                ['<25>{#p/asriel1}{#f/21}* 當心啊，Frisk！\n* 這些骨頭可能還在活動...'],
                                ['<25>{#p/asriel1}{#f/16}* ...或者沒有。'],
                                ["<25>{#p/asriel1}{#f/13}* 我想知道\n  你是不是那種會站在\n  燒紅煤炭上的人。"],
                                ['<25>{#p/asriel1}{#f/8}* 我是說燒紅的骨質煤炭。']
                            ][Math.min(asrielinter.s_pr_papbones++, 3)]
                        ]
                        : [
                            '<32>{#p/basic}* 一箱子的骨頭。',
                            ...(roomready()
                                ? [
                                    '<18>{#p/papyrus}嘿，那些就是我\n用來攻擊你的東西。',
                                    '<18>真是段美好的回憶，\n是吧？',
                                    '<18>感覺仿佛\n就在昨日...',
                                    SAVE.data.n.plot < 42.1
                                        ? '<18>{#f/4}實際上就是剛剛才\n發生的事。'
                                        : '<18>{#f/4}實際上就是今天\n早些時候發生的事。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            "<32>{#p/basic}* （你把手伸進箱子，\n  但骨頭不會對你造成任何傷害。）",
                            ...[
                                [],
                                ['<25>{#p/asriel1}{#f/16}* ...或者沒有。'],
                                ["<25>{#p/asriel1}{#f/13}* 我想知道\n  你是不是那種會站在\n  燒紅煤炭上的人。"],
                                ['<25>{#p/asriel1}{#f/8}* 我是說燒紅的骨質煤炭。']
                            ][Math.min(asrielinter.s_pr_papbones++, 3)]
                        ]
                        : ['<32>{#p/basic}* 一箱子的骨頭。']
            ),
            s_pr_papcloset: pager.create(
                0,
                () => [
                    '<32>{#p/human}* （你往衣櫥裡看...）',
                    ...(SAVE.data.b.svr
                        ? ["<32>{#p/human}* （太黑了，你什麼都看不見。）"]
                        : !world.runaway
                            ? ['<32>{#p/basic}* 裡面的衣服被瘋狂地\n  挪來挪去。']
                            : [
                                '<32>{#p/basic}* 衣服整齊地掛在裡面。',
                                SAVE.data.n.plot === 72
                                    ? '<32>* 其中一件衣服上寫著「骸闊天空」。'
                                    : '<32>* 許多衣服上都有手寫文字。'
                            ]),
                    ...(roomready()
                        ? [
                            "<18>{#p/papyrus}別擔心，\n衣櫥裡沒有骷髏。",
                            "<18>{#f/4}當然，\n除非我在換衣服。"
                        ]
                        : [])
                ],
                () => [
                    '<32>{#p/human}* （你往衣櫥裡看...）',
                    ...(SAVE.data.b.svr
                        ? ["<32>{#p/human}* （太黑了，你什麼都看不見。）"]
                        : !world.runaway
                            ? ['<32>{#p/basic}* 裡面的衣服被瘋狂地\n  挪來挪去。']
                            : [
                                '<32>{#p/basic}* 衣服整齊地掛在裡面。',
                                SAVE.data.n.plot === 72
                                    ? '<32>* 其中一件衣服上寫著「骸闊天空」。'
                                    : '<32>* 許多衣服上都有手寫文字。'
                            ])
                ]
            ),
            s_pr_papposter: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                "<25>{#p/asriel1}{#f/17}* 啊。\n* 那是Papyrus的特殊攻擊...",
                                
                                '<25>{#f/15}* 在之前的時間軸，\n  就是這種攻擊... 給我\n  帶來了公平的失敗。',
                                "<25>{#f/16}* ...不要問我為什麼\n  要和Papyrus戰鬥。"
                            ],
                            ["<25>{#p/asriel1}{#f/10}* 你說啥？拜託，那當時\n  並沒有發生什麼不好的事。\n* 反正不是那個時候。"],
                            [
                                '<25>{#p/asriel1}{#f/16}* 好吧，告訴你了。\n* 這是因為我可能把自己\n  偽裝成了一個人類。',
                                '<25>{#f/15}* ...是的。\n* 它看起來\n  和你想的一樣糟糕。',
                                '<25>{#f/5}* 但是，嘿，\n  我是在找機會和\n  最偉大的Papyrus戰鬥！'
                            ],
                            ['<25>{#p/asriel1}{#f/20}* 這非常值得。']
                        ][Math.min(asrielinter.s_pr_papposter++, 3)]
                        : [
                            "<32>{#p/basic}* 一面旗幟，\n  上面畫著一個嚇人的骷髏。",
                            ...(roomready()
                                ? [
                                    "<18>{#p/papyrus}很漂亮的海報吧？",
                                    '<18>UNDYNE在撿垃圾的\n時候發現的。',
                                    '<18>{#f/4}一開始上面是\n一個頭骨和\n兩根交叉的骨頭...',
                                    '<18>{#f/9}但我想到了\n更好的東西！'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            ["<25>{#p/asriel1}{#f/10}* 你說啥？拜託，那當時\n  並沒有發生什麼不好的事。\n* 反正不是那個時候。"],
                            [
                                '<25>{#p/asriel1}{#f/16}* 好吧，告訴你了。\n* 這是因為我可能把自己\n  偽裝成了一個人類。',
                                '<25>{#f/15}* ...是的。\n* 它看起來\n  和你想的一樣糟糕。',
                                '<25>{#f/5}* 但是，嘿，\n  我是在找機會和\n  最偉大的Papyrus戰鬥！'
                            ],
                            ['<25>{#p/asriel1}{#f/20}* 這非常值得。']
                        ][Math.min(asrielinter.s_pr_papposter++, 3)]
                        : ["<32>{#p/basic}* 一面旗幟，\n  上面畫著一個嚇人的骷髏。"]
            ),
            s_pr_paptable: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你對這些玩偶\n  的精雕細琢感到驚訝。）']
                        : [
                            '<32>{#p/basic}* 一套穿著俗氣制服的動作玩偶。',
                            ...(roomready()
                                ? [
                                    '<18>{#p/papyrus}啊，那個，\n動作玩偶。',
                                    '<18>用來參考理論戰鬥\n布置場景很合適。',
                                    '<18>{#f/4}但我為什麼\n會有這麼多呢？',
                                    '<18>{#f/6}那個，嗯...\n國王把它們當做\n禮物送給了我...',
                                    '<18>{#f/5}我真心希望\n我也能回報他\n一份禮物。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （仔細一想，\n  你就知道是誰創造了這些。）']
                        : ['<32>{#p/basic}* 一套穿著俗氣制服的動作玩偶。']
            ),
            s_puzzle1_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上寫著\n  破解謎題的基礎方法。）']
                    : ['<32>{#p/basic}* 「按順序激活每一條電路。」'],
            s_puzzle2_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上點撥出了\n  解這個謎題的思路。）']
                    : ['<32>{#p/basic}* 「從左邊開始。」'],
            s_puzzle3_note: () =>
                SAVE.data.b.svr
                    ? world.postnoot && world.nootflags.has('s_puzzle3') // NO-TRANSLATE

                        ? [
                            "<32>{#p/human}* （紙條上提到了\n  某人吹噓自己提前完成了\n  一個謎題。）",
                            ...[
                                ['<25>{#p/asriel1}{#f/20}* 啊哈哈... 我想知道是誰\n  留下了這張紙條...\n* 誒嘿嘿...'],
                                ["<25>{#p/asriel1}{#f/20}* 哈？\n  當然不可能是我！"],
                                ['<25>{#p/asriel1}{#f/13}* ...']
                            ][Math.min(asrielinter.s_puzzle3_note++, 2)]
                        ]
                        : ['<32>{#p/human}* （紙條上提到\n  謎題不再需要尋找破解方法。）']
                    : world.postnoot && world.nootflags.has('s_puzzle3') // NO-TRANSLATE

                        ? [
                            [
                                "<32>{#p/basic}* 這是一張沒有署名的便條...",
                                '<32>* 「像這樣的謎題真的\n   很煩人對吧。」',
                                '<32>* 「不過嘞，\n   我已經幫你搞定了。」',
                                '<32>* 「這不是很棒嗎？」\n* 「你應該謝謝我！」',
                                '  -「真摯的，」\n  你最好的朋友'
                            ],
                            [
                                "<32>{#p/basic}* 這是一張沒有署名的便條...",
                                '<32>* 「別擔心，」\n* 「不管你重置多少次...」',
                                '<32>* 「我永遠都會幫你\n   解決這些糟透了的謎題。」',
                                '<32>* 「舉手之勞而已\n  不用謝我。」',
                                '<#32>  - 「永遠的，」\n  你最好的朋友'
                            ]
                        ][Math.min(SAVE.flag.n.neutral_twinkly_loop1, 1)]
                        : !world.genocide && world.edgy
                            ? [
                                "<32>{#p/basic}* 一張Sans的字條...",
                                '<32>{#p/without}* 「哎呀。」\n* 「看來我兄弟最終還是找到你了。」',
                                '<32>* 「我把你的所作所為全告訴了他，\n  現在，他願意老實在家待著了。」',
                                '<32>* 「真是太遺憾了，對不對？」',
                                '<32>* 「papyrus不該卷到這堆破事中。」',
                                '<32>* 「但也許，這就是命。」',
                                '<32>* 「對了，解謎愉快喔。」',
                                '<32>* 「我猜，你肯定\n   一眨眼工夫就能解開。」',
                                '<#32>- 「恕我冒昧了，」\n  sans'
                            ]
                            : [
                                "<32>{#p/basic}* 這是張Papyrus留的字條...",
                                '<23>{#p/papyrus}{#f/30}「人類！！這個謎題可跟\n看起來的不一樣。」',
                                '<23>「我在等你的時候，\n試著改造了一下...」',
                                '<23>「當然，是為了讓圖案\n看起來更像我的臉！」',
                                '<23>「不過好像哪裡出了岔子...」',
                                '<23>「所以我現在\n只能做成一個\n很爛的箭頭形狀了！！！」',
                                '<23>「（另外，這個謎題\n需要你自己完成。）」',
                                '<23>「但不用擔心！」\n「你肯定做得到的，人類！」',
                                '<#23>  - 「最相信你的，」\n  PAPYRUS'
                            ],
            s_redbook: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （這本顏色不同的書記載了\n  一個隨著時間流逝\n  而被遺忘了的秘密武器。）']
                    : [
                        "<32>{#p/basic}* 一個書架。",
                        '<32>{#p/human}* （你取下了那本紅皮書...）',
                        '<32>{#p/basic}* 「人怪大戰進入到白熱化階段時，\n   皇家軍隊成立了一個秘密組織。」',
                        '<32>{#p/basic}* 「也就是所謂的『特種武器』研發部，\n   專門用來搞實驗研究。」',
                        '<32>{#p/basic}* 「他們造出了許多『戰鬥利器』，\n   但實戰效果都是微乎其微。」',
                        '<32>{#p/basic}* 「只有一個例外，\n   它就是被稱作『頓悟』的魔法捲軸。」',
                        '<32>{#p/basic}* 「這捲軸的力量超乎尋常，\n   即使用來對付人類也過於危險。」',
                        '<32>{#p/basic}* 「結果，捲軸被從內部鎖死，\n   並很快封存起來。」',
                        '<32>{#p/basic}* 「傳說，有人把它送上了\n   開往前哨站的運輸船。」',
                        '<32>{#p/basic}* 「如果傳說屬實，\n   那麼它現在位於何處？」\n* 「又該如何解開枷鎖？」',
                        '<32>{#p/basic}* 「但願，以上疑問永埋塵土之下，\n   湮沒無聞。」',
                        '<32>{#p/human}* （你把書放回了書架。）'
                    ],
            s_sansbox: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （信箱太滿，\n  你看不到裡面。）"]
                    : SAVE.data.n.plot === 72 && !world.runaway
                        ? [
                            '<32>{#p/basic}* 不知為何，\n  信箱內又被塞了一堆垃圾郵件。',
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...說實話，\n  這讓我感到驚訝。'])
                        ]
                        : [
                            "<32>{#p/basic}* （信箱裡塞滿了未開封的垃圾郵件。）",
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...他為啥\n  從來都不讀這些郵件。'])
                        ],
            s_sheddoor: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你好像沒法進去。）"]
                    : ["<32>{#p/basic}* 門被反鎖了。"],
            s_slew: ["<32>{#p/basic}* 這是狗糧。\n* 碎片看起來像是骨頭。"],
            s_spagnote: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （紙條上提到了\n  用義大利麵來誘惑你的妙處。）']
                    : !world.genocide && world.edgy
                        ? [
                            "<32>{#p/basic}* 一張Sans的字條...",
                            '<32>{#p/without}* 「哎呀，」\n* 「你發現了我兄弟的義大利麵。」',
                            '<32>* 「是不是看起來很香，很好吃？」',
                            '<32>* 「嘿，」\n* 「那就對了。」',
                            '<32>* 「不過，不要因此掉以輕心喔...」',
                            '<32>* 「因為，你花越多時間在\n   嘗試拿走這玩意上...」',
                            '<32>* 「我就有更多時間\n   準備下一個謎題了。」',
                            '<#23>- 「開個玩笑而已，」\n  sans'
                        ]
                        : [
                            "<32>{#p/basic}* 這是張Papyrus留的字條...",
                            '<23>{#p/papyrus}{#f/30}「人類啊！！」\n「享用這盤意面吧。」',
                            '<23>（「但其實你不知道的是，\n這盤意面是個陷阱...」）',
                            '<23>（「單純是為了吸引你的！！！」）',
                            '<23>（「你會忙著去夠它...」）',
                            '<23>（「然後就不會意識到\n自己毫無進展！！」）',
                            '<23>（「再次徹底被\n偉大的PAPYRUS戲弄！！！ 」）',
                            '<#23>  「捏嘿嘿，」\n  PAPYRUS'
                        ],
            s_town_camera1: () =>
                SAVE.data.b.svr
                    ? []
                    : world.runaway
                        ? [
                            "<32>{#p/basic}* 再也沒有人會用\n  藏在水晶莢的攝像頭來監視你了。"
                        ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* 水晶莢內\n  不再會有攝像頭了。"]
                            : ["<32>{#p/basic}* 在這堆水晶莢裡\n  藏著一個攝像頭。"],
            s_trapnote: () =>
                [
                    [
                        "<32>{#p/basic}* 這是張Papyrus留的字條...",
                        '<23>{#p/papyrus}{#f/30}「抱歉，到UNDYNE來之前，\n我得把你鎖在客房裡。」',
                        '<23>「把這裡當自己家\n一樣吧！！！」',
                        '<22>「已提供茶點和住宿。」',
                        '<#23>  「非常捏嘿嘿的，」\n  PAPYRUS'
                    ],
                    [
                        "<32>{#p/basic}* 這是張Papyrus留的字條...",
                        '<23>{#p/papyrus}{#f/30}「下次逃跑前\n記得跟我說一聲！」',
                        '<23>「在你失蹤的時候\n我可擔心死你了！！！」',
                        '<#23>  「對你牽腸掛骨的，」\n  PAPYRUS'
                    ],
                    [
                        "<32>{#p/basic}* 這是張Papyrus留的字條...",
                        '<23>{#p/papyrus}{#f/30}「如果你想找個地方住...」',
                        '<23>「直接告訴我！！！\n你不需要和我打！！！」',
                        '<#23>  「你的房東，」\n  PAPYRUS'
                    ]
                ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 2)],
            s_tree: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                '<25>{#p/asriel1}{#f/20}* $(name)總是喜歡\n  稱這些蟻群\n  屬於一種「文明」。',
                                '<25>{#f/17}* 我想這是為了\n  讓那傢伙被認為很聰明。',
                                '<25>{#f/13}* 我也想被認為很聰明，\n  但父母經常會看穿我。',
                                '<25>{#f/13}* $(name)總是\n  會比我撒謊技術要高。'
                            ],
                            [
                                '<26>{#p/asriel1}{#f/13}* 在$(name)墜落到此處後，\n  那傢伙嘗試讓我們相信\n  眼前的人類是一名外交官。',
                                "<25>{#f/17}* 不過還好，\n  那傢伙並不是一個說謊大師。",
                                "<25>{#f/15}* 想像一下，\n  如果當時我父母相信了，\n  事情會變得多麼糟糕..."
                            ],
                            [
                                "<26>{#p/asriel1}{#f/17}* 我很高興\n  你不會說謊話，Frisk。",
                                "<25>{#f/13}* 我的生活總是充滿謊言。",
                                '<25>{#f/20}* ...抱歉。\n* 我覺得這讓人有點驚訝。'
                            ],
                            ['<26>{#p/asriel1}{#f/15}* 百歲光陰能有幾，\n  一場扯淡沒來由...']
                        ][Math.min(asrielinter.s_tree++, 3)]
                        : world.darker
                            ? ["<32>{#p/basic}* 這個樹狀物沒什麼特別的。"]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}* 很快，\n  這個文明將要再次遷徙。',
                                    '<32>* 他們將去何方？\n* 我想待會我們就知道了。'
                                ]
                                : [
                                    '<32>{#p/basic}* 這個人畜無害的樹狀結構，\n  其實是一個文明的家園。',
                                    '<32>* 在瀕臨滅絕之時，\n  它們遷徙到這裡\n  來拯救自己的種族。'
                                ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            [
                                '<26>{#p/asriel1}{#f/13}* 在$(name)墜落到此處後，\n  那傢伙嘗試讓我們相信\n  眼前的人類是一名外交官。',
                                "<25>{#f/17}* 不過還好，\n  那傢伙並不是一個說謊大師。",
                                "<25>{#f/15}* 想像一下，\n  如果當時我父母相信了，\n  事情會變得多麼糟糕..."
                            ],
                            [
                                "<26>{#p/asriel1}{#f/17}* 我很高興\n  你不會說謊話，Frisk。",
                                "<25>{#f/13}* 我的生活總是充滿謊言。",
                                '<25>{#f/20}* ...抱歉。\n* 我覺得這讓人有點驚訝。'
                            ],
                            ['<26>{#p/asriel1}{#f/15}* 百歲光陰能有幾，\n  一場扯淡沒來由...']
                        ][Math.min(asrielinter.s_tree++, 3)]
                        : world.darker
                            ? ['<32>{#p/basic}* ...']
                            : SAVE.data.n.plot === 72
                                ? ["<32>{#p/basic}* 別擔心。\n* 他們終將找到屬於自己的道路。"]
                                : ["<32>{#p/basic}* 專家建議...\n* 不要搖晃這人畜無害的樹狀結構。"]
            ),
            doginfo: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （裡面的狗糧\n  被吃掉了一些。）']
                    : SAVE.data.n.state_starton_doggo === 2 || SAVE.data.n.plot > 27
                        ? SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 裡面有一袋半空的狗糧。']
                            : ["<32>{#p/basic}* 裡面有一袋半滿的狗糧。"]
                        : [
                            SAVE.data.n.state_starton_doggo === 3
                                ? '<32>{#p/basic}* 狗窩裡是只\n  看起來昏昏欲睡的守衛狗。\n* 它看不見你。'
                                : '<32>{#p/basic}* 狗窩裡是只很困惑的守衛狗。\n* 它看不見你。'
                        ]
        },
        truetext: {
            doggo1: ['<32>{#p/basic}* 還惦記狗糧呢？\n* 咋不去看看眼科醫生呢？'],
            doggo2: ['<32>{#p/basic}* 哈？拋接遊戲？', "<33>{#p/basic}* 這招還蠻管用..."],
            dogs1: [],
            dogs2: ['<33>{#p/basic}* 哇，你可太勤快了，\n  費這麼些勁還不抵\n  一扳手來得快呢。'],
            fetch: () =>
                [
                    ['<32>{#p/basic}* 哈？拋接遊戲？', "<33>{#p/basic}* 這招還蠻管用..."],
                    ["<32>{#p/basic}* 這已經是第二次，\n  第二次用生鏽的扳手那招了。", '<32>{#p/basic}* 沒有什麼新花樣嗎？'],
                    ["<32>{#p/basic}* 哇，你總不能\n  每次都靠這招矇混過關吧！"]
                ][SAVE.data.n.state_starton_latefetch++],
            great1: [
                "<32>{#p/basic}* 喔，小狗狗太可愛了！",
                "<32>{#p/basic}* 事實證明，\n  什麼都比不上一隻小狗的吻。"
            ],
            great2: [
                '<32>{#p/basic}* 你只用一根扳手，\n  拿拋接遊戲當幌子，\n  騙過了整支犬衛隊。',
                '<32>* 這有多瘋狂，\n  還需要我說嗎？'
            ],
            great3: ['<32>{#p/basic}* 什麼鬼？'],
            lesser1: ['<32>{#p/basic}* 關於伸展脖子的\n  神秘詞彙突然就變得有意義了...'],
            lesser2: [
                "<32>{#p/basic}* 這已經是第二次，\n  第二次用生鏽的扳手那招了。",
                '<32>{#p/basic}* 沒有什麼新花樣嗎？'
            ],
            papyrus1: [
                '<32>{#p/basic}* Papyrus的義大利麵可出名了。',
                "<32>* 卻沒幾個人知道\n  他拿的不是怪物菜譜。",
                '<32>* 他那個，呃，「烹飪老師」\n  不小心拿了本人類菜譜給他...',
                '<32>* 除了他自己，\n  估計只有人類\n  才吃得慣他的意面。',
                '<32>* 這也太諷刺了。'
            ],
            papyrus3: ['<32>{#p/basic}* 就是這樣...', "<32>* 馬上，你就要跟\n  鎮子上最酷的骷髏\n  來場「較量」了。"],
            papyrus4: [
                '<32>{#p/basic}* 他這一生\n  可能都在等這一刻...',
                "<32>* 如果我是你，\n  我絕不會浪費這次機會。"
            ],
            papyrus5: ["<32>{#p/basic}* 別擔心。", "<32>* 運氣好的話，你們很快就會\n  成為好朋友了。"],
            puzzle1: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/20}* 不錯嘛，Frisk。\n* 沒想到\n  你還是個數學高手..."]
                    : ['<32>{#p/basic}* 哇。\n* 你竟然真把它解開了？'],
            sans3: ['<32>{#p/basic}* 你盡力了。'],
            sans4: ['<32>{#p/basic}* 你以前做過這個嗎...？'],
            sans5: ['<32>{#p/basic}* 拜託，Sans。\n* 這「謎題」根本不值一看。'],
            sans6: ['<32>{#p/basic}* 拜託，Sans。\n* 這「謎題」根本不是人能做的啊。'],
            sans7: ['<32>{#p/basic}* 不是，搞了半天就這啊。'],
            sans8: ["<32>{#p/basic}* 我和你一樣對此感到困惑。"],
            sans9: ['<32>{#p/basic}* 拜託，讓那些東西動起來吧！\n* 我好想看看啊！', '<32>* 唉... 算了...'],
            papdate: () => [
                '<32>{#p/basic}* 所以... Papyrus，嗯？',
                SAVE.data.n.plot > 64.1
                    ? '<32>* 過了這麼久，\n  你們終於成了朋友。'
                    : '<32>* 我就知道你們倆\n  最終會成為朋友。',
                '<32>* ...\n* 我是看著那個骷髏在這裡\n  長大的...',
                '<32>* 他總是會給他周圍的人\n  樹立一個好榜樣...',
                '<32>* ...包括我也一樣。',
                "<32>* 真可惜，\n  我沒法親自告訴他這些。",
                "<32>* 但沒關係的。",
                '<32>* 看到你們倆相處得這麼好，\n  就足夠彌補遺憾了。'
            ]
        },
        vegetoid: pager.create(
            0,
            () => [
                SAVE.data.n.plot === 72
                    ? '<32>{#p/basic}* 我聽說運輸船司機\n  將在所有怪物離開前哨站後\n  獨自回到這裡。'
                    : world.population === 0
                        ? '<32>{#p/basic}* 我聽說那個運輸船司機\n  會在別的怪物全都逃走後\n  回到這裡。'
                        : "<32>{#p/basic}* 我聽說那個運輸船司機\n  不吃綠色蔬菜。",
                '<33>{#p/basic}* 它真的是個怪物嗎...？'
            ],
            () => [
                SAVE.data.n.plot === 72
                    ? "<32>{#p/basic}* 真正的怪物\n  絕不會想回到這個糟透了的地方。"
                    : world.population === 0
                        ? '<32>{#p/basic}* ...'
                        : '<32>{#p/basic}* 真正的怪物\n  都吃綠色蔬菜的。'
            ]
        ),
        vegetoidx: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你在這洞裡誰都沒找到。）"]
                : world.bulrun
                    ? ['<32>{#p/basic}* ...但是大家都逃走了。']
                    : ['<32>{#p/basic}* ...但是誰也沒有來。'],
        xtowerHiscoreNames: {
            kidd: '超愛UNDYNE10',
            napstablook: 'NAPSTABLOOK22',
            papyrus: '酷炫骷髏95',
            sans: '懶骨。',
            undyne: '壯魚91',
            you: '（遊客）'
        },
        xtowerMessage1: '新紀錄！',
        xtowerMessage2: '祝你下次好運...',
        xtowerMessage3: '感謝遊玩！',
        xtowerSans: () =>
            world.genocide
                ? [
                    '<32>{#p/event}* 鈴鈴，鈴鈴...',
                    "<32>{#p/alphys}* ...合著殺了他，\n  你還沒爽-爽夠是吧？",
                    '<32>* 你就非得在我... 那破-破遊戲上\n  把他從榜一攆下去是吧...',
                    '<32>* 誒嘿嘿...',
                    "<32>* 你可真噁心...",
                    '<32>* ...',
                    '<32>{#s/equip}{#p/human}* （你失去了所有金錢。）',
                    ...(world.goatbro
                        ? SAVE.flag.n.genocide_milestone < 5
                            ? SAVE.flag.n.ga_asrielXtower++ < 1
                                ? ["<25>{#p/asriel2}{#f/10}* 今兒我們膽量可嘉啊。"]
                                : []
                            : SAVE.flag.n.genocide_milestone < 6
                                ? SAVE.flag.n.ga_asrielAlphysCom2++ < 1
                                    ? ["<25>{#p/asriel2}{#f/1}* 這才是\n  我想看到的Alphys。"]
                                    : []
                                : SAVE.flag.n.ga_asrielAlphysCom5++ < 1
                                    ? ["<25>{#p/asriel2}{#f/4}* 可惜這樣救不了她。"]
                                    : []
                        : [])
                ]
                : [
                    '<32>{#p/event}* 鈴鈴，鈴鈴...',
                    '<25>{#p/sans}* 你在這花這麼大的努力\n  就只是為了超過\n  我的分數嗎？',
                    "<25>{#f/3}* 哇塞。\n* 那你可比我兄弟\n  固執多了。",
                    ...(SAVE.data.n.state_starton_papyrus === 1
                        ? [
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 可惜他已經死了，\n  不是嗎？",
                            '{*}{#s.resume}{%}'
                        ]
                        : [
                            SAVE.data.n.plot === 72
                                ? "<25>{#f/0}* 我本想給你一份\n  特殊大禮，但不巧的是\n  我還在找toriel。"
                                : "<25>{#f/0}* 我本想給你一份\n  特殊大禮，但不巧的是\n  我還在休息。",
                            ...(world.edgy_x
                                ? ['<25>{#f/0}* 不要見怪。', '<32>{#s/equip}{#p/event}* 滴...']
                                : [
                                    "<25>{#f/2}* 所以先給你一些零花錢\n  作為獎勵吧。",
                                    '<32>{#s/equip}{#p/human}* （你得到了10000G。）'
                                ])
                        ])
                ],
        xtowerAsriel: [
            '<25>{#p/asriel1}{#f/13}* ...你居然真的打破了最高紀錄？',
            '<25>{#f/17}* 哇喔。\n* 我也許低估了你。',
            '<25>{#f/20}* Frisk，\n  你真的超酷！'
        ],
        xtowerScore: '得分：$(x)'
    },

    b_group_starton: {
        dogs: () => (world.goatbro ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。'] : ['<32>{#p/story}* Dogi發起突襲！']),
        spacetopJerry: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 俗氣的帽子再配上沒譜的夥計。']
                : ['<32>{#p/story}* Astro Serf大搖大擺地晃了過來！\n* Jerry也來了。'],
        stardrakeSpacetop: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 笨蛋青年兩人組。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* Chilldrake和Astro Serf擺著姿勢，\n  扮作大反派。']
                    : ['<32>{#p/story}* Stardrake和Astro Serf擺著姿勢，\n  扮作大反派。'],
        stardrakeSpacetop2a: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 只剩一個了。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* Chilldrake泰然自若。']
                    : ['<32>{#p/story}* Stardrake泰然自若。'],
        stardrakeSpacetop2b: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一個了。'] : ['<32>{#p/story}* Astro Serf泰然自若。'],
        stardrakeSpacetop2c: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一個了。'] : ['<32>{#p/story}* 只剩下「Astro Serf」了。'],
        stardrakeSpacetop2d: () => (world.goatbro ? ['<32>{#p/asriel2}* Jerry。'] : ['<32>{#p/story}* Jerry。']),
        stardrakeSpacetopJerry: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 笨蛋青年兩人組。\n* 再加一個，Jerry。']
                : SAVE.data.b.spared_jerry
                    ? ['<32>{#p/story}* Jerry和朋友們出現了！']
                    : SAVE.data.b.s_state_chilldrake
                        ? ['<32>{#p/story}* Astro Serf和Chilldrake嘆著氣\n  來和你對峙了。\n* Jerry。']
                        : ['<32>{#p/story}* Astro Serf和Stardrake嘆著氣\n  來和你對峙了。\n* Jerry。'],
        stardrakeSpacetopJerry2a: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 還剩下兩個。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* Astro Serf和Chilldrake\n  仍然泰然自若。']
                    : ['<32>{#p/story}* Astro Serf和Stardrake\n  仍然泰然自若。'],
        stardrakeSpacetopJerry2b: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 還剩下兩個。'] : ['<32>{#p/story}* Astro Serf泰然自若。\n* Jerry.'],
        stardrakeSpacetopJerry2c: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 還剩下兩個。']
                : SAVE.data.b.s_state_chilldrake
                    ? SAVE.data.b.spared_jerry
                        ? ['<32>{#p/story}* Chilldrake和Jerry\n  不會為此產生任何情緒！']
                        : ['<32>{#p/story}* Chilldrake泰然自若。\n* Jerry。']
                    : SAVE.data.b.spared_jerry
                        ? ['<32>{#p/story}* Stardrake和Jerry\n  不會為此產生任何情緒！']
                        : ['<32>{#p/story}* Stardrake泰然自若。\n* Jerry。']
    },

    b_opponent_stardrake: {
        act_check: () =>
            world.goatbro
                ? SAVE.data.b.s_state_chilldrake
                    ? [
                        '<32>{#p/asriel2}* Chilldrake，中二叛逆。\n* 胡亂撒氣，荒唐至極。'
                    ]
                    : [
                        '<32>{#p/asriel2}* Stardrake，逗逼。\n* 總喜歡給別人講笑話，\n  殊不知自己就是個最大的笑話。'
                    ]
                : SAVE.data.b.s_state_chilldrake
                    ? ['<33>{#p/story}* CHILLDRAKE - 攻擊12 防禦7\n* 看啥都要對著幹！！\n* 他在找Starry。']
                    : ['<32>{#p/story}* STARDRAKE - 攻擊12 防禦7\n* 這名喜劇演員拼盡力氣\n  想留住一位觀眾。'],
        act_check2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* CHILLDRAKE - 攻擊12 防禦7\n* 看啥都要對著幹！！\n* 他在找逃跑路線。']
                : ["<32>{#p/story}* STARDRAKE - 攻擊12 防禦7\n* 想跟你打趣，\n  但被打得沒趣了。"],
        act_check3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* CHILLDRAKE - 攻擊12 防禦7\n* 看啥都要對著幹！！\n* 尤其是調情！！']
                : ['<32>{#p/story}* STARDRAKE - 攻擊12 防禦7\n* 調情對這個青年喜劇演員來說\n  可不是開玩笑的。'],
        act_check4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* CHILLDRAKE - 攻擊12 防禦7\n* 逐漸變得不再叛逆...']
                : ['<32>{#p/story}* STARDRAKE - 攻擊12 防禦7\n* 這位青年喜劇演員的\n  前途一片光明。'],
        act_flirt: () => ['<32>{#p/human}* （你講了一個浪漫的笑話。）'],
        flirtTalk1: ["<08>{#p/basic}{~}你可真怪。"],
        flirtTalk2: ["<08>{#p/basic}{~}你刻薄\n且奇怪。"],
        genoStatus: () =>
            SAVE.data.b.s_state_chilldrake ? ['<32>{#p/asriel2}* Chilldrake。'] : ['<32>{#p/asriel2}* Stardrake。'],
        heckleStatus: () =>
            world.goatbro
                ? SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/asriel2}* Chilldrake。']
                    : ['<32>{#p/asriel2}* Stardrake。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* Chilldrake驕傲自滿...']
                    : ['<32>{#p/story}* Stardrake驕傲自滿...'],
        heckleTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}不！！\n我就\n這麼幹！']
                : ["<08>{#p/basic}{~}這個也\n不好笑！"],
        heckleTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}骯髒的\n法律\n踐踏者。']
                : ['<08>{#p/basic}{~}你就是\n坨爛肉。'],
        heckleTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}反抗\n不讓\n反抗的！"]
                : ['<08>{#p/basic}{~}（對人類\n罵罵咧咧）'],
        heckleText1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* (你譴責Chilldrake的行為。）']
                : ['<32>{#p/human}* （你對Stardrake喝倒彩。）'],
        heckleText2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你鼓勵Chilldrake\n  去其他地方當反叛者。）']
                : ["<32>{#p/human}* （你說Stardrake\n  沒有一點幽默細胞。）"],
        heckleText3: () =>
            SAVE.data.b.s_state_chilldrake
                ? [
                    '<32>{#p/human}* （你嘲笑Chilldrake\n  在鳥不拉屎的地方抗議。）',
                    '<32>{#p/basic}* Chilldrake將你的嘲諷當做建議，\n  溜達著去鎮上了。'
                ]
                : [
                    '<32>{#p/human}* （你告訴Stardrake，\n  再這樣下去，它就成萬人煩了。）',
                    '<32>{#p/basic}* 他百口莫辯，灰溜溜地逃走了...'
                ],
        hurtStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 離死不遠了。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* Chilldrake的身體要散架了。']
                    : ['<32>{#p/story}* Stardrake的身體要散架了。'],
        idleTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}讓我\n刷牙？\n沒門！']
                : ['<08>{#p/basic}{~}儘量不要\n放「空」\n自我..'],
        idleTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}夜貓子\n不需要\n睡覺！']
                : ['<08>{#p/basic}{~}我的雙關\n「月」來\n「月相」樣了'],
        idleTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}誰還要\n爸媽管啊！？']
                : ['<08>{#p/basic}{~}已經好\n幾「光年」\n沒回家了..'],
        idleTalk4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}嘿呀，\n人生在世，\n總要撒點野！']
                : ['<08>{#p/basic}{~}敲程式碼很快，\n又稱\n快「碼」\n加「編」'],
        idleTalk5: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}沒人能\n教我做事！']
                : ['<08>{#p/basic}{~}想幹一架？\n直說就行嘛，\n幹嘛那麼\n「星」師動眾呢？'],
        idleTalk6: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}權力應該\n消失！']
                : ['<08>{#p/basic}{~}別生氣，\n生出的氣\n說不定會\n汙染空氣~'],
        idleTalk7: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}想剪\n我的爪子？\n門都沒有！']
                : ['<08>{#p/basic}{~}我有40個G，\n為啥還沒被\n超重壓死呢？'],
        jokeStatus: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* Chilldrake對他的反抗\n  失去了信心。']
                : ['<32>{#p/story}* Stardrake對自己的\n  五「星」級笑話感到滿意。'],
        jokeTalk0: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}至少你\n承認了。']
                : ["<08>{#p/basic}{~}這不是為\n了搞笑！"],
        jokeTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}你不知道\n我這樣做\n的原因！"]
                : ["<08>{#p/basic}{~}你笑什麼\n呢？"],
        jokeTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}你...\n真的...']
                : ['<08>{#p/basic}{~}看到沒！？\n笑了！\n老媽是\n對的！'],
        jokeTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}我不\n認為你\n..."]
                : ["<08>{#p/basic}{~}謝謝你，\n你是\n最棒的！"],
        jokeTalk4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}說實話...']
                : ['<08>{#p/basic}{~}你很有\n品味！！'],
        jokeText0: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你認同了Chilldrake。）']
                : ["<32>{#p/human}* （你對Stardrake的言論回以大笑。）"],
        jokeText1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<32>{#p/human}* （但是他還沒講出什麼\n  能被同意的言論。）"]
                : ["<32>{#p/human}* （但是他還沒有講出什麼笑話。）"],
        jokeText2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你認同了Chilldrake。）']
                : ["<32>{#p/human}* （你對Stardrake的笑話\n  回以大笑。）"],
        jokeText3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你再次認同了Chilldrake。）']
                : ["<32>{#p/human}* （你繼續對Stardrake\n  的雙關回以大笑。）"],
        name: () => (SAVE.data.b.s_state_chilldrake ? '* Chilldrake' : '* Stardrake'),
        punTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}只有\nStarry\n可以\n那樣做。']
                : ["<08>{#p/basic}{~}你在\n搞笑嗎？"],
        punTalk2: () =>
            SAVE.data.b.s_state_chilldrake ? ["<08>{#p/basic}{~}你可不是\nStarry。"] : ['<08>{#p/basic}{~}哈..\n哈..'],
        punTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}別再模仿\n我的朋友\n了。']
                : ["<08>{#p/basic}{~}我早就\n聽過了。"],
        punText1: ['<32>{#p/human}* （你講了一個太空雙關笑話。）'],
        randStatus1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* Chilldrake想知道Starry的去向。']
                : ['<32>{#p/story}* Stardrake正在審視人群。'],
        randStatus2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* Chilldrake正在吟唱\n  無政府主義的咒語。']
                : ['<32>{#p/story}* Stardrake正在練習下一個雙關。'],
        randStatus3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* Chilldrake著手著一場\n  怪物暴動。']
                : ['<32>{#p/story}* Stardrake被自己想出的\n  下一個雙關笑話逗笑了。'],
        randStatus4: () => ['<32>{#p/story}* 聞起來像溼枕頭。'],
        randStatus5: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 身體噴霧的味道撲面而來。']
                : ['<32>{#p/story}* Stardrake因自己的名字\n  不是雙關語而鬆了一口氣。'],
        status1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* Chilldrake大搖大擺地晃了過來！']
                : ['<32>{#p/story}* Stardrake撲騰了過來！']
    },
    b_opponent_jerry: {
        act_check: () =>
            SAVE.data.b.spared_jerry
                ? world.goatbro
                    ? [
                        '<33>{#p/asriel2}* Jerry，公認的傻帽。\n* 調情這麼有用？打死我也不信。'
                    ]
                    : [
                        '<32>{#p/story}* JERRY - 攻擊0 防禦30\n* 一個重生的怪物，因友誼的力量而覺醒。'
                    ]
                : world.goatbro
                    ? [
                        '<32>{#p/asriel2}* Jerry，公認的傻帽。\n* 他就是個不折不扣的廢物，一文不值。'
                    ]
                    : ['<32>{#p/story}* JERRY - 攻擊0 防禦30\n* 大家都認識Jerry。\n* 會延長攻擊時間。'],
        act_flirt: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/human}* （你向Jerry調情。）\n* （它感謝你的讚美。）']
                : 5 <= world.flirt
                    ? ['<32>{#p/human}* （你調用你的經驗，\n  發出一場改變人生的調情。）']
                    : [
                        '<32>{#p/human}* （你向Jerry調情。）',
                        '<32>{#p/basic}* Jerry有點喜歡你了...\n  好像過頭了。'
                    ],
        act_ditch: () => ['<32>{#p/human}* （你甩掉了Jerry。）'],
        act_kiss: () => ['<32>{#p/human}* （你親吻了Jerry。）'],
        flirtStatus: ["<32>{#p/story}* Jerry的救贖之旅開始了。"],
        flirtStatusWeird: ['<32>{#p/story}* 這事咋看咋奇葩。'],
        flirtTalk: [
            '<08>{#p/basic}{~}你...\n你...',
            "<08>{#p/basic}{~}就算\n只是\n為了你，\n我將...",
            "<08>{#p/basic}{~}我將\n盡全力\n成為一\n名更好\n的人！"
        ],
        flirtTalkWeird: ['<08>{#p/basic}{~}\x00*舔嘴唇*'],
        genoStatus: ['<32>{#p/asriel2}* Jerry。'],
        hurtStatus: () => (world.goatbro ? ['<32>{#p/asriel2}* 離死不遠了。'] : ['<32>{#p/story}* Jerry受了傷。']),
        idleTalk1: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}我為\n我們在\n這裡感\n到高興。"]
                : ["<08>{#p/basic}{~}你們\n不覺得\n無聊嗎？"],
        idleTalk2: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}我們能\n經常\n這麼做\n嗎？']
                : ['<08>{#p/basic}{~}我們到底\n為什麼在\n幹這事？'],
        idleTalk3: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}嘿，\n夥計們！\n你們都\n很棒！']
                : ['<08>{#p/basic}{~}哎呀呀，\n老兄你們\n真廢啊。'],
        idleTalk4: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}有人想\n得到一個\n擁抱嗎？']
                : ['<08>{#p/basic}{~}噓噓噓！\n別吵，\n讓我思考！'],
        idleTalkSolo1: () =>
            SAVE.data.b.spared_jerry ? ['<08>{#p/basic}{~}我感謝\n我們\n能夠\n相遇！'] : ['<08>{#p/basic}{~}尬死了。'],
        idleTalkSolo2: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}你\n真棒！\n只是\n說一下。"]
                : ['<08>{#p/basic}{~}所以，\n你在做\n什麼？'],
        idleTalkSolo3: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}你就是\n我的\n整個\n銀河系！"]
                : ['<08>{#p/basic}{~}這兒的訊號\n爛透了。'],
        idleTalkSolo4: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}我愛人類！']
                : ['<08>{#p/basic}{~}作為\n人類\n肯定\n很不錯。'],
        name: '* Jerry',
        randStatus1: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* Jerry的生活無憂無慮。']
                : ['<32>{#p/story}* Jerry吃著粉狀的食物，\n  自豪地舔著手。'],
        randStatus2: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* Jerry嚕嚕地笑著。']
                : ['<32>{#p/story}* Jerry打噴嚏時\n  的粘液飛的到處都是。'],
        randStatus3: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* Jerry發出一聲興奮的尖叫。']
                : ['<32>{#p/story}* Jerry打了個哈欠。'],
        randStatus4: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* 聞起來像... Jerry？']
                : ['<32>{#p/story}* 聞起來像... Jerry。'],
        status1: ['<32>{#p/story}* Jerry纏上你了！'],
        kissTalk: ['<08>{#p/basic}{~}哇喔...', '<08>{#p/basic}{~}一個\n來自我\n最好的\n朋友的\n吻！'],
        kissStatus: ['<32>{#p/story}* ...'],
        kissResult: () =>
            battler.alive.length === 2
                ? ["<32>{#p/basic}* 其他怪物表示沒眼看..."]
                : ["<32>{#p/basic}* 其他怪物表示沒眼看..."],
        ditchResult: () =>
            battler.alive.length === 1
                ? ["<32>{#p/basic}* 其他怪物正在慶祝Jerry的消失。"]
                : ["<32>{#p/basic}* 其他怪物正在慶祝Jerry的消失。"]
    },
    b_opponent_mouse: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Whizkarat，流浪貓。\n* 早已活得渾渾噩噩。']
                : ['<33>{#p/story}* WHIZKARAT - 攻擊16 防禦8\n* 這隻以城為家的時髦的貓\n  只想過簡單的生活。'],
        act_check2: [
            "<33>{#p/story}* WHIZKARAT - 攻擊16 防禦8\n* 這隻城裡貓\n  後悔來了不該來的地方。"
        ],
        act_check3: [
            '<33>{#p/story}* WHIZKARAT - 攻擊16 防禦8\n* 這隻改過自新的鄉下老鼠\n  對自己的改變非常滿意。'
        ],
        act_check4: [
            '<33>{#p/story}* WHIZKARAT - 攻擊16 防禦8\n* 這隻改過自新的\n  鄉下老鼠看上你了。'
        ],
        act_direct: ['<32>{#p/human}* （你告訴Whizkarat一個\n  關於老鼠的事實。）'],
        act_direct2: [
            '<32>{#p/human}* （你把你知道的關於老鼠的全部知識\n  告訴了Whizkarat。）',
            '<32>{#p/basic}* 突然間..！'
        ],
        act_direct3: ["<32>{#p/human}* （你嘗試告訴Whizkarat更多，\n  但它已經找到了適合\n  自己的生活方式。）"],
        act_disown: [
            "<32>{#p/human}* （你拔下了Whizkarat\n  臉上的一根鬍鬚。）",
            '<32>{#p/basic}* Whizkarat發出了刺耳的嘶嘶聲！'
        ],
        act_disown2: [
            "<32>{#p/human}* （你又拔下了Whizkarat\n  臉上的一根鬍鬚。）",
            '<32>{#p/basic}* Whizkarat吃痛，匆匆跑開了！'
        ],
        act_disown3: ['<32>{#p/human}* （你想拔掉它的鬍鬚，\n  但Whizkarat假裝它不存在。）'],
        act_flirt: ["<32>{#p/human}* （你說了一句可愛的話，\n  然後抓了抓Whizkarat的脖子。）"],
        disownStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Whizkarat。'] : ['<32>{#p/story}* Whizkarat逐漸變得不再冷靜。'],
        disownTalk1: ['<08>{#p/basic}{~}把你的\n爪子\n拿開..！'],
        flirtTalk: ['<08>{#p/basic}{~}嗚咪不行。'],
        flirtTalk2: ['<08>{#p/basic}{~}\x00*呼嚕聲*'],
        genoStatus: ['<32>{#p/asriel2}* Whizkarat。'],
        hurtStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 離死不遠了。'] : ['<32>{#p/story}* Whizkarat快斷氣了。'],
        idleTalk1: ['<08>{#p/basic}{~}它們\n吃啥？'],
        idleTalk2: ['<08>{#p/basic}{~}它們\n藏哪？'],
        idleTalk3: ['<08>{#p/basic}{~}它們\n如何\n說話？'],
        idleTalk4: ['<08>{#p/basic}{~}它們\n會做夢\n嗎？'],
        initTalk1: ['<08>{#p/basic}{~}唉，\n我還在\n這裡。'],
        initTalk2: ['<08>{#p/basic}{~}喔，\n我迷失\n了方向\n...'],
        initTalk3: ['<08>{#p/basic}{~}事態\n並不\n理想。'],
        initTalk4: ['<08>{#p/basic}{~}你能\n幫我嗎？'],
        name: '* Whizkarat',
        randStatus1: ['<32>{#p/story}* Whizkarat幻想著四肢著地。'],
        randStatus2: ['<32>{#p/story}* Whizkarat正在掃描這個區域。'],
        randStatus3: ['<32>{#p/story}* Whizkarat正試圖裝成\n  自己很小的樣子。'],
        randStatus4: ['<32>{#p/story}* 聞起來像世界奶酪排行榜的\n  前二十名的奶酪。'],
        remindStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Whizkarat。']
                : ['<32>{#p/story}* Whizkarat只需要一點\n  小小的幫助。'],
        remindTalk1: ['<08>{#p/basic}{~}住在\n洞裡，\n是嗎..？'],
        remindTalk2: ['<08>{#p/basic}{~}會像\n玩具\n吱吱叫，\n是嗎..？'],
        remindTalk3: ['<08>{#p/basic}{~}從現在\n開始，\n我應該像\n老鼠一樣\n生活。'],
        safeStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一擊。"] : ['<32>{#p/story}* Whizkarat前程無量。'],
        safeTalk1: ['<08>{#p/basic}{~}真美妙\n...'],
        safeTalk2: ['<08>{#p/basic}{~}太棒了\n...'],
        status1: ['<32>{#p/story}* Whizkarat來了！']
    },
    b_opponent_doggo: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Doggo，一條不順眼的狗。\n* 這個蠢貨怎麼又上崗了？']
                : ['<32>{#p/story}* DOGGO - 攻擊13 防禦7\n* 一點風吹草動便能讓它興奮。\n* 喜好之一：擁抱。'],
        act_check2: ['<32>{#p/story}* DOGGO - 攻擊13 防禦7\n* 他看眼自己都得費老勁...'],
        act_check3: ['<32>{#p/story}* DOGGO - 攻擊13 防禦7\n* 一隻非常興奮的狗，\n  正在享受其所好。'],
        act_check4: ['<32>{#p/story}* DOGGO - 攻擊13 防禦7\n* 在你眼裡，這隻狗在生活中\n  非常地孤獨。'],
        act_flirt: () => ['<32>{#p/human}* （你向Doggo調情。）'],
        act_cuddle: () => ['<32>{#p/human}* （你緊緊地抱住Doggo。）'],
        fetch: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗跑出去撿了回來。）\n* （你們就這樣玩了一會拋接遊戲。）'
        ],
        fetchTalk: pager.create(
            0,
            ['<11>{#p/basic}{~}哈！！\n有趣的扳手\n出現了！'],
            ['<11>{#p/basic}{~}哈！！\n又出現了！']
        ),
        fetchTalkX1: ["<11>{#p/basic}{~}它去哪\n了！？"],
        fetchTalkX2: ["<11>{#p/basic}{~}我的扳手\n在哪裡！？"],
        flirt1: ['<11>{#p/basic}{~}（情不自禁\n地臉紅）'],
        invisStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一擊。"] : ['<32>{#p/story}* Doggo找不到你了。'],
        name: '* Doggo',
        fetchStatus: ['<32>{#p/story}* Doggo喜歡玩拋接遊戲！'],
        fetchpet: ['<32>{#p/human}* （但是Doggo忙於尋找扳手，\n  沒時間讓你摸。）'],
        fetchflirt: ['<32>{#p/human}* （但是Doggo忙於尋找扳手，\n  沒時間聽你說話。）'],
        fetchcuddle: ['<32>{#p/human}* （但是Doggo忙於尋找扳手，\n  沒時間讓你抱。）'],
        normaStatus: () => (world.goatbro ? ['<32>{#p/asriel2}* Doggo。'] : ["<32>{#p/story}* Doggo知道你在這裡。"]),
        pet: () => [
            '<32>{#p/human}* （你摸了摸Doggo。）',
            ...(world.goatbro
                ? [
                    [],
                    ['<32>{#p/asriel2}* ...又摸？'],
                    ["<32>{#p/asriel2}* 摸狗有那麼有趣嗎..."],
                    ['<32>{#p/asriel2}* ...有趣嗎？'],
                    ['<32>{#p/asriel2}* 蠢死了。'],
                    ['<32>{#p/asriel2}* 你非得要這麼摸嗎？'],
                    ['<32>{#p/asriel2}* ...非得摸嗎？'],
                    ['<32>{#p/asriel2}* 我看真是。'],
                    ['<32>{#p/asriel2}* ...'],
                    ['<32>{#p/asriel2}* 事態快要失控了...'],
                    ['<32>{#p/asriel2}* 還摸？\n* 沒完了是吧...'],
                    ['<32>{#p/asriel2}* 哇喔。\n* 後面忘了。'],
                    ['<32>{#p/asriel2}* 你摸得可真是不亦樂乎啊。'],
                    ['<32>{#p/asriel2}* ...']
                ][Math.min(battler.volatile[0].vars.pet - 1, 13)]
                : [])
        ],
        cuddle: pager.create(
            0,
            ['<11>{#p/basic}{~}抱抱！？\n行吧，至少\n我知道它在\n哪裡了！'],
            ['<11>{#p/basic}{~}又抱！？']
        ),
        petStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一擊。"] : ['<32>{#p/story}* Doggo已經被摸過了。'],
        petTalk1: ["<11>{#p/basic}{~}啥！！！\n有人摸我！"],
        petTalk2: ["<11>{#p/basic}{~}那人從哪\n冒出來的！？"],
        petTalk3: ["<11>{#p/basic}{~}咋還\n沒完了呢！！"],
        petTalk4: ['<11>{#p/basic}{~}汪嗚，\n摸得可\n真徹底啊！！'],
        petTalk5: ['<11>{#p/basic}{~}（爽死了）'],
        petTalk6: ['<11>{#p/basic}{~}（活力四射）'],
        petTalk7: ['<11>{#p/basic}{~}居然還在摸！'],
        petTalk8: ['<11>{#p/basic}{~}還在摸！！'],
        petTalk9: ['<11>{#p/basic}{~}還\n在\n摸！！！'],
        petTalk10: ["<11>{#p/basic}{~}夠了。\n玩鬧結束了。"],
        petTalk11: ['<11>{#p/basic}{~}我都說了，\n「結束了」！'],
        petTalk12: ["<11>{#p/basic}{~}我滴媽，\n居然還沒有停！"],
        petTalk13: ["<11>{#p/basic}{~}我的天吶，\n撫摸永不停歇！！"],
        petTalk14: ['<11>{#p/basic}{~}汪嗚——！！！'],
        query1: ['<11>{#p/basic}{~}別想逃！'],
        query2: ["<11>{*}{#p/basic}{~}哈！\n它動了！\n它肯定動了！{^30}{%}"],
        query3: ['<11>{#p/basic}{~}我倒要看看\n這次它還動嗎？'],
        status1: () => (world.goatbro ? ['<32>{#p/asriel2}* Doggo。'] : ['<32>{#p/story}* Doggo擋住了去路！']),
        sussy: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Doggo。'] : ['<32>{#p/basic}* Doggo對你的行動\n  十分戒備。']
    },
    b_opponent_lesserdog: {
        act_check: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* Canis Minor，一條蠢狗。\n* 估計他都不知道自己為啥在這。"]
                : ['<32>{#p/story}* CANIS MINOR - 攻擊12 防禦2\n* 手持一把閃亮的狗狗長劍，\n  劍身由「砹鋅合金」鍛造而成。'],
        act_check2: [
            '<32>{#p/story}* CANIS MINOR - 攻擊12 防禦2\n* 這隻小狗受到了難以癒合的創傷，\n  想要夾起尾巴逃跑。'
        ],
        act_check3: [
            "<32>{#p/story}* CANIS MINOR - 攻擊12 防禦2\n* 這個怪物擁有著\n  全銀河系最長的脖子。"
        ],
        act_check4: ['<32>{#p/story}* CANIS MINOR - 攻擊12 防禦2\n* 為破譯你發出的\n  愛的密碼而付出全力。'],
        act_check5: ['<32>{#p/story}* CANIS MINOR - 攻擊12 防禦2\n* 這隻小狗的旅程才剛剛開始。'],
        act_flirt: ['<32>{#p/human}* （你用摩斯密碼的方式\n  拍撫著Canis Minor，\n  以此傳達你對它的愛意。）'],
        act_handshake: [
            "<32>{#p/human}* （你把手放在Canis Minor的頭上\n  晃啊晃，撫摸著它的毛。）"
        ],
        act_inquire: [
            "<32>{#p/human}* （你撫摸著Canis Minor，\n  並問它好狗狗是誰。\n  它興奮地汪汪叫以示回答。）"
        ],
        act_tickle: [
            "<32>{#p/human}* （你抓撓著Canis Minor的側邊\n  來愛撫它。）\n* （它興奮得近於狂亂。）"
        ],
        fetch: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗伸長脖子把扳手撿了回來。）',
            '<32>{#p/human}* （你們就這樣\n  玩了一會拋接遊戲。）',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 但是為什麼呢？'] : [])
        ],
        fetchStatus: ['<32>{#p/story}* Canis Minor喜歡玩拋接遊戲！'],
        fetchTalk: ['<11>{#p/basic}{~}（劇烈\n喘喘）'],
        hurtStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 離死不遠了。']
                : ['<32>{#p/story}* Canis Minor將它的尾巴\n  夾到兩條腿之間。'],
        name: '* Canis Minor',
        petTalk1: ['<11>{#p/basic}{~}（喘氣 \n喘氣）'],
        petTalk2: ['<11>{#p/basic}{~}（輕微的\n犬叫聲）'],
        petTalk3: ['<11>{#p/basic}{~}（尾巴\n搖搖）'],
        petTalk4: ['<11>{#p/basic}{~}（想著吃的）'],
        petTalk5: ['<11>{#p/basic}{~}（喘氣！\n喘氣！）'],
        petTalk6: ['<11>{#p/basic}{~}（興奮\n叫喊）'],
        petTalk7: ['<11>{#p/basic}{~}（摩託\n發動）'],
        petTalk8: ['<11>{#p/basic}{~}（飛機\n起飛）'],
        petTalk9: ['<11>{#p/basic}{~}（水壺\n鳴笛）'],
        petTalk10: ['<11>{#p/basic}{~}（...）'],
        petTalk11: ['<11>{#p/basic}{~}（來自\n星空的\n汪汪）'],
        petTalk12: ['<11>{#p/basic}{~}（汪汪）'],
        petText1: () => ['<32>{#p/human}* （你只是稍微抬了下手。）', '<32>{#p/basic}* 好興奮喔！'],
        petText2: () => [
            '<32>{#p/human}* （你輕輕地摸了一下狗子。）',
            "<32>{#p/basic}* 它已經興奮過頭了...",
            ...(world.goatbro ? ['<32>{#p/asriel2}* 狗子們還真喜歡被摸啊。'] : [])
        ],
        petText3: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            "<32>{#p/basic}* 它仰起頭，迎向你的手心。",
            ...(world.goatbro ? ["<32>{#p/asriel2}* 夠了，你都摸過它了。\n* 真沒必要繼續摸了。"] : [])
        ],
        petText4: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 真是只好狗狗。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 繼續摸它有必要嗎？'] : [])
        ],
        petText5: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 它的興奮永無止境...',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 沒必要繼續摸了。'] : [])
        ],
        petText6: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 會心一摸！\n* 狗子的興奮度增加了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 天吶，$(name)。'] : [])
        ],
        petText7: () => [
            '<32>{#p/human}* （你得跳起來才摸得到狗子了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 我們不能以摸狗為生。"] : [])
        ],
        petText8: () => [
            '<32>{#p/human}* （你想摸摸Canis Minor，\n  結果，連夠都夠不到。）',
            '<32>{#p/basic}* 不過它還是更加興奮了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 我們真要摸一整天狗嗎...？'] : [])
        ],
        petText9: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 根本沒法停下這場鬧劇。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        petText10: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 不積跬步，無以至千裡。\n  不積小摸，無以得巨狗。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 為啥要在這浪費時間？'] : [])
        ],
        petText11: () => [
            '<32>{#p/human}* （你呼喚著Canis Minor，\n  然而它已經聽不到你說話了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 這下好了。\n* 再也別想夠著它了。"] : [])
        ],
        petText12: () => ['<32>{#p/basic}* ...', ...(world.goatbro ? ['<32>{#p/asriel2}* ？？？'] : [])],
        petText13: () => [
            '<32>{#p/human}* （你又夠得著Canis Minor了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 你跟我開玩笑呢是吧？"] : [])
        ],
        petText14: () => ['<32>{#p/human}* （你摸了摸Canis Minor。）'],
        petText15: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            "<32>{#p/basic}* 你可能有什麼毛病。"
        ],
        petText16: () => [
            '<32>{#p/human}* （你沒摸著Canis Minor，\n  但它很看好你的努力。）',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 給我停下。'] : [])
        ],
        petText17: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 節制擼狗，人人有責。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 請你停下。'] : [])
        ],
        petText18: () => [
            '<32>{#p/human}* （你摸了摸Canis Minor。）',
            '<32>{#p/basic}* 鬧劇還在繼續。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        petText19: () => [
            '<32>{#p/human}* （你夠不著Canis Minor了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 好了，該結束了。\n* 趕緊殺了這個蠢貨。"] : [])
        ],
        petText20: () => [
            '<32>{#p/human}* （開玩笑吧。）',
            '<32>{#p/basic}* ...開玩笑吧。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 開玩笑吧...'] : [])
        ],
        statusX: ["<32>{#p/asriel2}* 不堪一擊。"],
        status0: () => (world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* Canis Minor出現了。']),
        status1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor將自己的頭\n  歪向一側。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor覺得你的武器\n  是狗餅乾。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor有點心不在焉。'],
        status4: () => (world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* 有一股狗糧的氣味。']),
        status5: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* Canis Minor在興奮地汪汪叫。'],
        status6: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* Canis Minor有點興奮過頭了。'],
        status7: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor看樣子\n  根本停不下來。'],
        status8: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* Canis Minor正在下降。'],
        status9: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* Canis Minor正在嘗試著編碼。'],
        status10: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ["<32>{#p/story}* Canis Minor由於看不見你\n  而發出嗚嗚的哀鳴。"],
        status11: () => (world.goatbro ? ['<32>{#p/asriel2}* Canis Minor。'] : ['<32>{#p/story}* 你好啊。']),
        status12: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor對於你的生活選擇\n  表示質疑。'],
        status13: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Minor。']
                : ['<32>{#p/story}* Canis Minor去了沒有任何狗狗\n  到過的地方。']
    },
    b_opponent_dogamy: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy，一條廢狗。\n* 純靠他的瘋狗老婆過活。']
                : ['<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* Dogaressa的老公。\n* 只認識他聞到的東西。'],
        act_check2: ['<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* 老婆死了，成了鰥夫。\n* 沉浸在悲傷中，鼻子也不好使了。'],
        act_check3: ['<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* Dogaressa的老公。\n* 認識的東西比先前更多了。'],
        act_check4: ["<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* Dogaressa的老公。\n* 也想把這份愛分享給老婆...？"],
        act_check5: ["<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* Dogaressa的老公。\n* 你要讓他走... 他大概也不介意？"],
        fetchText: [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗們跑出去撿了回來。）\n* （你們就這樣玩了一會拋接遊戲。）'
        ],
        fetchTextLone: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （但Dogamy沒有理它，\n  任由其滾落到了邊緣。）',
            ...(world.goatbro && SAVE.flag.n.ga_asrielSpannerComment++ < 1 ? ['<32>{#p/asriel2}* 預料到了。'] : [])
        ],
        flirtTalk1: ['<11>{#p/basic}{~}啊！\n但是為啥\n...！？'],
        flirtTalk2: ['<11>{#p/basic}{~}愛無處不在？'],
        flirtTalk3: ["<11>{#p/basic}{~}你剛才..."],
        flirtTalk4: ["<11>{#p/basic}{~}這隻小狗在\n幹什麼？"],
        flirtText: [
            '<32>{#p/human}* （你向Dogamy調情。）',
            "<32>{#p/basic}* 你的... 資訊素，\n  傳到了Dogamy的鼻子上。"
        ],
        flirtTextLone: ['<32>{#p/human}* （你向Dogamy調情。）', "<32>{#p/basic}* Dogamy的表情沒有發生變化。"],
        loneStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 只剩一個了。']
                : ['<32>{#p/story}* Dogaressa一心想要踢\n  人類的尾巴。'],
        loneTalk1: ['<11>{#p/basic}{~}汪嗚！'],
        loneTalk2: ['<11>{#p/basic}{~}嗚——'],
        loneTalk3: ['<11>{#p/basic}{~}嗷嗚...'],
        name: '* Dogamy',
        fetchStatus: ['<32>{#p/story}* 狗夫婦喜歡玩拋接遊戲！'],
        fetchStatusX: ["<32>{#p/story}* 狗狗們的思緒正指數增長！"],
        otherPet: ['<11>{#p/basic}{~}...'],
        petNeedStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* Dogaressa正在尋求關愛。'],
        petStatus: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 不堪一擊。"]
                : ["<32>{#p/story}* 狗狗們的思緒增加了！"],
        petTalk1: ['<11>{#p/basic}{~}手拿開，\n你這個\n該死的\n人類。'],
        petTalk1x: ['<11>{#p/basic}{~}手拿開，\n你這隻\n奇怪的\n小狗。'],
        petTalk2: ['<11>{#p/basic}{~}哇！！！\n來自另一隻\n小狗的撫摸\n！！！'],
        petTalk3: ["<11>{#p/basic}{~}停下！\n別碰她！"],
        petTalk4: ['<11>{#p/basic}{~}那我呢\n......'],
        petTalk5: ['<11>{#p/basic}{~}謝謝你...'],
        petText: ['<32>{#p/human}* （你撫摸了Dogamy。）'],
        petTextLone: ['<32>{#p/human}* （你嘗試撫摸Dogamy，\n  但他畏懼地縮起自己的頭。）'],
        randTalk1: () =>
            world.goatbro
                ? ['<11>{#p/basic}{~}王子已經\n失去了\n理智...']
                : ["<11>{#p/basic}{~}帶走\n我老婆...\n身上的\n跳蚤。"],
        randTalk2: () =>
            world.goatbro ? ['<11>{#p/basic}{~}你走的\n有點太遠了...'] : ["<11>{#p/basic}{~}別碰我的\n熱狗。"],
        randTalk3: () =>
            world.goatbro
                ? ["<11>{#p/basic}{~}我們會\n打倒你！"]
                : ['<11>{#p/basic}{~}克歷614年\n賣萌大賽\n冠軍！！'],
        randTalk4: () =>
            world.goatbro ? ["<11>{#p/basic}{~}這次\n你不會贏的..."] : ["<11>{#p/basic}{~}咱們一起\n踩爛人類的\n尾巴！！"],
        resmellStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* 狗狗們把你當成了\n  一條走丟的小狗。'],
        resmellText1: [
            '<32>{#p/human}* （你讓狗狗們再聞聞你。）',
            '<32>* （你聞起來仍然很古怪。）'
        ],
        resmellText2: [
            '<32>{#p/human}* （你讓狗狗們再聞聞你。）',
            '<32>* （在泥裡打了幾個滾後，\n  你的氣味正常了。）'
        ],
        resmellText3: [
            '<32>{#p/human}* （你讓狗狗們再聞聞你，\n  但他們已經知道你的氣味正常了。）'
        ],
        resmellTextFetch: [
            '<32>{#p/human}* （你讓狗狗們聞聞你，\n  但他們正忙著做別的事。）'
        ],
        resmellTextLone: ["<32>{#p/human}* （你讓Dogamy聞聞你，\n  但他連鼻子都沒抬一下。）"],
        rollStatus: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 你會把衣服弄髒的，\n  $(name)。"]
                : ['<32>{#p/story}* 狗狗們也許想重新聞聞你。'],
        rollText: () => [
            '<32>{#p/human}* （你在泥裡打了幾個滾。）\n* （這泥好像是合成的。）',
            '<32>{#p/basic}* 你的氣味有變化了...',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 你在做什麼。'] : [])
        ],
        rollText2: [
            '<32>{#p/human}* （你在泥裡打了幾個滾。）\n* （這泥好像是合成的。）',
            '<33>{#p/basic}* 你的氣味已經變了。'
        ],
        rollTextLone: () => [
            "<32>{#p/human}* （你在Dogaressa的塵埃裡打了幾個滾。）",
            '<32>{#p/basic}* Dogamy更頹喪了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        smellTalk1: ["<11>{#p/basic}{~}嗯？\n那是\n什麼氣味？"],
        smellTalk2: ['<11>{#p/basic}{~}什麼！\n聞上去\n像是...'],
        smellTalk3: ['<11>{#p/basic}{~}啊！\n多麼可愛的\n氣味...'],
        status1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* 狗狗們不停地揮舞著各自的斧頭\n  以保護彼此。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* 狗狗們正在重新評估\n  你的氣味。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* 狗狗們正為下一場情侶大賽\n  做練習。'],
        status4: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* 狗狗們正互相低聲說著甜言蜜語。'],
        susText: ["<32>{#p/basic}* 狗狗們仍然認為你是個\n  臭烘烘的人類。"],
        fetchTalk: ['<11>{#p/basic}{~}拋接遊戲\n真是\n太有趣啦！'],
        fetchTalkX: ['<11>{#p/basic}{~}和另外一隻\n小狗狗一起\n玩拋接\n遊戲！？']
    },
    b_opponent_dogaressa: {
        act_check: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* Dogaressa，一條瘋狗。\n* 沒了她老公，分分鐘發瘋。"]
                : ['<32>{#p/story}* DOGARESSA - 攻擊14 防禦5\n* 這隻小狗認為她丈夫很可愛。\n  僅限於氣味的那種？'],
        act_check2: ['<32>{#p/story}* DOGARESSA -  攻擊14 防禦5\n* 這隻小狗非常想念她的老公\n  僅限於被殺掉後的那種？'],
        act_check3: ['<32>{#p/story}* DOGARESSA - 攻擊14 防禦5\n* 對這隻小狗來說\n  事態進展得很順利。'],
        act_check4: [
            "<32>{#p/story}* DOGARESSA - 攻擊14 防禦5\n* 這隻小狗發覺可愛的東西\n  不只有她老公。"
        ],
        act_check5: ["<32>{#p/story}* DOGAMY - 攻擊14 防禦5\n* 這隻小狗在為她老公的安危擔憂。"],
        fetchTextLone: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （Dogaressa將其撿了起來，然後摔了個粉碎。）',
            ...(world.goatbro && SAVE.flag.n.ga_asrielSpannerComment++ < 1 ? ['<32>{#p/asriel2}* 預料到了。'] : [])
        ],
        flirtTalk1: ['<11>{#p/basic}{~}（嘿！\n別鬧了！）'],
        flirtTalk2: ['<11>{#p/basic}{~}（變得\n越來越\n奇怪了。）'],
        flirtTalk3: ['<11>{#p/basic}{~}（...\n跟我調情！\n啊！）'],
        flirtTalk4: ['<11>{#p/basic}{~}（我覺得\n它愛我，\n非常愛\n的那種。）'],
        flirtText: [
            '<32>{#p/human}* （你向Dogaressa調情。）',
            "<32>{#p/basic}* 你的... 資訊素，\n  傳到了Dogaressa的鼻子上。"
        ],
        flirtTextLone: [
            '<32>{#p/human}* （你向Dogaressa調情。）',
            "<32>{#p/basic}* Dogaressa的表情沒有發生變化。"
        ],
        loneStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一個了。'] : ['<32>{#p/story}* Dogamy心碎了。'],
        loneTalk1: ['<11>{#p/basic}{~}（有你\n好受的。）'],
        loneTalk2: ["<11>{#p/basic}{~}（看我不\n弄死你。）"],
        name: '* Dogaressa',
        otherPet: ['<11>{#p/basic}{~}（...）'],
        petNeedStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Dogamy和Dogaressa。']
                : ['<32>{#p/story}* Dogamy正在尋求關愛。'],
        petTalk1: ["<11>{#p/basic}{~}（他可不是\n你的老公，\n知道嗎？）"],
        petTalk2: ["<11>{#p/basic}{~}（嘿！\n別忽視\n我啊！）"],
        petTalk3: ['<11>{#p/basic}{~}（當心\n狗狗。）'],
        petTalk4: ['<11>{#p/basic}{~}（狗狗\n撫摸狗狗...\n好神奇！）'],
        petTalk5: ["<11>{#p/basic}{~}（你是\n最棒的！）"],
        petText: ['<32>{#p/human}* （你撫摸了Dogaressa。）'],
        petTextLone: ['<32>{#p/human}* （你試圖撫摸Dogaressa，\n  但她只是對你低吼。）'],
        randTalk1: () => (world.goatbro ? ['<11>{#p/basic}{~}（確實。）'] : ["<12>{#p/basic}{~}（別真的\n那麼做...）"]),
        randTalk2: () => (world.goatbro ? ['<11>{#p/basic}{~}（夠遠了。）'] : ['<11>{#p/basic}{~}（他指的\n是我。）']),
        randTalk3: () =>
            world.goatbro
                ? ['<11>{#p/basic}{~}（必要時\n使用武力。）']
                : ['<11>{#p/basic}{~}（我們當然\n是冠軍。）'],
        randTalk4: () =>
            world.goatbro ? ["<11>{#p/basic}{~}（時間到。）"] : ['<11>{#p/basic}{~}（人類\n有尾巴\n嗎？）'],
        resmellTalkLone: ['<11>{#p/basic}{~}（這就是\n你想要的\n嗎？？）\n（嗯？）'],
        resmellTextLone: [
            '<33>{#p/human}* （你激勵Dogaressa來聞聞你，\n  她用鼻子使勁在你臉上\n  蹭來蹭去。）'
        ],
        rollTextLone: () => [
            "<32>{#p/human}* （你在Dogamy的塵埃裡打了幾個滾。）",
            '<32>{#p/basic}* Dogaressa更瘋狂了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        smellTalk1: ['<11>{#p/basic}{~}（聞起來\n很迷...）'],
        smellTalk2: ['<11>{#p/basic}{~}（你真的\n是只\n小狗嗎！？）'],
        smellTalk3: ['<11>{#p/basic}{~}（奇怪小狗\n的氣味！）'],
        fetchTalk: ['<11>{#p/basic}{~}（我們喜歡玩\n拋接遊戲。）'],
        fetchTalkX: ['<11>{#p/basic}{~}（這隻狗狗\n什麼事\n都能做！）']
    },
    b_opponent_greatdog: {
        act_check: () =>
            world.goatbro
                ? ['<33>{#p/asriel2}* Canis Major，一條傻狗。\n* 這群狗裡面，\n  屬它頭腦簡單，四肢發達。']
                : ["<32>{#p/story}* CANIS MAJOR - 攻擊15 防禦8\n* 太過興奮，以至於將\n  戰鬥當作兒戲。"],
        act_check2: ['<32>{#p/story}* CANIS MAJOR - 攻擊15 防禦8\n* 渴望著關愛與照顧...'],
        act_check3: ['<32>{#p/story}* CANIS MAJOR - 攻擊15 防禦8\n* 已經累到虛脫了。'],
        act_flirt: [
            '<32>{#p/human}* （你向Canis Major調情。）',
            '<32>{#p/basic}* Canis Major尷尬地歪著頭。'
        ],
        beckonText: [
            '<32>{#p/human}* （你叫了叫Canis Major。）',
            '<32>{#p/basic}* 它躍向你，甩了你滿臉口水。'
        ],
        closeStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Major。'] : ['<32>{#p/story}* Canis Major渴望著關愛。'],
        closeText: ["<32>{#p/human}* （你叫了叫Canis Major。）\n* （但狗狗只是豎了豎耳朵。）"],
        doneText: ['<32>{#p/basic}* Canis Major覺得你太無趣了。'],
        fetch: () =>
            world.goatbro
                ? [
                    '<32>{#p/human}* （你把扳手扔了出去。）\n* （Canis Major把它吸收進自己的身體，\n  然後若無其事地繼續玩耍。）',
                    '<32>{#p/asriel2}* 呃... 這河裡嗎。'
                ]
                : [
                    '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗跑出去撿了回來。）\n* （你們就這樣玩了一會拋接遊戲。）'
                ],
        hurtStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 離死不遠了。'] : ['<32>{#p/story}* Canis Major正緩緩地喘著氣。'],
        ignoreStatus1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Major。']
                : ['<32>{#p/story}* Canis Major只是想要一些關愛。'],
        ignoreStatus2: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Major。'] : ['<32>{#p/story}* Canis Major正在賣萌。'],
        name: '* Canis Major',
        fetchStatus: ['<32>{#p/story}* Canis Major喜歡玩拋接遊戲！'],
        petStatus1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Major。']
                : ['<32>{#p/story}* Canis Major正用前爪拍打著地面。'],
        petStatus2: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Major。'] : ['<32>{#p/story}* Canis Major想要溫柔的關愛。'],
        petStatus3: () =>
            world.goatbro ? ['<32>{#p/asriel2}* ...'] : ['<32>{#p/story}* 撫摸能量，百分之四十！'],
        petStatus4: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一擊。"] : ['<32>{#p/story}* Canis Major非常滿足。'],
        petText0: ['<32>{#p/human}* （但是Canis Major離你太遠了，\n  你摸不著它。）'],
        petText1: [
            '<32>{#p/human}* （Canis Major享受著你的撫摸，\n  它把整個身子都蜷縮在你的腿上。）',
            '<32>* （它太舒服了，呼呼睡著了。）',
            '<32>* （狗子打呼著，打呼著...）',
            '<32>* （...然後它醒了。）',
            "<32>{#p/basic}* Canis Major的興奮度\n  毫無徵兆地增加了！"
        ],
        petText2: [
            '<32>{#p/human}* （你想摸摸狗子...）',
            '<32>* （...然而它的興奮能量\n  形成了一個反撫摸能量場。）'
        ],
        petText3: [
            '<32>{#p/human}* （你摸了摸狗狗。）\n* （他將自身全部重量都壓到了\n  你身上。）',
            "<32>* （你的移動速度變慢了，但仍沒有\n  給予狗狗足夠的撫摸。）"
        ],
        petText4: [
            '<32>{#p/human}* （你又是一摸。）\n* （這一摸不得了，直接把\n  撫摸能量幹到了百分之百！）',
            '<32>{#p/basic}* Canis Major四肢朝天躺在地上。'
        ],
        petText5: [
            '<32>{#p/human}* （你揉了揉狗狗的肚皮。）',
            '<32>{#p/basic}* Canis Major幸福地嗚叫著。'
        ],
        playText1: ['<32>{#p/human}* （但Canis Major不夠興奮，\n  不能和你一起玩。）'],
        playText2: [
            '<32>{#p/human}* （你放出了一個全息影像，\n  讓狗狗去追。）',
            '<32>* （最終，全息影像無法聚合，\n  自動消散了。）',
            '<32>* （Canis Major收集了這個區域\n  殘存的所有能量，並將其\n  帶還給你。）',
            '<32>{#p/basic}* 疲憊的Canis Major把頭\n  靠在了你身邊...'
        ],
        playText3: ['<32>{#p/basic}* Canis Major精疲力盡，\n  不想再玩了。'],
        playText4: ['<32>{#p/human}* （但是Canis Major已經開始在玩\n  拋接遊戲了。）'],
        status0: () => (world.goatbro ? ['<32>{#p/asriel2}* Canis Major。'] : ['<32>{#p/story}* Canis Major出現了。']),
        status1: () =>
            world.goatbro ? ['<32>{#p/asriel2}* Canis Major。'] : ['<32>{#p/story}* Canis Major正緊緊地注視著你。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Major。']
                : ['<32>{#p/story}* Canis Major正等待你的指令。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* Canis Major。']
                : ['<32>{#p/story}* 有股鮮榨小狗汁的味道。'],
        waitText: ['<32>{#p/basic}* Canis Major逐漸向你靠近。']
    },
    b_opponent_papyrus: {
        act_flirt: ['<32>{#p/human}* （你向Papyrus調情。）'],
        act_insult: ['<32>{#p/human}* （你罵了Papyrus一頓。）'],
        spanner: ['<32>{#p/human}* （你丟出舊版手。）\n* （Papyrus將它叼在嘴裡，\n  然後還給了你。）'],
        spannerTalk1: ['<15>{#p/papyrus}{#f/20}多麼\n瞠目結舌的舉動！'],
        spannerTalk2: [],
        spannerTalk3: ['<15>{#p/papyrus}{#f/20}我可以做一整天！\n就像電視裡的那樣！'],
        spannerTalk4: ['<15>{#p/papyrus}{#f/20}捏嘿嘿！'],
        sparableSpannerTalk1: ['<15>{#p/papyrus}{#f/20}現在，\n展示你的仁慈吧！'],
        sparableSpannerTalk2: ['<15>{#p/papyrus}{#f/20}...'],
        bullySpareTalk: [
            '<15>{#p/papyrus}{#f/27}怎麼...\n天暗下來了？',
            "<15>{#f/27}看來抓你\n不是啥好主意...",
            "<15>{#f/15}沒錯！！\n我敢說，你正渴求著\n我的仁慈！",
            '<15>{#f/20}我，偉大的PAPYRUS，\n樂意為您效勞！',
            '<15>{#f/20}人類，\n我會{@fill=#f00}饒恕{@fill=#000}你！！！',
            "<15>{#f/27}...是時候... 接受...\n我的{@fill=#f00}仁慈{@fill=#000}了..."
        ],
        act_check: () =>
            world.genocide
                ? ['<32>{#p/story}* PAPYRUS - 攻擊3 防禦3\n* 亡兄之弟。']
                : papreal()
                    ? ['<32>{#p/story}* PAPYRUS - 攻擊3 防禦3\n* 依然相信著你。']
                    : ['<32>{#p/story}* PAPYRUS - 攻擊20 防禦20\n* 喜歡說「捏嘿嘿！」'],
        act_check2: ['<32>{#p/story}* PAPYRUS - 攻擊20 防禦20\n* 一切都很順利。'],
        act_check3: ['<32>{#p/story}* PAPYRUS - 攻擊20 防禦20\n* 最最最仁慈的衛兵！'],
        capture1: [
            "<15>{#p/papyrus}{#f/20}看來你得進\n關押區了！！",
            '<15>{#f/24}...也叫車庫。',
            '<15>{#f/20}咳咳，\n一個加固的車庫！',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture2: [
            '<15>{#p/papyrus}{#f/24}好吧！！！你之\n前可能很機智地\n逃脫過關押區...',
            "<15>{#f/20}但這次，\n我升級了設施。",
            '<15>{#f/20}你不僅會\n被困住...',
            "<15>{#f/15}而且你永遠\n也不願離開！！！",
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture3: [
            '<15>{#p/papyrus}{#f/20}你也許...\n充滿決心！',
            "<15>然而這對我並\n沒有什麼卵用！！",
            '<15>我是最有決心的！',
            '<99>{#f/24}如果你認為\n你比最有決心\n還有決心的話...',
            '<15>{#f/20}那簡直是大錯\n特錯！語法上\n就是錯的！',
            '<15>{#f/24}因為正確的說法\n應該是...',
            '<15>{#f/20}你不如PAPYRUS，\n最最有決心的人\n那麼最有決心！',
            '<15>{#f/10}我希望\n你喜歡這堂課。',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture4: [
            '<15>{#p/papyrus}{#f/24}你確定\n你能堅持下去嗎？',
            '<15>{#f/21}再次被抓住一定\n讓你感到沮喪！！！',
            "<15>{#f/21}我不想讓你\n因為一再失敗\n而感到生氣...",
            '<15>{#f/20}也許下次我們可以\n跳過這場戰鬥！',
            "<15>{#f/20}現在，你還是要\n回到關押區！！！",
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture5: [
            '<15>{#p/papyrus}{#f/27}我嘞個...\n還來？？？',
            '<15>{#f/15}好吧，如果你堅持的話...！',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        checkTalk: ['<15>{#p/papyrus}{#f/20}捏嘿嘿！'],
        death1: () =>
            world.genocide
                ? ['<15>{#p/papyrus}{#f/27}不...\n不-不...']
                : ["<15>{#p/papyrus}{#f/21}呃，我沒想到\n會這樣..."],
        death2: () =>
            world.genocide
                ? ['<15>{#p/papyrus}{#f/21}SANS，我...', '<15>{#f/33}{@random=1.1/1.1}我讓你失望了...']
                : papreal()
                    ? [
                        '<15>{#p/papyrus}{#f/27}...儘-儘管如此，\n我仍然相信你！',
                        '<15>{#p/papyrus}{#f/21}只要你努力，\n肯定能變得更好...',
                        '<15>{#p/papyrus}{#f/27}我-我保證...！'
                    ]
                    : ['<15>{#p/papyrus}{#f/27}...幸-幸好，\n我的頭還在！'],
        dots: ['<32>{#p/basic}* ...'],
        flirt0: ['<32>{#p/basic}* 可愛。'],
        flirt1: [
            '<15>{#p/papyrus}{#f/20}什麼！？對我\n調-調-調情！？',
            '<15>你終於表露出\n你的{@fill=#f00}真實感受{@fill=#000}了！',
            "<15>但-但是！\n我可是個\n眼光很高的\n骷髏！！！",
            '<15>你又能做什麼\n來回報我的\n愛意呢？？？'
        ],
        flirt2: [choicer.create('* （你要怎麼回答？）', '\n我會做\n義大利麵', '\n\n我啥也不會')],
        flirt3a: ['<15>{#p/papyrus}{#f/24}這種\n自信的品格...\n讓我想到了...'],
        flirt3b: ['<15>{#p/papyrus}{#f/24}這種\n謙遜的品格...\n讓我想到了...'],
        flirt4: [
            '<15>{#f/22}我自己！！！',
            "<15>{#f/10}你完美地\n貼合了我的\n所有標準！！！",
            '<15>{#f/27}我想這意味著...\n我必須和你來場\n約會了？'
        ],
        flirt5: ["<15>{#p/papyrus}{#f/20}約會的事\n還是等到我抓住\n你之後再談吧！"],
        flirt6: ["<32>{#p/human}* （沒有效果...）\n* （似乎行動不會讓這戰鬥\n  進一步升級。）"],
        flirt7: ['<32>{#p/human}* （但Papyrus現在忙於戰鬥，\n  沒時間聽你說話。）'],
        flirtStatus1: ['<32>{#p/story}* Papyrus正在為約會考慮\n  要穿什麼。'],
        flirtStatus2: ['<32>{#p/story}* Papyrus往他耳後拍了些\n  骨龍水。'],
        flirtStatus3: ['<32>{#p/story}* Papyrus正在為約會考慮\n  要煮什麼。'],
        flirtStatus4: ['<32>{#p/story}* Papyrus往他耳後拍了些\n  番茄醬。'],
        flirtStatus5: ['<32>{#p/story}* Papyrus正在想{@fill=#ff0}方色{@fill=#fff}法\n  變得出名。'],
        flirtStatus6: ['<32>{#p/story}* Papyrus往他耳後拍了些\n  MTT牌面霜。'],
        flirtStatus7: ['<32>{#p/story}* Papyrus往他耳後拍了些\n  MTT動漫定妝粉。'],
        flirtStatus8: ['<32>{#p/story}* Papyrus往他耳後抹了點\n  MTT牌可愛汁。'],
        flirtStatus9: ["<32>{#p/story}* Papyrus意識到他沒有耳朵。"],
        flirtStatus10: ['<32>{#p/story}* Papyrus頭上隨便貼了一些藥膏。'],
        flirtStatus11: ["<32>{#p/story}* ...他還在想{@fill=#ff0}方色{@fill=#fff}法\n  變得出名。"],
        hurtStatus: ['<32>{#p/story}* Papyrus要被打敗了。'],
        insult1: ['<15>{#p/papyrus}{#f/20}多麼無私！', '<15>{#f/21}你想讓我\n對這場戰鬥\n減輕心理負擔...'],
        insult2: ["<15>{#p/papyrus}{#f/15}但你沒必要\n對自己撒謊！！！"],
        insult3: ["<32>{#p/human}* （沒有效果...）\n* （似乎行動不會讓這戰鬥\n  進一步升級。）"],
        insult4: ['<32>{#p/human}* （但Papyrus現在忙於戰鬥，\n  沒時間聽你說話。）'],
        name: '* Papyrus',
        randomStatus1: ['<32>{#p/story}* Papyrus正在準備一記\n  骨頭攻擊。'],
        randomStatus2: ['<32>{#p/story}* Papyrus準備了一記非骨頭攻擊，\n  然後花了一分鐘的時間來糾正錯誤。'],
        randomStatus3: ['<32>{#p/story}* Papyrus正在做飯。'],
        randomStatus4: ['<32>{#p/story}* Papyrus悄悄說了一句「捏嘿嘿！」'],
        randomStatus5: ['<32>{#p/story}* Papyrus正在左右搖晃他的骨頭。'],
        randomStatus6: ['<32>{#p/story}* Papyrus正在努力扮酷。'],
        randomStatus7: ['<32>{#p/story}* Papyrus正在考慮他的選擇。'],
        randomStatus8: ['<32>{#p/story}* 骨頭的氣味。'],
        randomStatus9: ['<32>{#p/story}* Papyrus想起了\n  Sans講過的一段笑話，\n  忍不住笑了幾下。'],
        spaghetti1: () => [
            '<15>{#p/papyrus}{#f/12}我的義大利麵！',
            "<15>{#p/papyrus}{#f/13}看起來你似乎\n很喜歡吃...",
            papreal()
                ? "<15>{#p/papyrus}{#f/27}我很高興\n能讓你感到快樂！"
                : [
                    '<15>{#p/papyrus}{#f/27}而且我很期待我\n們可以共進晚餐！',
                    '<15>{#p/papyrus}{#f/27}而且我很期待為\n你製作更多美味！'
                ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2]
        ],
        spaghetti2: ["<32>{#p/basic}* 要不是Papyrus現在忙於戰鬥，\n  他大概就注意到了。"],
        specialStatus0: ["<32>{#p/story}* Papyrus的氣場越來越強。"],
        specialStatus1: ['<32>{#p/story}* 特殊攻擊。'],
        specialStatus2: ['<32>{#p/story}* Papyrus正全力以赴。'],
        specialStatus3: ['<32>{#p/story}* Papyrus將所有邏輯都拋之腦後。'],
        specialStatus4: ['<32>{#p/story}* Papyrus發覺自己有些缺乏邏輯，\n  又把它撈回來了。'],
        specialStatus5: ['<32>{#p/story}* Papyrus汗流浹背。'],
        specialStatus6: ["<32>{#p/story}* Papyrus已經束手無策了。"],
        status1: ['<32>{#p/story}* Papyrus正在饒恕你。'],
        status2: ['<32>{#p/story}* Papyrus擋住了去路！'],
        turnTalk0a: ["<15>{#p/papyrus}{#f/24}看來，\n你要來真的..."],
        turnTalk0b: ["<15>{#p/papyrus}{#f/24}看來，\n你不想戰鬥..."],
        turnTalk0c: ["<15>{#p/papyrus}{#f/20}那就讓我看看\n你會如何應對\n我傳說中的\n「藍色攻擊」！"],
        turnTalk0x: [
            "<15>{#p/papyrus}{#f/10}你現在是\n藍色的了。",
            "<15>{#f/10}那就是\n我的攻擊！",
            '<15>{#f/20}捏嘿嘿嘿嘿嘿\n嘿嘿嘿！！！'
        ],
        turnTalk1a: ['<15>{#p/papyrus}{#f/20}看好了！'],
        turnTalk1b: ['<15>{#p/papyrus}{#f/20}嗯...\n我在想我應該\n穿什麼...'],
        turnTalk2a: ['<15>{#p/papyrus}{#f/20}你能跳多高呢？'],
        turnTalk2b: ["<15>{#p/papyrus}{#f/22}什麼！？\n我才沒有想著\n約會的事情呢！"],
        turnTalk3: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/21}...是不是只有我覺得\n空氣有點不對勁？']
                : ["<15>{#p/papyrus}{#f/20}對！\n別逼我用出我的\n{@fill=#f00}特殊攻擊{@fill=#000}！"],
        turnTalk4: () =>
            world.postnoot
                ? ["<15>{#p/papyrus}{#f/20}算了。\n應該沒什麼。"]
                : ['<15>{#p/papyrus}{#f/20}我都能嗅到\n我未來的\n人氣了！！！'],
        turnTalk5: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/20}我還從\n我的未來裡\n看到了番茄醬！']
                : ['<15>{#p/papyrus}{#f/20}PAPYRUS:\n舉世無雙意面王！'],
        turnTalk6: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/20}以及在特戰隊\n的一席之地！']
                : ['<15>{#p/papyrus}{#f/20}PAPYRUS:\n特戰隊成員！'],
        turnTalk7: ['<15>{#p/papyrus}{#f/10}UNDYNE一定會\n為我感到驕傲！！'],
        turnTalk8: ['<15>{#p/papyrus}{#f/20}國王會在首塔\n為我建造一座\n雕像！！！'],
        turnTalk9: ["<15>{#p/papyrus}{#f/10}...我也會\n讓我兄弟\n擁有一座的。"],
        turnTalk10: ["<15>{#p/papyrus}{#f/27}我們將會收穫\n眾多崇拜者！！\n但是..."],
        turnTalk11a: ['<15>{#p/papyrus}{#f/20}我又如何知道\n人們是否真心\n喜歡我呢？？？'],
        turnTalk11b: ['<15>{#p/papyrus}{#f/20}會有人像你一樣\n喜歡我嗎？'],
        turnTalk12: ['<15>{#p/papyrus}{#f/21}像你這樣的人\n真是很少見...'],
        turnTalk13a: ["<15>{#p/papyrus}{#f/21}我不覺得他們\n會輕易放你走..."],
        turnTalk13b: ['<15>{#p/papyrus}{#f/21}再想約會\n估計會很難...'],
        turnTalk14: ["<15>{#p/papyrus}{#f/26}如果你被抓到，\n然後送走的話。"],
        turnTalk15: ['<15>{#p/papyrus}{#f/17}呃...\n管他呢！\n放棄吧！！'],
        turnTalk16: ['<15>{#p/papyrus}{#f/15}要麼放棄，要麼...\n就準備面對我的\n{@fill=#f00}特殊攻擊{@fill=#000}！'],
        turnTalk17: ['<15>{#p/papyrus}{#f/20}沒錯！！！\n待會我就要使用\n我的{@fill=#f00}特殊攻擊{@fill=#000}了！'],
        turnTalk18: [
            '<15>{#p/papyrus}{#f/20}在我使用\n{@fill=#f00}特殊攻擊{@fill=#000}前...\n這是你的最後機會！'
        ],
        turnTalk19: ['<15>{#p/papyrus}{#f/20}看好了...！\n我的{@fill=#f00}特殊攻擊{@fill=#000}！'],
        turnTalk19x: [
            '<15>{#p/papyrus}{#f/15}捏嘿嘿！',
            '<15>{#f/20}在這之前可沒有人類\n能躲過我的\n{@fill=#f00}特殊攻擊{@fill=#000}！',
            '<15>{#f/20}做好被抓住的準備吧！\n一勞永逸的那種！'
        ],
        turnTalk20: ['<15>{#p/papyrus}{#f/20}特殊攻擊，\n阿爾法編陣！'],
        turnTalk21: ['<15>{#p/papyrus}{#f/20}特殊攻擊，\n貝塔編陣！'],
        turnTalk22: ['<15>{#p/papyrus}{#f/20}特殊攻擊，\n伽馬編陣！'],
        turnTalk23: ['<15>{#p/papyrus}{#f/20}特殊攻擊，\n德爾塔編陣！'],
        turnTalk24: [
            '<15>{#p/papyrus}{#f/27}哇塞！\n你也太強了吧！',
            '<15>{#f/20}但我可不怕！\n我不會被你的\n實力嚇倒！',
            '<15>{#f/14}...特殊攻擊...',
            '<15>{#f/17}{@fill=#f00}西格瑪{@fill=#000}編陣！！！'
        ],
        turnTalk24x: [
            "<15>{#p/papyrus}{#f/27}行吧...！（喘氣）\n很明顯... 你不能！\n（喘氣）打敗我！",
            '<15>{#f/15}沒錯！！！\n我看見你被嚇得\n全身發抖了！！',
            '<15>{#f/20}我，偉大的PAPYRUS，\n選擇給予你憐憫！！',
            '<15>{#f/20}我會{@fill=#f00}饒恕你{@fill=#000}，\n人類！！！',
            "<15>{#f/10}現在是你接受\n我{@fill=#f00}仁慈{@fill=#000}的機會了。"
        ],
        idleTalk: ['<15>{#p/papyrus}{#f/20}...'],
        idleTalkBullied: ['<18>{#p/papyrus}{#f/27}...'],
        secretFlirt1: ['<15>{#p/papyrus}{#f/27}你盼著能伴我左右...\n直到永遠？', '<15>{#p/papyrus}{#f/21}呃...'],
        secretFlirt2: [
            '<15>{#p/papyrus}{#f/27}有人想拆散我們？',
            '<15>{#p/papyrus}{#f/21}是誰呢...'
        ],
        secretFlirt2x: [
            "<15>{#p/papyrus}{#f/27}所以你【不願】\n與我在一起？",
            "<15>{#p/papyrus}{#f/14}但為何... 你不\n接受我的仁慈\n然後離我遠去？"
        ],
        secretFlirt3: [
            "<15>{#p/papyrus}{#f/25}呃，我們還沒到\n【那麼】濃情\n蜜意的地步吧...",
            '<15>{#p/papyrus}{#f/15}...但事後\n我們可以繼續！'
        ],
        secretFlirt3x: ["<15>{#p/papyrus}{#f/27}等等，\n【你】不想和我\n在一起？"],
        secretFlirt4: ['<15>{#p/papyrus}{#f/24}等等，你是想說...\n三角戀？？？'],
        secretFlirt4x: [
            "<15>{#p/papyrus}{#f/26}...所以你\n【不想】待會\n再試試？",
            '<15>{#p/papyrus}{#f/24}不僅如此，\n而且...',
            '<15>{#p/papyrus}{#f/22}你一開始就不想\n我們在一起？'
        ],
        secretFlirt5: ["<15>{#p/papyrus}{#f/22}或者你想說...\n如梯形般\n穩定的愛？"],
        secretFlirt5x: [
            "<15>{#p/papyrus}{#f/21}不是？那麼就是\n說這段愛缺少了\n兩條邊？",
            "<15>{#p/papyrus}{#f/18}但是...\n這根本不算一個\n正確的形狀！",
            "<15>{#p/papyrus}{#f/27}你是想說，\n我們的愛情永遠\n不會開花！？"
        ],
        secretFlirt6: [
            '<15>{#p/papyrus}{#f/14}等等... 我明白了！',
            '<15>{#p/papyrus}{#f/15}王子嫉妒我們\n之間的愛情！',
            '<15>{#p/papyrus}{#f/24}所以...\n他設下圈套，\n阻止我們在一起！'
        ],
        secretFlirt6x: [
            "<15>{#p/papyrus}{#f/27}不是？\n但是至少我的\n方向是正確的吧？",
            '<15>{#p/papyrus}{#f/24}等等...\n梯形的形狀...',
            "<15>{#p/papyrus}{#f/22}你是說\n我們此時\n深處牢籠？",
            "<15>{#p/papyrus}{#f/14}但是... 為何你\n不饒恕我然後\n逃離呢？",
            '<15>{#p/papyrus}{#f/21}...所以一定\n還有其他原因。',
            '<15>{#p/papyrus}{#f/26}不...\n我知道了！',
            
            '<15>{#p/papyrus}{#f/20}沒錯！\n我終於理解\n你的意思了！',
            '<15>{#p/papyrus}{#f/15}一定是那個\n「ASRIEL」\n對你做了什麼！',
            "<15>{#p/papyrus}{#f/14}他一定是通過\n某些手段阻止了\n你饒恕我的行為！"
        ],
        secretFlirt7: [
            '<15>{#p/papyrus}{#f/14}所以...\n我不會讓他\n的陰謀得逞！',
            '<15>{#p/papyrus}{#f/20}事實上，\n我已經有了一個\n完美的解決方案！',
            "<15>{#p/papyrus}{#f/10}為了避免發生如\n愛情劇裡面的\n場景，\n我會紳士地離去。",
            "<15>{#p/papyrus}{#f/24}然後，\n當你單獨\n和他在一起時...",
            "<15>{#p/papyrus}{#f/25}你將在這段戀情\n中處於一個\n完美的位置...",
            '<15>{#p/papyrus}{#f/15}這將讓他不會\n傷害你的感情！',
            '<15>{#p/papyrus}{#f/20}捏嘿嘿嘿嘿嘿\n嘿嘿嘿嘿！！！'
        ],
        secretFlirt8: [
            '<15>{#p/papyrus}{#f/20}別擔心，\n人類！',
            '<15>{#p/papyrus}{#f/14}我，PAPYRUS，\n將確保我們不會\n受到任何傷害！',
            '<15>{#p/papyrus}{#f/20}為了你，\n我將饒恕我自己！',
            '<15>{#p/papyrus}{#f/20}然後我會找\n一個安全的地方\n躲起來。',
            "<15>{#p/papyrus}{#f/15}別擔心，人類！\n一切盡在\nPAPYRUS的掌控之中！"
        ],
        secretInsult1: ['<15>{#p/papyrus}{#f/27}呃... 大可不必？？？'],
        secretInsult2: ['<15>{#p/papyrus}{#f/21}蠢貨...\n我好像在哪聽過...'],
        secretInsult2x: [
            '<15>{#p/papyrus}{#f/22}或者沒有...？',
            '<15>{#p/papyrus}{#f/24}所以，\n讓我把事情\n搞清楚。',
            '<15>{#p/papyrus}{#f/27}你想說...\n你愛我？',
            '<15>{#p/papyrus}{#f/27}有什麼東西想要\n破壞我們\n之間的愛情？'
        ],
        secretInsult3: ['<15>{#p/papyrus}{#f/29}搞什麼...'],
        secretInsult3x: [
            "<15>{#p/papyrus}{#f/27}你罵我是個蠢貨，\n是因為我沒有\n感覺到\n你有多愛我？",
            '<15>{#p/papyrus}{#f/28}所以你想讓... \n額...',
            "<15>{#p/papyrus}{#f/25}我—我的意思是，\n我們的關係還沒\n有發展得\n【那麼】快吧...",
            '<15>{#p/papyrus}{#f/15}...但事後\n我們可以繼續！'
        ],
        secretInsult4: ["<15>{#p/papyrus}{#f/27}你罵我沒腦子，\n沒懂你啥意思..."],
        secretInsult4x: [
            "<15>{#p/papyrus}{#f/27}所以... 你想\n說我們身處在\n三角戀中？",
            "<15>{#p/papyrus}{#f/19}好吧，這至少解釋了\n你說話為何\n這麼刻薄！"
        ],
        secretInsult5: [
            '<15>{#p/papyrus}{#f/27}啥？\n「志在星辰大海，\n何必自暴自棄」...',
            '<15>{#p/papyrus}{#f/17}你在說啥呢...？'
        ],
        secretInsult5x: [
            '<15>{#p/papyrus}{#f/25}等等...\n你想讓我知道\n你暗戀著我？',
            "<15>{#p/papyrus}{#f/22}我們的感情實際\n上是... 如梯形\n般穩定嗎！？"
        ],
        secretInsult6: [
            '<15>{#p/papyrus}{#f/14}等等... 我明白了！',
            '<15>{#p/papyrus}{#f/21}蠢貨...',
            '<15>{#p/papyrus}{#f/21}星辰大海...',
            '<15>{#p/papyrus}{#f/20}有顆星星，TWINKLY，\n他也喜歡叫人「蠢貨」！',
            '<15>{#p/papyrus}{#f/25}我...',
            "<15>{#p/papyrus}{#f/22}我才反應過來\n是怎麼回事！",
            '<15>{#p/papyrus}{#f/20}那個「ASRIEL」好像\n也喜歡罵人蠢貨！',
            '<15>{#p/papyrus}{#f/24}也就是說...',
            '<15>{#p/papyrus}{#f/22}你剛說的「星辰」\n肯定就是指他！',
            '<15>{#p/papyrus}{#f/19}他肯定幹了啥，\n害【我】表現得\n像個蠢貨！'
        ],
        secretInsult6x: [
            '<15>{#p/papyrus}{#f/10}喔...\n喔我知道了！',
            "<15>{#p/papyrus}{#f/10}你想說我是\n你的星辰大海！",
            "<15>{#p/papyrus}{#f/20}因為你一直\n想得到我的愛！",
            '<15>{#p/papyrus}{#f/27}哇喔...\n你這麼做\n真的很奇怪。',
            '<15>{#p/papyrus}{#f/24}真的太奇怪了...',
            "<15>{#p/papyrus}{#f/15}...你應該更好\n的事要做吧！",
            "<15>{#p/papyrus}{#f/21}畢竟，你如果只想\n告訴我這個...",
            '<15>{#p/papyrus}{#f/21}何必這麼麻煩...',
            '<15>{#p/papyrus}{#f/27}而不是饒恕我\n後再談這件事？',
            "<15>{#p/papyrus}{#f/21}除非...\n你【無法】饒恕我對吧。",
            '<15>{#p/papyrus}{#f/26}不...\n我知道了！',
            
            '<15>{#p/papyrus}{#f/20}沒錯！\n我終於理解\n你的意思了！',
            '<15>{#p/papyrus}{#f/24}既然那個\n「ASRIEL」這麼\n肯定你會\n殺了我...',
            "<15>{#p/papyrus}{#f/20}直覺告訴我，\n他用了什麼方式\n幹預了你的行為！",
            "<15>{#p/papyrus}{#f/15}他一直嫉妒\n你對我的感情！"
        ],
        secretInsult7: [
            '<15>{#p/papyrus}{#f/14}現在...\n我不會再\n被他騙了！',
            '<15>{#p/papyrus}{#f/20}我，PAPYRUS，\n保證讓他再也\n找不到我！',
            "<15>{#p/papyrus}{#f/15}別擔心，人類！\n一切盡在\nPAPYRUS的掌控之中！"
        ],
        sparableFlirt1: [
            "<15>{#p/papyrus}{#f/27}你現在\n要做的是饒恕，\n而不是調情！",
            '<15>{#f/14}我必須\n抗住誘惑！'
        ],
        sparableFlirt1x: [
            '<15>{#p/papyrus}{#f/27}啊？\n在這種時候... 調情？',
            "<15>{#f/14}嗯...\n這倒也算是一種\n贖罪方式！"
        ],
        sparableFlirt2: ['<15>{#p/papyrus}{#f/14}不-不...！'],
        sparableFlirt2x: ['<15>{#p/papyrus}{#f/14}啊-啊...！'],
        sparableFlirt3: ['<15>{#p/papyrus}{#f/14}...'],
        sparableInsult1: [
            "<15>{#p/papyrus}{#f/20}嘿，你沒必要\n辱罵自己的！",
            '<15>{#f/21}我知道你已經盡力了...'
        ],
        sparableInsult1x: [
            "<15>{#p/papyrus}{#f/20}嘿，你沒必要\n辱罵自己的！",
            "<15>{#f/15}人類，你要記住：\n來這裡是為了\n做個好人的！"
        ],
        sparableInsult2: ['<15>{#p/papyrus}{#f/21}人類...'],
        sparableInsult2x: ['<15>{#p/papyrus}{#f/15}你可以的...！'],
        sparableInsult3: ['<15>{#p/papyrus}{#f/21}...']
    },
    b_opponent_shockasgore: {
        act_check: ['<32>{#p/asriel2}* Asgore。\n* 親手葬送自己家園的昏君。'],
        act_hug: ['<32>{#p/human}* （你想抱抱Asgore...）'],
        hugText: ['<32>{#p/human}* （...但你的身體直接穿了過去。）', '<32>{#p/asriel2}* ...啊？'],
        foodText: ['<11>{#p/asgore}{#f/5}那是...'],
        idleText1: ['<11>{#p/asgore}{#f/1}開玩笑吧...'],
        idleText2: ['<11>{#p/asgore}{#f/1}一定要\n訴諸暴力嗎？'],
        idleText3: ['<11>{#p/asgore}{#f/1}為什麼不能\n和平解決呢？'],
        idleText4: ['<11>{#p/asgore}{#f/1}真的有必要嗎？'],
        stickText: [
            '<32>{#p/human}* （你朝Asgore扔出扳手。）\n* （扳手直接穿過了他的身體。）',
            '<32>{#p/asriel2}* ...啊？'
        ],
        miss: [
            '<11>{#p/asgore}{#f/2}...',
            '<11>{#f/1}我本人不在這，\nAsriel。',
            "<11>{#f/2}這不過\n是個投影。"
        ],
        name: '* Asgore',
        status1: ['<32>{#p/asriel2}* 現在殺了他，$(name)。'],
        status2: ['<32>{#p/asriel2}* ...']
    },

    i_berry: {
        battle: {
            description: '一小串半透明的漿果。',
            name: '洋梅'
        },
        drop: ['<32>{#p/human}* （你把洋梅扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （7 HP。）']
                : ['<32>{#p/basic}* 「洋梅」 回復7 HP\n* 一小串半透明的漿果。'],
        name: '洋梅',
        use: ['<32>{#p/human}* （你吃掉了洋梅。）']
    },
    i_blookpie: {
        battle: {
            description: '將新鮮洋梅浸潤在果凍中製作而成。',
            name: '洋梅派'
        },
        drop: () => [
            '<32>{#p/human}* （你把洋梅果凍派扔掉了。）',
            ...(instance('main', 'blookishly') !== void 0 // NO-TRANSLATE

                ? game.room === '_frontier4' // NO-TRANSLATE

                    ? ['<32>{#p/napstablook}* ......... 嗯？']
                    : ['<32>{#p/napstablook}* 喔..................']
                : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （99 HP。）']
                : ['<32>{#p/basic}* 「洋梅果凍派」 回復99 HP\n* 將新鮮洋梅浸潤在果凍中製作而成。'],
        name: '洋梅果凍派',
        use: () => [
            '<32>{#p/human}* （你吃掉了洋梅果凍派。）',
            ...(instance('main', 'blookishly') !== void 0 // NO-TRANSLATE

                ? game.room === '_frontier4' // NO-TRANSLATE

                    ? ['<32>{#p/napstablook}* ......... 嗯？']
                    : ['<32>{#p/napstablook}* 喔.........\n* 希望你愛吃.........']
                : [])
        ]
    },
    i_chip: {
        battle: {
            description: '請將其帶往星系之外。',
            name: '「芯」型洋芋片'
        },
        drop: () => [
            '<32>{#p/human}* （你把「芯」型洋芋片扔掉了。）',
            ...(SAVE.data.b.svr && !SAVE.data.b.freedom
                ? ["<25>{#p/asriel1}{#f/15}* 額... 你不打算\n  保護好它嗎？"]
                : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （45 HP。）\n* （比起吃掉它，你更想保護好它。）']
                : ['<32>{#p/basic}* 「『芯』型洋芋片」 回復45 HP\n* 請將其帶往星系之外。'],
        name: '「芯」型洋芋片',
        use: () => [
            '<32>{#p/human}* （你咬了一口「芯」型洋芋片。）',
            ...(SAVE.data.b.svr && !SAVE.data.b.freedom
                ? ["<25>{#p/asriel1}{#f/15}* 額... 你不打算\n  保護好它嗎？"]
                : world.darker || SAVE.data.b.ufokinwotm8
                    ? []
                    : calcHP() - SAVE.data.n.hp > 45
                        ? ['<32>{#p/basic}* 你的HP值獲得了一個增量。']
                        : ['<32>{#p/basic}* 你的傷口被覆蓋掉了。'])
        ]
    },
    i_eye: {
        battle: {
            description: '可隨身攜帶的力場發射器。',
            name: '力場護盾'
        },
        drop: ['<32>{#p/human}* （你把力場護盾扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （7防禦。）']
                : ['<32>{#p/basic}* 「力場護盾」 （7防禦）\n* 可隨身攜帶的力場發射器。'],
        name: '力場護盾',
        use: ['<32>{#p/human}* （你啟動了力場護盾。）']
    },
    i_eye_x: {
        battle: {
            description: '可隨身攜帶的力場發射器，\n但能量不足。',
            name: '力場護盾？'
        },
        drop: ['<32>{#p/human}* （你把力場護盾扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （5防禦。）']
                : ['<32>{#p/basic}* 「力場護盾」 （5防禦）\n* 可隨身攜帶的力場發射器，\n  但能量不足。'],
        name: '力場護盾？',
        use: ['<32>{#p/human}* （你啟動了力場護盾。）']
    },
    i_fruit: {
        battle: {
            description: '非歐幾何形狀的水果，\n裡頭比外邊還大。',
            name: '幽靈水果'
        },
        drop: ['<32>{#p/human}* （你吸收了幽靈水果。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。）']
                : ['<32>{#p/basic}* 「幽靈水果」 回復15 HP\n* 非歐幾何形狀的水果，\n  裡頭比外邊還大。'],
        name: '幽靈水果',
        use: ["<32>{#p/human}* （你展開了幽靈水果多個面的空間。）"]
    },
    i_glove: {
        battle: {
            description: "源自尖端科技，揍人超級有力的\n仿生手套。",
            name: '超能手套'
        },
        drop: ['<32>{#p/human}* （你把超能手套扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （5攻擊。）']
                : ['<32>{#p/basic}* 「超能手套」 （5攻擊）\n* 源自尖端科技，揍人超級有力的\n  仿生手套。'],
        name: '超能手套',
        use: ['<32>{#p/human}* （你戴上了超能手套。）']
    },
    i_glove_x: {
        battle: {
            description: "雖然是仿製手套，\n但不妨礙你用它痛扁敵人。",
            name: '超能手套？'
        },
        drop: ['<32>{#p/human}* （你把超能手套扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （3攻擊。）']
                : ['<32>{#p/basic}* 「超能手套？」 （3攻擊）\n* 雖然是仿製手套，\n  但不妨礙你用它痛扁敵人。'],
        name: '超能手套？',
        use: ['<32>{#p/human}* （你戴上了超能手套。）']
    },
    i_milkshake: {
        battle: {
            description: '由白如珍珠的不明物質製成。',
            name: '奶昔'
        },
        drop: ['<32>{#p/human}* （你擺脫掉了奶昔。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （18 HP。）']
                : ['<32>{#p/basic}* 「奶昔」 回復18 HP\n* 由白如珍珠的不明物質製成。'],
        name: '奶昔',
        use: () => [
            '<32>{#p/human}* （你咽下了最後一滴奶昔。）',
            ...(SAVE.data.b.svr || world.darker || SAVE.data.b.ufokinwotm8 ? [] : ['<32>{#p/basic}* ...好鹹。'])
        ]
    },
    i_nice_cream: {
        battle: {
            description: '包裝紙上印的不是笑話，\n而是一些天馬行空的想像。',
            name: '冰意靈'
        },
        drop: ['<32>{#p/human}* （你把冰意靈扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。）']
                : ['<32>{#p/basic}* 「冰意靈」 回復15 HP\n* 包裝紙上印的不是笑話，\n  而是一些天馬行空的想像。'],
        name: '冰意靈',
        use: pager.create(
            2,
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上寫著拯救世界的冒險。）'
                    : '<32>{#p/basic}* 「你是一個偉大的冒險家，\n   肩負著拯救世界的使命！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上把你描述成\n  一個星際飛船的船長。）'
                    : '<32>{#p/basic}* 「你是一艘星際飛船的船長，\n   正駛向未知的太空！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上寫著只有你一個人\n  能解開一個謎團。）'
                    : '<32>{#p/basic}* 「一個巨大的謎團正在揭開，\n   而你是唯一能解開它的人！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上寫著你穿越時空後\n  做出的努力。）'
                    : '<32>{#p/basic}* 「你穿越回過去，\n   阻止了一場可怕的災難！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上寫著你的科學才華。）'
                    : '<32>{#p/basic}* 「你是一位傑出的科學家，\n   即將取得重大突破！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? "<32>* （包裝上建立了一個\n  你發現的無辜的世界。）"
                    : '<32>{#p/basic}* 「你偶然發現了一個充滿無辜的\n   生物的世界，接下來會發生什麼\n   就取決於你了！」'
            ],
            () => [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                SAVE.data.b.svr
                    ? '<32>* （包裝上詳細介紹了\n  你的新能力。）'
                    : '<32>{#p/basic}* 「你已經獲得了隨心所欲\n   改變宇宙的力量！\n   明智地使用它吧！」'
            ],
            [
                '<32>{#p/human}* （你撕開了冰意靈的包裝。）',
                "<32>{#p/human}* （上面是你找到了一個\n  充滿愛的家庭的全息圖像。）"
            ]
        )
    },
    i_pop: {
        battle: {
            description: '可改變主觀時間流速。',
            name: '渦旋棒棒糖'
        },
        drop: ['<32>{#p/human}* （你把渦旋棒棒糖扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （11 HP。）']
                : [
                    '<33>{#p/basic}* 「渦旋棒棒糖」 回復11 HP\n* 可改變主觀時間流速。\n* 僅在戰鬥中有效。'
                ],
        name: '渦旋棒棒糖',
        use: () => [
            '<32>{#p/human}* （你把渦旋棒棒糖舔沒了。）',
            ...(battler.active
                ? game.vortex
                    ? ['<32>{#p/human}* （主觀時間流速之前已改變。）']
                    : [
                        '<32>{#p/human}* （你的主觀時間流速開始改變。）',
                        '<32>{#p/story}* 兩回合內，你的專注力提升！'
                    ]
                : ['<32>{#p/human}* （戰鬥外使用無效。）'])
        ]
    },
    i_spaghetti: {
        battle: {
            description: '絲般柔滑的意面，\n在時間膨脹單元之中精細陳化。',
            name: '義大利麵'
        },
        drop: () => [
            '<32>{#p/human}* （你把義大利麵扔掉了。）',
            ...(game.room === 's_jenga' && SAVE.data.n.plot < 26 // NO-TRANSLATE

                ? []
                : !world.genocide && !world.runaway && (SAVE.data.n.state_papyrus_spaghet !== 0 || game.room === 's_bros') // NO-TRANSLATE

                    ? game.room === 'f_kitchen' // NO-TRANSLATE

                        ? [
                            SAVE.data.b.undyne_respecc ? '<25>{#p/undyne}{#f/1}* ...' : '<25>{#p/undyne}{#f/14}* ...',
                            "<25>{#p/undyne}{#f/17}* 我會將它從地板上刮下來\n  然後放在冰箱裡重新加熱的。"
                        ]
                        : SAVE.data.n.plot === 72 && game.room === 'c_asgore_kitchen' // NO-TRANSLATE

                            ? [
                                '<18>{#p/papyrus}{#f/8}別啊！！\n你怎麼能這麼對它！？！？',
                                '<18>{#f/5}...那是我親自下廚\n為你做的意面啊...',
                                '<18>{#f/4}...說實話...\n這面放的時間確實\n有點太久了。',
                                '<18>{#f/0}是啊！！\n我的新菜會更棒的！',
                                "<18>{#f/9}當它完成時，\n請務必前來品嘗！",
                                '<25>{#p/sans}{#f/2}* 信我的。\n* 他的新作品\n  你不會想丟掉的。',
                                '<18>{#p/papyrus}{#f/6}...好耶！！'
                            ]
                            : (game.room === 's_bonehouse' && dateready()) || // NO-TRANSLATE

                                (fetchCharacters()
                                    .find(c => c.key === 'papyrus') // NO-TRANSLATE

                                    ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                ? [
                                    '<18>{#p/papyrus}{#f/8}別啊！！\n你怎麼能這麼對它！？！？',
                                    '<18>{#f/5}...那是我親自下廚\n為你做的意面啊...',
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? [
                                            '<25>{#p/undyne}{#f/4}* 完全沒問題！',
                                            '<25>{#p/undyne}{#f/7}* 人類！\n* 快點把義大利麵\n  從地上撿起來！',
                                            "<18>{#p/papyrus}{#f/6}UNDYNE，別！！\n太不衛生了！！"
                                        ]
                                        : ['<18>{#f/6}...再也沒法吃了！！']),
                                    "<18>{#f/4}不過... 這樣也好。",
                                    '<18>{#f/5}你丟掉了那份意面...',
                                    '<18>{#f/6}那我就做一份【更贊的】！',
                                    '<18>{#f/9}沒錯！\n你看我，充滿了鬥志！',
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? ['<25>{#p/undyne}{#f/17}* 耶！！\n* 你看他現在多麼\n  備受鼓舞啊！！']
                                        : []),
                                    "<18>{#p/papyrus}{#f/9}我要做銀河系史上\n最好的菜！",
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? [
                                            "<25>{#p/undyne}{#f/7}* 這次你一定會喜歡上它的！！",
                                            "<18>{#p/papyrus}{#f/6}但如果你不喜歡\n也沒關係！！！",
                                            '<25>{#p/undyne}{#f/17}* 對！！！！',
                                            '<18>{#p/papyrus}{#f/9}對！！！！！',
                                            '<25>{#p/undyne}{#f/8}* 對！！！！！！',
                                            '<18>{#p/papyrus}{#f/4}...對。'
                                        ]
                                        : [])
                                ]
                                : instance('main', 'sentryskeleton') !== void 0 || // NO-TRANSLATE

                                    (fetchCharacters()
                                        .find(c => c.key === 'sans') // NO-TRANSLATE

                                        ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                    ? [
                                        "<25>{#p/sans}{#f/0}* 啊？\n* 你不喜歡我兄弟的\n  招牌義大利麵？",
                                        '<25>{#f/2}* 我猜意面更適合我。'
                                    ]
                                    : []
                    : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （16 HP。）']
                : ['<32>{#p/basic}* 「義大利麵」 回復16 HP\n* 絲般柔滑的意面，\n  在時間膨脹單元之中精細陳化。'],
        name: '義大利麵',
        use: () => [
            '<32>{#p/human}* （你吃光了義大利麵。）',
            ...(game.room === 's_jenga' && SAVE.data.n.plot < 26 // NO-TRANSLATE

                ? []
                : !battler.active &&
                    !world.genocide &&
                    !world.runaway &&
                    (SAVE.data.n.state_papyrus_spaghet !== 0 || game.room === 's_bros') // NO-TRANSLATE

                    ? game.room === 'f_kitchen' // NO-TRANSLATE

                        ? [
                            SAVE.data.b.undyne_respecc
                                ? '<25>{#p/undyne}{#f/1}* 義大利麵，對嗎？'
                                : '<25>{#p/undyne}{#f/14}* 義大利麵，對嗎？',
                            "<25>{#p/undyne}{#f/8}* 你最好會喜歡它，\n  因為這是用我的\n  食譜做的！！"
                        ]
                        : SAVE.data.n.plot === 72 && game.room === 'c_asgore_kitchen' // NO-TRANSLATE

                            ? [
                                '<18>{#p/papyrus}{#f/1}啥？\n你剛剛是不是\n吃了那份義大利麵？',
                                '<18>{#f/5}我做了它\n已經很長時間了...',
                                '<25>{#p/sans}{#f/2}* 至少也得幾個小時。',
                                "<18>{#p/papyrus}{#f/6}我覺得\n它已經過期了。",
                                "<18>{#f/6}我是說它的新品期\n已經過去了。",
                                "<18>{#f/4}但是不用擔心。\n這道新做的\n義大利麵...",
                                '<18>{#f/9}...會比以前的\n更加美味！',
                                "<18>{#f/9}當它完成時，\n請務必前來品嘗！"
                            ]
                            : (game.room === 's_bonehouse' && dateready()) || // NO-TRANSLATE

                                (fetchCharacters()
                                    .find(c => c.key === 'papyrus') // NO-TRANSLATE

                                    ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                ? SAVE.data.n.state_papyrus_spaghet === 0
                                    ? ((SAVE.data.n.state_papyrus_spaghet = 2),
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你剛剛是不是\n吃了那份義大利麵？',
                                            "<18>{#f/5}我剛想問你\n拿它怎麼辦呢...",
                                            '<18>{#f/6}但是現在答案\n就在我面前！',
                                            '<18>{#f/0}謝謝你，人類，\n吃掉時提供了\n這麼多資訊。'
                                        ])
                                    : [
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你剛剛是不是\n吃了那份義大利麵？',
                                            '<18>{#f/7}我還以為你\n要和我分享呢！',
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    "<25>{#p/undyne}{#f/7}* 好吧，\n  看起來那人類\n  不願與我們分享！",
                                                    '<18>{#p/papyrus}{#f/6}但是人類之前\n答應過我的！'
                                                ]
                                                : []),
                                            '<18>{#f/5}...也許原因在於\n我的廚藝...',
                                            "<18>{#f/6}你忍受不住\n它的美味，\n所以就嘗了一口！",
                                            '<18>{#f/5}還有，\n還有就是...',
                                            "<18>{#f/6}在你意識到之前，\n你就差點\n把盤子也吃了！",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? ['<25>{#p/undyne}{#f/14}* 哇。\n* 多麼罪惡啊。']
                                                : []),
                                            '<18>{#p/papyrus}{#f/5}是我極佳的廚藝\n讓你背叛了我...',
                                            "<18>{#f/9}不-不...！\n我會解決\n這個問題的！",
                                            '<18>{#f/4}...「咳咳」。',
                                            '<18>{#f/0}我，PAPYRUS，\n特此聲明你對我\n的承諾無效！',
                                            '<18>{#f/0}你瞧！\n現在你可以\n放心地享用了。',
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    '<25>{#p/undyne}{#f/11}* ...',
                                                    '<18>{#p/papyrus}{#f/4}（你可以\n配合一下嗎？）',
                                                    "<25>{#p/undyne}{#f/12}* 對！\n* 放心吧！\n* 你就這麼吃吧！",
                                                    '<18>{#p/papyrus}{#f/0}（謝啦。）'
                                                ]
                                                : [])
                                        ],
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你剛剛是不是\n吃了那份義大利麵？',
                                            "<18>{#f/4}好吧，你並沒有\n承諾要分享它...",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    "<25>{#p/undyne}{#f/11}* 所以問題是？",
                                                    "<18>{#p/papyrus}{#f/0}喔，額，\n我想這沒啥問題。"
                                                ]
                                                : ["<18>{#f/0}額，我想這\n感覺挺好。"]),
                                            '<18>{#f/5}畢竟，\n如果你【曾經】\n作出過這種承諾...',
                                            '<18>{#f/6}我們處於一個\n進退兩難的困境。',
                                            "<18>{#f/0}但是你沒有！\n所以我們仍然\n保持完美！",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    '<25>{#p/undyne}{#f/12}* 世界未來一片光明，\n  是吧？',
                                                    "<18>{#p/papyrus}{#f/7}嘿！\n我正要說這個！",
                                                    '<18>{#f/0}但是對對對。'
                                                ]
                                                : ['<18>{#f/0}世界未來一片光明！'])
                                        ]
                                    ][SAVE.data.n.state_papyrus_spaghet - 1]
                                : instance('main', 'sentryskeleton') !== void 0 || // NO-TRANSLATE

                                    (fetchCharacters()
                                        .find(c => c.key === 'sans') // NO-TRANSLATE

                                        ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                    ? [
                                        "<25>{#p/sans}{#f/3}* 它很美味，不是嗎？",
                                        "<25>{#f/2}* 我應該知道。\n* 我是第一個試吃者。"
                                    ]
                                    : []
                    : [])
        ]
    },
    i_swirl: {
        battle: {
            description: '一個五彩斑斕的發光瑞士卷。',
            name: '光彩漩渦'
        },
        drop: ['<32>{#p/human}* （你把光彩漩渦扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （22 HP。）']
                : ['<32>{#p/basic}* 「光彩漩渦」 回復22 HP\n* 一個五彩斑斕的發光瑞士卷。'],
        name: '光彩漩渦',
        use: ['<32>{#p/human}* （你吃掉了光彩漩渦。）']
    },
    i_voidy: {
        battle: {
            description: '可傳送到某個隱藏房間，\n戰鬥中使用無效。',
            name: '聖所'
        },
        drop: ['<32>{#p/human}* （你將聖所棄如敝屣。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （一件存在之外的物品。）']
                : ['<32>{#p/basic}* 可傳送到某個隱藏房間，\n  戰鬥外可用。'],
        name: '聖所',
        use: () =>
            battler.active
                ? ['<32>{#p/human}* （你使用了聖所。）', '<32>{#p/human}* （戰鬥中使用無效。）']
                : ['<32>{#p/human}* （你使用了聖所。）']
    },
    i_corndog_sword: {
        battle: {
            description: '絕對是獨一無二的武器。',
            name: '玉狗聖劍'
        },
        drop: ['<32>{#p/human}* （你想扔掉玉狗聖劍...）', '<32>{#p/human}* （...但是它拒絕了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （你覺得還是不要思考\n  這玩意怎麼工作的比較好。）']
                : ['<32>{#p/basic}* 絕對是獨一無二的武器。'],
        name: '玉狗聖劍',
        use: () =>
            battler.active && battler.alive[0].opponent.metadata.corndogger
                ? [
                    '<32>{#p/human}* （你裝備上玉狗聖劍。）',
                    "<32>{#p/human}* （它太誘人了，你禁不住想咬一口。）",
                    [
                        '<32>{#p/human}* （你吃掉了外層的面衣...）',
                        '<32>{#p/human}* （你吃掉了劍尖...）',
                        '<32>{#p/human}* （你吃掉了劍身...）',
                        '<32>{#p/human}* （你吃掉了劍柄...）',
                        '<32>{#p/human}* （你吃掉了最後的握柄...）'
                    ][SAVE.data.n.corndogger++],
                    '<32>{#p/basic}* 突然間..！'
                ]
                : [
                    '<32>{#p/human}* （你試圖裝備上玉狗聖劍...）',
                    "<32>{#p/human}* （...但是，它沒有嗅到\n  足夠大的威脅！）"
                ]
    },
    i_fryz: {
        battle: {
            description: '這次可不只是「暖暖的」了喔。',
            name: 'Grillby'
        },
        drop: ["<32>{#p/human}* （你把烈焰Grillby當做燃燒瓶\n  拋了出去。）"],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （30 HP。）']
                : ['<32>{#p/basic}* 「烈焰Grillby」 回復30 HP\n* 這次可不只是「暖暖的」了喔。'],
        name: "烈焰Grillby",
        use: ["<32>{#p/human}* （你喝掉了烈焰Grillby。）"]
    },
    i_burgerz: {
        battle: {
            description: '很像普通漢堡，只是小了一些。\n共有三個。',
            name: '三隻小漢堡'
        },
        drop: ['<32>{#p/human}* （你把小漢堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。共有三個。）']
                : ['<32>{#p/basic}* 「小漢堡」 回復15 HP\n* 很像普通漢堡，只是小了一些。\n* 共有三個。'],
        name: '三隻小漢堡',
        use: ['<32>{#p/human}* （你吃掉了一個小漢堡。）']
    },
    i_burgerz_use1: {
        battle: {
            description: '很像普通漢堡，只是小一些。\n還剩兩個。',
            name: '兩隻小漢堡'
        },
        drop: ['<32>{#p/human}* （你把小漢堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。還剩兩個。）']
                : ['<32>{#p/basic}* 「小漢堡」 回復15 HP\n* 很像普通漢堡，只是小了一些。\n* 還剩兩個。'],
        name: '兩隻小漢堡',
        use: ['<32>{#p/human}* （你吃掉了一個小漢堡。）']
    },
    i_burgerz_use2: {
        battle: {
            description: '很像普通漢堡，只是小了一些。',
            name: '小漢堡'
        },
        drop: ['<32>{#p/human}* （你把小漢堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。最後一個。）']
                : ['<32>{#p/basic}* 「小漢堡」 回復15 HP\n* 很像普通漢堡，只是小了一些。\n* 最後一個。'],
        name: '小漢堡',
        use: ['<32>{#p/human}* （你吃掉了一個小漢堡。）']
    },

    k_premium: {
        name: '高級會員券',
        description: () =>
            SAVE.data.b.f_state_voucher
                ? '與你根本不存在的付費望遠鏡訂閱\n配套使用。'
                : '在使用過星港的望遠鏡之後，\n怪物小孩給你的東西。'
    },

    k_inverter: {
        name: '重力轉換器遙控器',
        description: () =>
            SAVE.data.b.s_state_inverter
                ? '用它激活了與之匹配的\n重力轉換器。'
                : "在Sans房間裡的沒封上的信封中\n搞到的。"
    },

    k_security: {
        name: '生鏽的鑰匙',
        description: () =>
            SAVE.data.n.state_aerialis_lockup > 0
                ? '用它解鎖了休閒迴廊的\n兵工廠。'
                : '在星港小鎮北側的「警察崗」\n搞到的。'
    },

    n_shop_blook: {
        exit: ["<32>{#p/napstablook}{#k/0}* 喔... 你要走了...", '<32>{#k/1}* 好吧，下次再見，也許吧...'],
        item: () =>
            blookGone()
                ? [
                    '§fill=#808080§---- 售罄 ----',
                    SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '0G - 洋梅果凍派',
                    '0G - 幽靈水果',
                    '0G - 奶昔',
                    '離開'
                ]
                : SAVE.data.n.plot === 72
                    ? [
                        SAVE.data.b.item_voidy ? '§fill=#808080§---- 售罄 ----' : '432G - 聖所',
                        SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '80G - 洋梅果凍派',
                        '5G - 幽靈水果',
                        '5G - 奶昔',
                        '離開'
                    ]
                    : [
                        SAVE.data.b.item_voidy ? '§fill=#808080§---- 售罄 ----' : '432G - 聖所',
                        SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '100G - 洋梅果凍派',
                        '12G - 幽靈水果',
                        '16G - 奶昔',
                        '離開'
                    ],
        itemInfo: [
            '特殊物品：\n傳送到\n某個\n隱藏房間。',
            '回復99 HP\n在黑暗中\n發出\n幽幽螢光。',
            "回復15 HP\n非歐幾何的\n產物。",
            '回復18 HP\n也許含有\n靈質。'
        ],
        itemPrompt: '<09>{#p/napstablook}{#k/3}看上\n什麼了嗎？',
        itemPurchase: [
            '<09>{#p/napstablook}{#k/3}嘿... 謝謝你...',
            "<09>{#p/napstablook}{#k/0}不買也沒\n關係的...",
            '<09>{#p/napstablook}{#k/0}對不起...\n錢不夠...',
            "<10>{#p/human}（你帶的\n東西\n太多了。）"
        ],
        itemPurchasePrompt: () => (blookGone() ? '偷走嗎？' : '花$(x)G\n買它嗎？'),
        itemUnavailable: () =>
            blookGone() ? '<09>{#p/basic}空無一物。' : "<09>{#p/napstablook}{#k/0}喔... 這個\n賣光了...",
        menu: () =>
            blookGone() ? ['拿取', '偷竊', '閱讀', '離開'] : ['購買', world.meanie ? '偷竊' : '出售', '交談', '離開'],
        menuPrompt1: () =>
            [
                '<23>{#p/napstablook}{#k/3}* 來隨便看看吧...',
                "<23>{#p/napstablook}{#k/3}* 希望這裡有你想要的東西...",
                "<23>{#p/napstablook}{#k/3}* 來隨便看看吧...\n  不想也行...\n  一切由你...",
                '<23>{#p/napstablook}{#k/3}* 來隨便看看...\n* 也許吧...',
                "<23>{#p/napstablook}{#k/3}* 來隨便看看吧...\n  不想也行...\n  一切由你..."
            ][Math.min(SAVE.data.n.state_wastelands_napstablook, 4)],
        menuPrompt2: '<23>{#p/napstablook}{#k/0}* 你可以隨時離開這裡... ',
        menuPrompt3: () =>
            world.bulrun ? '<23>{#p/basic}* ...但是大家都逃走了。' : '<23>{#p/basic}* ...但是誰也沒有來。',
        note: () =>
            ['f_blooky', 'f_napstablook'].includes(SAVE.data.s.state_foundry_deathroom) // NO-TRANSLATE

                ? ["<32>{#p/basic}* 沒有人給你留字條。"]
                : SAVE.data.b.killed_mettaton
                    ? ["<32>{#p/basic}* 這裡有一張字條。", '<32>{#p/napstablook}* 「都是你的錯...」']
                    : world.runaway
                        ? ["<32>{#p/basic}* 這裡有一張字條。", '<32>{#p/napstablook}* 「我們別無選擇...」']
                        : ["<32>{#p/basic}* 這裡有一張字條。", '<32>{#p/napstablook}* 「對不起，我得走了...」'],
        sell1: () =>
            blookGone()
                ? ['<30>{#p/human}* （你從櫃檯後面拿走了42G。）']
                : world.meanie
                    ? [
                        "<30>{#p/napstablook}{#k/2}* 喔...\n  你想偷我的東西...",
                        '<30>{#p/napstablook}{#k/5}* 你肯定很需要錢...',
                        SAVE.data.b.item_voidy
                            ? "<30>{#k/0}* 對不起...\n  我唯一的收入還是你剛給的錢..."
                            : "<30>{#k/0}* 對不起...\n  我很窮，沒錢給你..."
                    ]
                    : [
                        '<30>{#p/napstablook}{#k/2}* 喔... 你是想賣掉一些東西嗎',
                        "<30>{#k/0}* 我不清楚我能不能買下\n  所有東西...\n  抱歉..."
                    ],
        sell2: () =>
            blookGone()
                ? ['<30>{#p/basic}* 空無一物。']
                : world.meanie
                    ? [
                        "<30>{#p/napstablook}{#k/5}* 嗯...\n* 我沒法給你值錢的東西...",
                        "<30>{#p/napstablook}{#k/0}* 我理解...\n  這會讓你很難過"
                    ]
                    : [
                        '<30>{#p/napstablook}{#k/5}* 嗯... 想賣東西的話...\n  可以問問我的表親...',
                        '<30>{#k/0}* 它應該和undyne住在一塊'
                    ],
        talk: (name: string) =>
            SAVE.data.n.plot === 72
                ? ['打招呼', '發生什麼了', name, '未來打算', '離開']
                : [
                    '打招呼',
                    '幽靈',
                    '聖所',
                    65 <= SAVE.data.n.plot
                        ? SAVE.data.b.a_state_hapstablook && 68 <= SAVE.data.n.plot
                            ? '你的家人'
                            : '你的生活'
                        : 63 <= SAVE.data.n.plot && SAVE.data.b.a_state_hapstablook
                            ? 'Mettaton'
                            : 60 <= SAVE.data.n.plot
                                ? '喵喵玩偶'
                                : 48 <= SAVE.data.n.plot
                                    ? '旅途'
                                    : SAVE.data.b.napsta_performance
                                        ? 'DJ生涯'
                                        : SAVE.data.n.state_wastelands_napstablook === 0
                                            ? 'Dapper Blook？'
                                            : '你的生活',
                    '離開'
                ],
        talkPrompt: '<09>{#p/napstablook}{#k/1}喔，\n想和我\n聊天嗎？',
        talkText: [
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/napstablook}{#k/3}* 喔，你好啊...',
                        '<32>{#k/0}* 有那麼會，大夥全都失蹤了...',
                        '<32>{#k/1}* 當他們再次出現的時候，\n  他們都知道了你的名字...',
                        "<32>{#k/3}* 所以...\n  你叫Frisk，對吧？",
                        '<32>{#k/4}* 那，很高興見到你，Frisk'
                    ]
                    : SAVE.data.b.a_state_napstadecline
                        ? ['<32>{#p/napstablook}{#k/2}* 啊...', '<32>{#p/napstablook}{#k/2}* 嘿...']
                        : SAVE.data.n.state_wastelands_napstablook < 2
                            ? [
                                [
                                    '<32>{#p/napstablook}{#k/3}* 喔，你好啊...',
                                    '<32>{#p/napstablook}{#k/3}* 喔，很高興又見到你...'
                                ][SAVE.data.n.state_wastelands_napstablook],
                                ...(world.meanie
                                    ? ["<32>{#k/0}* 為什麼露出那副表情？\n* 我做錯什麼了嗎..."]
                                    : ['<32>{#k/4}* 最近在忙些什麼呀？'])
                            ]
                            : SAVE.data.n.state_wastelands_napstablook < 5
                                ? [
                                    "<32>{#p/napstablook}{#k/0}* 喔...\n* 不太確定我要怎麼接...",
                                    '<32>{#k/3}* 呃... 你好？\n  應該行吧...'
                                ]
                                : [
                                    '<32>{#p/napstablook}{#k/4}* 嘿...\n* 嘿...',
                                    '<32>{#k/3}* 問一下，\n  你剛來嗎？',
                                    "<32>{#k/5}* 你看起來有點陌生..."
                                ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/napstablook}{#k/2}* 老實說，\n  我真的不知道發生了什麼...",
                        "<32>{#k/2}* 和我的家人一樣\n* 我們沒有像其他人一樣被拉進去",
                        '<32>{#k/1}* 我們的確看到了一道亮光，\n  但當它經過的時候...\n  我們只是拒絕了它',
                        "<32>{#k/0}* 儘管，我們不咋了解...",
                        "<32>{#k/3}* 但我們都聽說了\n  你對我們所做的一切",
                        '<32>{#k/3}* 所以... 謝謝你'
                    ]
                    : [
                        '<32>{#p/napstablook}{#k/2}* 你想了解幽靈嗎？',
                        '<32>{#k/0}* 嗯，除了我自己\n  我只認識三個幽靈...\n  都是我的表親...',
                        '<32>{#k/3}* 當然，還有你身後那一個',
                        "<32>{#k/1}* 除此之外，沒什麼可以說了",
                        '<32>{#k/0}* 如果不與容器融合，\n  我們就只能... 這樣存在',
                        '<32>{#k/0}* 嗯，我懂...\n* 這特質確實很有趣...'
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/napstablook}{#k/2}* ...',
                        "<32>{#k/2}* 那個...\n  那個幽靈還在你身後對吧",
                        '<32>{#k/0}* 對...\n  我可以看到...',
                        ...(SAVE.data.b.oops
                            ? [
                                "<32>{#k/0}* 那個幽靈...\n  似乎不喜歡被我指出來...",
                                '<32>{#k/0}* 喔不...'
                            ]
                            : [
                                '<32>{#k/2}* 看起來那個幽靈... 很開心？',
                                '<32>{#k/4}* frisk，如果你能\n  讓那個幽靈有這種感覺...',
                                '<32>{#k/3}* 你真的很特別'
                            ])
                    ]
                    : [
                        '<32>{#p/napstablook}{#k/3}* 喔... 你說那個啊...',
                        '<32>{#k/1}* 有一天，我在地上\n  發現了一個小盒子...',
                        "<32>{#k/5}* 當我打開它的時候，\n  就到了一個我從未見過的\n  神秘地方...",
                        '<32>{#k/4}* 現在，我偶爾會去\n  那個地方放鬆自己',
                        "<32>{#k/3}* 那裡很安寧..."
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        SAVE.data.b.a_state_hapstablook
                            ? '<32>{#p/napstablook}{#k/0}* 好吧，在解決了我與我的表親\n  之間的問題後...'
                            : "<32>{#p/napstablook}{#k/0}* 好吧，因為我真的無事可做...",
                        '<32>{#k/0}* 我想是時候\n  嘗試一些新東西了',
                        '<32>{#k/3}* 我在聽說\n  檔案內的人類的事情後，\n  由衷地為他們感到難過...',
                        '<32>{#k/3}* 因此... 我收養了一個',
                        '<32>{#k/1}* 我只希望\n  我能盡全力照顧那個人類'
                    ]
                    : 65 <= SAVE.data.n.plot
                        ? SAVE.data.b.a_state_hapstablook
                            ? 68 <= SAVE.data.n.plot
                                ? [
                                    '<32>{#p/napstablook}{#k/3}* 嘿，mettaton剛剛來過',
                                    "<32>{#k/0}* 我們聊了一些以前的家常...",
                                    
                                    "<32>{#k/3}* 嗯，我從來沒有這麼開心過",
                                    '<32>{#k/3}* 你為我們所做的一切...\n  真的意義重大'
                                ]
                                : [
                                    "<32>{#p/napstablook}{#k/0}* 嘿...\n  很抱歉事情並未如我們所願...",
                                    '<32>{#k/3}* 很高興有你在那裡，\n  儘管...'
                                ]
                            : [
                                '<32>{#p/napstablook}{#k/7}* 時間每流逝一點，\n  我離幸福也就更遠一步...'
                            ]
                        : 63 <= SAVE.data.n.plot && SAVE.data.b.a_state_hapstablook
                            ? [
                                "<32>{#k/7}* 喔... 你可能在想關於會議的事",
                                "<32>{#k/7}* 別擔心，它還沒結束...",
                                '<32>{#k/7}* 我只是回到這\n  檢查一下我的商店...'
                            ]
                            : 60 <= SAVE.data.n.plot
                                ? SAVE.data.b.a_state_napstadecline
                                    ? [
                                        '<32>{#k/7}* ...',
                                        "<32>{#k/7}* 我不怎麼... 想談論那個...",
                                        ...(SAVE.storage.inventory.contents.includes('tvm_mewmew') // NO-TRANSLATE

                                            ? ["<32>{#k/2}* 特別是它就在你的物品欄..."]
                                            : [])
                                    ]
                                    : [
                                        '<32>{#k/1}* 喔... 對...',
                                        '<32>{#k/3}* 謝謝你同意\n  幫助我去做那件事',
                                        "<32>{#k/2}* mettaton最近的行為有點奇怪...",
                                        "<32>{#k/0}* 但他這麼做\n  我一點都不驚訝",
                                        '<32>{#k/4}* alphys前陣子第一次帶我看\n  喵喵太空探險系列的電影...',
                                        '<32>{#k/3}* 我們在一晚上追完了整整四季...',
                                        '<32>{#k/6}* 那結局...\n  有點東西...',
                                        
                                    ]
                                : 48 <= SAVE.data.n.plot
                                    ? [
                                        '<32>{#k/1}* 是的... 現在當我消遣時\n  一般就會看這個',
                                        ...[
                                            ['<32>{#k/0}* 很抱歉我打擾了\n  你和我表親在一起的時光'],
                                            ['<32>{#k/0}* ...\n* 你見過我表親了嗎？'],
                                            ['<32>{#k/3}* 我聽說我的表親\n  很喜歡你...'],
                                            [
                                                "<32>{#k/5}* 我表親告訴我\n  你不怎麼風趣...",
                                                '<32>{#k/5}* 但我不同意...'
                                            ],
                                            [],
                                            []
                                        ][SAVE.data.n.state_wastelands_toriel === 0 ? 2 : SAVE.data.n.state_foundry_maddummy],
                                        '<32>* ...',
                                        "<32>{#f/1}* 不管怎樣\n* 我希望你在外一切都好...",
                                        '<32>{#f/2}* 因為走過星港之後，\n  會有一些東西比較... 狂躁'
                                    ]
                                    : SAVE.data.b.napsta_performance
                                        ? [
                                            '<32>{#p/napstablook}{#k/1}* 嗯，我有時會創作音樂',
                                            "<32>{#k/0}* 人們覺得我的音樂很棒，\n  但我明白這只是他們\n  為了激勵我說的謊\n  罷了...",
                                            '<32>{#k/4}* 不過，感謝你來我的小演出捧場...',
                                            '<32>{#k/3}* 見到你，我很高興...'
                                        ]
                                        : [
                                            [
                                                '<32>{#p/napstablook}{#k/2}* 你指的是...\n  之前我給你表演的帽子魔術嗎...？',
                                                '<32>{#k/1}* 嗯，那個是我一個表親\n  教我的...',
                                                '<32>{#k/3}* 以前，我和他常常在一塊\n  做各種事...',
                                                '<32>{#k/0}* 後來有一天，他...',
                                                '<32>{#k/6}* ...',
                                                '<32>{#k/0}* 沒事...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 喔，我的生活蠻平淡的，\n  拿不出什麼好聊的事...",
                                                '<32>{#k/3}* 碰上你這事，\n  都算這周末比較出彩的了...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 喔，我的生活蠻平淡的，\n  拿不出什麼好聊的事...",
                                                '<32>{#k/6}* 而且有你在這，\n  我的生活估計也不會有啥起色了...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 喔，我的生活蠻平淡的，\n  拿不出什麼好聊的事...",
                                                "<32>{#k/3}* 每天能做的...\n  也只有記{@fill=#ff0}錄{@fill=#fff}生活的{@fill=#ff0}軌{@fill=#fff}跡..."
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 喔，我的生活蠻平淡的，\n  拿不出什麼好聊的事...",
                                                '<32>{#k/6}* 我想你對這事...\n  也沒啥興趣...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 喔，我的生活蠻平淡的，\n  拿不出什麼好聊的事...",
                                                "<32>{#k/0}* 每天{@fill=#ff0}混{@fill=#fff}日子，\n  做點喜歡的{@fill=#ff0}音{@fill=#fff}樂"
                                            ]
                                        ][SAVE.data.n.state_wastelands_napstablook]
        ],
        zeroPrompt: '<09>{#p/basic}...'
    },
    n_shop_hare: {
        exit: ['<32>{#p/basic}{#k/11}* 再見！\n* 有空常來啊！'],
        item: () =>
            world.population === 0 || world.runaway
                ? [
                    '0G - 超能手套？',
                    SAVE.data.b.item_eye ? '0G - 力場護盾？' : '0G - 力場護盾',
                    '0G - 渦旋棒棒糖',
                    '0G - 光彩漩渦',
                    '離開'
                ]
                : SAVE.data.n.plot === 72
                    ? [
                        '10G - 超能手套？',
                        SAVE.data.b.item_eye ? '10G - 力場護盾？' : '20G - 力場護盾',
                        '8G - 渦旋棒棒糖',
                        '5G - 光彩漩渦',
                        '離開'
                    ]
                    : [
                        '30G - 超能手套？',
                        SAVE.data.b.item_eye ? '30G - 力場護盾？' : '40G - 力場護盾',
                        '28G - 渦旋棒棒糖',
                        '20G - 光彩漩渦',
                        '離開'
                    ],
        itemInfo: () => [
            "武器：3攻擊\n(當前攻擊$(x))\n重拳出擊，\n仿製品。",
            SAVE.data.b.item_eye
                ? '防具：5防禦\n(當前防禦$(x))\n有力防禦，\n仿製品。'
                : '防具：7防禦\n(當前防禦$(x))\n有力防禦。',
            '回復11 HP\n可改變\n主觀時間\n流速。',
            "回復22 HP\n她的\n獨家配方。"
        ],
        itemPrompt: '<09>{#p/basic}{#k/0}想買點\n什麼？',
        itemPurchase: [
            '<09>{#p/basic}{#k/4}謝謝惠顧。',
            '<09>{#p/basic}{#k/7}只是\n看看？',
            "<09>{#p/basic}{#k/5}這點錢不夠。",
            "<10>{#p/human}（你帶的\n東西\n太多了。）"
        ],
        itemPurchasePrompt: () => (world.population === 0 || world.runaway ? '偷走嗎？' : '花$(x)G\n買它嗎？'),
        menu: () =>
            world.population === 0 || world.runaway
                ? ['拿取', '偷竊', '閱讀', '離開']
                : ['購買', world.meanie ? '偷竊' : '出售', '交談', '離開'],
        menuPrompt1: '<23>{#p/basic}{#k/0}* 你好啊，旅行者。\n* 想來點什麼嗎？',
        menuPrompt2: '<23>{#p/basic}{#k/0}* 慢慢挑。',
        menuPrompt3: () =>
            world.bulrun ? '<23>{#p/basic}* ...但是大家都逃走了。' : '<23>{#p/basic}* ...但是誰也沒有來。',
        note: () =>
            world.runaway
                ? ["<32>{#p/basic}* 這裡有一張字條。", '<32>{#p/basic}* 「請你別跟過來。」']
                : SAVE.data.n.plot === 72
                    ? ["<32>{#p/basic}* 這裡有一張字條。", '<33>{#p/basic}* 「對不起，我不敢回去。」']
                    : ["<32>{#p/basic}* 這裡有一張字條。", '<33>{#p/basic}* 「請不要傷害我的家人。」'],
        sell1: () =>
            world.population === 0 || world.runaway
                ? ['<30>{#p/human}* （你從櫃檯後面拿走了758G。）']
                : world.meanie
                    ? [
                        "<30>{#p/basic}{#k/1}* 哈？\n* 這是不是\n  代表著我應該報警呢？",
                        "<30>{#k/2}* 如果你想要什麼東西，\n  你可以去購買它啊！",
                        '<30>{#k/12}* 沒得商量。'
                    ]
                    : [
                        "<30>{#p/basic}{#k/6}* 哈？\n* 你想賣東西？\n* 這裡看起來像當鋪嗎？",
                        "<30>{#k/3}* 我不知道在你家鄉是\n  什麼樣子的... 但是...",
                        "<30>* 如果我開始花錢買\n  舊扳手和穿過的太空服，\n  我生意就做不下去了！"
                    ],
        sell2: () =>
            world.population === 0 || world.runaway
                ? ['<30>{#p/basic}* 空無一物。']
                : world.meanie
                    ? ["<30>{#p/basic}{#k/8}* 我不知道你想耍什麼花招，\n  但是這對我毫無作用。"]
                    : [
                        "<30>{#p/basic}{#k/8}* 你要是真缺錢的話，\n  可以試試眾籌啊。",
                        '<30>{#k/2}* 我聽說現在人們\n  願意為了任何東西花錢。'
                    ],
        talk: () =>
            SAVE.data.n.plot === 72
                ? ['打招呼', '發生什麼了', '外域', '未來打算', '離開']
                : ['打招呼', '這裡可以幹什麼', '小鎮的歷史', '你的生活', '離開'],
        talkPrompt: '<09>{#p/basic}{#k/0}想聊聊\n天嗎？',
        talkText: [
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/4}* 喔，你是Frisk，對吧！\n* 大夥都在討論你的光輝事跡呢！",
                        "<32>{#k/0}* 謝謝你讓我們重獲自由！",
                        "<32>{#k/5}* 大夥都看到過同樣的事情... \n  所以我們知道你一定需要休息一下。",
                        "<32>{#k/4}* 儘管如此。\n* 我們還是為自由而忍不住興奮。"
                    ]
                    : [
                        "<32>{#p/basic}{#k/4}* 你好呀！歡迎來到星港！\n* 我都記不得上次看到新面孔\n  是什麼時候的事情了。",
                        '<32>{#k/8}* 你是從哪裡來的？\n* 首塔嗎？',
                        "<32>{#k/7}* 你看起來不像是遊客。\n* 你是自己來的嗎？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/8}* 你知道發生了什麼，不是嗎？",
                        "<32>{#k/9}* 另一方面，\n  你看到的東西可能有些不同...",
                        "<32>{#k/0}* 來。\n* 我告訴你我看到了什麼。",
                        '<32>{#k/0}* 我們大夥\n  都被一束強光拉了進來後...',
                        "<32>{#k/7}* 然後我們似乎...\n  以別人的視角看到了...",
                        "<32>{#k/5}* 你受到了來自四面八方的攻擊，\n  那時我覺得你肯定死掉了。",
                        "<32>{#k/11}* 但是我錯了，\n  你仍在那傲然挺立著。",
                        '<32>{#k/8}* 最後，你向攻擊你的人說了一些\n  特別的話，而那人聽到後...\n  居然停止了攻擊。',
                        '<32>{#k/9}* 在此之後，\n  我們大夥就都醒了過來，\n  然後看到力場被摧毀了。'
                    ]
                    : [
                        '<32>{#p/basic}{#k/8}* 你想知道在星港可以幹什麼？',
                        "<32>{#k/9}* 你可以去Grillby's用餐，\n  可以去圖書倌獲取資訊...",
                        "<32>{#k/2}* 如果你累了，\n  你可以去旅館打個盹。\n* 就在隔壁，我姐妹開的。",
                        "<32>{#k/0}* 你要是覺得無聊了，\n  可以坐在外面，\n  看那兩個古怪的骷髏\n  做他們的事情。",
                        "<32>* 他們兩個...\n* 我覺得，應該是兄弟。\n* 從我記事的時候，\n  他們就在這裡了。",
                        '<32>{#k/9}* 喔，我差點忘了。\n* 最近，有個小鬼兒決定\n  在小鎮的南邊開一家商店。',
                        "<32>{#k/11}* 雖然事情不算大，\n  但如果你路過，\n  一定要打聲招呼。\n* 那傢伙很需要陪伴的。"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/basic}{#k/12}* 關於外域的事你聽說了嗎？',
                        '<32>{#k/2}* 據說女王\n  在那待了很長很長的時間。',
                        '<32>{#k/8}* 不可思議，對吧！？',
                        "<32>{#k/10}* 我敢打包票，\n  當她看到那些人類都還活著時，\n  肯定比我們還驚訝。"
                    ]
                    : [
                        '<32>{#p/basic}{#k/9}* 複習下你歷史課上\n  學到的東西...',
                        '<32>{#k/0}* 很久以前，怪物們住在\n  我們現在稱之為鑄廠的地方。',
                        '<32>* 過了一段時間，\n  我們發明了在前哨站\n  建造新區域的技術。',
                        "<32>* 首先建造出來的就是星港，\n  他們認為這是一個建小鎮的\n  好地方。",
                        "<32>{#k/10}* 聽起來很古怪，\n  但我還挺喜歡的，\n  你懂嗎？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/5}* 嗯，我會考慮\n  將我的商店搬到新家園。",
                        "<32>{#k/4}* ...恐怕我沒有其他計畫了。"
                    ]
                    : [
                        '<32>{#p/basic}* 生活總是一成不變。',
                        '<32>{#k/5}* 雖然有點孤單...',
                        "<32>{#k/10}* 但是... 在我們內心深處\n  都知道自由即將到來，\n  不是嗎？",
                        '<32>{#k/9}* 只要我們心存希望，\n  我們就能咬緊牙關，\n  日復一日地面對\n  同樣的困難...',
                        "<32>{#k/0}* 這就是生活啊，不是嗎？"
                    ]
        ],
        zeroPrompt: '<09>{#p/basic}...'
    },

    c_name_starton: {
        papyrus: () =>
            SAVE.data.n.plot_date < 2 || (SAVE.data.n.exp > 0 && SAVE.data.b.a_state_fishbetray)
                ? "給Papyrus打電話"
                : 'Papyrus和Undyne'
    },

    c_call_papyrus: <Partial<CosmosKeyed<CosmosProvider<string[]>>>>{
        s_start: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}啊，你在星港入口那兒。',
                '<18>{#p/papyrus}{#f/5}這條路沒啥人去，\n看著空蕩蕩的，\n不過嘛...',
                '<18>{#p/papyrus}{#f/0}它承載了我的\n許多美好回憶！',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}比如，在我和SANS\n還小的時候...',
                        '<18>{#p/papyrus}{#f/0}我倆經常在這賽車。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 講講唄。',
                        '<18>{#p/papyrus}{#f/0}那就說說我和SANS的\n懸浮車競速賽吧！',
                        "<18>{#p/papyrus}{#f/5}小時候，\n咱倆經常在這縱情飛馳，\n看誰開得更快..."
                    ]),
                '<18>{#p/papyrus}{#f/4}可惜，\n不管我怎麼努力...',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/7}等我到終點線，\n他車都停那好久了！',
                        '<18>{#p/papyrus}{#f/5}每次都這樣，\n你說我難不難過。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/17}* 他從來沒輸過？',
                        "<25>{#p/undyne}{#f/4}* 這太正常了，\n  他總作弊，都成慣犯了。",
                        '<25>{#p/undyne}{#f/5}* 射擊遊戲的\n  排行榜看過沒？',
                        "<25>{#p/undyne}{#f/8}* 他那分數，\n  簡直是個天文數字！！",
                        '<18>{#p/papyrus}{#f/4}他要是沒作弊，\n那就有鬼了。',
                        "<18>{#p/papyrus}{#f/7}真希望\n他能收斂一點！",
                        '<18>{#p/papyrus}{#f/7}他那麼整，別人還咋玩？',
                        '<25>{#p/undyne}{#f/1}* 也不一定...',
                        '<25>{#p/undyne}{#f/8}* 說不定，「衝榜」本身\n  也是個新奇的挑戰呢！',
                        '<18>{#p/papyrus}{#f/4}...才怪。'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/5}SANS他...\n總是喜歡走捷徑。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/4}我懷疑他用\n那玩意作弊了。\n不然咋能把把都贏呢？']
                    : ["<18>{#p/papyrus}{#f/4}大概這就是\n所謂的「優勝劣汰」吧。"])
            ]
        ),
        s_sans: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}這裡是SANS的哨站，\n然後...",
                '<18>{#p/papyrus}{#f/5}...',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}對了，\n我前幾天聽到他說...',
                        '<18>{#p/papyrus}{#f/6}...要幫哪個人去\n避開其他守衛。',
                        "<18>{#p/papyrus}{#f/5}我雖然不太能確定，\n但我感覺...",
                        "<18>{#p/papyrus}{#f/5}我兄弟...\n該不會是什麼\n特務吧？",
                        '<18>{#p/papyrus}{#f/4}...',
                        '<18>{#p/papyrus}{#f/4}...或者應該叫\n叛賊？'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/5}沒啥可聊的了...',
                        "<25>{#p/undyne}{#f/17}* Papyrus，你有沒有...\n  呃... 往上看過？",
                        '<18>{#p/papyrus}{#f/6}什麼！？',
                        "<18>{#p/papyrus}{#f/7}我可沒這閒工夫！",
                        "<25>{#p/undyne}{#f/1}* 現在你也沒在抓誰啊。",
                        '<18>{#p/papyrus}{#f/6}瞎-瞎說！\n我-我當然在抓人！\n在抓另一個「人」！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}「特務」和「叛賊」...',
                        '<18>{#p/papyrus}{#f/1}...難不成我兄弟\n其實是只烏賊！？'
                    ]
                    : ["<18>{#p/papyrus}{#f/4}我剛才指的是...\n一個長方形的夥計。"]
        ),
        s_crossroads: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}最近，前哨站上\n掀起了一股留言熱潮。',
                '<18>人們用便條\n記載夢想，送出祝福，\n也有向愛人表白的...',
'<18>能寫的東西可多了。',
                ...(solo()
                    ? [
                        
                        "<18>{#p/papyrus}{#f/9}看到大夥敞開心扉，\n我真的很高興。",
                        '<18>{#p/papyrus}{#f/4}不過我兄弟，就...',
                        "<18>{#p/papyrus}{#f/4}他{@fill=#ff0}月{@fill=#fff}想{@fill=#ff0}月{@fill=#fff}覺得\n那幫傢伙\n都是在做夢。"
                    ]
                    : [
                        '<18>...',
                        "<18>UNDYNE，\n幹嘛露出這幅表情？",
                        '<25>{#p/undyne}{#f/3}* ...你有沒有見過，呃...',
                        '<18>{#p/papyrus}{#f/0}...見過啥？',
                        '<25>{#p/undyne}{#f/15}* ...跟科學有關的便條？',
                        '<18>{#p/papyrus}{#f/0}噢。',
                        '<18>{#p/papyrus}{#f/0}...沒。',
                        '<25>{#p/undyne}{#f/1}* 真見鬼！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}話說，要是有個月亮\n繞著咱們轉，\n生活會變成啥樣。']
                    : ["<18>{#p/papyrus}你沒啥想要分享的\n希望與夢想嗎？"]
        ),
        s_human: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我說說那段\n出色的演講吧！',
                '<18>{#p/papyrus}{#f/0}說來挺巧的，\n我第一次排練\n就是在這兒。',
                '<18>{#p/papyrus}{#f/9}當然，SANS也在！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}不過我們一直在爭\n站哪邊比較好。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 你們肯定沒爭起來吧。",
                        '<18>{#p/papyrus}{#f/0}啊，正好相反。',
                        '<18>{#p/papyrus}{#f/0}我們經常爭起來！'
                    ]),
                "<18>{#p/papyrus}{#f/4}我轉向這個方向\n說站這邊比較好...",
                "<18>{#p/papyrus}{#f/4}他又轉向那個方向，\n說站那邊更好。",
                '<18>{#p/papyrus}{#f/6}我們爭啊爭，\n最後我們倆都轉得\n越來越快。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}於是，「二人轉」就成了\n我們兄弟倆的招牌動作。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* ...難怪我看到你倆\n  之前在我家門口- {%}',
                        '<18>{#p/papyrus}{#f/1}你看到啥了！？',
                        '<18>{#p/papyrus}{#f/6}等下，\n你聽我解釋...',
                        '<18>{#p/papyrus}{#f/5}咳咳，\nSANS只是擔心... 呃...',
                        "<18>{#p/papyrus}{#f/6}...擔心我賴在你家\n說啥都不走。",
                        '<18>{#p/papyrus}{#f/6}對對對，就是這樣！！',
                        "<25>{#p/undyne}{#f/16}* 畢竟你倆是親兄弟...",
                        "<25>{#p/undyne}{#f/1}* 也許他只是\n  想讓你多陪陪他。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}說個有意思的事。',
                        '<18>{#p/papyrus}{#f/0}我們的轉速加起來...\n結果是零。',
                        
                        '<18>{#p/papyrus}{#f/4}...因為我們總是\n朝相反的方向轉。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}畢竟，\n與家人共度時光\n很重要。',
                        '<18>{#p/papyrus}{#f/9}有的時候\n甚至需要用\n飛行魔法！'
                    ]
        ),
        s_papyrus: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}捏嘿嘿！！\n我不光是個謎題大師...',
                
                '<18>{#p/papyrus}{#f/9}還是一名\n德高望重的建築師！',
'<18>{#p/papyrus}{#f/9}佩服吧？',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}等我加入皇家衛隊，\n肯定要多建幾個哨站。']
                    : [
                        '<25>{#p/undyne}{#f/1}* 話說，我之前\n  想把你的「哨站」翻新一下...',
                        '<25>{#p/undyne}{#f/14}* 為啥呢？\n  估計是想... 給你個驚喜！',
                        '<18>{#p/papyrus}{#f/4}你說啥？',
                        '<25>{#p/undyne}{#f/12}* 不過，呃，那個哨站\n  已經很完美了。',
'<25>{#p/undyne}{#f/12}* 所以這麼搞可能會弄巧成拙。',
                        '<18>{#p/papyrus}{#f/5}那玩意\n已經「完美」了？',
                        '<18>{#p/papyrus}{#f/6}可你之前不是說過\n沒有最好，只有更好嗎！',
                        '<25>{|}{#p/undyne}{#f/17}* 呃... 是這樣沒錯啦！\n* 我其實想說- {%}',
                        '<18>{#p/papyrus}幾乎完美。\n這樣說可以吧。',
                        '<25>{#p/undyne}{#f/12}* 對對對，就是這個。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}要是SANS能找到點\n好建材，就好了。",
                        '<18>{#p/papyrus}{#f/6}紙箱子頂多\n就這樣了！！'
                    ]
                    : ['<18>{#p/papyrus}人類，謝謝你...', '<18>可以當我\n幾乎完美的\n朋友。']
        ),
        s_doggo: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}這不是DOGGO的哨站嘛...',
                '<18>{#p/papyrus}{#f/5}那天，DOGGO跟其他狗狗\n發生了點事...',
                "<18>{#p/papyrus}{#f/5}在那之後，他告訴我，\n自己再也沒有\n家的感覺了。",
                '<18>{#p/papyrus}{#f/0}我抱了抱他，告訴他，\n心裡有啥不快，\n就說出來吧。',
                '<18>{#p/papyrus}{#f/4}當然，犬衛隊\n都很通情達理。',
                "<18>{#p/papyrus}{#f/0}事情一點點好起來\n也一點都不奇怪！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 是啊，我還記得這件事呢...',
                        '<25>{#p/undyne}{#f/22}* 他...\n* 他當時還在想...',
                        '<18>{#p/papyrus}{#f/5}...嗯？',
                        '<25>{#p/undyne}{#f/9}* ...幸好有你在。',
                        "<25>{#p/undyne}{#f/16}* 不然他說不定就...",
                        '<18>{#p/papyrus}{#f/6}啥？\n說不定就怎樣？？',
                        '<25>{#p/undyne}{#f/12}* ...呃，他說不定就馬上離隊了。',
                        '<18>{#p/papyrus}{#f/0}喔，這樣啊。',
                        '<18>{#p/papyrus}{#f/5}那可就太可惜了...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}善良【真的】是\n一種美德！']
                    : ['<18>{#p/papyrus}{#f/9}沒有一條狗\n能在我眼皮底下\n辭職皇家守衛！']
        ),
        s_robot: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}作為一個建築機器人，\n生活一定很艱難吧。',
                '<18>{#p/papyrus}{#f/5}對那些智能\n比較人工的傢伙\n好一點。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 是啊... 尤其是一個\n  住在前哨站的機器人。',
                        '<25>{#p/undyne}{#f/9}* 我覺得我們\n  都知道原因。',
                        '<18>{#p/papyrus}{#f/5}太不幸了。',
                        "<25>{#p/undyne}{#f/17}* 但是，嘿！\n* 也不全是壞事！！",
                        '<25>{#p/undyne}{#f/14}* 畢竟，他們的晶片\n  可以直接轉移到\n  一臺新電腦上。',
                        '<18>{#p/papyrus}{#f/0}喔！喔！\n我應該懂了！',
                        "<18>{#p/papyrus}{#f/0}這樣他們就可以\n上域外網了！",
                        '<18>{#p/papyrus}{#f/0}還有天文\n觀測網路！',
                        '<18>{#p/papyrus}{#f/0}還有更多更多！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}你永遠不知道\n他們會孤獨多久！！"]
                    : [
                        "<18>{#p/papyrus}{#f/0}不知道他們\n能不能看到我的\n瀏覽記錄。",
                        '<18>{#p/papyrus}{#f/4}全都是生\n義大利麵條的\n圖片...'
                    ]
        ),
        s_maze: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我懂，我懂，\n我知道我的謎題\n是有點難...',
                ...(SAVE.data.b.papyrus_fire
                    ? [
                        '<18>{#p/papyrus}{#f/9}但只要把它想像成\n一次學習的經歷\n就好！',
                        '<18>{#p/papyrus}{#f/0}這是個對品格\n而非技能的考驗。',
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/1}* 哼？\n* 發生啥了？',
                                "<18>{#p/papyrus}{#f/5}人類在躲避烈火之牆\n那裡的表現很一般。",
                                '<25>{#p/undyne}{#f/10}* 啊...',
                                "<25>{#p/undyne}{#f/8}* 你是說那人沒有\n  直接飛過去！？",
                                '<18>{#p/papyrus}{#f/6}人類還能飛？？',
                                '<25>{#p/undyne}{#f/17}* ...',
                                "<25>{#p/undyne}{#f/17}* 你是說那人沒有\n  直接繞過去！？",
                                '<18>{#p/papyrus}{#f/6}呃...'
                            ])
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}但朋友啊，\n你真是個解謎大師啊！',
                        "<18>{#p/papyrus}{#f/9}這玩意可不是\n髓便就能通過的。",
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/1}* 哼？\n* 發生啥了？',
                                '<18>{#p/papyrus}{#f/0}人類前陣子把我那\n名聲大糟的「躲避\n烈火之牆」給搞定了！',
                                '<25>{#p/undyne}{#f/8}* 我來猜猜！\n* 那人肯定是繞過去的！！',
                                '<18>{#p/papyrus}{#f/4}並不。\n事實上，那人巧妙地\n從中走出去了。',
                                '<25>{#p/undyne}{#f/1}* ...噢。',
                                '<25>{#p/undyne}{#f/14}* 我本來還想猜\n  那人是飛過去的。',
                                '<18>{#p/papyrus}{#f/0}不！\n這靠的就是\n堅持不懈的練習！',
                                "<18>{#p/papyrus}{#f/5}不過，\n我也搞不清楚\n那人是怎麼練的...",
                                '<18>{#p/papyrus}{#f/4}明明是第一次\n遇到這個迷題啊。',
                                ...(SAVE.data.b.undyne_respecc
                                    ? [
                                        "<25>{#p/undyne}{#f/1}* 呵。\n* 我見識過\n  那人勇往直前的模樣。",
                                        "<25>{#p/undyne}{#f/12}* 能夠輕鬆解決這迷題，\n  我一點也不意外！"
                                    ]
                                    : [
                                        '<25>{#p/undyne}{#f/17}* 什麼？\n* 練習？\n* 我去！！',
                                        '<25>{#p/undyne}{#f/7}* 把你的秘訣告訴我，\n  小混蛋！！',
                                        '<18>{#p/papyrus}{#f/6}別這樣，\n讓解謎大師\n安心解謎吧！'
                                    ])
                            ])
                    ])
            ],
            () =>
                SAVE.data.b.papyrus_fire
                    ? solo()
                        ? [
                            '<18>{#p/papyrus}{#f/0}一日一迷題，\n「腦癱」遠離你！',
                            '<18>{#p/papyrus}{#f/4}至少他們\n都是這麼說的。'
                        ]
                        : [
                            "<18>{#p/papyrus}{#f/4}順便提一嘴，\n其實你壓根繞不過\n那玩意。",
                            "<18>{#p/papyrus}{#f/0}希望你剛才沒真\n傻乎乎地去試。"
                        ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/6}更何況你\n初見就通過了！！！']
                        : SAVE.data.b.undyne_respecc
                            ? [
                                '<18>{#p/papyrus}{#f/5}也許...',
                                '<18>{#p/papyrus}{#f/4}是烈火自己被你\n強悍的氣場嚇退了。'
                            ]
                            : ['<18>{#p/papyrus}{#f/5}我們那麼拼，\n就圖能和你【一樣】\n會解迷題啊。']
        ),
        s_dogs: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}DOGAMY和\nDOGARESSA的\n哨站...',
                '<18>{#p/papyrus}{#f/0}有時候我想知道\n和狗結婚是什麼\n感覺。',
                "<18>{#p/papyrus}{#f/4}雖然，我是永遠\n都不可能知道了，\n因為...",
                "<18>{#p/papyrus}{#f/9}我只願意娶一個\n帥氣的骷髏！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 這...\n  你說的是你自己吧。',
                        "<18>{#p/papyrus}{#f/6}啊？\n你咋會這麼想呢？？",
                        "<25>{#p/undyne}{#f/12}* 這不很明顯嗎？\n* 還有誰能和你一樣帥啊？",
                        '<18>{#p/papyrus}{#f/4}呃，我承認我\n確實長得英俊瀟灑...',
                        "<18>{#p/papyrus}{#f/4}但我們註定是沒戲的！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/6}什麼！？！？\n我們不能結婚！！",
                        ...(SAVE.data.b.flirt_papyrus
                            ? ["<18>{#p/papyrus}{#f/0}我們都說好了\n是不會有結果的，\n還記得嗎？"]
                            : [
                                "<18>{#p/papyrus}{#f/0}我們已經是\n一對酷酷的朋友了啊！",
                                '<18>{#p/papyrus}{#f/5}而且要是我們結婚了...',
                                "<18>{#p/papyrus}{#f/6}我就沒法和你\n做朋友了！"
                            ])
                    ]
                    : ['<18>{#p/papyrus}{#f/4}那樣的一對...\n有點過於強大了。']
        ),
        s_lesser: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這個房間過去是\n用一座橋連接的。',
                '<18>{#p/papyrus}{#f/4}左右兩半，\n在中心相連...',
                '<18>{#p/papyrus}{#f/9}就像兩個很勇敢的\n骷髏的靈魂！',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#p/papyrus}{#f/5}我不知道SANS現在\n在想什麼...",
                        "<18>{#p/papyrus}{#f/4}但我覺得肯定跟\n調味品有很大關係。",
                        "<18>{#p/papyrus}{#f/5}要是他不再對調味品\n念念不忘就好了...",
                        '<18>{#p/papyrus}{#f/7}不然我就得\n好好用雅莫醬\n{@fill=#ff0}醬{@fill=#fff}他一軍了！！'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 對喔， \n  你倆之間是不是\n  有什麼聯結之類的東西？",
                        '<18>{#p/papyrus}{#f/0}從記事起，\n我們就一直是這樣！',
                        '<25>{#p/undyne}{#f/14}* 這倒是讓我想起了些\n  古老的故事...',
                        '<25>{#p/undyne}{#f/17}* ...那是關於\n  一個拿自己做實驗的骷髏的。',
                        '<25>{#p/undyne}{#f/8}* 說不定，\n  你和你的兄弟\n  和他有點關係呢！！',
                        '<18>{#p/papyrus}{#f/1}我，\n在不知情的情況下\n參與了一場實驗！？',
                        "<18>{#p/papyrus}{#f/7}這也太荒唐了！",
                        '<25>{#p/undyne}{#f/15}* ...誰知道呢...'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我希望我還能有\n別的話可說...',
                        "<18>{#p/papyrus}{#f/4}但我現在滿腦子想的\n都是調味品的事。"
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}嗯，\n我現在還真有點好奇\n我的過去了。",
                        "<18>{#p/papyrus}{#f/9}應該只要\n稍微調查一下，\n就能搞清楚了！",
                        "<25>{#p/undyne}{#f/14}* 需要的話，\n  我也可以幫你...",
                        "<18>{#p/papyrus}{#f/5}沒關係，不用了。\n況且，作為衛隊長...",
                        '<18>{#p/papyrus}{#f/4}你已經夠忙的了。'
                    ]
        ),
        s_bros: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}SANS很喜歡那些\n找不同的謎題...',
                '<18>{#p/papyrus}{#f/5}我之前做的找不同\n都很簡單。',
                "<18>{#p/papyrus}{#f/7}但最近的都變得\n幾乎找不到了！",
                '<18>{#p/papyrus}{#f/4}如果不對圖像像素\n進行像素掃描...',
                "<18>{#p/papyrus}{#f/7}根本就沒人能\n解決！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/7}太荒謬了！"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 我覺得這些應該是圖書館\n  那個迷題設計師繪製的。',
                        "<25>{#p/undyne}{#f/11}* ...感覺她認為\n  自己的工作相當無聊。",
                        "<18>{#p/papyrus}{#f/4}這算哪門子迷題...",
                        '<18>{#p/papyrus}{#f/0}看來我得去\n好好「處理」一下了！',
                        '<25>{#p/undyne}{#f/12}* 或許你也可以\n  自己設計一個...？',
                        '<18>{#p/papyrus}{#f/9}我或許可以吧！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}你在尋求\n我的幫助嗎？',
                        '<18>{#p/papyrus}{#f/7}啊，算了！',
                        "<18>{#p/papyrus}{#f/0}反正，\n不公平的謎題\n不值得去解。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 每當我卡在這類迷題上，\n  我就會傳送給Alphys。',
                        "<25>{#p/undyne}{#f/14}* 她有個什麼高級的\n  圖像減影工具。",
                        '<18>{#p/papyrus}{#f/0}什麼，減影？',
                        '<18>{#p/papyrus}{#f/4}...「對比」這個詞\n會更加準確吧？',
                        '<25>{#p/undyne}{#f/8}* 總之，那玩意確實能\n  減輕我頭疼的程度！'
                    ]
        ),
        s_spaghetti: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}有人說那房間裡的\n微波爐...',
                '<18>{#p/papyrus}{#f/0}有一個所謂的\n「隱藏功能」。',
                '<18>{#p/papyrus}{#f/5}不過，大多數人\n不知道的是...',
                '<18>{#p/papyrus}{#f/4}它發出的「微」波...\n實際上是\n「微」小的引力波。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 我還以為我的「熱冰箱」\n  已經夠顛覆常識的了。',
                        '<25>{#p/undyne}{#f/8}* 沒想到這個「引力微波爐」\n  才是真的逆天啊！',
                        '<25>{#p/undyne}{#f/11}* ...或者說，\n  其實那盤義大利麵\n  要更逆天點？',
                        '<18>{#p/papyrus}只有在被用來舉起\n這樣美味的佳餚時，\n才能體現這玩意的好。',
                        '<18>{#p/papyrus}{#f/6}但是等等！！\n如果引力波太大...',
                        "<18>{#p/papyrus}{#f/6}它就會變成\n一個飛天意面怪的！",
                        "<25>{#p/undyne}{#f/14}* ...我可以考慮\n  信一下這個教。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}要是有辦法把它\n關掉就好了。']
                    : [
                        '<18>{#p/papyrus}{#f/5}說到飛天意面怪啊...',
                        '<18>{#p/papyrus}{#f/0}我還是想讓\n我的義大利麵\n老老實實地待著。',
                        '<18>{#p/papyrus}{#f/0}被漂漂亮亮地\n放在盤子裡，\n作為我高超廚藝的證明...',
                        '<18>{#p/papyrus}{#f/4}並等著被吃掉。'
                    ]
        ),
        s_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}嗯... 這個\n謎題的解法...？',
                '<18>{#p/papyrus}{#f/5}呃，有的時候\n我就直接從雷射上\n跨過去了。',
                '<18>{#p/papyrus}{#f/0}所以，其中一個解法\n就是要又高又帥！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...如果你個子太小\n絕對不要這樣做。"]
                    : [
                        '<25>{#p/undyne}{#f/8}* 另一個解法就是用\n  你的噴氣背包飛過去！！',
                        "<18>{#p/papyrus}{#f/4}但噴氣背包\n不一定是萬能的。",
                        '<18>{#p/papyrus}{#f/7}要是你突然想\n欣賞風景怎麼辦？',
                        '<25>{#p/undyne}{#f/16}* ...',
                        '<25>{#p/undyne}{#f/16}* 活了這麼久我哪天沒有\n  「欣賞風景」啊，\n  Papyrus。',
                        "<25>{#p/undyne}{#f/17}* 你就不會覺得膩嗎！？",
                        '<18>{#p/papyrus}{#f/6}才不會呢！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}我在做這個迷題了..."]
                    : [
                        '<18>{#p/papyrus}{#f/5}嗯...',
                        '<18>{#p/papyrus}{#f/0}UNDYNE真該\n買臺望遠鏡。',
                        '<18>{#p/papyrus}{#f/4}聽說我的兄弟\n正好在發放著\n會員資格呢...'
                    ]
        ),
        s_puzzle2: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}有人告訴我說\n這些謎題有一個\n訣竅...",
                "<18>{#p/papyrus}{#f/5}涉及到在瓷磚上\n顯示的內容。",
                '<18>{#p/papyrus}{#f/6}...我還以為這是個\n猜謎遊戲呢！',
                '<18>{#p/papyrus}{#f/0}你看，今天又學到\n新東西了。',
'<18>{#p/papyrus}{#f/0}再接再厲！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 你有沒有聽說Asgore\n  最近發布的那個命令？',
                        '<25>{#p/undyne}{#f/16}* 說什麼雷射\n  對於小孩來說\n  「危險」、「有害」。',
                        '<18>{#p/papyrus}{#f/6}嗯，\n他說的確實有道理...',
                        '<25>{#p/undyne}{#f/4}* 別吧！\n* 這真是把樂趣\n  都給剝奪光了。',
                        '<25>{#p/undyne}{#f/12}* 我，呃，\n  小時候還經常玩\n  那些東西呢。',
                        '<18>{#p/papyrus}{#f/0}...啊。',
                        '<18>{#p/papyrus}{#f/4}也難怪你會覺得\n拿命去冒險\n會很「好玩」了。',
                        "<25>{#p/undyne}{#f/14}* 誰不覺得呢！？！？",
                        '<18>{#p/papyrus}{#f/6}呃...\n我？？？'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}等下，這是我\n兄弟的臺詞..."]
                    : [
                        "<18>{#p/papyrus}{#f/4}拿命去冒險\n是一回事...",
                        '<18>{#p/papyrus}{#f/7}白白浪費生命\n就是另一回事了！'
                    ]
        ),
        s_jenga: pager.create(
            0,
            () =>
                SAVE.data.b.s_state_puzzlenote
                    ? [
                        '<18>{#p/papyrus}{#f/5}喔？\n這個迷題啊。',
                        '<18>{#p/papyrus}{#f/5}我們永遠也不會知道\n它會給出什麼結果。',
                        '<18>{#p/papyrus}{#f/4}事實上，我現在\n唯一知道的事是...',
                        '<18>{#p/papyrus}{#f/5}實事求是的話，\n這下我們什麼事\n都不知道了！',
                        ...(solo()
                            ? ['<18>{#p/papyrus}{#f/6}哇！！！']
                            : [
                                '<25>{#p/undyne}{#f/1}* 這有點像個繞口令。',
                                "<18>{#p/papyrus}{#f/7}啥啊！？\n骷髏明明\n連舌頭都沒有！",
                                '<25>{#p/undyne}{#f/17}* 呃，這還用說嗎。',
                                "<25>{#p/undyne}{#f/16}* 這... 只是一種比喻。",
                                "<18>{#p/papyrus}{#f/4}嗯...\n想想看，\n骷髏不會有舌頭...",
                                '<18>{#p/papyrus}{#f/5}而黃色小星星\n卻可以有。',
                                '<25>{#p/undyne}{#f/12}* 你到底在說啥啊？',
                                '<18>{#p/papyrus}{#f/6}...沒什麼！！！'
                            ])
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/5}起初，這個謎題\n結果讓我\n大失所望...",
                        '<18>{#p/papyrus}{#f/4}但後來，我就\n意識到了...',
                        '<18>{#p/papyrus}{#f/0}發生這種事情的\n概率很低...',
                        '<18>{#p/papyrus}{#f/9}...所以我們可能是\n僅有的見證了\n這一幕的人！！',
                        '<18>{#p/papyrus}{#f/0}你現在覺得\n很幸運了吧。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/12}* 你還不明白嗎？",
                                '<18>{#p/papyrus}{#f/0}明白啥？',
                                "<25>{#p/undyne}{#f/1}* 這種情況是\n  專門有個說法的。",
                                '<25>{#p/undyne}{#f/1}* 叫「揮汗如雨，顆粒無收」。',
                                '<25>{#p/undyne}{#f/14}* 搞那些複雜的規則，\n  還鋪墊大半天...',
                                '<25>{#p/undyne}{#f/12}* 結果毛用沒有，\n  最後就只出來了\n  一個巨大的臃腫的零。',
                                "<18>{#p/papyrus}{#f/0}我不明白\n你在說什麼，\n但是...",
                                '<18>{#p/papyrus}{#f/7}...等等，\n【你】怎麼知道\n這裡發生了啥的？',
                                "<25>{#p/undyne}{#f/15}* 呃... 我可能之前\n  去實驗室那邊轉了轉，\n  然後...",
                                '<18>{#p/papyrus}{#f/7}你在監視我！？',
                                '<25>{#p/undyne}{#f/8}* 沒說是你，\n  Papyrus！！',
                                '<18>{#p/papyrus}{#f/4}喔。',
                                '<18>{#p/papyrus}{#f/7}...所以你在\n監視人類！？！？',
                                "<25>{#p/undyne}{#f/17}* 我可是皇家衛隊的隊長！！\n* 你以為呢！"
                            ])
                    ],
            () =>
                solo()
                    ? SAVE.data.b.s_state_puzzlenote
                        ? ['<18>{#p/papyrus}{#f/5}噢天啊，\n我們真是還有很多\n未知或忘卻的事啊...']
                        : ['<18>{#p/papyrus}幸運女神站在我們\n這邊，人類！']
                    : SAVE.data.b.s_state_puzzlenote
                        ? ['<18>{#p/papyrus}{#f/5}怪物的生理構造\n真奇怪。']
                        : ['<18>{#p/papyrus}就算母星「克裡」\n沒能收穫「顆粒」，\n但咱也挺幸運，是吧？']
        ),
        s_pacing: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}CANIS MINOR的\n哨站。',
                '<18>{#p/papyrus}{#f/4}也是那些月巖商人\n喜歡的地方。',
                '<18>{#p/papyrus}{#f/5}嗯... 我想知道\n那些巖石都是用\n什麼做成的。',
                "<18>{#p/papyrus}{#f/4}肯定不是用\n月亮做的，\n因為...",
                '<18>{#p/papyrus}{#f/7}月亮本身就是個\n巨大的巖石啊！',
                '<18>{#p/papyrus}{#f/5}這是不是就意味著\n月亮本身就是\n月巖呢？',
                '<18>{#p/papyrus}{#f/5}那「月亮」和「月巖」\n區別在哪？',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* Papyrus，\n  我覺得這種問題\n  是沒有標準答案的。",
                        "<25>{#p/undyne}{#f/7}* ...不過這並不代表\n  你不該思考這個問題！！",
                        '<25>{#p/undyne}{#f/1}* 這種問題特別能\n  鍛鍊腦子！',
                        '<25>{#p/undyne}{#f/14}* 腦子可是你體內\n  最重要的那塊肌肉。',
                        '<18>{#p/papyrus}{#f/4}對人類來說\n或許是這樣...',
                        "<18>{#p/papyrus}{#f/7}但對怪物來說，\n可就不一樣了！",
                        '<25>{|}{#p/undyne}{#f/12}* 我知道，\n  我只是想讓那人\n  更容易理解-{%}',
                        "<18>{#p/papyrus}{#f/0}你看，\n怪物其實不是用\n腦子來思考的。",
                        "<18>{#p/papyrus}{#f/4}更像是...\n用個靈魂那樣的東西。",
                        '<25>{#p/undyne}{#f/1}* 怪物把靈魂用走了，\n  正好給人類\n  剩了個零「頭」。',
                        '<18>{#p/papyrus}{#f/7}老天啊！！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}也許我們凡人\n不值得了解這些\n知識。']
                    : ['<25>{#p/undyne}{#f/12}* 以後就叫我「喻姐」吧。', "<18>{#p/papyrus}{#f/0}別吧。"]
        ),
        s_puzzle3: pager.create(
            0,
            [
                '<18>{#p/papyrus}{#f/5}所以...\n這裡發生的事...',
                '<18>{#p/papyrus}{#f/5}...',
                "<18>{#p/papyrus}{#f/4}咱還是別提\n這個謎題了吧。"
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}...']
                    : [
                        "<25>{#p/undyne}{#f/12}* ...沒那麼糟吧？",
                        '<18>{#p/papyrus}{#f/5}真的。',
                        '<18>{#p/papyrus}{#f/4}真的糟透了。',
                        '<25>{#p/undyne}{#f/11}* ...好吧，\n  聽你的...'
                    ],
            () => (solo() ? ['<18>{#p/papyrus}{#f/4}...'] : ['<25>{#p/undyne}{#f/7}* 他都說了別提這個了！！'])
        ),
        s_greater: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}CANIS MAJOR的\n哨站...',
                '<18>{#p/papyrus}{#f/5}那隻狗有一顆\n金子般的心。',
                '<18>{#p/papyrus}{#f/4}要是【我】加入\n皇家衛隊就好了...',
                "<18>{#p/papyrus}{#f/0}這樣我就能\n報答它的好意了！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 如果你願意的話，\n  我可以幫你報答它。',
                        "<18>{#p/papyrus}{#f/7}我自己做\n才會更有意義！",
                        "<25>{#p/undyne}{#f/17}* 那你不能等它回家的時候\n  再報答嗎！？",
                        "<18>{#p/papyrus}{#f/7}在它工作的地方報答\n才更有意義！",
                        "<25>{#p/undyne}{#f/1}* 你說得對。\n* 那我就讓你以全息影像的\n  方式出現在那裡吧。",
                        '<18>{#p/papyrus}{#f/7}哼！！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}真可惜我可能\n永遠加入不了\n皇家衛隊了。"]
                    : ['<18>{#p/papyrus}{#f/7}面對面交談的作用\n是任何方式\n都無法比擬的！']
        ),
        s_math: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}數學【一直】是\n我最頭疼的東西。',
                '<18>{#p/papyrus}{#f/5}又是微積分，\n又是幾何學...',
                '<18>{#p/papyrus}{#f/4}用指骨數數不好嗎？',
                '<18>{#p/papyrus}{#f/7}所有的「高等」數學\n都是完全沒有\n必要的！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 你咋還真這麼想啊？",
                        "<25>{#p/undyne}{#f/17}* 要是沒有高等數學，\n  我們現在就還會\n  活在黑暗時代呢！",
                        "<25>{#p/undyne}{#f/16}* 不過話說回來，\n  那樣的話，我們說不定\n  還能住在故園的星球上...",
                        '<18>{#p/papyrus}{#f/5}我明白，我明白...',
                        "<18>{#p/papyrus}{#f/7}我只是\n不喜歡做數學題！",
                        "<25>{#p/undyne}{#f/14}* 噢別吧。\n  這我完全同意。"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}如果你真的需要\n高等數學方面的\n幫助...',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}那就沒有比\nALPHYS博士更\n適合的人選了！",
                        "<18>{#p/papyrus}{#f/4}大家都說她像個\n行走的計算器...",
                        '<18>{#p/papyrus}{#f/0}而且是很科學的\n那種！'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 找Alphys博士就行了？',
                        '<18>{#p/papyrus}{#f/9}哇，\n我怎麼就沒想到呢！！',
                        '<18>{#p/papyrus}{#f/4}...噢等等。',
                        "<18>{#p/papyrus}{#f/4}這是因為\n她幫你整理了\n所有的報告。",
                        "<25>{#p/undyne}{#f/17}* 她確實挺會排日程的，\n  好嗎？？"
                    ])
            ]
        ),
        s_bridge: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}還記得那個\n「致命恐怖\n大挑戰」嗎？',
                '<18>{#p/papyrus}{#f/4}不知道你信不信，\n其實還有個\n秘密的第七武器。',
                "<18>{#p/papyrus}{#f/6}那東西真的會讓你\n魂飛魄散的！",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...']
                    : [
                        "<25>{#p/undyne}{#f/12}* 那能讓人目瞪口呆的呢？",
                        "<18>{#p/papyrus}{#f/0}實際上，那是我\n超秘密的第八武器。",
                        '<25>{#p/undyne}{#f/1}* 喔。\n* 聽起來很危險啊。',
                        "<18>{#p/papyrus}{#f/6}不然你以為我\n為啥沒把它用上！？"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}...字面意義上的！！']
                    : [
                        "<18>{#p/papyrus}{#f/4}我都還沒開始說...",
                        '<18>{#p/papyrus}{#f/4}那個超級無敵秘密的\n第十武器呢。',
                        '<18>{#p/papyrus}{#f/6}...等等，我把\n究級秘密的第九武器\n給忘了！',
                        '<18>{#p/papyrus}{#f/0}那玩意絕對能\n嚇掉你的下巴。'
                    ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}幸好我沒用上它啊，\n對吧？",
                        '<18>{#p/papyrus}{#f/4}更別提我還有\n其它二十種武器呢。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}嚇掉你的衣服鞋子\n也不在話下...',
                        '<18>{#p/papyrus}{#f/6}...最後啊，\n你整個人都會被嚇暈！'
                    ]
        ),
        s_town1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}星港小鎮：\n北側！',
                "<18>{#p/papyrus}{#f/5}是我不會花很多\n時間的一側。",
                '<18>{#p/papyrus}{#f/4}然而，SANS就...',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/4}...好吧，你可以\n大概猜一下他為什麼\n喜歡這裡。']
                    : [
                        "<25>{#p/undyne}{#f/14}* ...他喜歡Grillby's的\n  美味新品！",
                        '<18>{#p/papyrus}{#f/4}什麼？\n美味新品？',
                        '<18>{#p/papyrus}{#f/5}那【確實】是\n比以前好吃點了...',
                        '<18>{#p/papyrus}{#f/7}但還是比不上\n在家做的意面啊！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}跟GRILLBY'S是\n有關係的喔。"]
                    : [
                        '<18>{#p/papyrus}{#f/5}他要是能珍惜點\n我為他做的一切\n就好了。',
                        '<18>{#p/papyrus}{#f/6}好兄弟嘛，\n對吧。'
                    ]
        ),
        s_taxi: pager.create(
            0,
            () => [
                ...(SAVE.data.n.plot < 65
                    ? [
                        '<18>{#p/papyrus}{#f/0}今天運輸船\n還開嗎？',
                        '<18>{#p/papyrus}{#f/5}嗯... 一般來說\n晚些時候會\n過來的。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}我聽說\n運輸船終於開了！',
                        "<18>{#p/papyrus}{#f/5}嗯...\n這說明現在是\n「晚些時候」了。"
                    ]),
                '<18>{#p/papyrus}{#f/6}至於如何分辨\n「早些時候」和\n「晚些時候」...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...我回頭再\n跟你講。"]
                    : [
                        '<25>{#p/undyne}{#f/12}* 呃...\n  這是你瞎編的吧。',
                        '<25>{#p/undyne}{#f/17}* 前哨站壓根就沒有\n  「晚些時候」這種說法。',
                        '<18>{#p/papyrus}{#f/4}沒錯...',
                        '<18>{#p/papyrus}{#f/9}...但現在有了！',
                        '<18>{#p/papyrus}{#f/9}總有一天，\n所有人都會採用\n我的計時方法！',
                        "<18>{#p/papyrus}{#f/0}這將是一場\n偉大的計時改革！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}會講的！！！']
                    : [
                        '<18>{#p/papyrus}{#f/4}為了召開我們的\n第一次改革會議...',
                        "<18>{#p/papyrus}{#f/0}我們需要確定\n一個具體的時間點。",
                        "<18>{#p/papyrus}{#f/9}別擔心！\n我會告訴參會者們...",
                        '<18>{#p/papyrus}{#f/9}...在「早些時候」\n到達！',
                        '<25>{#p/undyne}{#f/1}* 那他們怎麼知道\n  那是啥時候啊？',
                        '<18>{#p/papyrus}{#f/4}對喔...',
                        "<18>{#p/papyrus}{#f/0}看來我們得在會上\n討論這個問題。"
                    ]
        ),
        s_town2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}星港小鎮：\n南側！',
                '<18>{#p/papyrus}{#f/4}或者我也喜歡\n叫做...',
                '<18>{#p/papyrus}{#f/9}宇宙中最好的\n一側！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 這還用說，\n  你自己都住這。',
                        '<18>{#p/papyrus}{#f/4}不僅如此...',
                        "<18>{#p/papyrus}{#f/0}GRILLBY'S\n還不在這！！"
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/4}難怪會有一個\n友好的幽靈\n在這裡開店...",
                "<18>{#p/papyrus}{#f/9}誰不想接近\n這偉大的一邊呢？",
                "<18>{#p/papyrus}{#f/0}我肯定是\n沒法抗拒的。"
            ]
        ),
        s_battle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/9}你正站在\n我們那場傳奇大戰的\n場地上？',
                "<18>{#p/papyrus}{#f/0}沒事沒事，你繼續。\n這可是個有著\n歷史意義的地方。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 別欣賞太久風景了，\n  小混蛋！",
                        "<25>{#p/undyne}{#f/7}* 你還得去觀摩一下\n  咱倆打那場傳奇大戰的\n  地方！",
                        '<18>{#p/papyrus}{#f/6}那人到底打過\n幾場傳奇大戰啊？',
                        '<25>{#p/undyne}{#f/8}* 誰知道呢！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}總有一天他們會\n把這件事放進\n博物館的..."]
                    : [
                        '<25>{#p/undyne}{#f/1}* 不管現在怎樣...',
                        '<25>{#p/undyne}{#f/7}* 你最好別打出個\n  比我們那場\n  還傳奇的大戰！',
                        '<25>{#p/undyne}{#f/14}* 除非我也上場！\n* 呋呼呼！'
                    ]
        ),
        s_exit: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}你現在得\n小心點...',
                '<18>{#p/papyrus}{#f/0}那邊那扇門是\n鑄廠的入口。',
                '<18>{#p/papyrus}{#f/5}在這樣的地方\n等待你的只有\n黑暗。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 這我不反對。",
                        '<25>{#p/undyne}{#f/16}* 我幾乎一半的時間\n  都把噴氣背包\n  當手電筒用...',
                        '<18>{#p/papyrus}{#f/6}那我給你的\n那些手電筒呢？',
                        '<25>{#p/undyne}{#f/1}* 喔，你說那些啊。',
                        '<25>{#p/undyne}{#f/14}* ...呃，\n  我大概在用噴氣背包時\n  不小心給弄丟了。',
                        '<18>{#p/papyrus}{#f/4}我就知道...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}我剛才提到過\n等待著你的黑暗\n了嗎？']
                    : [
                        "<18>{#p/papyrus}要說我在UNDYNE身上\n學到了什麼...",
                        "<18>{#p/papyrus}{#f/5}那就是\n不管啥事都能扯到\n她的噴氣背包上。",
                        '<18>{#p/papyrus}{#f/4}無論是何時何地\n都一個樣...',
                        "<18>{#p/papyrus}{#f/5}她總因為那玩意\n而惹上麻煩。",
                        "<25>{#p/undyne}{#f/14}* 即使如此，你這不也能\n  接受我的怪癖，\n  沒有排斥我嗎！",
                        '<25>{#p/undyne}{#f/17}* 對吧？',
                        '<18>{#p/papyrus}{#f/6}...那肯定啊！！'
                    ]
        ),
        s_grillbys: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}所以...\n這裡是GRILLBY'S。",
                '<18>{#p/papyrus}{#f/5}他們真的安了臺\n雅莫萬用醬\n噴醬機嗎...',
                "<18>{#p/papyrus}{#f/6}就只是為了滿足\n我兄弟奇怪的\n念頭？",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/13}* 啥玩意？',
                        '<18>{#p/papyrus}{#f/4}雅莫萬用醬噴醬機。',
                        '<18>{#p/papyrus}{#f/4}就是用來\n噴雅莫萬用醬的。'
                    ]),
                '<18>{#p/papyrus}{#f/4}...',
                '<18>{#p/papyrus}{#f/4}我通常都對\n我們一族\n抱有希望的，但...',
                '<18>{#p/papyrus}{#f/4}遇到這種事\n就不行了。',
                '<18>{#p/papyrus}{#f/5}...不過。',
                "<18>{#p/papyrus}{#f/5}還好他們把點唱機\n修好了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/8}* 真修好了！？',
                        "<25>{#p/undyne}{#f/7}* 那玩意在我出生前就壞了。"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}第三首是我個人\n最喜歡的。',
                ...(solo() ? [] : ["<25>{#p/undyne}{#f/1}* 我最喜歡第四首！"])
            ]
        ),
        s_backrooms: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}自從他們開始\n在這裡使用複製器...',
                "<18>{#p/papyrus}{#f/5}我就一直不知道\n該怎麼看待這事。",
                '<18>{#p/papyrus}{#f/0}一方面，\n這種新食物\n確實健康。',
                "<18>{#p/papyrus}{#f/7}但另一方面，\n他們完全把烹飪\n放棄掉了！",
                "<18>{#p/papyrus}{#f/4}看到你現在\n所在的這個\n房間了嗎？",
                '<18>{#p/papyrus}{#f/7}猜猜它過去\n是幹什麼的吧！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 這不是Canis Minor\n  平時喜歡待的地方嗎？",
                        '<25>{#p/undyne}{#f/10}* 就它自己...\n* 一個人在這玩牌...',
                        "<18>{#p/papyrus}{#f/4}噢，這沒事的。\n它那樣挺開心的。",
                        '<18>{#p/papyrus}{#f/0}它好像有一套\n自己的生活規劃...',
                        '<18>{#p/papyrus}{#f/9}就包括打牌！！\n以及要好多摸頭！',
                        "<25>{#p/undyne}{#f/14}* 關於摸頭，\n  你說得可太對了。",
                        '<25>{#p/undyne}{#f/17}* 有一回它闖進\n  皇家衛隊的會議，\n  就只是為了要摸摸！',
                        '<18>{#p/papyrus}{#f/6}有意思！！\n那你們怎麼做的？',
                        '<25>{#p/undyne}{#f/12}* 嗯...\n  我們大家把它的頭\n  摸了不少下呢。',
                        "<25>{#p/undyne}{#f/8}* 怎麼可能不摸呢！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}是某種「廚房」...',
                        '<18>{#p/papyrus}{#f/5}現在他們只把這裡\n當成玩私人紙牌\n遊戲的地方了。'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/4}如果他們不打算\n把這裡當廚房...",
                        '<18>{#p/papyrus}{#f/5}也許搞個摸頭機\n要更好。'
                    ]
        ),
        s_bonehouse: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}還有什麼地方能\n比我家更好呢！',
                "<18>{#p/papyrus}{#f/0}我們有超高水槽...\n還有寵物月巖...",
                '<18>{#p/papyrus}{#f/9}甚至還有個陽臺，\n多適合戶外生活！',
                "<18>{#p/papyrus}{#f/0}我基本只有在這\n才會有家的感覺。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 我本想說我家也不錯，\n  但... 你知道的。",
                        '<18>{#p/papyrus}{#f/5}是啊...\n沒家肯定會不好受。',
                        '<18>{#p/papyrus}{#f/6}...話說，\n現在哪裡可以讓你\n感覺像在家啊？',
                        "<25>{#p/undyne}{#f/1}* 想聽真話嗎？\n* 這裡就挺好的！",
                        "<18>{#p/papyrus}{#f/5}但... 怎麼會呢？\n我們只是在\n幹站著啊！",
                        "<25>{#p/undyne}{#f/14}* 只要和你在一塊，\n  哪兒都是家。\n* 呋呼呼。",
                        '<18>{#p/papyrus}{#f/5}...你認真的嗎？',
                        '<25>{#p/undyne}{#f/8}* 當然了！！',
                        "<18>{#p/papyrus}{#f/8}不-不...！！\n你要把我弄哭了！"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}不知道現在\n人類是怎麼稱呼\n「家」的。',
                '<18>{#p/papyrus}{#f/4}據我所知，\n他們還生活在\n地球上...',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 事實上，\n  聽說地球已經一團糟了。',
                        '<25>{#p/undyne}{#f/12}* ...我在皇家實驗室那邊\n  聽說的。',
                        '<25>{#p/undyne}{#f/13}* 他們好像找到了什麼\n  關於自然災害的「證據」...'
                    ])
            ]
        ),
        s_papyrusroom: pager.create(
            0,
            () =>
                SAVE.data.n.plot_date < 1.1
                    ? [
                        '<18>{#p/papyrus}哇，你只花了四秒鐘\n就給我打電話了！',
                        '<18>你一定非常需要\n我的幫助！！！',
                        "<18>{#p/papyrus}{#f/9}但不要害怕。\n這是PAPYRUS的\n熱線電話！",
                        '<18>{#p/papyrus}{#f/9}只需要描述一下\n你的位置，然後...',
                        '<18>{#p/papyrus}{#f/4}...等等。',
                        "<18>{#p/papyrus}{#f/6}你還在我的\n房間裡？？",
                        '<18>{#p/papyrus}{#f/5}...',
                        '<18>{#p/papyrus}{#f/5}你有沒有聽說過一種\n叫做... 門的東西？',
                        "<18>{#p/papyrus}{#f/6}別著急！！\n我會給你畫個\n圖解的！"
                    ]
                    : SAVE.data.n.plot_date < 1.2
                        ? [
                            "<18>{#p/papyrus}{#f/1}啥？？\n我以為你早就\n離開我房間了！！",
                            "<18>{#p/papyrus}{#f/4}看來我們得\n從頭開始了...",
                            '<18>{#p/papyrus}{#f/5}首先，你還知道\nPAPYRUS是\n誰嗎！？'
                        ]
                        : [
                            '<18>{#p/papyrus}{#f/5}所以你\n又回我房間了，\n嗯？',
                            '<18>{#p/papyrus}{#f/5}（唉...）',
                            '<18>{#p/papyrus}{#f/5}只能說這裡\n【確實】蠻酷的。',
                            ...(solo()
                                ? []
                                : [
                                    '<25>{#p/undyne}{#f/1}* 那我的房間呢？',
                                    "<18>{#p/papyrus}{#f/4}嗯...\n那房間很熱。",
                                    '<18>{#p/papyrus}{#f/4}事實上，\n都著火了。',
                                    '<25>{#p/undyne}{#f/17}* 很好！！\n* 我就喜歡熱乎的東西！'
                                ])
                        ],
            () =>
                SAVE.data.n.plot_date < 1.1
                    ? ["<18>{#p/papyrus}{#f/6}堅持住！\n我還在畫！"]
                    : SAVE.data.n.plot_date < 1.2
                        ? ['<18>{#p/papyrus}{#f/1}【我】還知道\nPAPYRUS是\n誰嗎！？！？']
                        : [
                            ...(solo()
                                ? [
                                    "<18>{#p/papyrus}{#f/6}嘿，呃，\n既然你在那...",
                                    '<18>{#p/papyrus}{#f/6}能不能幫我照顧下\n我的那些動作玩偶？？',
                                    "<18>{#p/papyrus}{#f/5}他們最近...\n好像有點寂寞了。",
                                    '<18>{#p/papyrus}{#f/5}...謝了。'
                                ]
                                : ["<25>{#p/undyne}{#f/8}* 尤其是\n  當它們著火的時候！！！"])
                        ]
        ),
        s_innterior: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}旅館是個好地方。",
                '<18>{#p/papyrus}床很舒服，\n旅館的老闆娘\n人就更好了。',
                '<18>{#p/papyrus}{#f/5}但我最喜歡的，\n還是牆上的那個\n照片...',
                "<18>{#p/papyrus}{#f/0}它時刻提醒我們\n怪物的真正能耐\n是怎樣的。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 這也是最有名的\n  關於故園的照片之一了...",
                        '<25>{#p/undyne}{#f/9}* 僅存的幾張照片之一啊。',
                        "<18>{#p/papyrus}{#f/5}...你覺得我們\n還能找到其它的嗎？",
                        "<25>{#p/undyne}{#f/1}* 嗯，\n  要是我們有什麼方法\n  能掃描怪物的記憶就好了...",
                        '<26>{#p/undyne}{#f/14}* 我們就可以找個\n  以前住那的怪物\n  掃描一下！',
                        '<18>{#p/papyrus}{#f/0}啊...\n聽上去真不錯！',
                        '<18>{#p/papyrus}{#f/4}...要是我們\n真有法子就好了。',
                        "<18>{#p/papyrus}{#f/4}然而我們沒有。",
                        '<18>{#p/papyrus}{#f/4}太悲哀了。'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}要是我們能回到\n過去就好了...']
                    : [
                        '<18>{#p/papyrus}{#f/5}我覺得，\n眼下啊...',
                        '<18>{#p/papyrus}{#f/4}只能互相\n講講睡前故事了。',
                        "<25>{#p/undyne}{#f/1}* 對喔，\n  Sans不是經常跟你講嗎？",
                        "<18>{#p/papyrus}{#f/0}當然了！\n那些故事簡直就是\n想像力的源泉！",
                        '<25>{#p/undyne}{#f/1}* 想像一下，\n  你要是能找個來自故園的人\n  給你講故事...',
                        '<25>{#p/undyne}{#f/14}* 那樣的人絕對能給你講上\n  幾百個超棒的睡前故事！',
                        '<18>{#p/papyrus}那還用說！'
                    ]
        ),
        s_beddinng: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}有的時候，\nSANS會給我讀一個\n睡前故事。',
                '<18>{#p/papyrus}{#f/5}你聽說過\n《偉大的怪物》嗎？',
                '<18>{#p/papyrus}{#f/6}SANS昨晚給我講了\n這個故事，然後...',
                "<18>{#p/papyrus}{#f/8}...呃啊！\n我就哭得\n停不下來了！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/10}* 哎喲...\n* 那確實是個悲劇。",
                        '<25>{#p/undyne}{#f/16}* 尤其是它還是個人類寫的。',
                        '<18>{#p/papyrus}{#f/6}...難道人類寫的書裡\n故事都這麼悲慘嗎？',
                        "<25>{#p/undyne}{#f/14}* 這我就不知道了。\n* 我就讀過這一本。",
                        '<25>{#p/undyne}{#f/15}* 呃，除非你把\n  Alphys前幾天發的\n  那些「書」也算上...',
                        "<18>{#p/papyrus}{#f/4}...那些\n我一點也不想聽。"
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/4}下一次，我就讓\nSANS講一個\n開心的故事了。",
                '<18>{#p/papyrus}{#f/6}要有一個\n【真正】意義上的\n幸福結局！',
                '<18>{#p/papyrus}{#f/5}每個人都該\n適得其所！！',
                '<18>{#p/papyrus}{#f/7}每個人都不用\n失去性命，\n不用道別！！！'
            ]
        ),
        s_librarby: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}噓...\n（圖書倌裡是不能\n打電話的！）',
                "<18>{#p/papyrus}{#f/0}（不過可以等你出來\n之後再給我打\n電話！）",
                ...(solo() ? [] : ['<25>{|}{#p/undyne}{#f/8}* 呀哈哈讓我們嗨起-{%}'])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}（你認真的嗎...）']
                    : [
                        '<18>{#p/papyrus}{#f/4}（對了，\n我得掛掉電話，\n免得Undyne吵到你。）',
                        '<25>{|}{#p/undyne}{#f/8}* 呀- {%}'
                    ]
        ),
        f_start: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}看看鑄廠裡\n這不祥的氣氛。',
                '<18>{#p/papyrus}{#f/4}他們說管道裡\n住著怪物...',
                "<18>{#p/papyrus}{#f/0}說得絕對沒錯！",
                '<18>{#p/papyrus}{#f/5}有些怪物確實喜歡\n潮溼骯髒的環境。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}我就不一樣！！']
                    : [
                        "<25>{#p/undyne}{#f/1}* 我把這些管子當成攀爬架爬\n  希望他們不要介意。",
                        '<25>{#p/undyne}{#f/8}* 我一直都把這東西\n  當攀爬架用的！',
                        '<18>{#p/papyrus}{#f/6}UNDYNE，喔不！\n好可憐的管道居民啊！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}我更喜歡在生活中\n衛生一點。']
                    : ['<18>{#p/papyrus}{#f/6}以後請輕攀慢爬。']
        ),
        f_sans: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在這\n有一個工作站。',
                '<18>{#p/papyrus}{#f/4}事實上，\n他同時管理兩個站點。',
                "<18>{#p/papyrus}{#f/0}很驚人，是吧？",
                '<18>{#p/papyrus}{#f/0}他偷懶的次數\n是平時的兩倍！！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 聽起來他沒少看啊。",
                        '<18>{#p/papyrus}{#f/0}啊，對...沒少看。',
                        '<18>{#p/papyrus}{#f/4}確實沒少看網上的影片\n啥的。',
                        "<25>{#p/undyne}{#f/3}* ...我想知道他是不是\n  《喵喵航天行》的粉絲。",
                        "<18>{#p/papyrus}{#f/7}那不是重點！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我們醒著的人只能\n夢想擁有這樣的\n懶惰...']
                    : [
                        "<18>{#p/papyrus}{#f/5}就連UNDYNE都被SANS的\n壞習慣影響了...",
                        '<25>{#p/undyne}{#f/17}* 我沒有！！',
                        "<18>{#p/papyrus}{#f/4}...上班的時候別看，行嗎？",
                        '<25>{#p/undyne}{#f/17}* 好啦！！'
                    ]
        ),
        f_corridor: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}你的次元箱裡\n有什麼？",
                "<18>{#p/papyrus}{#f/4}實際上，\n不用告訴我。",
                "<18>{#p/papyrus}{#f/7}不然就是公然\n侵犯你的隱私了！",
                ...(solo()
                    ? []
                    : SAVE.data.b.undyne_respecc
                        ? ['<25>{#p/undyne}{#f/17}* ...', "<25>{#p/undyne}{#f/14}* ...啊，還真是。"]
                        : [
                            '<25>{#p/undyne}{#f/8}* 等等，我撤回！\n* 我想知道！',
                            "<25>{#p/undyne}{#f/7}* 你！\n* 你都私藏了什麼啊，小混蛋！？",
                            "<18>{#p/papyrus}{#f/6}啥也沒有！\n就這樣！！",
                            "<25>{#p/undyne}{#f/17}* 誰問你了。",
                            "<25>{#p/undyne}{#f/14}* ...呃，你要是不告訴我，\n  我待會自己去查\n  維度儲存組。",
                            "<18>{#p/papyrus}{#f/6}啥！？\n那玩意真存在啊？",
                            '<18>{#p/papyrus}{#f/5}我就說物品肯定不能\n放進去就憑空消失了...'
                        ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}...至少告訴我\n不是「狗剩」就行。']
                    : [
                        '<18>{#p/papyrus}{#f/4}別跟別人說啊...',
                        "<18>{#p/papyrus}{#f/0}UNDYNE其實不是真的想\n偷你的東西的。",
                        "<25>{#p/undyne}{#f/12}* 我？偷他東西？\n* 噗，你說啥呢！",
                        "<18>{|}{#p/papyrus}看見了吧？\n他沒有-{%}",
                        SAVE.data.b.undyne_respecc
                            ? "<25>{#p/undyne}{#f/14}* 我只會偷那種慫包的\n  東西啦！"
                            : "<25>{#p/undyne}{#f/14}* 我只會偷那種不友好的\n  小混蛋的東西的啦！",
                        "<18>{#p/papyrus}{#f/4}...那你為什麼偷我東西？",
                        "<25>{#p/undyne}{#f/17}* 別想太多啦！"
                    ]
        ),
        f_doge: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}我總聽別人說，\n「生活就如白雲蒼狗，\n 飄忽不定。」",
                '<18>{#p/papyrus}{#f/7}我就納悶了，\n白雲那麼輕，怎麼能\n藏住一隻狗呢...',
                '<18>{#p/papyrus}{#f/5}不過，\n我倒知道這裡\n藏著一隻狗...',
                '<18>{#p/papyrus}{#f/6}她應該就在\n你的附近！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 說起來...',
                        '<25>{#p/undyne}{#f/9}* ...我的一位高級部下Doge\n  今天辭職了。',
                        '<18>{#p/papyrus}{#f/6}喔！\n他們說的「白雲藏狗」\n指的是她嗎？',
                        "<25>{#p/undyne}{#f/1}* 呃，白雲裡藏沒藏狗我不知道，\n  但她確實是一位寶藏隊員。",
                        '<25>{#p/undyne}{#f/16}* 她對我一直忠心耿耿...\n  是我待她不周了。',
                        '<18>{#p/papyrus}{#f/5}啊...',
                        '<18>{#p/papyrus}{#f/6}那就...\n找個機會和她道個歉，\n咋樣？',
                        "<25>{#p/undyne}{#f/12}* ...好，\n  確實是個不錯的起點。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}要是我水槽下面的\n那條狗有這樣的\n優先權就好了...']
                    : ['<18>{#p/papyrus}{#f/0}有顧慮就直接問。', '<18>{#p/papyrus}{#f/9}這招總是很有效！']
        ),
        f_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}小心古人的\n塔架謎題！',
                '<18>{#p/papyrus}{#f/4}雖然他們的建造方法\n很簡陋...',
                '<18>{#p/papyrus}{#f/6}但是設計卻很複雜！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}我們這些怪物\n能解決這些謎題\n可真是個奇蹟。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 這是怪物的智慧。\n* 換做人類就不行了...',
                        '<25>{#p/undyne}{#f/16}* 他們為了這點小破事就\n  跟我們發動了戰爭，\n  真是夠蠢的。',
                        '<18>{#p/papyrus}{#f/6}...塔們也架不住\n這樣折騰啊！',
                        "<25>{#p/undyne}{#f/12}* ...幸好，咱\n  有個超棒的人類\n  來挪這些塔架！",
                        '<18>{#p/papyrus}{#f/0}這回我【總算】\n不用親自出馬了。'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}我好奇人類會不會\n被怪物的謎題難住。']
                    : ['<18>{#p/papyrus}{#f/0}哈！人類也不全是壞的！']
        ),
        f_quiche: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我兄弟前幾天\n來過這裡...',
                '<18>{#p/papyrus}{#f/5}說他得送點\n東西過來。',
                '<18>{#p/papyrus}{#f/5}我問他要送什麼，\n他給了我一個挑戰...',
                '<18>{#p/papyrus}{#f/4}說要讓我想\n一{@fill=#ff0}支世{@fill=#fff}俗的笑話。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 我應該知道它是什麼意思，\n  Papyrus。',
                        '<18>{#p/papyrus}{#f/6}啥！？\n說來聽聽？',
                        '<25>{#p/undyne}{#f/1}* 啊，得了吧。\n* 我還能有你了解你兄弟啊？\n  你不想解就直說嘛！',
                        '<25>{#p/undyne}{#f/12}* {@fill=#ff0}但高{@fill=#fff}手可不能臨陣脫逃啊！\n  Papyrus！',
                        '<18>{#p/papyrus}{#f/5}呃...\n芝士謎語...',
                        '<18>{#p/papyrus}{#f/4}搭配上蛋糕...'
                    ])
            ],
            ["<18>{#p/papyrus}{#f/6}等我想到答案了\n很快就來找你！"]
        ),
        f_puzzle2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}通常情況下，\n如果你沒花時間\n好好讀牌子的話...',
                "<18>{#p/papyrus}{#f/5}你可能是解不開\n謎題的。",
                "<18>{#p/papyrus}{#f/6}你以為僅憑直覺就\n可以了，但是...\n完全不夠！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}...我已經沒少\n因為這個尷尬了..."]
                    : [
                        '<25>{#p/undyne}{#f/14}* 是啊，逼人讀牌子，有夠煩。',
                        '<25>{#p/undyne}{#f/8}* 換做我就直接把矛往\n  接收器上丟，收工！',
                        "<18>{#p/papyrus}{#f/6}那謎題不就壞了嗎！？",
                        '<25>{#p/undyne}{#f/14}* 沒壞，我也很驚訝。',
                        '<25>{#p/undyne}{#f/14}* 人造謎題比人類還要耐磨。',
                        "<25>{#p/undyne}{#f/7}* 信我。\n* 我也不是沒試過故意破壞。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}我以前說過，\n我還要再說一遍。",
                        '<18>{#p/papyrus}{#f/9}讀！\n標！！\n牌！！！',
                        '<18>{#p/papyrus}{#f/4}注意我的感嘆號\n用得越來越多。',
                        "<18>{#p/papyrus}{#f/7}意思就是說這\n非常重要！！！！"
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}呃，一句老話說得好...',
                        "<18>{#p/papyrus}{#f/0}砸不壞，就解開！",
                        '<18>{#p/papyrus}{#f/5}真是繞了好大一圈。'
                    ]
        ),
        f_story1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}訊星真的很厲害，\n對吧？',
                '<18>{#p/papyrus}{#f/5}不過，它們會\n周期性地重置。',
                '<18>{#p/papyrus}{#f/4}在重置之前，\n只能保留一條訊息...',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* 所以我想傳給Alphys資訊的\n  計畫才失敗了的。",
                        '<18>{#p/papyrus}{#f/6}你用訊星給ALPHYS傳過\n信！？',
                        '<18>{#p/papyrus}{#f/5}噢...\nUNDYNE...',
                        "<25>{#p/undyne}{#f/17}* 怎麼？\n* 我就還以為它知道要給誰\n  說呢！",
                        "<25>{#p/undyne}{#f/11}* 訊星以前不就是這樣的嗎？？",
                        '<18>{#p/papyrus}{#f/0}啊，其實不是。',
                        '<18>{#p/papyrus}{#f/4}他們剛發芽的時候...',
                        '<18>{#p/papyrus}{#f/9}他們就很容易受到外界\n影響！',
                        '<18>{#p/papyrus}{#f/5}然後，他們一點點生長，\n接收資訊的速度也越來\n越慢。',
                        '<25>{#p/undyne}{#f/1}* 哈。\n* 真迷人！',
                        "<25>{#p/undyne}{#f/12}* 那我得換個法子了。"
                    ])
            ],
            ["<18>{#p/papyrus}{#f/4}這通電話\n【應該】不會被錄下來吧。"]
        ),
        f_prechase: pager.create(
            0,
            () =>
                SAVE.data.n.plot < 37.11
                    ? []
                    : SAVE.data.n.plot < 48
                        ? [
                            '<18>{#p/papyrus}這裡以前有一座橋的，\n但是橋塌了。',
                            "<18>{#p/papyrus}{#f/5}希望他們很快能\n建一座新橋...",
                            '<18>{#p/papyrus}{#f/6}站在一個脆弱的\n浮動平臺上\n太嚇人了！'
                        ]
                        : [
                            '<18>{#p/papyrus}我聽說這裡的工人建了座橋。',
                            '<18>{#p/papyrus}{#f/5}謝宇謝宙...',
                            "<18>{#p/papyrus}{#f/6}我已經受夠\n浮動平臺了！！",
                            ...(solo()
                                ? []
                                : [
                                    "<25>{#p/undyne}{#f/7}* 那是你不懂享受。",
                                    "<18>{#p/papyrus}{#f/4}那可不麼，\n我可沒有火箭背包。",
                                    '<18>{#p/papyrus}{#f/6}我掉下去可咋辦！',
                                    '<25>{#p/undyne}{#f/14}* 人生只有這點樂趣，\n  你甘心嗎？',
                                    "<25>{#p/undyne}{#f/4}* 你就算掉下去了，\n  也摔不死。",
                                    "<25>{#p/undyne}{#f/1}* 撐死也就...四處飄幾天。",
                                    "<25>{#p/undyne}{#f/14}* 我會用噴氣背包\n  撈你上來的！",
                                    "<18>{#p/papyrus}{#f/6}我會用橋試試運氣的，\n謝謝你！"
                                ])
                        ],
            () =>
                SAVE.data.n.plot < 37.11
                    ? []
                    : [
                        '<18>{#p/papyrus}{#f/0}沒有什麼比一座...',
                        '<18>{#p/papyrus}{#f/0}既堅固，又穩定，\n設計又合理的橋\n更安全的了。',
                        '<18>{#p/papyrus}{#f/9}這是對一流工程\n技術的真正證明！！'
                    ]
        ),
        f_chase: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}當我第一次看到\n這個房間時，\n我真的很驚訝。',
                "<18>{#p/papyrus}{#f/4}驚訝到，我找不到\n出去的路了。",
                '<18>{#p/papyrus}{#f/6}...就更別說這裡的\n陷阱了！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 啊對，我都給那些玩意忘了...',
                        "<25>{#p/undyne}{#f/14}* 呃，反正人們基本都知道\n  怎麼走。\n* 不會有事的。",
                        '<18>{#p/papyrus}{#f/6}聽著八成會出事。',
                        "<25>{#p/undyne}{#f/12}* 別擔心啦。\n* 其實，還挺方便的！",
                        '<25>{#p/undyne}{#f/1}* 我覺得犬衛隊都開始\n  把那當訓練場了。',
                        '<18>{#p/papyrus}{#f/4}到底是怎麼訓練的？',
                        '<25>{#p/undyne}{#f/17}* 好像是什麼「戰術性誘惑迴避」？',
                        '<25>{#p/undyne}{#f/12}* 他們在有陷阱的路後面\n  放了點零食，然後讓狗狗們試著\n  避開那些零食。',
                        "<18>{#p/papyrus}{#f/5}我收回之前「八成會出事」\n的觀點。",
                        "<18>{#p/papyrus}{#f/6}現在是十成會出事了！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我覺得還是避開\n恐怖的迷宮遊戲\n比較好。']
                    : [
                        "<25>{#p/undyne}{#f/1}* 其實陷阱已經少很多了。\n* 之前可不止這些。",
                        '<18>{#p/papyrus}{#f/6}之前多少？',
                        '<25>{#p/undyne}{#f/12}* ...\n* 絕對不少。',
                        '<18>{#p/papyrus}{#f/5}多少啊？',
                        '<25>{#p/undyne}{#f/17}* 很多。',
                        '<18>{#p/papyrus}{#f/6}有多多？？',
                        '<25>{#p/undyne}{#f/7}* 夠了！'
                    ]
        ),
        f_entrance: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}你現在在一個叫做...",
                '<18>{#p/papyrus}{#f/9}「暗區」的地方。',
                "<18>{#p/papyrus}{#f/4}你肯定想不到\n它名字的來歷的...",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 你真該謝謝我們怪物界的\n  起名天才——Asgore。\n* 這名是他起的。',
                        '<25>{#p/undyne}{#f/8}* 起名這塊他稱第二，\n  沒人敢稱第一。',
                        '<18>{#p/papyrus}{#f/0}我完全同意！\n所有東西的名字都\n超級容易理解！',
                        "<25>{#p/undyne}{#f/3}* ...你沒開玩笑，對吧？",
                        "<18>{#p/papyrus}{#f/0}那是必然！\n我可很欣賞他的這個\n優點！",
                        '<25>{#p/undyne}{#f/1}* 好喔...',
                        '<18>{#p/papyrus}{#f/0}還有一點，\n你一定深有體會！',
                        "<18>{#p/papyrus}{#f/9}有了他起的名字，\n你就不可能【不】知道\n這東西是幹啥的！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}劇透警告...', "<18>{#p/papyrus}{#f/4}...因為裡面非常暗。"]
                    : ["<18>{#p/papyrus}{#f/0}這不是很有助於理解嗎？"]
        ),
        f_lobby: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}我現在... 完全...\n聯繫不上你！",
                "<18>{#p/papyrus}{#f/6}手機... 絕對...\n出故障了！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}...',
                        "<18>{#p/papyrus}{#f/4}好吧，我承認其實\n並沒有故障。",
                        '<18>{#p/papyrus}{#f/0}...但那臺桌子肯定\n故障了！'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 我覺得，這手機{@fill=#ff0}芝士{@fill=#fff}太累了。\n* 咱倆也得像它一樣\n  吃苦{@fill=#ff0}奶酪{@fill=#fff}才行。',
                        "<18>{#p/papyrus}{#f/5}我感覺不是。\n再吃苦奶酪，\n也不至於{@fill=#ff0}壞了{@fill=#fff}啊。"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}不過，講真的，\n那東西到底是\n什麼情況啊？"]
                    : ["<18>{#p/papyrus}{#f/4}真高興，\nUNDYNE也會玩\n奶酪雙關了。"]
        ),
        f_error: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這件房間標誌著\n你的旅程已經走了一半...',
                '<18>{#p/papyrus}{#f/0}也就是從星港出發開始...',
                '<18>{#p/papyrus}{#f/0}到空境第一層的盡頭。',
                '<18>{#p/papyrus}{#f/5}...不管你接下來\n要去哪裡...',
                '<18>{#p/papyrus}{#f/6}你的旅程【至少】\n已經走完一半了！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/4}* 什麼！？\n* 別這麼說！",
                        "<18>{#p/papyrus}{#f/6}我-我是說，你的旅途終於\n算是開始了！",
                        "<18>{#p/papyrus}{#f/6}你還有好多東西\n沒見識到呢！",
                        '<18>{#p/papyrus}{#f/6}而且還有好多地方\n沒有去到呢！',
                        '<18>{#p/papyrus}{#f/4}最終...',
                        '<18>{#p/papyrus}{#f/9}還有好多朋友\n沒有交到呢！',
                        "<25>{#p/undyne}{#f/12}* 這麼說才對嘛。"
                    ])
            ],
            () =>
                solo()
                    ? ['<19>{#p/papyrus}{#f/5}走完一半了...']
                    : ["<19>{#p/papyrus}{#f/9}還有好長的路要走！"]
        ),
        f_telescope: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在這裡經營\n望遠鏡生意。',
                '<18>{#p/papyrus}{#f/5}訂閱、會員、\n註冊、開券...',
                "<18>{#p/papyrus}{#f/6}這是個無窮無盡的\n條款和條件的迷宮！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我曾經試過報名，\n但是...',
                        "<18>{#p/papyrus}{#f/4}就算是我，\n耐力也是有限度的。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/13}* 我很懷疑真的有人能\n  註冊上嗎？',
                        "<18>{#p/papyrus}{#f/5}我認為...應該沒有。",
                        '<18>{#p/papyrus}{#f/6}這些「最高級」望遠鏡真的\n能用嗎！？',
                        '<25>{#p/undyne}{#f/8}* 誰知道呢！！',
                        "<25>{#p/undyne}{#f/1}* 倒也沒事，\n  畢竟普通款能用就夠了。",
                        '<25>{#p/undyne}{#f/14}* 我一直用的都是普通款！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}愛搞惡作劇的人\n總會把事情搞複雜...']
        ),
        f_bird: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/9}最是聲名狼藉的。',
                '<18>{#p/papyrus}{#f/9}最是無所畏懼的。',
                '<18>{#p/papyrus}{#f/9}最是一往無前的。',
                '<18>{#p/papyrus}{#f/9}怪物。\n神話。\n傳說...',
                '<18>{#p/papyrus}{#f/9}那隻黃色的鳥。',
                ...(SAVE.data.n.plot < 42
                    ? [
                        '<18>{#p/papyrus}{#f/9}...',
                        '<18>{#p/papyrus}{#f/4}...等等。',
                        "<18>{#p/papyrus}{#f/1}不在這！？！？",
                        '<18>{#p/papyrus}{#f/8}怎麼可能！！！'
                    ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/4}...看來我們沒有\n別的辦法來跨越\n這鴻溝了。']
                        : [
                            '<25>{#p/undyne}{#f/1}* 那隻鳥會帶任何人飛過這鴻溝。\n* 他從未拒絕過別人。',
                            '<25>{#p/undyne}{#f/16}* 我小的時候，它載過我一次。\n* 那次花了一個小時...',
                            '<25>{#p/undyne}{#f/17}* 但這隻鳥未曾說過\n  「放棄」二字！！！',
                            '<25>{#p/undyne}{#f/1}* 珍惜那隻鳥吧。'
                        ])
            ],
            () =>
                SAVE.data.n.plot < 42
                    ? [
                        "<18>{#p/papyrus}{#f/8}我就是不理解..！",
                        '<18>{#p/papyrus}{#f/8}那唯一一隻黃鳥怎麼就\n拋棄了我們？？？'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}相信我，\n那條溝比看起來要\n寬多了。',
                        '<18>{#p/papyrus}{#f/4}而且很可能是\n非歐的那種。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/7}* 所以你是說它\n  還得飛過來！？",
                                '<25>{#p/undyne}{#f/8}* 該死，更珍惜那隻鳥一點！',
                                "<18>{#p/papyrus}{#f/6}我會竭盡全力珍惜的！！",
                                '<25>{#p/undyne}{#f/7}* 漂亮！！！'
                            ])
                    ]
        ),
        f_stand: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}有傳言說...',
                '<18>當地賣冰淇淋的那個人\n會發明信片。',
                '<18>{#p/papyrus}{#f/4}聽說這些「明信片」\n具有不可言說的力量...',
                '<18>{#p/papyrus}{#f/9}...可以解鎖更多\n美味的口味！',
                ...(solo()
                    ? []
                    : [
                        '<26>{#p/undyne}{#f/8}* 而我喜歡好吃的！',
                        "<25>{#p/undyne}{#f/14}* 好吧，我不喜歡吃涼的。",
                        "<25>{#p/undyne}{#f/17}* 我是說「我沒那麼喜歡」\n  而已！！"
                    ])
            ],
            [
                '<18>{#p/papyrus}{#f/0}不知道這些明信片\n還有什麼魔力...',
                '<18>{#p/papyrus}{#f/4}它們往往\n很快就會用完...'
            ]
        ),
        f_abyss: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我們望著這條布滿\n訊星的蜿蜒小路...',
                '<18>{#p/papyrus}{#f/4}我們認為這「很正常」。',
                '<18>{#p/papyrus}{#f/0}你知道還有什麼\n「很正常」嗎？',
                '<18>{#p/papyrus}{#f/0}這通電話竟然能\n傳到那裡！',
                '<18>{#p/papyrus}{#f/6}太正常了！！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 你的意思是那不正常，\n  對吧？",
                        '<18>{#p/papyrus}{#f/0}差不多。',
                        '<25>{#p/undyne}{#f/14}* ...照這樣下去，你遲早會晉升\n  為「陰陽大師」的！',
                        "<18>{#p/papyrus}{#f/4}我要找時間陰陽陰陽\n我兄弟。",
                        "<25>{#p/undyne}{#f/1}* 我不建議喔。\n* 他現在是比「陰陽大師」還要\n  高級的「陰陽仙尊」。",
                        "<25>{#p/undyne}{#f/17}* 你要是想打敗他的話，\n  你就得瘋狂的訓練！",
                        "<18>{#p/papyrus}{#f/4}啊，相信我，UNDYNE，\n我準備好接受訓練了。",
                        "<25>{#p/undyne}{#f/8}* 你最好沒在陰陽我！"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/6}我絕對沒有在\n陰陽怪氣！！"]
                    : ["<19>{#p/papyrus}{#f/4}陰陽訓練【絕對】是世界上\n最簡單的事了。"]
        ),
        f_muffet: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}前幾天我上網...',
                "<18>{#p/papyrus}{#f/6}我了解到了蜘蛛絲\n比你想像得更堅固！",
                '<18>{#p/papyrus}{#f/4}你問我上的是哪個網？',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...你應該不想知道的。"]
                    : [
                        "<25>{#p/undyne}{#f/17}* ...認真的？\n* 這都不是第一次了！",
                        '<18>{#p/papyrus}{#f/6}我只是想知道絲和絲\n之間是怎麼互聯的！',
                        '<25>{#p/undyne}{#f/8}* 你上回用的就是這個藉口！！',
                        '<18>{#p/papyrus}{#f/6}那我好奇怎麼辦嘛！！！',
                        '<25>{#p/undyne}{#f/12}* ...網還是留給蜘蛛爬吧。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}不是用電腦，\n這是肯定的。"]
                    : ['<18>{#p/papyrus}{#f/4}我應該找個機器人\n爬網...']
        ),
        f_shyren: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}我聽說這裡住著個\n很害羞的怪物...",
                '<18>{#p/papyrus}{#f/0}如果你想讓別人敞開心扉...',
                '<18>{#p/papyrus}{#f/9}你就該跟他戰鬥！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}這是個適用於任何\n場合的可靠策略。']
                    : [
                        "<25>{#p/undyne}{#f/8}* 還有別忘了在他的面前\n  大聲吵吵！",
                        '<18>{#p/papyrus}{#f/6}...這步可能有點多餘。',
                        '<25>{#p/undyne}{#f/14}* 呃，可是昨天在特戰隊\n  那邊起效了，所以嘛...',
                        '<18>{#p/papyrus}{#f/4}...',
                        "<18>{#p/papyrus}{#f/4}我要重新考慮\n我的職業道路了...",
                        "<25>{#p/undyne}{#f/17}* 誒，等等！！\n* 我不是說所有的守衛！",
                        '<18>{#p/papyrus}{#f/6}那要是我湊巧\n【去】了特戰隊呢？？？',
                        "<25>{#p/undyne}{#f/14}* ...那特殊對待你！",
                        "<18>{#p/papyrus}{#f/7}可你應該一視同仁！！",
                        '<25>{#p/undyne}{#f/17}* 得了吧！！'
                    ])
            ],
            () => ['<18>{#p/papyrus}{#f/0}哼哼哼...', ...(solo() ? [] : ['<25>{#p/undyne}{#f/12}* 哼哼哼...'])]
        ),
        f_statue: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}一座神秘的雕像...',
                '<18>{#p/papyrus}{#f/4}在工廠正中央...',
                '<18>{#p/papyrus}{#f/6}...我想知道這\n有什麼意義！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 那座雕像永遠擺在那...",
                        '<25>{#p/undyne}{#f/17}* ...但是沒人知道\n  他是哪來的！',
                        '<25>{#p/undyne}{#f/1}* 裡面倒是有個很酷的八音盒。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}勁爆訊息。',
                        '<18>{#p/papyrus}{#f/4}神秘的雕像很神秘。',
                        "<18>{#p/papyrus}{#f/6}這誰能想得到！！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/11}* 有人說雕像還有第二個\n  八音盒...',
                        "<25>{#p/undyne}{#f/12}* ...我得親耳聽見我才相信。"
                    ]
        ),
        f_piano: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}要是有個房間...',
                '<18>能讓我通過音樂\n表達自己就好了。',
                '<18>一個孤獨的房間，\n與世隔絕...',
                '<18>中間唯有一架鋼琴...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}...喔等下！\n不就是這個房間嗎！"]
                    : [
                        '<25>{#p/undyne}{#f/10}* 也許那架鋼琴可以\n  用來解謎...',
                        '<25>{#p/undyne}{#f/10}* 或是用那個雕像\n  練習戰鬥...',
                        '<25>{#p/undyne}{#f/10}* 又或是演奏一段充滿了你\n  美好回憶的旋律...',
                        '<25>{#p/undyne}{#f/7}* ...要是你現在就在那個\n  房間就好了！！',
                        '<18>{#p/papyrus}{#f/6}別搶我臺詞！！'
                    ])
            ],
            ['<18>{#p/papyrus}下次我來這裡，\n我要寫一首曲子。', '<18>名字就叫\n《PAPYRUS的故事》。']
        ),
        f_artifact: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}我覺得我之前從來\n沒進過這個房間。",
                "<18>{#p/papyrus}{#f/6}這個房間什麼樣？\n裡面有沒有\n數不清的寶藏？",
                '<18>{#p/papyrus}{#f/4}聲明一下，\n這個問題是反問句。',
                "<18>{#p/papyrus}{#f/7}我寧願自己去\n尋找答案！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 看到你仍然有冒險精神，\n  我很高興。",
                        '<18>{#p/papyrus}{#f/9}那當然！！\n我，偉大的PAPYRUS...',
                        '<18>{#p/papyrus}{#f/9}擁有著無人能比的\n冒險精神！',
                        "<18>{#p/papyrus}{#f/4}好吧，其實有人能比。",
                        '<18>{#p/papyrus}{#f/6}SANS每天都會以一種\n新方式探索沙發。',
                        '<25>{#p/undyne}{#f/17}* ...啊。',
                        "<25>{#p/undyne}{#f/17}* 怪不得那沙發那麼亂。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}不要劇透！！！']
                    : ["<18>{#p/papyrus}{#f/4}這還不是他最令人\n印象深刻的壯舉。"]
        ),
        f_path: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}繼續走，\n你就能看到首塔了。",
                "<18>{#p/papyrus}{#f/4}通常你從這麼遠的地方\n看不到，但是...",
                '<18>{#p/papyrus}{#f/5}通過這個房間裡的\n某個東西...',
                '<18>...就能看到了...',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 可能這就是Alphys總說的\n  「空間扭曲」現象吧。',
                        '<25>{#p/undyne}{#f/1}* 你離得太近的話，\n  時間的流逝會變慢的。',
                        '<18>{#p/papyrus}{#f/5}所以要小心點！',
                        '<18>{#p/papyrus}{#f/6}要是時間完全\n慢下來了，你還能\n跑掉嗎？',
                        "<25>{#p/undyne}{#f/17}* ...在絕對的力量面前，\n  一切都是空談！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}趁著還有機會，\n好好欣賞風景吧！']
                    : ['<18>{#p/papyrus}{#f/6}小心點！']
        ),
        f_view: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}你肯定是一個\n很會一心多用的人！',
                "<18>{#p/papyrus}{#f/4}因為只有像你\n這樣的人...",
                '<18>{#p/papyrus}{#f/5}才會在【那種】美景\n附近還想著打電話\n給別人。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 在和特戰隊進行\n  人類追逐練習時...',
                        '<25>{#p/undyne}{#f/17}* 每次都肯定有個警衛被它\n  分心。',
                        "<25>{#p/undyne}{#f/10}* 無論是Cozmo對美學本質\n  的爭執...",
                        '<25>{#p/undyne}{#f/10}* 又或是Terrestria對\n  「宇宙之美」的痴迷...',
                        "<25>{#p/undyne}{#f/9}* ...好吧其實也就這倆。",
                        '<18>{#p/papyrus}{#f/5}但是...作為還活著的最老\n的怪物...',
                        '<18>{#p/papyrus}{#f/6}他們都幹活都不應該\n馬虎！！',
                        "<26>{#p/undyne}{#f/16}* 他們幹活確實沒馬虎，\n  但是...他們訓練\n  還是很馬虎的。",
                        "<18>{#p/papyrus}{#f/5}好吧。\n呃，還真是不幸。",
                        "<25>{#p/undyne}{#f/1}* 幸好，景色再漂亮，\n  某個大隊長也照樣能\n  不為所動！！",
                        '<25>{#p/undyne}{#f/12}* ...要不然，為啥都讓我\n  監督他們好好幹活呢。',
                        '<18>{#p/papyrus}{#f/6}聽起來好辛苦...',
                        "<18>{#p/papyrus}{#f/9}但我知道...\n這點事肯定難不倒你！",
                        '<25>{#p/undyne}{#f/14}* 謝嚕，Papyrus。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/7}眼前有那麼美的景色...',
                        "<18>{#p/papyrus}{#f/7}為啥不去看風景，\n還跑來給我打電話！"
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 你沒被招進皇家衛隊，\n  就偷著樂吧！",
                        '<25>{#p/undyne}{#f/12}* 要不然...\n  被我逮到你在摸魚，\n  有你好受。'
                    ]
        ),
        f_plank: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}很不幸，這裡沒有什麼\n特別好說的。",
                '<18>{#p/papyrus}{#f/4}除了我聽說的那座\n不知道通往哪裡的橋...',
                '<18>{#p/papyrus}{#f/5}真的就只是條\n死胡同。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 什麼橋？\n* 我剛砍掉那座嗎？？',
                        '<25>{#p/undyne}{#f/8}* 那只是工廠裡面很多舊橋\n  的一小部分而已！',
                        '<18>{#p/papyrus}{#f/6}那座橋可算換掉了？？',
                        '<18>{#p/papyrus}{#f/5}哇吚...\n我還以為要用這舊橋\n用一輩子呢...',
                        '<25>{#p/undyne}{#f/14}* 那玩意還想用一輩子？\n* 早點砍了，才安全！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}也許你可以\n先到別的地方，\n再繞回來？']
                    : ['<18>{#p/papyrus}{#f/4}所以說，以前這裡\n還有別的東西...']
        ),
        f_tunnel: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}啊... 你在垃圾場啊。',
                '<18>{#p/papyrus}{#f/0}人們有東西不想要了\n就丟那，可方便了。',
                '<18>{#p/papyrus}{#f/4}其實...',
                '<18>{#p/papyrus}{#f/9}你要是想免費尋寶就去那，\n也挺方便！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}我有的時候跟SANS\n過來翻東西。']
                    : [
                        "<25>{#p/undyne}{#f/12}* 你確定那...呃，安全嗎？",
                        "<25>{#p/undyne}{#f/10}* 我知道「甲之蜜糖，乙之砒霜」\n  這理啦，可-",
                        '<18>{#p/papyrus}{#f/0}BRATTY和CATTY\n撿垃圾還得去室外...',
                        '<18>{#p/papyrus}{#f/0}真不方便！\n而我和Sans足不出戶，\n一個房間就能撿到天黑！',
                        "<25>{#p/undyne}{#f/1}* 你說話這語氣，\n  感覺不像壞事啊。",
                        '<25>{#p/undyne}{#f/17}* 就是別等垃圾處理器啟動了，\n  才知道要逃！',
                        "<18>{#p/papyrus}{#f/6}當然！！\n我們可不想人間蒸發！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}上次我們甚至找到了\n一幅骨頭畫...',
                        '<18>{#p/papyrus}{#f/5}就是稍微有點\n髒而已！！'
                    ]
                    : ["<18>{#p/papyrus}{#f/6}我覺得你還是離開\n這個房間比較好。"]
        ),
        f_chute: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}地板上有三臺\n平板電腦。',
                '<18>{#p/papyrus}{#f/0}一臺是關於星花的，\n一臺是關於蟲洞的。',
                '<18>{#p/papyrus}{#f/4}還有一臺裡是\n科幻動漫。',
                "<18>{#p/papyrus}{#f/0}我【個人】覺得，\n這些東西都是有關聯的。",
                '<18>{#p/papyrus}{#f/5}也就是說，星花\n是通過蟲洞來的...',
                '<18>{#p/papyrus}{#f/5}就像那部科幻動漫\n預言的那樣。',
                "<18>{#p/papyrus}{#f/6}這是能一次性解釋清\n這三個東西的\n唯一辦法！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 這就是你的理論？",
                        '<25>{#p/undyne}{#f/14}* 這樣所有平板電腦上的資訊\n  就都連起來了？',
                        '<18>{#p/papyrus}{#f/0}對。',
                        '<25>{#p/undyne}{#f/1}* 好。\n* 我就一個問題...',
                        "<25>{#p/undyne}{#f/7}* 空口無憑，證據呢！？",
                        '<18>{#p/papyrus}{#f/6}動漫裡呢！！',
                        '<18>{#p/papyrus}{#f/4}科幻動漫。',
                        "<18>{#p/papyrus}{#f/4}證據都在動漫裡。\n雖然我太忙沒空看。",
                        '<25>{#p/undyne}{#f/17}* 科幻動漫？沒空看！？',
                        "<25>{#p/undyne}{#f/8}* 開玩笑呢啊！！"
                    ])
            ],
            ['<18>{#p/papyrus}{#f/5}總有一天，人類...', '<18>{#p/papyrus}{#f/5}總有一天，我會證明\n我的理論給你看的。']
        ),
        f_dummy: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}不要忽略隱藏的\n路徑...",
                '<18>{#p/papyrus}{#f/5}閉上眼睛，\n徑直地走...',
                "<18>{#p/papyrus}{#f/5}迎接TEMMIE狂熱的心情。",
                "<18>{#p/papyrus}{#f/4}...這是我聽說的\n關於這個地方的謎語。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 嗯...\n  「不要忽略隱藏的路徑...」',
                        '<25>{#p/undyne}{#f/11}* 什麼隱藏路徑？',
                        '<25>{#p/undyne}{#f/13}* 然後...「閉上眼睛」...',
                        '<25>{#p/undyne}{#f/12}* 好了，停停停，停。',
                        "<26>{#p/undyne}{#f/8}* 我啥也看不見了，\n  我還咋找TEMMIE村莊啊！",
                        '<18>{#p/papyrus}{#f/4}可惜，謎語是這麼說的。',
                        '<18>{#p/papyrus}{#f/7}真是沒用的謎語！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}【你】知道怎麼解嗎？']
        ),
        f_hub: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}如果你看到一家商店...',
                '<18>{#p/papyrus}{#f/4}你就該停下腳步...',
                '<18>{#p/papyrus}{#f/0}心急火燎地\n進去看看！！',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/9}因為我們在進行\n火熱的大甩賣！！",
                        '<18>{#p/papyrus}{#f/5}這都是在我想像中\n賣火的商店裡\n會發生的事。'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 就像Gerson的店那樣嗎？",
                        '<25>{#p/undyne}{#f/8}* 我都是從他那買東西的！',
                        "<18>{#p/papyrus}{#f/6}他賣的東西有什麼\n特別的嗎？",
                        '<25>{#p/undyne}{#f/17}* 你說啥呢？\n* Gerson可活過了人怪大戰！',
                        "<25>{#p/undyne}{#f/14}* 他才是真英雄。",
                        '<18>{#p/papyrus}{#f/4}我之前還想說點別的\n什麼的來著，但還是\n算了吧。',
                        '<18>{#p/papyrus}{#f/0}GERSON萬歲！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}這也是我的\n另一個夢想..."]
                    : [
                        "<18>{#p/papyrus}{#f/0}認可我們的英雄是\n很重要的。",
                        '<18>{#p/papyrus}{#f/5}沒了他們，哪有我們\n現在的幸福生活。'
                    ]
        ),
        f_undyne: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}這裡是UNDYNE的家。",
                ...(SAVE.data.n.plot < 48 || world.trueKills > 0
                    ? ['<18>{#p/papyrus}{#f/9}學習烹飪的\n理想的地方！']
                    : SAVE.data.n.plot_date < 1.3
                        ? ['<18>{#p/papyrus}{#f/4}你應該知道吧，就是\n門前站了只骷髏的那屋。']
                        : SAVE.data.n.plot_date < 2
                            ? ["<18>{#p/papyrus}{#f/9}別猶豫，快進來！"]
                            : SAVE.data.n.plot_date < 2.1
                                ? [
                                    "<18>{#p/papyrus}{#f/6}...你還在UNDYNE的\n家那裡啊？？",
                                    "<18>{#p/papyrus}{#f/5}她，呃，\n還沒跟我見面呢。",
                                    '<18>{#p/papyrus}{#f/4}要不你先\n離開房間然後...',
                                    '<18>{|}{#f/1}...{%}',
                                    '<25>{#p/undyne}{#f/12}* 呼... 哈...！',
                                    "<25>{#p/undyne}{#f/8}* 沒錯！！！\n* 那是我的家！！！",
                                    "<18>{#p/papyrus}{#f/6}呃，嗨，UNDYNE！\n你是怎麼這麼快\n就到這裡的啊？",
                                    '<25>{#p/undyne}{#f/17}* 我跑過來的。',
                                    '<18>{#p/papyrus}{#f/1}什麼？？\n那你肯定有一些...',
                                    '<18>{#p/papyrus}{#f/9}關於你家的\n很酷的事情\n要說吧！！！',
                                    '<25>{#p/undyne}{#f/14}* 沒有！！！'
                                ]
                                : [
                                    '<18>{#p/papyrus}{#f/4}至少曾經是，\n直到...',
                                    '<25>{#p/undyne}{#f/12}* ...我們把它給點著了。',
                                    '<25>{#p/undyne}{#f/8}* 哎呀，管它呢？？',
                                    '<25>{#p/undyne}{#f/14}* 跟Papyrus出去消遣\n  最棒了！'
                                ])
            ],
            () =>
                SAVE.data.n.plot < 48 || world.trueKills > 0
                    ? [
                        '<18>{#p/papyrus}{#f/0}專家提示：\n在跟UNDYNE烹飪時...',
                        '<18>{#p/papyrus}{#f/4}如果她開始攻擊蔬菜...',
                        "<18>{#p/papyrus}{#f/5}...那就該溜了。"
                    ]
                    : SAVE.data.n.plot_date < 1.3
                        ? ['<18>{#p/papyrus}{#f/0}我也很高興見到你！']
                        : SAVE.data.n.plot_date < 2
                            ? ["<18>{#p/papyrus}{#f/4}我們還在這等著呢，\n你知道吧..."]
                            : SAVE.data.n.plot_date < 2.1
                                ? [
                                    "<18>{#p/papyrus}{#f/0}我相信她很快就\n會想出來的。",
                                    "<25>{#p/undyne}{#f/14}* 你可別打包票！"
                                ]
                                : [
                                    '<18>{#p/papyrus}{#f/0}請叫我「消遣雜務工」。',
                                    '<18>{#p/papyrus}{#f/4}我雖然沒辦法\n修補你的家...',
                                    '<18>{#p/papyrus}{#f/9}但我還可以幫你\n「補上」美好的一天！'
                                ]
        ),
        f_blooky: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}也許有一天，\n我會過上平靜的生活。",
                '<18>{#p/papyrus}{#f/5}養蝸牛，創作音樂...',
                '<18>{#p/papyrus}{#f/6}愁眉苦臉，\n不讓任何人安慰我...',
                "<18>{#p/papyrus}{#f/5}轉念一想，\n這個生活方式可能\n不太適合我。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 他都不想讓我幫他，\n  好讓他好受些！",
                        '<25>{#p/undyne}{#f/16}* ...我想應該不是每個人都是\n  一跟朋友出去玩就能\n  開心的。',
                        '<18>{#p/papyrus}{#f/5}是啊...\nSANS有時候也是這樣。',
                        "<18>{#p/papyrus}{#f/0}啊，別誤會。\n他一般都好著呢！",
                        '<18>{#p/papyrus}{#f/6}但是，\n誰都有不如意的時候嘛。',
                        '<25>{#p/undyne}{#f/14}* 你這個「誰」包括Papyrus嗎？',
                        '<18>{#p/papyrus}{#f/4}好啦，好啦...',
                        '<18>{#p/papyrus}{#f/0}我把「誰」改成「大部分人」\n好了。'
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/0}唉，我感覺我更適合\n當啦啦隊隊員。",
                '<18>{#p/papyrus}{#f/5}...而不是那個\n要別人幫忙\n安慰我的人。'
            ]
        ),
        f_snail: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}我聽說有一種方法\n可以贏這個遊戲...",
                '<18>{#p/papyrus}{#f/0}就是關於提供\n「及時的鼓勵」。',
                '<18>{#p/papyrus}{#f/5}及時的鼓勵...',
                "<18>{#p/papyrus}{#f/4}怎麼說得好像還有\n【不及時的】鼓勵\n一樣。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 啊，\n  有時候會有點尷尬...',
                        "<25>{#p/undyne}{#f/1}* 但是總的來說，你是對的。",
                        '<18>{#p/papyrus}{#f/0}你什麼意思？',
                        '<25>{#p/undyne}{#f/1}* 呃...如果你一再鼓勵...',
                        "<25>{#p/undyne}{#f/1}* 他們估計就以為\n  你在阿諛逢迎了。",
                        '<18>{#p/papyrus}{#f/7}鱷魚！？蜂蠅！？\n我家裡可沒有這些！',
                        "<25>{#p/undyne}{#f/16}* 我是說啊，\n  如果你不斷鼓勵別人...",
                        "<25>{#p/undyne}{#f/16}* 他們會大腦過載的。",
                        '<25>{#p/undyne}{#f/17}* 所以嘛，要穩紮穩打！！',
                        "<18>{#p/papyrus}{#f/4}...我立刻開始處理這個\n建議。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我要是想太多可能會\n讓人不知所措...']
                    : ["<18>{#p/papyrus}{#f/6}我思考完了再回來！！！"]
        ),
        f_taxi: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}你有沒有注意到一件\n怪事？',
                '<18>{#p/papyrus}{#f/4}我跟你保證這裡肯定\n放著一首神秘的歌曲...',
                '<18>{#p/papyrus}{#f/5}肯定在特定的角度能\n看見一些平時看不見\n的東西...',
                "<18>{#p/papyrus}{#f/0}啊算了。\n只是我的想像罷了。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 其實...\n* 我也聽得見那個歌聲。",
                        '<25>{#p/undyne}{#f/17}* 而且那邊也肯定有什麼\n  平常看不見的東西。',
                        '<18>{#p/papyrus}{#f/5}那種聲音，\n你能感受到...',
                        "<18>{#p/papyrus}{#f/4}...但是確切去聽的時候，\n你又聽不見了。",
                        "<25>{#p/undyne}{#f/1}* 對！！\n* 正是那個！！"
                    ])
            ],
            () => [
                "<18>{#p/papyrus}{#f/0}也許是宇宙起源之音吧。",
                '<18>{#p/papyrus}{#f/5}或許是星際中的迷失\n通訊...',
                '<18>{#p/papyrus}{#f/5}一切都要追溯到宇宙\n起源。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 那要是宇宙沒有\n  起源呢？？',
                        '<18>{#p/papyrus}{#f/1}不-不...！！\n這是對我無懈可擊\n推理的挑戰！',
                        '<18>{#p/papyrus}{#f/5}現在我要找公關了...'
                    ])
            ]
        ),
        f_prepuzzle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我經常在想為什麼\n人類要把我們\n困在這裡。',
                '<18>{#p/papyrus}{#f/5}我知道他們害怕\n我們，但是...',
                "<18>{#p/papyrus}{#f/6}他們就不會逃跑嗎！？",
                '<18>{#p/papyrus}{#f/6}或者，跟我們談談，\n這不也挺好嗎！！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}很不幸，他們從來\n沒有想過這些事情。"]
                    : [
                        '<25>{#p/undyne}{#f/16}* 對呀，我也經常這麼想。',
                        "<25>{#p/undyne}{#f/17}* 他們蠢得讓人印象深刻。",
                        "<18>{#p/papyrus}{#f/7}人類不蠢！！",
                        '<18>{#p/papyrus}{#f/5}人類就只是...',
                        "<18>{#p/papyrus}{#f/6}...不思考那些事而已。",
                        "<25>{#p/undyne}{#f/12}* 呃...\n* 或許你是對的。",
                        "<25>{#p/undyne}{#f/12}* 不管怎樣，\n  到底咱還是被困在這。"
                    ])
            ],
            ['<18>{#p/papyrus}{#f/0}至少【我】是\n想過這些的！！']
        ),
        f_puzzle3: pager.create(
            0,
            ...[
                () => [
                    '<18>{#p/papyrus}{#f/6}我自稱是謎題大師，\n但是...',
                    '<18>{#p/papyrus}{#f/5}這件事我得坦白。',
                    "<18>{#p/papyrus}{#f/4}...我從來沒真正\n解決過這個難題。",
                    "<18>{#p/papyrus}{#f/6}等等！！\n別對我太苛刻！！",
                    '<18>{#p/papyrus}{#f/4}...我還沒來得及試，\n他們就把它關掉了。',
                    ...(solo()
                        ? []
                        : [
                            "<25>{#p/undyne}{#f/17}* 要是沒關掉，你就能解開？？",
                            '<25>{#p/undyne}{#f/14}* 很多人都試過解決這個謎題，\n  但是真正能解決的沒有\n  幾個。',
                            "<18>{#p/papyrus}{#f/0}啊，那不算什麼難題。",
                            '<18>{#p/papyrus}{#f/0}這個類別的謎題我都\n解決多少個了！\n而且解決的極其迅速！',
                            '<25>{#p/undyne}{#f/14}* 如果你說的「極其迅速」是指\n  幾個小時的話，我信了。',
                            '<18>{#p/papyrus}{#f/6}怎麼？？幾個小時？？',
                            '<18>{#p/papyrus}{#f/5}不出十秒鐘，\n我就能解決那些謎題！',
                            '<25>{#p/undyne}{#f/17}* 加上你盯著看的時間呢...？',
                            '<18>{#p/papyrus}{#f/7}...那個不算！'
                        ])
                ],
                () =>
                    solo()
                        ? ['<18>{#p/papyrus}{#f/6}我知道的啊！\n所以它不公平啊！！']
                        : [
                            '<18>{#p/papyrus}{#f/0}思考的時間花的越多，\n解決的時間花的越少。',
                            '<18>{#p/papyrus}{#f/9}我送給各位一個\n謎題小貼士！'
                        ]
            ].map(
                lines => () =>
                    SAVE.data.n.plot < 45
                        ? SAVE.data.b.f_state_password
                            ? [
                                '<18>{#p/papyrus}{#f/6}「使用終端」！！',
                                '<18>{#p/papyrus}{#f/6}「就在右邊」！！！',
                                '<18>{#p/papyrus}{#f/6}「祝你好運」！！'
                            ]
                            : ((SAVE.data.b.f_state_password = true),
                                [
                                    "<18>{#p/papyrus}{#f/4}啊...是【這個】謎題？",
                                    "<18>{#p/papyrus}{#f/5}...啊。\n這可不是最簡單的那個。",
                                    '<18>{#p/papyrus}{#f/9}幸好，\n我有一個解決方案！',
                                    '<18>{#p/papyrus}{#f/0}聽好了！',
                                    '<18>{#p/papyrus}{#f/0}使用就在右邊的終端。',
                                    '<32>{#p/human}* （Papyrus在你耳旁說了些\n  悄悄話。）',
                                    '<18>{#p/papyrus}{#f/6}希望對你有幫助！'
                                ])
                        : lines()
            )
        ),
        f_prespear: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}如果我是你，\n我會小心這個房間...',
                '<18>{#p/papyrus}{#f/5}UNDYNE經常來這裡，\n威嚴地站在附近。',
                "<18>{#p/papyrus}{#f/6}她不止一次嚇到過我！",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}即使我讓自己\n很容易被當成靶子。']
                    : [
                        '<25>{#p/undyne}{#f/14}* 對。\n* 我來這裡巡邏，為了尋找人類。',
                        "<25>{#p/undyne}{#f/7}* 我就是幹這個的。",
                        '<18>{#p/papyrus}{#f/6}啊！！\n別那麼咄咄逼人嘛！！',
                        "<25>{#p/undyne}{#f/14}* 我就是我，這一點永不變。",
                        '<18>{#p/papyrus}{#f/6}但是只要他們\n努力嘗試，每個人都有\n機會改變自己！',
                        "<25>{#p/undyne}{#f/17}* 每條定理都有例外嘛！",
                        '<18>{#p/papyrus}{#f/7}那我的定理就是\n「每條定理都有例外」\n這條定理的例外！',
                        '<25>{#p/undyne}{#f/4}* ...',
                        '<25>{#p/undyne}{#f/5}* ...',
                        "<25>{#p/undyne}{#f/12}* ...行吧，我沒想到這點。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}喔，還有不知道從哪裡\n冒出來的長矛陷阱。',
                        '<18>{#p/papyrus}{#f/5}也小心點那些。'
                    ]
                    : ['<18>{#p/papyrus}{#f/4}為什麼我們時不時要\n吵架呢...']
        ),
        f_spear: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}穿過這個房間\n所花的時間...',
                '<18>{#p/papyrus}{#f/5}...好像哪次都不一樣。',
                "<18>{#p/papyrus}{#f/4}有的時候很長，\n有的時候就不一樣...",
                '<18>{#p/papyrus}{#f/4}有的時候我穿\n圓點圖案的衣服。',
                "<18>{#p/papyrus}{#f/0}不管怎麼解釋好像\n都說不通。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}說的是我剛才那句。']
                    : [
                        "<25>{#p/undyne}{#f/12}* 可能只是一種空間扭曲吧。",
                        '<25>{#p/undyne}{#f/17}* 我今天早些時候追人類時\n  感覺到了。',
                        '<18>{#p/papyrus}{#f/4}真是討厭...',
                        '<18>{#p/papyrus}{#f/7}什麼時候扭曲\n才會停下來啊！？',
                        "<25>{#p/undyne}{#f/1}* 呃，扭曲沒有錯。",
                        '<25>{#p/undyne}{#f/14}* 空間扭曲就只是，呃...\n  宇宙的一部分。',
                        '<18>{#p/papyrus}{#f/5}天哪...\n怎麼宇宙也這樣啊！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我剛才沒提過\n圓點圖案的衣服嗎？']
                    : ["<18>{#p/papyrus}{#f/4}這就是我橫跨整個星系\n的大陰謀..."]
        ),
        f_corner: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這個工廠裡的\n很多地方...',
                '<18>{#p/papyrus}{#f/0}...只有跳過去\n才能到達。',
                '<18>{#p/papyrus}{#f/9}就比如，這個房間\n左右的兩條道！',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}我聽說人類可以\n跳得很高，所以...",
                        "<18>{#p/papyrus}{#f/0}你應該不會有\n什麼問題的。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 有的地方，\n  你還得飛過去呢！',
                        '<18>{#p/papyrus}{#f/6}比如呢？？',
                        '<25>{#p/undyne}{#f/8}* 比如，那個平臺中間的洞！',
                        '<18>{#p/papyrus}{#f/0}啊。',
                        ...(SAVE.data.b.f_state_kidd_betray
                            ? [
                                '<25>{#p/undyne}{#f/16}* 但之前有個孩子\n  在這摔了...',
                                "<25>{#p/undyne}{#f/9}* 我當時要是不在那兒可就\n  壞了。",
                                "<18>{#p/papyrus}{#f/9}...好！！\n你在那真是太好了！",
                                "<25>{#p/undyne}{#f/16}* 是啊，那兒除了我肯定\n  沒別人了。",
                                "<25>{#p/undyne}{#f/11}* 對吧，小混蛋？",
                                '<18>{#p/papyrus}{#f/6}...啥？？？'
                            ]
                            : [
                                '<25>{#p/undyne}{#f/1}* 之前有個孩子在這摔了，\n  但...',
                                '<25>{#p/undyne}{#f/1}* 人類在壞事之前救起了他。',
                                "<18>{#p/papyrus}{#f/9}...好！！\n人類在那兒真是太好了！",
                                '<18>{#p/papyrus}{#f/4}...\n慢著...',
                                '<18>{#p/papyrus}{#f/7}那【你】就在那兒站著\n幹看著！？',
                                '<25>{#p/undyne}{#f/7}* 人類立馬就上去了，\n  根本沒給我機會！！'
                            ])
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/9}你能做到的！！\n我相信你！']
                    : SAVE.data.b.f_state_kidd_betray
                        ? ['<18>{#p/papyrus}{#f/6}你要不換個地方\n再打回來呢？']
                        : ['<18>{#p/papyrus}{#f/0}我真佩服你能\n那麼迅速的救起\n那個孩子。']
        ),
        f_story2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}訊星真的很厲害，\n對吧？',
                '<18>{#p/papyrus}{#f/5}不過，它們會\n周期性地重置。',
                '<18>{#p/papyrus}{#f/4}在重置之前...',
                "<18>{#p/papyrus}{#f/6}等下，別的地方\n是不是也有一個\n類似的房間！？",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 這兒可比你想像的容易迷路\n  多了。",
                        '<25>{#p/undyne}{#f/4}* 最近一次，我在裡面找一個\n  失蹤的怪物的時候...',
                        '<25>{#p/undyne}{#f/7}* 就遇上了鬼打牆！',
                        '<18>{#p/papyrus}{#f/0}就好像訊星一直重複\n一個資訊一樣！',
                        '<25>{#p/undyne}{#f/10}* 比喻的其實不是很恰當...',
                        "<25>{#p/undyne}{#f/12}* 其實更像房間變得越來越...\n  長，不知道為什麼。",
                        '<25>{#p/undyne}{#f/11}* ...哈。',
                        '<18>{#p/papyrus}{#f/5}...那你找到那個怪物\n沒有？',
                        '<25>{#p/undyne}{#f/12}* 找到了，就是個小孩。',
                        '<25>{#p/undyne}{#f/10}* 我問他他家住哪，可...\n  他說...',
                        "<25>{#p/undyne}{#f/12}* ...呃，他說他沒有家。",
                        '<18>{#p/papyrus}{#f/6}聽起來...\n挺令人擔憂的。',
                        '<25>{#p/undyne}{#f/17}* 還用你說！！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}我感覺有時候\n我只是把自己的話給\n重複了一遍。"]
                    : ["<18>{#p/papyrus}{#f/5}我很好奇我們是不是\n都在原地踏步啊。"]
        ),
        f_pacing: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}這個房間真的\n沒什麼可說的。",
                '<18>{#p/papyrus}{#f/4}它的存在只會讓你\n走得越來越遠，',
                '<18>{#p/papyrus}{#f/5}朝著出口\n一步一步邁出...',
                '<18>{#p/papyrus}{#f/4}充滿了徹底的、\n無休止的懸念。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/14}* 總結完畢。'])
            ],
            ['<18>{#p/papyrus}{#f/7}徹底的！\n無休止的！！\n懸念！！！']
        ),
        f_battle: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}在這個房間裡，\n你會看到\nUNDYNE的巨塔。",
                '<19>{#p/papyrus}{#f/9}那是由一顆古老\n小行星的殘骸\n做成的！',
                "<18>{#p/papyrus}{#f/5}她總是在上面擺姿勢...",
                '<18>{#p/papyrus}{#f/4}然後喃喃自語...',
                ...(solo()
                    ? []
                    : SAVE.data.b.undyne_respecc
                        ? [
                            '<25>{#p/undyne}{#f/12}* 啊，對，\n  「我們怪物一族的故事」...',
                            "<25>{#p/undyne}{#f/1}* 這故事我到底也沒\n  講出來。",
                            '<25>{#p/undyne}{#f/8}* 反正那小混蛋可能已經\n  聽過了！'
                        ]
                        : [
                            '<25>{#p/undyne}{#f/12}* 啊，對，\n  「我們怪物一族的故事」...',
                            '<25>{#p/undyne}{#f/1}* 總之是草草了事了，\n  白排練了。',
                            '<25>{#p/undyne}{#f/8}* 忘了那些事先排練了\n  好幾遍的多愁善感的\n  演講吧！！'
                        ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}她可能有什麼\n必須要記住的東西吧。"]
                    : ['<18>{#p/papyrus}{#f/9}我先說好，\n我愛爆事先排練了\n好幾遍的演講了！']
        ),
        f_exit: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}這個儲液罐是\n專門放在這裡的...',
                '<18>{#p/papyrus}{#f/0}因為某個皇家衛隊\n隊長覺得...',
                "<18>{#p/papyrus}{#f/4}覺得這可以作為\n一種安全措施...",
                '<18>{#p/papyrus}{#f/5}以避免她的巨型噴氣\n背包進入充滿靜電的\n地方時出現的事故。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}...把靜電全吸收掉是\n非常，非常危險的！！']
                    : [
                        "<25>{#p/undyne}{#f/17}* 別跟我說這事了！！\n* 我當時不是趕時間嗎！",
                        "<18>{#p/papyrus}{#f/4}是是是，\n你成天趕時間...",
                        "<25>{#p/undyne}{#f/7}* 靜電的危害，我能不知道？！",
                        '<18>{#p/papyrus}{#f/4}...那你還去抓人類幹嘛。',
                        '<25>{#p/undyne}{#f/1}* 不敢直面危險，\n  哪還配叫皇家守衛？',
                        "<18>{#p/papyrus}{#f/6}直面危險\n也不是讓你玩命啊？？",
                        '<25>{#p/undyne}{#f/12}* 俗話說的好：「富貴險中求。」',
                        "<18>{#p/papyrus}{#f/7}遇到危險，富貴算個球！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}我只想用一個詞來\n評價那個守衛隊長。',
                        '<18>{#p/papyrus}{#f/4}那個詞就是\n「注意看好路」。'
                    ]
                    : ["<18>{#p/papyrus}{#f/5}我很擔心UNDYNE的\n人身安全。"]
        ),
        f_napstablook: pager.create(
            0,
            () =>
                SAVE.data.n.plot <= 48.1 && SAVE.data.n.state_foundry_blookdate < 2
                    ? [
                        "<18>{#p/papyrus}{#f/0}所以你跟一個幽靈\n交上朋友了。",
                        '<18>{#p/papyrus}{#f/1}你交友的範圍是不是\n有點太寬泛了！？！？',
                        ...(solo()
                            ? ['<18>{#p/papyrus}{#f/6}你的實力真的\n太讓人害怕了！！']
                            : [
                                "<25>{#p/undyne}{#f/14}* 要不然他咋能跟我交上\n  朋友呢。",
                                "<25>{#p/undyne}{#f/17}* 你應該提醒我的，Papyrus！！\n* 我現在沒退路了！",
                                '<18>{#p/papyrus}{#f/6}友誼的小船可不是\n說翻就翻的「帆」船！！'
                            ])
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}嗯...',
                        '<18>{#p/papyrus}{#f/4}我敢說，要是音樂聲\n再大點，說不定你就得\n{@fill=#ff0}死於{@fill=#fff}耳聾了。',
                        ...(solo()
                            ? [
                                '<18>{#p/papyrus}{#f/0}...啥？死魚耳聾？\n你聽錯了吧！',
                                '<18>{#p/papyrus}{#f/5}我明明說的是\n「私語」的兒童！'
                            ]
                            : [
                                "<25>{#p/undyne}{#f/8}* 別忘了我可在你旁邊呢，\n  傻帽！",
                                '<18>{#p/papyrus}{#f/6}咋會忘呢！！\n我咋可能忘呢！！'
                            ])
                    ],
            () =>
                SAVE.data.n.plot <= 48.1 && SAVE.data.n.state_foundry_blookdate < 2
                    ? solo()
                        ? ['<18>{#p/papyrus}{#f/5}小心點靈質就行。']
                        : [
                            "<18>{#p/papyrus}{#f/5}至少她吸取教訓了...",
                            '<25>{#p/undyne}{#f/14}* 是啊...真的！'
                        ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/9}那個幽靈的立體音響\n裡面有很多音樂！']
                        : ['<18>{#p/papyrus}{#f/0}有描寫私語的兒童的，\n有能讓你死於耳聾的。', '<25>{#p/undyne}{#f/8}* 真的有很多音樂！！']
        ),
        f_hapstablook: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}誒？\n你這是在哪？',
                "<18>{#p/papyrus}{#f/5}我...沒來過這兒。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}也沒...見別人來過這兒。']
                    : [
                        '<25>{#p/undyne}{#f/14}* ...是啊，那房子已經\n  廢棄很久了。',
                        '<25>{#p/undyne}{#f/17}* 其實，那房子甚至比我\n  歲數還大！',
                        '<18>{#p/papyrus}{#f/6}多奇怪啊！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}老實說，這件事我不想再\n深入了解了..."]
                    : ['<18>{#p/papyrus}{#f/5}時間飛逝啊，是吧？', '<25>{#p/undyne}{#f/14}* 是啊！']
        ),
        a_start: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}你現在在空境嗎？",
                "<18>{#p/papyrus}{#f/0}我想不只有我才喜歡\n裝飾用的尖塔。",
                "<18>{#p/papyrus}{#f/4}不包括...\n不是裝飾用的。",
                '<18>{#p/papyrus}{#f/4}那兒住著幾百號人呢。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}但它們仍然\n有裝飾作用！"]
                    : [
                        '<25>{#p/undyne}{#f/14}* 甚至Alphys博士\n  也住過那玩意。',
                        '<25>{#p/undyne}{#f/1}* 和她的童年玩伴\n  Bratty和Catty一起...',
                        '<25>{#p/undyne}{#f/1}* 這可是她當上科學員後\n  親口告訴我的。',
                        "<18>{#p/papyrus}{#f/0}喔，\n我想知道更多！\n待會我去問問她。",
                        '<25>{#p/undyne}{#f/12}* 好啊。\n* 她好像喜歡談論\n  這些事...？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}中間的那個是\n我最喜歡的。']
                    : ['<18>{#p/papyrus}{#f/5}在尖塔屋看到的景色\n一定大為震撼...']
        ),
        a_lab_entry: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}啊，實驗室。\n那可真是個消遣的好地方。',
                '<18>{#p/papyrus}{#f/0}如果ALPHYS博士陪著\n就更是如此了。',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}她真的很喜歡聊\n「科幻」之類的東西...',
                        "<18>{#p/papyrus}{#f/9}所以這何嘗不是件\n好事呢！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* Alphys她... 一直都待在\n  實驗室，Papyrus。',
                        '<26>{#f/17}* 她的「房子」就是\n  樓上那個紫色立方體。',
                        "<26>{#f/16}* 別問我這是什麼原理，\n  因為即使她告訴我...",
                        "<26>{#f/12}* 咱倆應該都不會理解。",
                        '<18>{#p/papyrus}{#f/4}確實。',
                        '<18>{#p/papyrus}{#f/0}所以原理是啥？',
                        '<25>{#p/undyne}{#f/17}* ...',
                        "<25>{#p/undyne}{#f/14}* 我待會告訴你。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}不過，她有個喜歡\n破壞東西的習慣。']
                    : ["<25>{#p/undyne}{#f/8}* 我待會會告訴你的！！！", '<18>{#p/papyrus}{#f/6}我知道了！！！']
        ),
        a_lab_main: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}我上次去實驗室...',
                solo()
                    ? '<18>{#p/papyrus}{#f/0}...還是去找\nALPHYS博士玩，\n就這周！'
                    : '<18>{#p/papyrus}{#f/0}...其實就今天早些時候，\n剛好咱要去休閒迴廊！',
                '<18>{#p/papyrus}{#f/5}但在我小時候，\nSANS就經常帶我\n去實驗室玩。',
                '<18>{#p/papyrus}{#f/5}數不勝數的科學奇蹟\n讓人心潮澎湃...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/6}但可惜的是對此\n感興趣的人不多！"]
                    : [
                        '<18>{#p/papyrus}{#f/0}你呢，UNDYNE？',
                        '<25>{#p/undyne}{#f/1}* 我嗎？\n* 嗯...',
                        '<25>{#p/undyne}{#f/14}* 那個冰激淋機製作的\n  冰激淋真的很好吃。',
                        "<18>{#p/papyrus}{#f/4}...還有嗎？",
                        '<25>{#p/undyne}{#f/20}* 我覺得Alphys能利用\n  高科技監視人類超酷...',
                        '<18>{#p/papyrus}{#f/0}喔，對！\n她也可以\n監視其他人！',
                        '<25>{#p/undyne}{#f/13}* ...',
                        '<25>{#p/undyne}{#f/7}* 我現在被監視了？？？'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}喔對了，\n我忘了說...',
                        '<18>{#p/papyrus}{#f/0}我兄弟過去是個\n實驗室助手。',
                        "<18>{#p/papyrus}{#f/6}就是不知道\n他為啥要辭職...",
                        '<18>{#p/papyrus}{#f/5}他可是\n超愛這份工作的啊。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 我要去殺了她。',
                        "<18>{#p/papyrus}{#f/5}但你根本不知道\n你有沒有被監視！",
                        "<25>{#p/undyne}{#f/8}* ...你覺得\n  她不會那樣做嗎！？",
                        "<18>{#p/papyrus}{#f/6}我不到啊！！",
                        "<25>{#p/undyne}{#f/14}* 你不會當真了吧，\n  我可不會去殺她。",
                        '<25>{#p/undyne}{#f/17}* 開個玩笑而已。',
                        "<18>{#p/papyrus}{#f/4}...好好好。"
                    ]
        ),
        a_lab_upstairs: pager.create(
            0,
            () =>
                SAVE.data.b.water
                    ? [
                        '<18>{#p/papyrus}{#f/5}這些資源回收桶\n的真正用途實際上\n並非回收。',
                        "<18>{#p/papyrus}{#f/4}如果是的話，\nALPHYS就不會計畫...",
                        '<18>{#p/papyrus}{#f/5}製作一臺用於分離\n裡面所有垃圾的\n機器了。',
                        '<18>{#p/papyrus}{#f/6}比如，\n電尼阻液！',
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/17}* 人類居然還拿著杯子嗎？',
                                "<25>{#p/undyne}{#f/8}* 你不會認真的吧！！",
                                "<18>{#p/papyrus}{#f/4}還好人類沒有\n喝裡面的液體。",
                                '<25>{#p/undyne}{#f/16}* 對，那液體\n  對人類有些害處。',
                                "<25>{#p/undyne}{#f/14}* 不過對怪物完全無害！"
                            ])
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}實驗室裡\n有一臺奇怪的機器...",
                        '<18>{#p/papyrus}{#f/0}我聽說ALPHYS\n用它做冰激淋。',
                        '<18>{#p/papyrus}{#f/4}...毫無疑問，\n她會在看\n科幻動漫時吃。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/17}* 啥？？\n* 她從來沒帶過我追劇...",
                                '<18>{#p/papyrus}{#f/4}嗯...',
                                '<18>{#p/papyrus}{#f/0}喔，我知道的！',
                                '<18>{#p/papyrus}{#f/9}你只需要和她\n「打破冰激淋」！',
                                '<25>{#p/undyne}{#f/13}* ...啥玩意？',
                                '<18>{#p/papyrus}{#f/0}打「破冰」激淋！',
                                "<25>{#p/undyne}{#f/14}* 那太荒謬了，\n  不過我喜歡。"
                            ])
                    ],
            () => [
                '<18>{#p/papyrus}{#f/0}說到食物和飲料...',
                '<18>{#p/papyrus}{#f/0}我聽說METTATON\n曾想開一家食品店。',
                '<18>{#p/papyrus}{#f/4}特色食品叫做\n「NEO之力」。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}我不知道\n那是啥意思。"]
                    : [
                        '<25>{#p/undyne}{#f/12}* 聽起來像是\n  廉價的山寨品牌。',
                        "<18>{#p/papyrus}{#f/7}啥？？\nMETTATON才不會\n是那意思！"
                    ])
            ]
        ),
        a_lab_downstairs: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}自動售貨機裡的\n那些花哨的飲料...',
                '<18>{#p/papyrus}{#f/0}我一直都想嘗一口...',
                '<18>{#p/papyrus}{#f/4}但每次我明明買了，\n可飲料就是出不來。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/8}* 要是吐不出來，\n  那就使勁晃機器，\n  啥時候出來啥時候停。",
                        "<18>{#p/papyrus}{#f/0}建議不錯，\n但我更想把機器\n修好。",
                        "<25>{#p/undyne}{#f/1}* 一般搖搖就好了。\n* 我都是這麼修的。",
                        '<18>{#p/papyrus}{#f/4}那你可能可以動「搖」\n我的想法。',
                        "<25>{#p/undyne}{#f/14}* 得了吧，這樣就挺好。"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我還是喝桌子上的\n紅色汽水吧。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 除了搖晃...',
                        '<25>{#p/undyne}{#f/14}* 超強電熱帶是我的\n  另一個修理方式。',
                        '<18>{#p/papyrus}{#f/0}喔對，\n那東西可以修\n任何東西。',
                        '<18>{#p/papyrus}{#f/4}...嗯，\n大部分東西。',
                        "<25>{#p/undyne}{#f/7}* 這樣就夠了！！"
                    ]
        ),
        a_lab_virt: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}真遺憾，\n虛擬空間並不是\n一直開著的。",
                "<18>{#p/papyrus}{#f/7}因此我失去了\n多少樂趣！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}...太可惜了。',
                        "<18>{#p/papyrus}{#f/6}為此我不能\n經營我那舉世聞名\n的餐廳！！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 我可不會用\n  「樂趣」這個詞。',
                        '<18>{#p/papyrus}{#f/5}你真的忍心批評\n像我這樣的骷髏...',
                        '<18>{#p/papyrus}{#f/6}想擁有一家\n舉世聞名的餐廳的\n願望嗎？',
                        '<25>{#p/undyne}{#f/17}* 你這讓我壓力山大啊，\n  Papyrus。',
                        '<18>{#p/papyrus}{#f/4}皇家衛隊的隊長\n居然會說這話。',
                        '<25>{#p/undyne}{#f/14}* 統領皇家衛隊是一回事。',
                        '<25>{#p/undyne}{#f/7}* 但經營餐廳又是\n  另一回事！'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}喔對了，\n關於那家餐廳...',
                '<18>{#p/papyrus}{#f/9}它碰巧是一艘\n巨大的宇宙飛船！',
                '<18>{#p/papyrus}{#f/4}由番茄醬驅動。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/14}* ...還真是。'])
            ]
        ),
        a_path1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我聽說空境\n曾經是一個待命區。',
                '<18>{#p/papyrus}{#f/5}他們打算建造特別多\n的酷玩意，但是...',
                '<18>{#p/papyrus}{#f/4}在實驗室完成後，\n他們的紫色油漆\n用完了。',
                '<18>{#p/papyrus}{#f/4}對於油漆業來說，\n這真是一個巨大的\n退躍。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 你知道他們可以製作\n  更多油漆，對吧？",
                        '<25>{#p/undyne}{#f/7}* 他們放棄的真正原因\n  是因為Mettaton\n  接管了這地盤！！',
                        "<18>{#p/papyrus}{#f/0}你說的跟\n這是件壞事似的。",
                        '<25>{#p/undyne}{#f/17}* ...',
                        '<25>{#p/undyne}{#f/17}* 他就想要\n  在這地盤稱霸。',
                        "<18>{#p/papyrus}{#f/0}喔，我知道了。\n這下我可以\n理解他們了。",
                        '<18>{#p/papyrus}{#f/4}他的顏值確實可以\n稱霸，沒有人不會\n因此愛他。',
                        '<25>{#p/undyne}{#f/12}* ...我不是這意思，\n  但算了。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<19>{#p/papyrus}{#f/0}可惜我們永遠都不能\n看到它們的全部\n潛力了。",
                        '<18>{#p/papyrus}{#f/5}包括那些\n奇怪的建築\n和機器...',
                        "<18>{#p/papyrus}{#f/8}還有那些我本可以\n使用的小發明！"
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/4}如果METTATON\n沒那麼美就好了。",
                        "<18>{#p/papyrus}{#f/6}等等，\n那樣就太糟了！",
                        '<18>{#p/papyrus}{#f/5}但放棄\n待命區也是...',
                        "<25>{#p/undyne}{#f/1}* 也許有一件小發明\n  可以解決這問題。",
                        '<18>{#p/papyrus}{#f/0}就像是...\n顏值補償濾光鏡！？',
                        '<25>{#p/undyne}{#f/18}* 我更傾向於\n  改變他的自我意識。',
                        '<25>{#p/undyne}{#f/17}* 你可以製作一個\n  「意識補償濾波器」。',
                        '<18>{#p/papyrus}{#f/7}別想！'
                    ]
        ),
        a_path2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這些升降機\n特別好玩。',
                "<18>{#p/papyrus}{#f/0}有時候，\n在周圍沒人時...",
                "<18>{#p/papyrus}{#f/0}我就會\n來回搭乘它們。",
                '<18>{#p/papyrus}{#f/4}不過它\n需要一種\n特殊通行證。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/4}* 嘿，Alphys從來\n  都沒給過我通行證！',
                        '<18>{#p/papyrus}{#f/0}也許你該\n向她要一個！',
                        '<25>{#p/undyne}{#f/3}* ...',
                        '<18>{#p/papyrus}{#f/6}...',
                        '<25>{#p/undyne}{#f/11}* ...',
                        '<25>{#p/undyne}{#f/8}* 門都沒有！',
                        '<18>{#p/papyrus}{#f/6}好好說話！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}去吧，試試看！',
                        "<18>{#p/papyrus}{#f/5}不危險的...",
                        '<18>{#p/papyrus}{#f/6}...一般來說。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}...',
                        "<18>{|}{#p/papyrus}{#f/4}我不是唯一\n一個認為你- {%}",
                        '<25>{#p/undyne}{#f/8}* 天啊別！！',
                        '<18>{#p/papyrus}{#f/6}好，好！'
                    ]
        ),
        a_path3: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我聽說空境的\n教學模式很艱苦。',
                '<18>{#p/papyrus}{#f/6}是真的嗎？\n學生真的要遭\n那麼多罪嗎？',
                "<18>{#p/papyrus}{#f/8}不敢想像如果我沒提前\n受到教育會怎麼樣...！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/8}* 我十歲就退學了！！',
                        '<18>{#p/papyrus}{#f/1}啥！？！？',
                        '<18>{#p/papyrus}{#f/6}你怎麼能這麼徹底\n地違反體制！',
                        '<25>{#p/undyne}{#f/1}* 人的生命各不相同，\n  所以不是每個人都要走\n  相同的路，Papyrus。',
                        '<25>{#p/undyne}{#f/1}* 我退學後，\n  ASGORE就成為了\n  我的老師。',
                        '<25>{#p/undyne}{#f/14}* 同時他也是最棒的老師。',
                        '<18>{#p/papyrus}{#f/5}...看來我還有\n許多東西要學...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/8}甚至可能不會得到\n我的特殊攻擊！"]
                    : ["<18>{#p/papyrus}{#f/6}別擔心，\n我這就學！"]
        ),
        a_rg1: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}這裡的實習守衛\n真的難以置信。",
                '<18>{#p/papyrus}{#f/4}他們似乎\n永遠不會迷路。',
                '<18>{#p/papyrus}{#f/5}問題是...',
                '<18>{#p/papyrus}{#f/6}這地方看著...\n啥也沒有啊！！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/7}所有的房間\n都看起來一模一樣！']
                    : [
                        "<25>{#p/undyne}{#f/12}* 實際上，\n  你說的並不過分...",
                        "<25>{#p/undyne}{#f/1}* 他們花了很長時間\n  來記住這地方的布局。",
                        '<18>{#p/papyrus}{#f/0}但最後他們都\n成功記住了，\n對吧？',
                        '<25>{#p/undyne}{#f/16}* 嗯...\n  失敗了億百次後...',
                        '<25>{#p/undyne}{#f/17}* 我放棄了，\n  給他們頭盔上\n  裝了個導航模塊。',
                        '<18>{#p/papyrus}{#f/1}啥！？！？',
                        '<18>{#p/papyrus}{#f/7}這是用科技作弊！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}想知道【你】為啥\n從來都沒迷路過...']
                    : [
                        '<18>{#p/papyrus}{#f/4}我，偉大且\n天賦異稟的\nPAPYRUS...',
                        '<18>{#p/papyrus}{#f/7}永遠不會依賴科技\n來完成工作！',
                        "<18>{#p/papyrus}{#f/0}...除了真正需要時。"
                    ]
        ),
        a_path4: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}傳說有一個地方\n可以將無用的垃圾\n變成珍貴的寶藏。',
                '<18>{#p/papyrus}{#f/9}一個可以將垃圾\n變成黃金的地方！',
                '<18>{#p/papyrus}{#f/4}一個\n吃太空金槍魚\n的地方.....',
                '<18>{#p/papyrus}{#f/5}嗯，放那的東西\n就那麼直接消失了。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}你知道這樣\n的地方嗎？']
                    : [
                        "<25>{#p/undyne}{#f/1}* 聽起來像是\n  Bratty和Catty的地盤。",
                        '<25>{#p/undyne}{#f/14}* 她們愛太空金槍魚\n  甚至超過愛賣垃圾！',
                        '<25>{#p/undyne}{#f/17}* 而且她們\n  真的超愛賣垃圾！！',
                        '<18>{#p/papyrus}{#f/0}哇喔！',
                        '<18>{#p/papyrus}{#f/5}她們有時也會賣\n非垃圾的東西嗎？',
                        '<25>{#p/undyne}{#f/8}* 她們為啥要賣！？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我就當這是一種\n響亮的「可能」吧。']
                    : [
                        '<18>{#p/papyrus}{#f/0}所以BRATTY和CATTY\n是垃圾販子對吧？',
                        "<18>{#p/papyrus}{#f/4}她們肯定\n也認識我兄弟。"
                    ]
        ),
        a_barricade1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這個房間可能有也\n可能沒有路障。',
                '<18>{#p/papyrus}{#f/4}他們說你必須回答\n問題才能解開它們。',
                '<18>{#p/papyrus}{#f/1}這不會是！？\n機智問答節目的\n秘密試鏡吧！？',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 哈，問答節目？',
                        '<18>{#p/papyrus}{#f/9}...幾乎全是\n冷知識類別的問題！！',
                        "<25>{#p/undyne}{#f/1}* 好，問你一個問題。",
                        '<25>{#p/undyne}{#f/12}* 需要多少鞋子...',
                        "<25>{#p/undyne}{#f/7}* 才能把那個機器人\n  的屁股踹飛到太空！！",
                        '<18>{#p/papyrus}{#f/6}呃...',
                        '<18>{#p/papyrus}{#f/5}... 嗯，呃...',
                        '<18>{#p/papyrus}{#f/4}實際上，\n這跟重力有關。',
                        '<25>{#p/undyne}{#f/8}* Papyrus！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}他【已經】有\n一段時間沒播過了。"]
                    : [
                        "<25>{#p/undyne}{#f/1}* 如果你還想答，\n  我這還有一個問題。",
                        '<18>{#p/papyrus}{#f/5}...過幾天吧。',
                        "<18>{#p/papyrus}{#f/4}而且，我們都知道\n他飛到哪了...",
                        '<25>{#p/undyne}{#f/7}* 對！！\n* 太空！！'
                    ]
        ),
        a_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}你知道，可能只有\n我這麼覺得，\n但是...',
                '<18>{#p/papyrus}{#f/4}這謎題超怪的。',
                '<18>{#p/papyrus}{#f/4}...我總是容易\n找到正確的終端。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...一遍又一遍...']
                    : [
                        '<25>{#p/undyne}{#f/1}* 是嗎？\n* 每當我嘗試解決\n  這謎題時...',
                        '<25>{#p/undyne}{#f/17}* 周圍的的一切\n  都開始變得瘋狂！！',
                        "<18>{#p/papyrus}{#f/6}ALPHYS從來都沒\n把你拉回安全點\n過嗎？",
                        '<25>{#p/undyne}{#f/12}* 嗯... 我...',
                        '<18>{#p/papyrus}{#f/6}UNDYNE，\n你幹啥了！？！？',
                        '<25>{#p/undyne}{#f/12}* ...',
                        "<25>{#p/undyne}{#f/12}* 沒啥。",
                        '<25>{#p/undyne}{#f/12}* 除了差點讓我當場消逝。',
                        '<18>{#p/papyrus}{#f/8}不...！\n下次注意點！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}要是你喜歡做這個\n謎題，我將對你\n【另】眼相看。']
                    : ['<18>{#p/papyrus}{#f/4}這樣的維度技術\n問題可大了。']
        ),
        a_mettaton1: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}一個小建議。",
                '<18>{#p/papyrus}{#f/4}當METTATON說要在\n節目中做什麼時...',
                '<18>{#p/papyrus}{#f/4}聽他指揮就行。',
                '<18>{#p/papyrus}{#f/0}沒有什麼「如果」\n「而且」「但是」！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 「然而」呢？',
                        '<18>{#p/papyrus}{#f/4}...',
                        '<18>{#p/papyrus}{#f/4}這只是「但是」\n的另一種說法。',
                        '<25>{#p/undyne}{#f/17}* ...確實。',
                        '<25>{#p/undyne}{#f/14}* 那「除非」呢？',
                        '<18>{#p/papyrus}{#f/4}我們都快禁止完了。',
                        "<25>{|}{#p/undyne}{#f/8}* 但是我還沒說-{%}",
                        '<18>{#p/papyrus}{#f/6}沒有但是！！！',
                        '<25>{|}{#p/undyne}{#f/7}* 如果你只會讓我-{%}',
                        '<18>{#p/papyrus}{#f/7}沒有如果！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}並且沒有然而。']
                    : ['<18>{#p/papyrus}{#f/4}別讓我\n把「也許」也禁了。']
        ),
        a_elevator1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}電梯多，耗時少...',
                "<18>{#p/papyrus}{#f/4}除非它們不工作。",
                '<18>{#p/papyrus}{#f/6}昨天我出來逛時\n不得不步行！！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}要是我知道為啥\n會有人關掉它\n就好了...']
                    : [
                        '<25>{#p/undyne}{#f/12}* 我聽說是Mettaton\n  為了演節目\n  而把電梯關了的。',
                        '<18>{#p/papyrus}{#f/4}真... 真的嗎？',
                        '<25>{#p/undyne}{#f/17}* 據我所知！',
                        '<18>{#p/papyrus}{#f/7}...他只是這次\n冒失了點而已！',
                        '<18>{#p/papyrus}{#f/7}我現在就\n找他說句話！',
                        "<25>{#p/undyne}{#f/7}* 告訴他在你忙的時候\n  取消那些愚蠢的節目！"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}這怎麼看\n都是一場陰謀。"]
                    : [
                        '<18>{#p/papyrus}{#f/4}也許...\n這是我的一次\n機會...',
                        '<18>{#p/papyrus}{#f/9}...來提議建造\n更多的升降機！'
                    ]
        ),
        a_lift: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}這個電梯應該播放\n一套音樂專輯！',
                '<18>{#p/papyrus}{#f/5}最好是愉快的\n布魯斯藍調...',
                "<18>{#p/papyrus}{#f/6}可惜音響壞了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/13}* 布魯斯藍調？\n* 認真的？',
                        "<25>{#p/undyne}{#f/14}* 大夥都知道\n  搖滾樂才是主流！",
                        '<18>{#p/papyrus}{#f/4}啥玩意！？\n搖滾樂超怪的好吧...',
                        "<18>{#p/papyrus}{#f/9}你要是想聽重吉他，\n重金屬樂更好！！",
                        '<25>{#p/undyne}{#f/8}* 什麼，重金屬！？',
                        '<25>{#p/undyne}{#f/4}* 不不不，\n  你應該聽迴響貝斯。',
                        '<18>{#p/papyrus}{#f/6}迴響貝斯！？！？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我可能聽過，\n但也沒聽過幾次。']
                    : [
                        '<18>{#p/papyrus}{#f/0}布魯斯藍調是很好，\n但我最喜歡的是\n斯卡音樂。',
                        '<18>{#p/papyrus}{#f/9}你永遠都聽不夠\n那些扣人心弦的\n小號！'
                    ]
        ),
        a_elevator2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}歡迎來到\n空境二層。',
                '<18>{#p/papyrus}{#f/4}在這裡，\n你可以找到\n許多神奇的東西...',
                '<18>{#p/papyrus}{#f/9}例如謎題！\n路障！\n甚至電視機！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}...不對，那些不是\n一層的東西嗎？"]
                    : [
                        "<25>{#p/undyne}{#f/14}* 所以... \n  這裡和一層\n  一模一樣吧。",
                        '<18>{#p/papyrus}{#f/6}我想確實？？？',
                        '<25>{#p/undyne}{#f/1}* 嘿。\n* 至少二層更大。',
                        '<18>{#p/papyrus}{#f/4}喔，棒欸。\n現在我可以\n更容易迷路了。',
                        '<25>{#p/undyne}{#f/17}* 至少二層有更多\n  酷東西可以看！！',
                        "<18>{#p/papyrus}{#f/6}但這些對迷路\n可沒有幫助！"
                    ])
            ],
            [
                '<18>{#p/papyrus}{#f/5}創造這個區域的\n一定是條懶狗。',
                "<18>{#p/papyrus}{#f/4}這樣那些哨站就\n說得通了..."
            ]
        ),
        a_sans: pager.create(
            0,
            () => [
                '<19>{#p/papyrus}{#f/0}是，我兄弟就用哨站\n賣玉米熱狗。',
                '<18>{#p/papyrus}{#f/4}但是我覺得那並不\n「可口」。',
                "<18>{#p/papyrus}{#f/5}我也要開一個小吃攤，\n這樣他就沒生意做了...",
                '<18>{#p/papyrus}{#f/5}可是我試過了...',
                '<18>{#p/papyrus}{#f/6}星際黑幫總想分一杯羹。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/7}想都別想！！\n我絕不會向黑惡勢力\n低頭！"]
                    : [
                        '<25>{#p/undyne}{#f/17}* ...',
                        '<25>{#p/undyne}{#f/17}* 你說什麼玩意？',
                        '<18>{#p/papyrus}{#f/0}星際黑幫啊。',
                        '<18>{#p/papyrus}{#f/4}你知道的，虛擬世界\n裡的那些。',
                        '<25>{#p/undyne}{#f/12}* 啊，那個星際黑幫啊。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}但是他們穿的還蠻\n整潔的，這一點值得\n表揚。",
                        "<18>{#p/papyrus}{#f/7}可是那不會影響\n我對他們的看法！",
                        '<18>{#p/papyrus}{#f/4}你們的得體打扮就\n只能幫你到這了。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 你覺得「星際黑幫」會插手\n  Sans的玉米熱狗生意嗎？',
                        "<18>{#p/papyrus}{#f/0}哇！好問題！",
                        '<25>{#p/undyne}{#f/14}* 真的嗎？',
                        "<18>{#p/papyrus}{#f/0}但是我不想回答！"
                    ]
        ),
        a_pacing: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}今天我在域外網上\n收到了一條奇怪的\n訊息。',
                '<18>{#p/papyrus}{#f/4}是關於一群被困在\n力場裡的烏賊的。',
                '<18>{#p/papyrus}{#f/5}過著烏賊的生活，\n吃著烏賊的食物...',
                '<18>{#p/papyrus}{#f/4}那些烏賊渴望著有\n一天，他們能夠觸碰\n到星星。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}...到底是什麼意思！？']
                    : [
                        "<25>{#p/undyne}{#f/8}* 有很奇怪嗎？\n* 哈！",
                        '<25>{#p/undyne}{#f/7}* 你聽聽我這個！',
                        '<18>{#p/papyrus}{#f/4}怎麼，更多烏賊？',
                        '<25>{#p/undyne}{#f/14}* 怎麼可能。',
                        '<18>{#p/papyrus}{#f/4}那是什麼\n「穩賺不賠的投資」嗎？',
                        '<25>{#p/undyne}{#f/14}* 怎麼可能。',
                        '<18>{#p/papyrus}{#f/6}還是什麼\n「離開前哨站」的\n獨家捷徑？',
                        "<25>{#p/undyne}{#f/14}* ...還真是。\n* 然後我就給他們\n  屏蔽了。",
                        '<25>{#p/undyne}{#f/7}* 敢拿假訊息糊弄我，\n  還想讓我饒了你？',
                        '<18>{#p/papyrus}{#f/0}就是啊！！',
                        '<18>{#p/papyrus}{#f/5}而且，咱可有\n【貨真價實】的\n自由法寶呢...',
                        '<18>{#p/papyrus}{#f/6}而且，還正跟咱\n打電話呢！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我其實挺好奇，\n那些烏賊會不會\n真的存在呢？',
                        '<18>{#p/papyrus}{#f/4}畢竟宇宙是沒有盡頭的...',
                        '<18>{#p/papyrus}{#f/9}那就意味著無盡的\n可能性，無盡的組合！！'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}祝你終能重獲自由。",
                        '<18>{#p/papyrus}{#f/6}也祝我們未來\n能重獲自由！！'
                    ]
        ),
        a_prepuzzle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}散落在這附近的\n那些花...？',
                "<18>{#p/papyrus}{#f/0}啊，那其實是ASGORE\n的主意。",
                '<18>{#p/papyrus}{#f/4}他就算不是前哨站的\n「大領導」...',
                '<18>{#p/papyrus}{#f/5}也能算個「大齡搗」。',
                '<18>{#p/papyrus}{#f/5}年齡大了，但還喜歡\n搗鼓花花草草的\n「大齡搗」。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 那我是什麼？',
                        '<18>{#p/papyrus}{#f/0}我早就給你想好了。',
                        '<18>{#p/papyrus}{#f/4}他是「大領導」，\n你是「打凌刀」。',
                        '<25>{#p/undyne}{#f/14}* ...「打凌刀」是個啥？',
                        '<18>{#p/papyrus}{#f/9}路見不平，窮追猛{@fill=#ff0}打{@fill=#fff}。\n盛氣{@fill=#ff0}凌{@fill=#fff}人，武功高強。\n朋友有難，兩肋插{@fill=#ff0}刀{@fill=#fff}。',
                        '<25>{#p/undyne}{#f/8}* 妙，太妙了！！！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}國王是「大領導」，\n你是「打凌刀」，\n那我就是「大刀」。']
        ),
        a_puzzle2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}之前解這個謎題的時候...',
                "<18>{#p/papyrus}{#f/6}不管我往哪兒跑，\n最後總是回到起點！",
                '<18>{#p/papyrus}{#f/5}...至少那個時候\n確實是這樣。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 哎呀真是的。\n* 白費這力氣幹嘛？',
                        '<18>{#p/papyrus}{#f/6}因為啊！！',
                        '<18>{#p/papyrus}{#f/6}解謎本應是一種樂趣的！！',
                        "<25>{#p/undyne}{#f/12}* 你就不能用飛行魔法\n  繞過去嗎？",
                        '<18>{#p/papyrus}{#f/4}飛行魔法非緊急情況\n我是不會用的。',
                        '<25>{#p/undyne}{#f/1}* 那什麼才算是「緊急情況」。',
                        '<18>{#p/papyrus}{#f/7}反正就解個謎肯定\n算不上緊急情況！',
                        "<25>{#p/undyne}{#f/14}* 那你就慢慢解吧，\n  有你好受的。",
                        '<18>{#p/papyrus}{#f/7}我偏要解！！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}數字，到處都是數字！！',
                        '<18>{#p/papyrus}{#f/6}到底是什麼意思！？！？'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/5}到處飛來飛去可不公平。",
                        '<25>{#p/undyne}{#f/11}* 那你就甘願自己受苦...？',
                        '<18>{#p/papyrus}{#f/9}一份付出，一份回報！',
                        '<25>{#p/undyne}{#f/17}* ...那什麼才算是「付出」。'
                    ]
        ),
        a_mettaton2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}啊...時過金遷。',
                ...(SAVE.data.n.plot < 60
                    ? [
                        '<18>{#p/papyrus}{#f/4}正如你所知...',
                        "<18>{#p/papyrus}{#f/5}下一集裡就沒有我了。",
                        "<18>{#p/papyrus}{#f/6}...我坐在他旁邊\n會很緊張的。"
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}METTATON想讓我上，可...',
                        '<18>{#p/papyrus}{#f/5}經過一番思考，\n我意識到...',
                        "<18>{#p/papyrus}{#f/6}...我不能坐在他旁邊，\n我會緊張死的。"
                    ]),
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* ...你真的很喜歡他啊。",
                        '<18>{#p/papyrus}{#f/4}呃，他【真的】很有魅力...',
                        "<18>{#p/papyrus}{#f/6}...但我還沒\n下定決心！",
                        "<25>{#p/undyne}{#f/3}* 才幾分鐘而已。",
                        '<18>{#p/papyrus}{#f/4}哈？\n你是不是以為...',
                        '<18>{#p/papyrus}{#f/7}...我們倆之間有啥\n特殊關係吧！？！？',
                        '<25>{#p/undyne}{#f/14}* 才怪，\n  怎麼可能。',
                        "<25>{#p/undyne}{#f/17}* 不過這也太明顯了，\n  我都忍不住把真相\n  說出來了。",
                        '<18>{#p/papyrus}{#f/5}（唉...）'
                    ])
            ],
            () =>
                solo()
                    ? SAVE.data.n.plot < 60
                        ? ['<18>{#p/papyrus}{#f/0}幸好我找了個替身。']
                        : SAVE.data.b.undyne_respecc
                            ? ['<18>{#p/papyrus}{#f/0}謝天謝地，\nUNDYNE幫我\n參加了節目。']
                            : ['<18>{#p/papyrus}{#f/0}謝天謝地，\n我兄弟幫我\n參加了節目。']
                    : ['<25>{#p/undyne}{#f/12}* Papyrus正白日做夢，\n  沒空接電話。']
        ),
        a_rg2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}小心點，人類！',
                '<18>{#p/papyrus}{#f/5}這區域的守衛\n剛剛結束了訓練。',
                "<18>{#p/papyrus}{#f/6}她們也許會忽略\n一些皇家備忘錄！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}順便問下，\n啥是皇家備忘錄？"]
                    : [
                        '<25>{#p/undyne}{#f/16}* 對這事我深有體會...',
                        '<18>{#p/papyrus}{#f/5}哈？\n她們經常忽略你的\n備忘錄嗎？',
                        '<25>{#p/undyne}{#f/14}* 喔，\n  那倒不會。',
                        "<25>{#p/undyne}{#f/10}* 不過她們倒是經常會忽略\n  Alphys的備忘錄。",
                        "<18>{#p/papyrus}{#f/6}但她可是\n皇家科學員啊！",
                        "<18>{#p/papyrus}{#f/6}還是\n皇室的親信！",
                        "<25>{#p/undyne}{#f/12}* 是啊...\n  按理說就是這樣。",
                        "<25>{#p/undyne}{#f/16}* 但自從Roman教授去世後，\n  我們每個人的心中\n  都還沒做好替代他的準備。",
                        "<26>{#p/undyne}{#f/10}* 因此皇家衛隊的大多數人\n  都不把他的繼任者\n  當回事，所以..",
                        '<25>{#p/undyne}{#f/9}* 這也影響了\n  實習守衛對她的看法。',
                        '<18>{#p/papyrus}{#f/5}喔...',
                        "<25>{#p/undyne}{#f/17}* 我知道的。\n* 這確實... 不怎麼樣。",
                        "<26>{#f/9}* 但她太笨了，\n  還不能徹底地\n  證明自己。",
                        '<26>{#f/16}* 所以...\n  我大概能理解。',
                        "<18>{#p/papyrus}{#f/5}希望她終將\n得到應有的尊重。",
                        '<26>{#p/undyne}{#f/14}* 希望吧。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我想知道它和\n普通的備忘錄\n有啥區別。"]
                    : ['<18>{#p/papyrus}{#f/4}希望\n那一天不會太遠。']
        ),
        a_barricade2: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}對這個房間，\n我沒啥要說的。",
                '<18>{#p/papyrus}{#f/5}實際上，\n我唯一要說的是...',
                '<18>{#p/papyrus}{#f/6}...是我\n【無】話可說！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}額，實際上，\n我還是有話可說的。']
                    : [
                        '<26>{#p/undyne}{#f/1}* 我有句話要說。',
                        '<18>{#p/papyrus}{#f/6}啥？\n是什麼？',
                        '<26>{#p/undyne}{#f/14}* 這個房間可能有\n  也可能沒有路障。',
                        "<18>{#p/papyrus}{#f/4}在一層已經有\n一個這樣的房間了。",
                        '<18>{#p/papyrus}{#f/7}說點原創的！！',
                        "<26>{#p/undyne}{#f/17}* 說不出來了。",
                        '<18>{#p/papyrus}{#f/5}... 沒關係...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}也許在另一個房間\n我就有話說了。"]
                    : ["<18>{#p/papyrus}{#f/0}也許這個房間\n不是很有趣。"]
        ),
        a_split: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}看，那是著名的\nMETTATON噴泉！",
                '<18>{#p/papyrus}{#f/4}我聽說這費了\n九牛二虎之力\n才修建好。',
                '<18>{#p/papyrus}{#f/5}無數個日夜\n刻苦耐勞，\n兢兢業業...',
                '<18>{#p/papyrus}{#f/6}才得到那麼\n完美無瑕的\n長方形。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 然後他毀了它，\n  這樣就可以自己設計了。',
                        '<18>{#p/papyrus}{#f/6}真的嗎？？',
                        '<25>{#p/undyne}{#f/1}* 第一個沒有達到\n  他的「高標準」。',
                        '<18>{#p/papyrus}{#f/4}等等，\n電視上有關於\n這個的訊息。',
                        '<25>{#p/undyne}{#f/14}* 喔對，他決定向\n  全前哨站直播。',
                        '<25>{#p/undyne}{#f/17}* 他必須向每個人展示\n  他那所謂的出類拔萃。',
                        '<18>{#p/papyrus}{#f/4}嗯，畢竟這是\n【他的】雕像...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}我兄弟告訴我\n那說的並不完全對。"]
                    : [
                        '<18>{#p/papyrus}{#f/5}我想知道他為啥\n第一次要\n僱別人設計。',
                        "<18>{#p/papyrus}{#f/4}要是我最開始\n就自己做了..."
                    ]
        ),
        a_offshoot1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}訊號似乎不太好。',
                "<18>{#p/papyrus}{#f/6}就像是...\n被幹擾了？？",
                "<18>{#p/papyrus}{#f/4}也許最好在\n其他地方打電話。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 也許人類在空境的\n  舊瞭望塔附近。",
                        "<25>{#p/undyne}{#f/17}* 他們過去\n  用的金屬有點問題。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}上一通電話\n沒有打過去嗎？']
                    : ["<25>{#p/undyne}{#f/14}* 不過沒啥大不了的。"]
        ),
        a_elevator3: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我第一次\n來到這個房間時...',
                '<18>{#p/papyrus}{#f/6}看到又得\n乘一部電梯，\n讓我煩死了。',
                '<18>{#p/papyrus}{#f/5}然後，\n我有點釋然了...',
                '<18>{#p/papyrus}{#f/4}...因為我發現\n附近沒有一個\n無聊的廣告。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 所以你喜歡乘電梯嗎？',
                        '<18>{#p/papyrus}{#f/6}嗯...',
                        '<18>{#p/papyrus}{#f/5}有音樂還好，\n要是沒音樂\n簡直痛苦萬分。',
                        '<18>{#p/papyrus}{#f/4}不過我承認\n它們是必需品。',
                        "<25>{#p/undyne}{#f/1}* 好吧，\n  你該慶幸自己\n  不住在尖塔房子裡。",
                        '<18>{#p/papyrus}{#f/5}為啥？',
                        '<25>{#p/undyne}{#f/17}* 那裡全是電梯。',
                        '<18>{#p/papyrus}{#f/6}不——...！',
                        "<25>{#p/undyne}{#f/7}* 而且它們甚至\n  都沒啥必要。",
                        "<18>{#p/papyrus}{#f/8}不要啊...！",
                        "<25>{#p/undyne}{#f/8}* 最後它們甚至\n  不帶音樂！！！",
                        "<18>{#p/papyrus}{#f/1}簡直像是地獄！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}要是有更好的\n辦法就好了。',
                        '<18>{#p/papyrus}{#f/0}...喔，等等，\n絕對有！',
                        '<18>{#p/papyrus}{#f/9}升降機！！！'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/5}沒有音樂\n的電梯就像...',
                        '<18>{#p/papyrus}{#f/5}一盤不加番茄醬的\n義大利麵。',
                        '<18>{#p/papyrus}{#f/4}如果是我兄弟那就是\n奶油奶酪醬。',
                        "<18>{#p/papyrus}{#f/4}...而且人們總是說\n我很奇怪。"
                    ]
        ),
        a_elevator4: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}如果一隻骷髏\n勇闖安保門，\n會發生什麼？',
                '<19>{#p/papyrus}{#f/4}答案是...\n他會差點被電嗝屁。',
                '<18>{#p/papyrus}{#f/6}就像我第一次\n來這裡那樣！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 這麼說，這電門跟你\n  關係不一般啊。",
                        '<18>{#p/papyrus}{#f/4}喔，這門給我留下了\n極其深刻的印象...',
                        '<18>{#p/papyrus}{#f/5}反正印象不咋樣。',
                        '<25>{#p/undyne}{#f/14}* 這就叫「無知者無畏」吧？',
                        "<18>{#p/papyrus}{#f/7}別以為我傻！\n啥危險我能不知道？",
                        '<18>{#p/papyrus}{#f/5}要說「自不量力」\n還差不多。',
                        '<25>{#p/undyne}{#f/17}* 不對。',
                        "<25>{#p/undyne}{#f/17}* 那安保門給你「輸送」了\n  那麼多力量，\n  你咋還能「自不量力」？",
                        "<18>{#p/papyrus}{#f/4}哎，好像有道理..."
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/6}哎，說來話長啊，\n以後再說這事吧。"]
                    : ["<18>{#p/papyrus}{#f/0}這麼一想，被電也挺好。"]
        ),
        a_auditorium: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在這主持過\n一次喜劇節目。',
                '<18>{#p/papyrus}{#f/4}那場節目\n的名字叫做...',
                '<18>{#p/papyrus}{#f/4}...《衫燃肋下》。',
                "<18>{#p/papyrus}{#f/5}雖然名字很爛，\n但節目並沒失敗。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}確切的說，\n那場節目大受歡迎！！']
                    : [
                        "<25>{#p/undyne}{#f/1}* 實話說，我很驚訝\n  他為啥不趁熱打鐵，\n  反而要功成身退。",
                        '<25>{#p/undyne}{#f/16}* 也許他只願當個哨兵，\n  整天逍遙自在吧。',
                        '<18>{#p/papyrus}{#f/5}對。\n一定是這樣的。',
                        "<18>{#p/papyrus}{#f/4}絕對沒有其他原因。",
                        '<25>{#p/undyne}{#f/14}* ...啥？'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我和你一樣\n對此驚訝。"]
                    : ["<18>{#p/papyrus}{#f/0}有些事\n還不到提的時候。"]
        ),
        a_aftershow: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}所以這裡是\nBRATTY和CATTY的\n工作區，對吧？',
                "<18>{#p/papyrus}{#f/0}比我想的還乾淨。",
                "<18>{#p/papyrus}{#f/4}她們倆不應該是\n垃圾販子嗎...？",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...也許垃圾\n被整理得很好。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 我覺得她們倆正很好地\n  保護著她們收集來的\n  垃圾。",
                        '<25>{#p/undyne}{#f/16}* Alphys告訴過我\n  她們仨過去是怎麼\n  撿垃圾的...',
                        "<25>{#p/undyne}{#f/9}* 並非只是古怪的愛好。\n* 也是生活。",
                        '<18>{#p/papyrus}{#f/0}感覺好好玩的亞子。',
                        '<25>{#p/undyne}{#f/1}* 此外，\n  所有最酷的玩意都是被\n  喜歡她們的人發現的。',
                        '<18>{#p/papyrus}{#f/9}像是上次電視節目\n中的那個喵喵玩偶！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}整理垃圾...',
                        "<18>{#p/papyrus}{#f/4}這倆詞組成的句子\n我還是頭一回說。"
                    ]
                    : ['<18>{#p/papyrus}{#f/0}不知道人類會不會\n喜歡翻怪物垃圾。']
        ),
        a_hub1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}喔... 這裡是迴廊中央。',
                '<18>{#p/papyrus}{#f/4}第一次聽到\n這名的時候...',
                "<18>{#p/papyrus}{#f/5}我還納悶...\n這裡啥時候來了個\n姓「回」的郎中？",
                "<18>{#p/papyrus}{#f/0}但我一琢磨，\n這裡好像真沒醫生，\n那來個郎中也合理！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 「迴廊」，「郎中」，「中央」...',
                        "<26>{#p/undyne}{#f/14}* 哇，我要是不認識你，\n  光聽你念叨這些詞，\n  還得把你當成大詩人呢！",
                        '<18>{#p/papyrus}{#f/6}...你說我，詩人？',
                        "<18>{#p/papyrus}{#f/5}算了吧，\n我可配不上。",
                        "<25>{#p/undyne}{#f/17}* 開玩笑吧？\n* 你很有這種天賦。",
                        '<18>{#p/papyrus}{#f/4}也說不定...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}而且，這裡的食物\n也挺棒的。']
                    : ['<18>{#p/papyrus}{#f/0}如果我會寫日本俳句，\n那我就叫「帕俳如詩」。', '<18>{#p/papyrus}{#f/5}「帕俳如詩」...\n這{@fill=#ff0}回琅{@fill=#fff}琅上口了。']
        ),
        a_dining: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}不知道你咋想，\n但這地方的食物...",
                '<18>{#p/papyrus}{#f/6}...都是些\n什麼鬼玩意！！',
                "<18>{#p/papyrus}{#f/4}好像每個人\n都忘記了怎麼烹飪。",
                "<18>{#p/papyrus}{#f/7}我的意面風味的\n義大利麵哪去了！？",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 這提醒了我...',
                        '<25>{#p/undyne}{#f/1}* 我有次想給皇家衛隊\n  添一個炊事員。',
                        "<25>{#p/undyne}{#f/16}* 我們會有充滿美味的餐廳，\n  精緻的食物....",
                        '<25>{#p/undyne}{#f/17}* ...直到，\n  Asgore嘗了口我做的菜。',
                        '<18>{#p/papyrus}{#f/4}嗯...',
                        "<18>{#p/papyrus}{#f/9}也許你番茄醬\n沒加夠！",
                        '<25>{#p/undyne}{#f/3}* 再多的番茄醬\n  也不能彌補這種暴行。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}上次我想點它時，\n他們...',
                        "<18>{#p/papyrus}{#f/5}...這麼說吧，\n似乎這讓他們的大腦\n停止了思考。"
                    ]
                    : ['<18>{#p/papyrus}{#f/4}也許應該讓我來做。']
        ),
        a_hub2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}人生就像一盤棋局。',
                '<18>{#p/papyrus}{#f/5}讓心\n靜如水...',
                '<18>{#p/papyrus}{#f/5}然後捕獲棋子...',
                '<18>{#p/papyrus}{#f/6}再然後，呃...',
                '<18>{#p/papyrus}{#f/4}好吧，\n人生一點都不像\n棋局。',
                '<18>{#p/papyrus}{#f/0}但它們之間\n確實有相同之處。',
                '<18>{#p/papyrus}{#f/9}就是你永遠都不知道\n接下來會\n發生什麼！！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 也有點像一盒樹膠。',
                        '<18>{#p/papyrus}{#f/0}是啊，\n確實很像！',
                        "<18>{#p/papyrus}{#f/4}不對，\n不應該像\n一盒巧克力嗎？",
                        '<25>{#p/undyne}{#f/14}* 那是人類的表達。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}但也許更像\n一盒巧克力。"]
                    : ['<18>{#p/papyrus}{#f/0}巧克力和樹膠\n的味道其實很像。']
        ),
        a_lookout: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}假以時日，\n我們都將成為\n星際旅者。',
                '<18>{#p/papyrus}{#f/5}去探索那些\n深邃的未知...',
                '<18>{#p/papyrus}{#f/5}遠離這座\n古老的監獄。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 別告訴我\n  你在策劃越獄！",
                        "<18>{#p/papyrus}{#f/5}別擔心，\n這只是自由的寓言。",
                        '<18>{#p/papyrus}{#f/4}【真正的】越獄\n太可疑了。',
                        '<25>{#p/undyne}{#f/16}* 對對...',
                        '<18>{#p/papyrus}{#f/5}此外，\n如果我想做\n正確的事...',
                        "<18>{#p/papyrus}{#f/6}我將召開\n緊急會議！",
                        "<25>{#p/undyne}{#f/12}* 天，多麼艱巨啊。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}只希望，\n當我們到達\n星星那邊時...",
                        "<18>不會遇到任何\n特烏叛賊。"
                    ]
                    : ['<18>{#p/papyrus}{#f/5}抱歉。', "<18>{#p/papyrus}{#f/4}我可沒吐槽。"]
        ),
        a_hub3: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}這不是那些\n喜好寒冷的人們\n常去的消遣之地嗎？",
                '<18>{#p/papyrus}{#f/5}我為他們\n感到難過...',
                '<18>{#p/papyrus}{#f/9}...所以我打算哪天\n給他們買個冰箱！',
                "<18>{#p/papyrus}{#f/0}這樣，\n他們附近就會有\n一塊寒冷的地方了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 說到附近...',
                        "<25>{#p/undyne}{#f/8}* 我們就在隔壁！！",
                        '<18>{#p/papyrus}{#f/9}對！！\n就在你右下角！！',
                        '<25>{#p/undyne}{#f/17}* 是隔壁，不是下面。',
                        "<18>{#p/papyrus}{#f/6}...是在平面圖的\n下面！！",
                        '<25>{#p/undyne}{#f/14}* 我懷疑人類\n  都不知道那長啥樣。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}科技改變世界！"]
                    : [
                        '<18>{#p/papyrus}{#f/6}還在等什麼呢？！！\n快下來！！',
                        '<25>{#p/undyne}{#f/7}* 他是說去隔壁！！'
                    ]
        ),
        a_plaza: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}那是BURGIE的商店。",
                '<18>{#p/papyrus}{#f/6}儘管他賣的\n都是些垃圾食品...',
                '<18>{#p/papyrus}{#f/5}但他卻像一個\n真正的男子漢。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* 你要這麼說也不是不行。",
                        '<18>{#p/papyrus}{#f/5}無可否認，\n和他說話確實會\n讓人感到緊張。',
                        "<18>{#p/papyrus}{#f/6}但我不認為\n這是他的錯！！",
                        "<18>{#p/papyrus}{#f/4}這... 實際上是\nMETTATON的錯。",
                        "<18>{#p/papyrus}{#f/9}但別擔心！\n我待會就去跟他\n談這事！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}當然你必須\n要贏得他的尊重。']
                    : ['<18>{#p/papyrus}{#f/4}我和那機器人有...\n一大堆要討論的。']
        ),
        a_elevator5: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}這個「休閒迴廊」\n當然是用來休閒的...',
                '<18>{#p/papyrus}{#f/5}...想幹啥都行。',
                "<18>{#p/papyrus}{#f/6}但我想知道\n蒲公罌到底有啥\n神奇的？",
                '<18>{#p/papyrus}{#f/4}可以回應\n人們的粟求嗎？',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}嗯...\n我想找個時間\n試試。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 我想你不會喜歡的，\n  Papyrus。",
                        "<25>{#p/undyne}{#f/17}* 這不是你的作風。",
                        "<18>{#p/papyrus}{#f/5}是啊，\n興許我該聽你的。",
                        '<25>{#p/undyne}{#f/14}* 那必須的。',
                        '<18>{#p/papyrus}{#f/9}但我還是要\n試一試！！',
                        '<25>{#p/undyne}{#f/17}* ...'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}不過我儘量不會在\n休閒迴廊試的。',
                '<18>{#p/papyrus}{#f/4}我這可是\n在為科學獻身。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/12}* 啐，是是是...'])
            ]
        ),
        a_hub4: pager.create(
            0,
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}所以那邊\n有一堆好玩的？",
                        '<18>{#p/papyrus}{#f/9}聽起來是個\n消遣的好去處！！',
                        "<18>{#p/papyrus}{#f/0}有時間我一定會去\n那邊看看。",
                        "<18>{#p/papyrus}{#f/4}這可比杵在\nUNDYNE家門口好多了。"
                    ]
                    : ["<25>{#p/undyne}{#f/8}* 想聊天？\n* 我們就在這裡，小混蛋！"],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}也許在我們\n跟她消遣過後...',
                        '<18>{#p/papyrus}{#f/0}我們就都\n可以去那玩了！'
                    ]
                    : ["<25>{#p/undyne}{#f/8}* 想聊天？\n* 我們就在這裡，小混蛋！"]
        ),
        a_sleeping1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我聽說這家旅館\n是在額外的維度\n建造的。',
                '<18>{#p/papyrus}{#f/4}維度...\n層面...',
                '<18>{#p/papyrus}{#f/5}他們會在我們打盹時\n多給我們一層\n毯子嗎？',
                '<18>{#p/papyrus}{#f/0}當然我是\n替我朋友問的。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 確實，因為你\n  一直精神抖擻。',
                        "<18>{#p/papyrus}{#f/0}完全正確！\n我不能浪費時間\n在打盹上。",
                        '<25>{#p/undyne}{#f/14}* 那睡覺呢？',
                        '<18>{#p/papyrus}{#f/6}睡覺？？？',
                        "<18>{#p/papyrus}{#f/4}...那只是我兄弟\n用來打盹的藉口。",
                        '<25>{#p/undyne}{#f/17}* 顯而易見！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}喔，我？\n我才不打盹。",
                        '<18>{#p/papyrus}{#f/4}我只是碰巧\n閉了下眼睛。'
                    ]
                    : ["<18>{#p/papyrus}{#f/4}他能從床上爬起來\n真是個奇蹟。"]
        ),
        a_hub5: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}如果你是要離開\n休閒迴廊然後繼續\n前進，那我...",
                "<18>{#p/papyrus}{#f/5}那我就\n跟你\n打不了電話了。",
                "<18>{#p/papyrus}{#f/4}但你如果\n是要回去...",
                "<18>{#p/papyrus}{#f/0}...那就沒問題了！！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 我們哪都不去。",
                        '<18>{#p/papyrus}{#f/6}絕對不走！！！',
                        '<18>{#p/papyrus}{#f/5}雖然，在有些時候，\n我們免不了要離開。',
                        "<25>{#p/undyne}{#f/16}* 確實如此，但是...",
                        '<25>{#p/undyne}{#f/17}* 但是沒必要擔心這個！',
                        '<18>{#p/papyrus}{#f/0}完全正確。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}所以你\n是去是回？',
                        "<18>{#p/papyrus}{#f/5}這是個\n艱難的抉擇。"
                    ]
                    : ['<18>{#p/papyrus}{#f/6}不過不需要擔心！！']
        )
    },

    s_save_starton: {
        s_crossroads: {
            name: '星港 - 停靠港',
            text: () =>
                SAVE.data.n.plot < 29
                    ? world.edgy
                        ? ['<32>{#p/human}* （有個骷髏沒有出現，\n  這使你充滿了決心。）']
                        : ["<32>{#p/human}* （那對骷髏兄弟的滑稽互動\n  使你充滿了決心。）"]
                    : papreal() || world.runaway
                        ? ['<32>{#p/human}* （孤零零的箱子使你充滿了決心。）']
                        : ['<32>{#p/human}* （箱子現在能放心了。）\n* （這當然使你充滿了決心。）']
        },
        s_pacing: {
            name: '星港 - 月巖小路',
            text: () =>
                world.runaway || epilogueOverride(world.population < 6) || world.genocide || roomKills().s_pacing > 1
                    ? SAVE.data.n.plot < 29
                        ? ['<32>{#p/human}* （星光黯淡了。）\n* （不知怎地，這使你充滿了決心。）']
                        : ['<32>{#p/human}* （群星不再閃耀。）\n* （當然，這使你充滿了決心。）']
                    : SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （無謂的爭論總算平息了。）',
                            '<32>* （這使你充滿了決心。）'
                        ]
                        : [
                            '<32>{#p/human}* （月巖商人在前景裡\n  輕浮地爭論著。）',
                            '<32>* （這使你充滿了決心。）'
                        ]
        },
        s_spaghetti: {
            name: '星港 - 意面樞紐',
            text: () =>
                [
                    ['<32>{#p/human}* （一盤違反物理定律的義大利麵\n  使你充滿了決心。）'],
                    [
                        '<32>{#p/human}* （現在，這盤義大利麵\n  也遵循物理規律了。）',
                        '<32>{#p/human}* （這使你充滿了決心。）'
                    ],
                    ['<32>{#p/human}* （義大利麵沒了。）', '<32>{#p/human}* （這使你充滿了決心。）']
                ][trueSpaghettiState()]
        },
        s_town1: {
            name: '星港 - 小鎮',
            text: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （小鎮也許被棄，但其可愛依舊。）',
                        '<32>{#p/human}* （這使你充滿了決心。）'
                    ]
                    : papreal() || world.runaway
                        ? ['<32>{#p/human}* （小鎮籠罩在一片陰影中，\n  這使你充滿了決心。）']
                        : ['<32>{#p/human}* （這個可愛的小鎮\n  使你充滿了決心。）']
        }
    }
};


// END-TRANSLATE
