import { ca_state, cf2_state } from '../../../code/citadel/extras';
import { asrielinter, cs_state } from '../../../code/common/api';
import { spawn } from '../../../code/systems/core';
import { battler, calcLV, choicer, instance, pager, player, postSIGMA, world } from '../../../code/systems/framework';
import { SAVE } from '../../../code/systems/save';
import { CosmosUtils } from '../../../code/systems/storyteller';

// START-TRANSLATE

export default {
    a_citadel: {
        youvedoneitnow: [
            [
                '<32>{#p/human}* （一股暗流在你心中充盈。）',
                '<32>{#p/human}* （你祈祷，这只是一场噩梦。）'
            ],
            [
                '<32>{#p/human}* （你拼命想从那黑暗中挣脱出来。）',
                '<32>{#p/human}* （你竭尽全力与之抗争，\n  但无济于事。）'
            ],
            [
                '<32>{#p/human}* （你大声呼救，但谁也没有来。）',
                '<32>{#p/human}* （你别无所求，只希望能彻底解脱。）'
            ],
            ['<32>{#p/human}* （...）', '<32>{#p/human}* （你深吸一口气，\n  准备迎接最终的结局。）'],
            ['<32>{#p/human}* （...）', '<32>{#p/human}* （你已做好准备。）']
        ],
        hypertext: {
            count: '$(x)秒后重启',
            death1: ['{#p/human}（你深吸了一口气。）', "（你充满了决心。）"],
            death2: [
                "{#p/human}{#v/1}{@fill=#42fcff}失败了没关系...",
                '{@fill=#42fcff}沉住气，再来一次吧...'
            ],
            death3: ['{#p/human}{#v/2}{@fill=#ff993d}可别在这会儿就放弃。', '{@fill=#ff993d}起来，继续作战！'],
            death4: ["{#p/human}{#v/3}{@fill=#003cff}相信自己能行的。", "{@fill=#003cff}别退缩！"],
            death5: [
                '{#p/human}{#v/4}{@fill=#d535d9}活过这轮不成问题...',
                '{@fill=#d535d9}继续前进。'
            ],
            death6: [
                "{#p/human}{#v/5}{@fill=#00c000}整个世界都指望你了...",
                '{@fill=#00c000}相信自己！'
            ],
            death7: ["{#p/human}{#v/6}{@fill=#faff29}他早晚会败下阵来。"],
            cyan1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某个迷失灵魂呼唤着你。',
                '<99>{*}{@fill=#faff29}依靠{@mystify=耐心而忖恧㤈耏寸}耐心{@mystify=}，将会有望逃脱。',
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}帮我拿回小熊座...',
                '<99>{*}{#p/human}（按[Z]传送。）'
            ],
            cyan2: [
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}那个存在，正伺机而动。',
                '<99>{*}{@fill=#42fcff}有了耐心，你就能挺住不败...'
            ],
            orange1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某个迷失灵魂呼唤着你。',
                '<99>{*}{@fill=#faff29}凭借{@mystify=勇气勈氣甬気力乞}勇气{@mystify=}，或将摆脱束缚。',
                "<99>{*}{#p/human}{#v/2}{@fill=#ff993d}别忘了我的超能手套！",
                '<99>{*}{#p/human}（按[Z]释放冲击波。）'
            ],
            orange2: [
                '<99>{*}{#p/human}{#v/2}{@fill=#ff993d}那个存在，正不断靠近...',
                '<99>{*}{@fill=#ff993d}有了勇气，就能重拳出击！'
            ],
            blue1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某个迷失灵魂呼唤着你。',
                '<99>{*}{@fill=#faff29}坚守{@mystify=正直㱏十止且上目}正直{@mystify=}，必定能够逃脱。',
                "<99>{*}{#p/human}{#v/3}{@fill=#003cff}帮我带回我最信赖的悬浮靴。"
            ],
            blue2: [
                '<99>{*}{#p/human}{#v/3}{@fill=#003cff}那个存在，正立于一处。',
                '<99>{*}{@fill=#003cff}坚守正直，你就能迎难而上。'
            ],
            purple1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某个迷失灵魂呼唤着你。',
                '<99>{*}{@fill=#faff29}拥有{@mystify=毅力䝘刀豙万殳勹}毅力{@mystify=}，定可摆脱束缚。',
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}一台平板电脑就能伴你远行。'
            ],
            purple2: [
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}那个存在，已不再稳定。',
                '<99>{*}{@fill=#d535d9}拥有毅力，怎会轻言放弃？'
            ],
            green1: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}某个迷失灵魂呼唤着你。',
                '<99>{*}{@fill=#faff29}心怀{@mystify=善良譱艮言㫐羊哴}善良{@mystify=}，终能冲破枷锁。',
                '<99>{*}{#p/human}{#v/5}{@fill=#00c000}请用那架塔布拉木琴解救我！'
            ],
            green2: [
                '<99>{*}{#p/human}{#v/5}{@fill=#00c000}那个存在，正土崩瓦解...',
                '<99>{*}{@fill=#00c000}心怀善意，定会立于不败之地...'
            ],
            yellow: [
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}迷失的灵魂呼唤了你。',
                '<99>{*}{@fill=#faff29}秉持正义，你一一回应。',
                '<99>{*}{@fill=#faff29}将他们从牢笼中解放。',
                '<99>{*}{#p/human}{#v/1}{@fill=#42fcff}终于啊。',
                "<99>{*}{#p/human}{#v/2}{@fill=#ff993d}大英雄！",
                "<99>{*}{#p/human}{#v/3}{@fill=#003cff}干得好。",
                '<99>{*}{#p/human}{#v/4}{@fill=#d535d9}谢谢你...',
                "<99>{*}{#p/human}{#v/5}{@fill=#00c000}太棒了...！",
                '<99>{*}{#p/human}{#v/6}{@fill=#faff29}我们的力量归你了。',
                '<99>{*}{@fill=#faff29}有了这些力量，就能彻底击败那东西。',
                '<99>{*}{@fill=#faff29}事成之后...',
                '<99>{*}{@fill=#faff29}...去做你必须要做的事吧。',
                '<99>{*}{@fill=#faff29}现在，结果了它！',
                '<99>{*}{#p/human}（按[Z]射击。）'
            ],
            boot: '重启中...',
            init: '已就位',
            warn: '警告...',
            file1saved: '存档1 已保存',
            file1loaded: '存档1 已载入',
            file2saved: '存档2 已保存',
            file2loaded: '存档2 已载入',
            file3saved: '存档3 已保存',
            file3loaded: '存档3 已载入',
            file4saved: '存档4 已保存',
            file4loaded: '存档4 已载入',
            file5saved: '存档5 已保存',
            file5loaded: '存档5 已载入',
            file6saved: '存档6 已保存',
            file6loaded: '存档6 已载入'
        },
        noequip: ['<32>{#p/human}* （你打算不这么做。）'],
        genotext: {
            monologue: [
                (re: boolean) => [
                    ...(re
                        ? ['<26>{#p/asriel2}{#f/13}* 我之前说到...']
                        : ["<25>{#p/asriel2}{#f/13}* 其实..."]),
                    "<25>{#f/16}* ...我早就亲手毁灭过\n  这该死的前哨站。",
                    "<25>{#f/15}* 一次又一次，一次又一次...\n* 呵，我早就记不清\n  自己看过多少条时间线了。",
                    '<25>{#f/23}* 可是...',
                    "<25>{#f/16}* 我纵使可以随心所欲，\n  但一直觉得... 缺点什么。"
                ],
                (re: boolean) => [
                    '<25>{#p/asriel2}{#f/15}* 那时，我从昏迷中苏醒。\n  却发现自己变成了一颗星星。',
                    "<25>{#f/16}* 我没有手，没有腿，\n  什么都做不了。",
                    "<25>{#f/13}* 我不知所措，希望有人\n  能来帮助我，关心我...",
                    '<25>{#f/13}* 我大声呼救...',
                    '<25>{#f/23}* 我竭力呼喊...',
                    '<25>{#f/7}* ...',
                    '<25>{#f/6}* ...但是谁也没有来。'
                ],
                (re: boolean) => [
                    ...(re
                        ? ["<25>{#p/asriel2}{#f/6}* 之前说到，再度苏醒后，\n  星星身的我再也无法\n  回归正常生活了。"]
                        : []),
                    "<25>{#p/asriel2}{#f/15}* 我不仅失去四肢，\n  更失去了“爱与被爱”的能力。",
                    '<25>{#f/23}* 我很害怕，我很忧虑。\n* 我别无所求，\n  只希望能让一切恢复正常。',
                    "<25>{#f/13}* 所以，我去找父亲，\n  希望他能救救我。",
                    "<25>{#f/17}* 父亲说，会一直照顾我...",
                    "<25>{#f/13}* ...但他再怎么努力，\n  终究治标不治本。"
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<25>{#p/asriel2}{#f/13}* 之前说到，再度苏醒后，\n  我变成了一颗星星，\n  再也无法回归正常生活了。",
                            "<25>{#f/13}* 既然父亲救不了我...",
                            '<25>{#f/16}* 那我就去找母亲了。'
                        ]
                        : ['<26>{#p/asriel2}{#f/16}* 父亲救不了我，\n  那就去找母亲吧。']),
                    "<25>{#f/13}* 我心想...\n  找她肯定靠谱。",
                    "<25>{#f/17}* 以前，她那么关心我...",
                    "<25>{#f/23}* 所以，世上最有能力\n  解救我的人，就是她。"
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<25>{#p/asriel2}{#f/13}* 之前说到，再度苏醒后，\n  我变成了一颗星星，\n  再也无法回归正常生活了。",
                            "<26>{#f/16}* 我把希望寄托于我的父母，\n  但他们啥都没帮上。"
                        ]
                        : ["<25>{#p/asriel2}{#f/16}* ...但她也失败了。"]),
                    "<25>{#f/13}* 一想到自己要永远\n  当颗星星...",
                    '<25>{#f/13}* 一想到谁都救不了自己...',
                    '<26>{#f/23}* 我就想马上去死。',
                    '<25>{#f/15}* 我放弃了一切... 选择自尽。',
                    '<25>{#f/16}* ...可是...\n* 当“死亡”来临时...',
                    '<25>{#f/7}* 眼前却突然闪过许多\n  扑朔迷离的景象...',
                    '<25>{#f/6}* 之后，我猛然发现自己\n  又回到了醒来的时间点。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<25>{#p/asriel2}{#f/10}* 我们刚才说到哪了？',
                            '<26>{#f/6}* ...想起来了。\n* 我又回到了醒来的时间点。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/13}* 一开始，我也纳闷\n  为什么会“回来”...",
                    '<25>{#f/15}* ...所以，我做了个实验。\n  看看能不能主动回溯时间。',
                    '<25>{#f/16}* 我屏息凝神，集中注意力。\n* 于是... 时间回溯了。',
                    "<25>{#f/15}* 我非常吃惊...",
                    "<25>{#f/17}* 自己居然获得了\n  “回溯时间”的能力。",
                    "<25>{#f/23}* 一开始，我想用这种能力\n  做点好事。",
                    "<25>{#f/15}* 所谓“助人自助”，\n  既然我做不到“自助”...",
                    '<25>{#f/16}* 起码还能“助人”。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<25>{#p/asriel2}{#f/10}* 我们刚才说到哪了？',
                            '<25>{#f/16}* ...想起来了。\n* 一开始，我用“时间回溯”的能力\n  帮助怪物。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/23}* 其实，做好事并不容易。\n* 一开始，给他们干活\n  总要花很大的力气。",
                    '<25>{#f/15}* ...渐渐地，\n  我越做越熟练了。',
                    '<25>{#f/5}* 很快，那些活\n  我闭眼睛都能干好。',
                    '<25>{#f/9}* 嘿嘿，我还真试过呢。',
                    '<25>{#f/13}* 把这事挂在嘴边，\n  好像是在炫耀...',
                    '<25>{#f/9}* 但说到底...\n  我干得再快，帮得再多，\n  又有什么用呢？',
                    '<25>{#f/5}* 帮得再多，\n  我也救不了自己...',
                    '<25>{#f/15}* 尽管如此，\n  我还是努力帮助他们，\n  拯救他们...',
                    '<25>{#f/15}* 努力做个好人。'
                ],
                (re: boolean) => [
                    ...(re ? ['<25>{#p/asriel2}{#f/15}* 之前说到，\n  一开始，我努力帮助别人。'] : []),
                    '<25>{#p/asriel2}{#f/16}* 但很快，\n  我发现不对劲。',
                    '<25>{#f/15}* 无论重置多少次...',
'<25>{#f/15}* 他们的回答永远是那几句，\n  故事的结局永远是那一种...',
                    "<25>{#f/16}* “做个好人”开始变得无聊了。",
                    '<25>{#f/6}* 你想说，\n  “那就试试别的行动呗？”',
'<25>{#f/6}* 呵，什么调情、约会、挑逗...\n  早试过了。',
                    '<25>{#f/7}* 做多了，也就腻了。',
                    "<25>{#f/10}* 我当然可以继续循环，\n  但有什么意思呢？",
                    '<25>{#f/6}* 该换换口味了。'
                ],
                (re: boolean) => [
                    ...(re
                        ? ["<25>{#p/asriel2}{#f/6}* 之前说到，\n  我当老好人当腻了。"]
                        : []),
                    "<25>{#p/asriel2}{#f/4}* 不过，一开始\n  我不想对他们太坏。",
                    '<25>{#f/3}* 说点狠话，骂骂人，\n  就差不多了。',
                    '<25>{#f/10}* 有时我会感觉心虚，难过。\n* 但转念一想，也没多恶劣。',
                    '<25>{#f/6}* 如果我发现\n  人们的反应又开始重复，\n  我就更狠一点。',
                    '<25>{#f/8}* 这里骂一句，那里怼一句。',
                    '<25>{#f/7}* 骂得多，就不在乎了。',
                    "<25>{#f/9}* 那段时间，\n  我最多只是耍耍嘴皮子。\n* 从没动过手，更没杀过人。"
                ],
                (re: boolean) => [
                    ...(re ? ["<26>{#p/asriel2}{#f/4}* 之前说到，\n  我开始骂他们，怼他们了。"] : []),
                    '<25>{#p/asriel2}{#f/15}* “言语攻击”玩腻了，\n  我又想...\n  要不试试动手揍人？',
                    "<25>{#f/16}* 没什么大不了的，\n  只要别失手打死了就行。",
                    "<25>{#f/10}* 受点伤，算的了什么？\n  怪物有的是办法疗伤。",
                    "<25>{#f/4}* 即使真出了意外，\n  我可以直接重置，\n  他们又能活蹦乱跳。",
                    '<25>{#f/3}* ...但意外真的发生了。',
'<25>{#f/3}* 那一刻，\n  我才知道自己多么天真。'
                ],
                (re: boolean) => [
                    ...(re ? ["<26>{#p/asriel2}{#f/3}* 之前说到，我感觉\n  “言语攻击”没什么意思，\n  想给他们来点“物理攻击”。"] : []),
                    '<25>{#p/asriel2}{#f/13}* 可能是冲昏了头脑...\n  我玩了点“新花样”。',
                    '<25>{#f/15}* 我用魔法，把亲生母亲\n  吊了起来。\n* 越勒越紧... 越勒越紧...',
                    '<25>{#f/16}* ...',
                    '<25>{#f/6}* 生命一点点离她而去。\n* 她气若游丝，\n  哀求我马上停手...',
'<25>{#f/6}* ...',
                    '<25>{#f/8}* 我把她活活勒死了。',
                    "<25>{#f/7}* 我惊恐万分，马上重置。\n* 但那地狱般的景象\n  却久久挥之不去。",
                    '<25>{#f/13}* 重置后，为了让自己心安，\n  我不停做好事，\n  努力做个孝子。',
                    "<25>{#f/15}* 但自作孽，不可活。",
                    "<25>{#f/15}* 我不敢直视她的目光...\n  不敢直视每一个人..."
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            "<26>{#p/asriel2}{#f/15}* 之前说到，\n  第一次杀人后，\n  噩梦般的景象久久挥之不去。",
                            '<25>{#f/16}* 但有了第一次，\n  就会有第二次，第三次...'
                        ]
                        : ['<25>{#p/asriel2}{#f/16}* 有了第一次，\n  就会有第二次，第三次...']),
                    '<26>{#f/15}* “万事开头难。”\n* 杀了一次人，\n  就能下得去手了。',
                    '<26>{#f/15}* 很快，情况变成这样：\n  我心情不好，杀个人找安慰。\n  我想找乐子，杀个人爽一把。',
                    '<26>{#f/16}* 第一次杀人纯粹只是意外。\n  现在却一发不可收拾。',
                    '<26>{#f/7}* 但我不怕，\n  杀了就杀了呗，\n  反正我能无限重置。',
                    '<25>{#f/6}* 一旦我开始这么想...\n  就再也没有回头路了。'
                ],
                (re: boolean) => [
                    '<25>{#p/asriel2}{#f/6}* 重置得越多，\n  折磨他们的损招就越多。',
                    '<25>{#f/7}* 我把他们千刀万剐...\n* 我让他们自相残杀...\n* 我使他们如堕地狱...',
                    '<25>{#f/15}* 他们死而复生。\n* 他们生而复死。\n* 他们生不如死。',
                    "<25>{#f/16}* 一次又一次，\n  一次又一次...\n* 我彻底麻木了。",
                    '<25>{#f/3}* 好事、坏事、善事、恶事...\n  什么都做过了，\n  最后，我感受到什么呢？',
                    '<25>{#f/3}* ...什么都没有。',
                    '<25>{#f/3}* 没有情绪共鸣。\n* 没有意义可言。\n* 只有空虚。',
                    '<25>{#f/15}* 我一无所有。\n  没有朋友，没有自由...\n* 于是，我改变了想法。',
                    '<26>{#f/23}* 我最后一次重置。\n* 这一次，我任由时间向前，\n  不再干预时间线。'
                ],
                (re: boolean) => [
                    ...(re
                        ? [
                            '<26>{#p/asriel2}{#f/16}* 之前说到，\n  我发现一切都毫无意义。',
                            '<25>{#f/23}* 所以，在这次重置后，\n  我不再干预时间线。'
                        ]
                        : []),
                    "<25>{#p/asriel2}{#f/17}* 但有了你，$(name)，\n  就不一样了。",
                    '<25>{#f/23}* 你知道吗？有你陪着我，\n  我真的非常高兴。',
                    "<25>{#f/13}* 有你在身边，我不再孤独。",
                    "<25>{#f/15}* 有你在身边，我不再绝望。",
                    "<25>{#f/16}* 而且，你不是也想\n  “给他们自由”嘛？",
                    '<25>{#f/13}* 我可以帮你实现愿望。',
                    '<25>{#f/23}* 我们永远都是好伙伴。'
                ]
            ],
            monologueX1: [
                '<25>{#p/asriel2}{#f/17}* 记住，$(name)。',
                '<25>{#f/17}* 只要我们心连心，\n  就能粉碎一切障碍。'
            ],
            monologueX2: () => [
                '<25>{#p/asriel2}{#f/16}* ...来，握住我的手。',
                ...(SAVE.data.b.water ? ["<25>{#f/13}* 别担心，杯子我帮你拿..."] : [])
            ],
            monologueX3: [
                '<25>{#p/asriel2}{#f/17}* 以前，我们就这样\n  手牵着手，在城市漫步...',
                '<25>{#f/23}* 现在，趁还有机会，\n  我们走完这最后一程。',
                "<25>{#f/16}* ...之后，\n  把一切都炸成碎片。"
            ],
            monologueX4: () => [
                '<25>{#p/asriel2}{#f/16}* 景色真美。',
                ...(SAVE.flag.n.ga_asrielMonologueY < 2
                    ? [
                        "<25>{#f/13}* 但前哨站的末日\n  已经到了。",
                        "<25>{#f/7}* $(name)，\n  那些怪物根本不懂我们。",
                        "<25>{#f/6}* 他们还相信\n  宇宙就是个大避难所。",
                        "<25>{#f/8}* 还天真地以为，\n  “星空之大，能容下每一个人。”",
                        "<25>{#f/6}* 但我们俩\n  可不跟那群蠢货一般见识。",
                        "<25>{#f/7}* 谁也阻止不了我们。",
                        "<25>{#f/9}* 嘻嘻。\n* 想来也是真有意思...",
                        '<25>{#f/13}* 这种信念，\n  让所有人疏远我们...',
                        '<25>{#f/16}* ...却也让我们的纽带\n  愈加牢固。',
                        '<26>{#f/17}* 听着，$(name)。\n  只要我们上了飞船，\n  离开这鬼地方...',
                        "<25>{#f/17}* 就能永远在一起了。",
                        "<25>{#f/23}* 这就是天意。"
                    ]
                    : [
                        '<25>{#f/13}* 该说的我都说了。',
                        "<25>{#f/17}* 继续干正事吧。"
                    ])
            ],
            monologueX5: ['<25>{#p/asriel2}{#f/17}* 你来带路。'],
            monologueY: [
                "<25>{#p/asriel2}{#f/16}* ...我不想废话。",
                "<26>{#f/13}* 为什么来这，要干什么，\n  你比我都清楚。"
            ],
            afterfight1: ['<25>{#p/asriel2}{#f/8}* ...真费劲。'],
            afterfight2: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/8}* 看起来，人类都疏散走了。",
                        '<25>{#f/7}* ...啧啧。',
                        "<25>{#f/6}* 那老头要以为\n  就凭这样就能阻止咱们，\n  那他可真傻到家了。",
                        "<25>{#f/10}* 他明明可以\n  用人类灵魂的力量\n  消灭我们...",
                        "<26>{#f/16}* 但说实话...",
                        "<25>{#f/13}* 狠不下心，不敢动手，\n  才是我熟悉的艾斯戈尔。\n* 你说是吧？"
                    ],
                    ['<25>{#p/asriel2}{#f/6}* 等我一下。']
                ][Math.min(SAVE.flag.n.ga_asriel56++, 1)],
            afterfight3: () => [
                '<25>{#p/asriel2}{#f/16}* 核心即将熔毁。',
                ...(SAVE.flag.n.ga_asriel57++ < 1
                    ? [
                        '<25>{#f/5}* 现在，我们只需要\n  找到一艘特殊飞船...',
                        "<25>{#f/9}* 在飞船上，把我们俩的灵魂\n  连接在一起。\n* 这样，我们就能冲出力场。"
                    ]
                    : [])
            ],
            afterfight4: ['<25>{#p/asriel2}{#f/3}* 跟我走。'],
            afterfight5a: ['<25>{#p/asriel2}{#f/5}* 我最亲爱的艾斯戈尔！', '<25>{#f/5}* 最近活得滋润不？'],
            afterfight5b: [
                '<25>{#p/asgore}{#f/5}* 比你想得还舒服。',
                "<25>{#p/asriel2}{#f/6}* 听好了，你已经无处可逃。\n* 所以别跟我耍什么花招。"
            ],
            afterfight6: [
                '<25>{#p/asgore}{#f/1}* 我没想和你耍花招啊，\n  艾斯利尔。',
                '<25>{#p/asgore}{#f/2}* 我也知道，离死不远了。'
            ],
            afterfight7: ['<25>{#p/asriel2}{#f/10}* 我要把一切都炸成灰烬了，\n  临死之前，有什么遗言？'],
            afterfight8: [
                '<25>{#p/asriel2}{#f/15}* 没有？',
                '<25>{#f/7}* 行。',
                "<25>{#f/6}* 那我们也不劳烦您嘞。",
                '<25>{#f/8}* 现在，把门禁卡\n  给我交出来。'
            ],
            afterfight10: ['<25>{#p/asriel2}{#f/1}* 跟我走，$(name)。', "<25>{#f/2}* 我真是受够这死地方了。"],
            afterfight11: [
                '<25>{#p/asgore}{#f/5}* $(name)...？',
                '<25>{#p/asgore}{#f/6}* ...哦。\n* 艾斯利尔，一路顺风哦。'
            ],
            afterfight12: ['<25>{#p/asriel2}{#f/16}* $(name)，别管他。\n* 这死地方爱咋咋地，\n  跟咱们一分钱关系都没有。'],
            afterfight13: ['<25>{#p/asriel2}{#f/17}* 我只在乎你。'],
            coreboomA1: [
                '<18>{#p/papyrus}{#f/5}有人吗？\n有人吗？',
                "<18>{#p/papyrus}{#f/5}我想找到那个人类，\n就来这了，可是..."
            ],
            coreboomA2: ['<18>{#p/papyrus}{#f/8}不要...！'],
            coreboomA3: ['<32>{#p/basic}* 帕派瑞斯？{%40}'],
            coreboomA4: ["<18>{#p/papyrus}{#f/4}我有不好的预感...{%40}"],
            coreboomA5: ['<32>{#p/basic}* ...有人吗？{%40}'],
            coretext1: ['<32>{#p/basic}{#s/spiderLaugh}* 稳住啊，亲爱的~'],
            coretext2: ['<32>{#p/basic}{#s/spiderLaugh}* 嘎啊...', '<32>{#p/basic}* 一起再加把劲~'],
            coreboomB1: ['<32>{#p/basic}{#s/spiderLaugh}* 啊！', '<32>{#p/basic}* 不要这样啊~'],
            coreboomB2: ['<32>{#p/basic}* 不要哪样？{%40}'],
            coreboomB3: ['<32>{#p/basic}{#s/spiderLaugh}* 该死。{%40}'],
            coretext3: ['<18>{#p/papyrus}{#f/9}要帮忙吗？'],
            coretext4a: ['<32>{#p/basic}{#s/spiderLaugh}* 帕派瑞斯！', "<32>{#p/basic}* 你还活着~"],
            coretext4b: ['<18>{#p/papyrus}{#f/6}我一块肉都没少！'],
            coretext5a: ['<18>{|}{#p/papyrus}{#f/4}啊不对，应该说- {%}'],
            coretext5b: [
                '<32>{#p/basic}{#s/spiderLaugh}* 帕派瑞斯，快去喊些帮手，\n  把系统改回手动控制！'
            ],
            coreboomC1: ["<18>{#p/papyrus}{#f/5}恐怕...\n这里除了我们，没别人了。"],
            coreboomC2: ['<18>{#p/papyrus}{#f/8}不要...！'],
            coreboomC3: ["<32>{#p/basic}{#s/spiderLaugh}* 撑不住了。{%40}"],
            coretext6: ["<32>{#p/basic}* 我马上去叫那些机械师！"],
            coretext7: ['<18>{#p/papyrus}{#f/6}好，好，快去叫！'],
            coreboomD1: ['<32>{#p/basic}* ...', '<32>{#p/basic}* 没人接。'],
            coreboomD2: ['<32>{#p/basic}* ...', "<32>{#p/basic}* 他们说，人手不足？！"],
            coreboomD3: ['<18>{#p/papyrus}{#f/5}可恶。{%40}'],
            coretext8: ['<32>{#p/basic}* ...', "<32>{#p/basic}* 改回手动控制了！"],
            coretext9: ['<32>{#p/basic}{#s/spiderLaugh}* 太好了~'],
            coretext10: ['<32>{#p/basic}* 快好了...'],
            coretext11: ['<32>{#p/basic}{#s/spiderLaugh}* 成功啦~'],
            coretext12a: ['<18>{#p/papyrus}{#f/0}我们成功了吗？！？！'],
            coretext12b: ['<32>{#p/basic}{#s/spiderLaugh}* 啊呼呼...\n  还得有人进入控制台\n  内部操控~'],
            coreboom12c: ["<32>{#p/basic}* 看我干什么！\n* 我就是个人偶！"],
            coreboom12d: ['<32>{#p/basic}{#s/spiderLaugh}* 而且是一个在特战队里\n  待过的人偶~'],
            coreboom12e: ['<32>{#p/basic}* ...那都什么陈年旧事了。'],
            coretext13: ["<32>{#p/napstablook}* 让我来吧"],
            coretext14a: ['<18>{#p/papyrus}{#f/1}【你】从哪冒出来的？？？'],
            coretext14b: [
                '<32>{#p/napstablook}* 对不起...\n* 没时间解释了...',
                '<32>* 表亲，保重...',
                '<32>* 好吗？'
            ],
            coretext15: ['<32>{*}{#p/basic}{#s/spiderLaugh}* 你在干什么~{%40}'],
            coretext16: ["<32>{*}{#p/basic}* 不... 不！\n* ...我不想再失去亲人了！{%40}"],
            coretext17: ['<32>{#p/napstablook}{*}* 我明白了...', '<32>* 我明白到底为什么\n  不稳定了。'],
            coretext18: [
                "<33>{*}{#p/napstablook}* 应该就是这个原因...",
                '<32>{*}* 重设命令执行路径就行。',
                '<32>{*}* 快点啊...'
            ],
            coretext19: ['<32>{#p/napstablook}* ...', '<32>{#p/napstablook}* 成功了...'],
            coretext20: [
                '<25>{#p/asgore}{#f/6}* 怎么样了？',
                '<18>{#p/papyrus}{#f/0}艾斯戈尔！我们成功了！',
                '<18>{#p/papyrus}{#f/0}核心不会爆炸了！',
                '<32>{#p/basic}* ...我的表亲，小幽，它...',
                '<18>{#p/papyrus}{#f/5}人偶的表亲做了件\n很了不起的事。'
            ],
            coretext21: ['<25>{#p/asgore}{#f/1}* 你叫什么名字？'],
            coretext22: [
                '<32>{#p/basic}* 是说我吗？',
                "<32>* 嗯...\n* 呃，现在我应该没有名字了。",
                '<32>* 叫我“人偶”就行。'
            ],
            coretext23a: [
                '<25>{#p/asgore}{#f/1}* 呃，人偶... 听我说。\n* 你很痛苦，大伙也都一样。',
                '<25>{#f/2}* 今天，我们都失去了至亲。'
            ],
            coretext23b1: ['<32>{#p/basic}{#s/spiderLaugh}* 当然，我可没失去哦~'],
            coretext23b2: ['<32>{#p/basic}{#s/spiderLaugh}* ...我不是那个意思。\n  我跟大伙关系都蛮好啦...'],
            coretext24a: [
                "<18>{#p/papyrus}{#f/5}天哪...\n要是那人类没饶恕我，\n我...",
                '<32>{#p/basic}* 人类饶恕你了？\n* 对，那人也饶恕我了...',
                '<32>{#p/basic}{#s/spiderLaugh}* 啊呼呼...\n  没等那人下手，我就先逃了呢~',
                '<18>{#p/papyrus}{#f/0}...哦，对了！\n还有核心的员工！',
                '<18>{#p/papyrus}{#f/0}人类肯定也\n饶恕他们了！'
            ],
            coretext24b: ['<25>{#p/asgore}{#f/1}* ...请问，\n  人类饶恕你们的时候，\n  艾斯利尔在场吗？'],
            coretext25: [
                '<18>{#p/papyrus}{#f/9}当然不在！',
                '<32>{#p/basic}* 不在。',
                "<32>{#p/basic}{#s/spiderLaugh}* 想了一下，应该没看到他~",
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#p/asgore}{#f/1}* 果然是这样...',
                '<25>{#p/asgore}{#f/2}* ...或许...\n* 把过错归咎于人类，\n  是我的错...',
                '<18>{#p/papyrus}{#f/6}...\n归咎人类？？',
                '<18>{#p/papyrus}{#f/7}到底怎么回事！！'
            ],
            coretext26: ['<18>{*}{#p/papyrus}{#f/7}艾斯戈尔，你做了什么？！{^40}{%}'],
            coretext27a: '{*}{#p/event}{#i/3}前哨站灰飞烟灭。',
            coretext27b: '{*}{#p/event}{#i/3}前哨站幸免于难。',
            respawn0: () =>
                [
                    [
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱俩都离开星港了，\n  你咋就没摸下存档点呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是说说而已。'
                        ],
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱俩都杀掉安黛因了，\n  你咋就没摸下存档点呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是说说而已。'
                        ],
                        [
                            "<25>{#p/asriel2}{#f/15}* 咱俩都离开空境了，\n  你咋就没摸下存档点呢？",
                            '<25>{#p/asriel2}{#f/16}* 唉，我就是说说而已。'
                        ],
                        [
                            '<25>{#p/asriel2}{#f/15}* 你是不是\n  在战斗后给自己下毒了？',
                            "<25>{#p/asriel2}{#f/16}* 真是绝了。"
                        ]
                    ],
                    [
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也该记得要保存进度了吧。",
                            "<25>{#p/asriel2}{#f/8}* 虽说就算没保存，\n  区区星港，很快就过去了。",
                            '<25>{#p/asriel2}{#f/7}* 不过我看你是\n  一点记性没长。'
                        ],
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也该记得要保存进度了吧。",
                            '<26>{#p/asriel2}{#f/8}* 更何况，我们好不容易\n  才灭了安黛因。',
                            '<25>{#p/asriel2}{#f/7}* 不过我看你是\n  一点记性没长。'
                        ],
                        [
                            "<26>{#p/asriel2}{#f/6}* 我上次都提醒你了，\n  你也该记得要保存进度了吧。",
                            '<25>{#p/asriel2}{#f/8}* 更何况，我们好不容易\n  才灭了空境那些碍事的家伙。',
                            '<25>{#p/asriel2}{#f/7}* 不过我看你是\n  一点记性没长。'
                        ],
                        ['<26>{#p/asriel2}{#f/7}* 这才多久，\n  真是累死个人。']
                    ],
                    [
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，保存下进度吧。'],
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，保存下进度吧。'],
                        ['<25>{#p/asriel2}{#f/4}* $(name)。\n* 算我求你了，保存下进度吧。'],
                        ["<25>{#p/asriel2}{#f/4}* 现在咋感觉你这么烦呢。"]
                    ],
                    [
                        ['<25>{#p/asriel2}{#f/8}* 别再来了...'],
                        ['<25>{#p/asriel2}{#f/8}* 别再来了...'],
                        ['<25>{#p/asriel2}{#f/8}* 别再来了...'],
                        ['<25>{#p/asriel2}{#f/8}* 别再来了...']
                    ]
                ][Math.min(SAVE.flag.n.ga_asrielRespawn0++, 3)][Math.floor(SAVE.flag.n._genocide_milestone_last / 2)],
            respawn1: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/15}* 咋回来了？",
                        "<25>{#p/asriel2}{#f/16}* 大不了...\n  再杀他一次就好。"
                    ],
                    ['<25>{#p/asriel2}{#f/6}* 开玩笑吗？'],
                    ['<25>{#p/asriel2}{#f/6}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn1++, 2)],
            respawn2: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/15}* 我们又回来了。\n* 呵，真是太棒了...",
                        '<25>{#p/asriel2}{#f/16}* 还行，问题不大...\n* 再来一遍吧...'
                    ],
                    ['<25>{#p/asriel2}{#f/8}* 我有点不耐烦了。'],
                    ['<25>{#p/asriel2}{#f/8}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn2++, 2)],
            respawn4: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* $(name)，\n  我们马上就要把事\n  办成了。',
                        '<25>{#p/asriel2}{#f/16}* 这次保存下进度，\n  行不行啊？'
                    ],
                    ['<25>{#p/asriel2}{#f/10}* ...你逗我玩呢？'],
                    ['<25>{#p/asriel2}{#f/10}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn4++, 2)],
            respawn6: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* $(name)，听好了。',
                        '<25>{#p/asriel2}{#f/7}* 我们已经干掉她了。',
                        '<25>{#p/asriel2}{#f/5}* 那你还回溯时间干嘛呢？'
                    ],
                    ["<25>{#p/asriel2}{#f/7}* ...你逗我呢？"],
                    ['<25>{#p/asriel2}{#f/7}* ...']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn6++, 2)],
            respawn7: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* 什么鬼...',
                        "<25>{#p/asriel2}{#f/15}* 我发誓我们在逃生艇上..."
                    ],
                    [
                        '<25>{#p/asriel2}{#f/10}* $(name)，你是不是...',
                        "<25>{#p/asriel2}{#f/16}* ...不...\n* 你不会那么做的..."
                    ],
                    [
                        '<25>{#p/asriel2}{#f/15}* ...',
                        '<25>{#p/asriel2}{#f/15}* $(name)？',
                        '<32>{#p/human}* （看起来艾斯利尔陷入了沉思。）'
                    ],
                    ['<25>{#p/asriel2}{#f/15}* ...', '<32>{#p/human}* （看起来艾斯利尔陷入了沉思。）']
                ][Math.min(SAVE.flag.n.ga_asrielRespawn7++, 3)],
            respawnWitnessA: () =>
                [
                    ['<25>{#p/asriel2}{#f/9}* 怎么回事？', '<25>{#p/asriel2}{#f/10}* ...谁攻击了我们？'],
                    ['<25>{#p/asriel2}{#f/15}* 我们...', '<25>{#p/asriel2}{#f/10}* ...被一道电魔法击中了？'],
                    [
                        "<25>{#p/asriel2}{#f/3}* 肯定是她，艾菲斯。",
                        "<25>{#p/asriel2}{#f/15}* 她竟然没逃跑...",
                        '<25>{#p/asriel2}{#f/16}* 呵，有点意思。'
                    ]
                ][SAVE.flag.n.ga_asrielWitness++],
            respawnWitnessB: (wit: number) =>
                wit > 0
                    ? [
                        '<25>{#p/asriel2}{#f/15}* 果然是艾菲斯...',
                        '<25>{#p/asriel2}{#f/16}* 呵，有点意思。'
                    ]
                    : [
                        "<25>{#p/asriel2}{#f/15}* 她竟然没逃跑...",
                        '<25>{#p/asriel2}{#f/16}* 呵，有点意思。'
                    ]
        },
        truetext: {
            monologue1: () => [
                '<32>{#p/basic}* 等等。',
                SAVE.data.b.flirt_papyrus
                    ? '<32>* 你有没有\n  想起你还没和帕派瑞斯约会？'
                    : '<32>* 你有没有\n  想起你还没和帕派瑞斯消遣过？',
                "<32>* ...嘿，我们可不能抛下他！"
            ],
            monologue2: [
                '<32>{#p/basic}* 等等。',
                "<32>* 帕派瑞斯之前不是\n  想让你和安黛因消遣吗？",
                "<32>* ...嘿，我们可不能抛下她！",
                "<32>* 尽管她有点混球。"
            ],
            monologue3: [
                '<32>{#p/basic}* 等等。',
                '<32>* 你忘了安黛因！',
                '<32>* 先是帕派瑞斯，\n  现在这个又要？',
                "<33>* ...快点，我们得回到她家！"
            ],
            storyEnding: () => [
                '<32>{#p/basic}* ...\n* 现在你知道了。',
                "<32>* 因为你看过艾斯利尔的日记，\n  所以你应该知道我是故意生病的。",
                '<32>* 为了拯救所有人，我骗了他，\n  操纵着他来执行这个愚蠢的计划。',
                '<32>* 最后也只是让它\n  演变成了一场复仇之旅，\n  即便那样，计划也没有顺利完成。',
                '<32>* 关键时刻，\n  他阻止了我向那些人类反击，\n  因此我生了他很久的气...',
                '<32>* ...',
                '<32>* 也许...\n  也许他那样事出有因。',
                "<32>* 我不知道。",
                "<32>* 我总在想，如果当时他听了我的话，\n  事情会如何发展...",
                
                "<32>* ...但与此同时我在想...\n* 最好的结果只能是他不听从我吧。",
                '<32>* ...',
                '<32>* 嘿... 我只是想让你知道，\n  有你在我身边...',
                "<32>* 让我觉得，\n  我存在于这个世界\n  也不是没有意义了。",
                "<32>* 为此，我想谢谢你。",
                '<32>* 我真的觉得，\n  一切都会好起来的。',
                '<32>* 或者说...\n  一切即将迎来最好的结局。',
                '<32>* ...不管以什么方式。',
                "<32>* 很快就要到力场那边了。",
                ...(SAVE.data.n.plot_date < 2.1
                    ? [
                        '<32>* 不过，在我们前往之前...',
                        ...(SAVE.data.n.plot_date < 1.1
                            ? [
                                '<32>* 我们真的应该回去找帕派瑞斯。',
                                "<32>* 你不会想让他等太久吧？"
                            ]
                            : [
                                '<32>* 我们真的应该回去找安黛因。',
                                "<32>* 你不会想让\n  帕派瑞斯在她家门前等太久吧？"
                            ])
                    ]
                    : [
                        "<32>* 你大概听够了我的废话，\n  所以我们该走了。",
                        "<32>* 至于为何...\n* 也许等力场消失了，\n  答案就会显现出来。",
                        "<32>* ...我们等着瞧。"
                    ])
            ],
            epilogue: [
                () => [
                    "<32>{#p/basic}* 当然这不是说\n  我们现在就得去找他。",
                    "<32>* 就只是..",
                    '<32>* ...',
                    '<32>{#p/human}* （你听到一声长叹。）',
                    '<32>{#p/basic}* 弗里斯克...',
                    "<32>* 有些事我还没告诉你。",
                    "<32>* 这是关于我的过去...",
                    "<32>* 这关乎于为什么\n  我迫切想和他说话的原因。",
                    "<32>* 我很抱歉。",
                    
                    '<32>* 我只是...\n* 我得告诉你\n  我是如何走到今天这一步的。',
                    '<32>* 我需要你的理解。'
                ],
                () => [
                    '<32>{#p/basic}* 弗里斯克...',
                    "<32>* 你能想象一夜之间\n  失去所有至亲是什么感觉吗？",
                    
                    "<32>* 你能想象...\n* 知道这些过错\n  全都归咎于自己是什么感觉？",
                    '<32>* ...',
                    '<32>* 在过去的一百年里...',
                    "<32>* 我就像被困在地狱的边境。",
                    
                    "<32>* 不管我怎么努力...\n  都无法挣脱这种枷锁。",
                    '<32>* ...',
                    "<32>* 我只能看着其他人\n  过着他们自己的生活。",
                    '<32>* 我看到他们交朋友...\n  他们欢笑... 他们爱恋...',
                    
                    "<32>* 但那些...\n  为我曾所做的一切。",
                    '<32>* 如今... 我只能看着...',
                    '<32>* 除了看着...\n  什么都做不到...'
                ],
                () => [
                    '<32>{#p/basic}* 当幽灵家族找到我时，\n  已经离那个事件过去好几天了。',
                    "<32>* 我想，也许，\n  这还没有那么糟糕。",
                    '<32>* 我也许身处炼狱，但是...',
                    "<32>* ...至少还能有人陪我聊天，对吧？",
                    '<32>* ...',
                    '<32>* 他们尝试帮助我...',
                    '<32>* 他们尝试让我感受到家的温暖...',
                    "<32>* ...但是他们\n  没人能够理解我所经历的。",
                    '<32>* 他们如此年轻...',
                    '<32>* 老实说，现在还是。',
                    '<32>* 怪物在这方面就像孩童...',
                    '<32>* 他们的纯真定义了他们。',
                    "<32>* 但这表示\n  他们无法和我相处。",
                    '<32>* ...',
                    
                    "<32>* 从那时起...\n  我一直孑然一身。"
                ],
                () => [
                    '<32>{#p/basic}* 这么多年来都是以影为伴...',
                    '<32>* 百无聊赖，行思坐想...',
                    "<32>* 我没有精神失常真是个奇迹。",
                    '<32>* 该死，但这也许就是\n  上天对我的“惩罚”。',
                    '<32>* 不是让我死亡，\n  不是让我疯狂，\n  也不是让我缺乏普通的陪伴...',
                    '<32>* 无论如何，我都无法逃离。',
                    "<32>* ...\n* 但这理论有一个问题。",
                    '<32>* 一个例外。\n* 你猜是什么？',
                    
                    "<32>* 我想你已经明白了...",
                    '<32>* ...',
                    "<32>* 是你，弗里斯克。",
                    "<32>* 你是唯一一个能够理解我的人。"
                ],
                () => [
                    "<32>{#p/basic}* 你也许认为\n  其他人类可以聆听我的心声。",
                    '<32>* ...但是不行。',
                    "<32>* 有时，我会跟他们插句话...",
                    '<32>* 或者幸运地进入到他们梦中。',
                    '<32>* 但是除了你...',
                    "<32>* 也许是因为我们的\n  灵魂特质相同，但是...",
                    '<32>* 不只你能够聆听我...',
                    '<32>* 我也能“聆听”你。',
                    "<32>* 虽然不多，\n  但足以知道你在想什么。",
                    '<32>* 比如，现在...',
                    '<32>* ...',
                    '<32>* 弗里斯克，你...',
                    "<32>* ...你知道那不可能发生的对吧？",
                    choicer.create('* （你想怎么拥抱？）', '温柔地', '紧紧地', '小心地', '拼命地'),
                    '<32>{#p/basic}* ...笨蛋弗里斯克。',
                    '<32>* 如果可以的话，\n  我会接受的。',
                    "<32>* 可惜... 我无法做到..."
                ],
                () => [
                    '<32>{#p/basic}* 弗里斯克，我...',
                    "<32>* 我知道我是\n  最不可能说这种话的人，\n  但是...",
                    '<32>* 我真的爱你，弗里斯克。',
                    '<32>* 就像我爱他一样。',
                    "<32>* 我们此时就像...\n  一个真正的家庭。",
                    '<32>* 嘿。',
                    '<32>* ...谢谢你给了我一次\n  重新感受世界的机会。',
                    '<32>* ...谢谢你成为了这样的人。',
                    '<32>* 但是... 弗里斯克。',
                    "<32>* 我不确定\n  我是否在这个世界上是否有未来。",
                    "<32>* 一旦你走了...",
                    "<32>* ...我将会再次孤身一人。",
                    "<32>* 那就是为什么... \n  我这么心急如焚地想与他说话，\n  你知道吗？",
                    "<32>* 至少那时，\n  我就可以从已经发生的事中\n  走出来。",
                    "<32>* 一个孤独的存在...\n  就不会那么悲哀了。",
                    '<32>* 但是... 我知道。',
                    "<32>* 我确定你还有很多人\n  想要了解一下。",
                    '<33>* 所以，先去做那些事吧，\n  然后...',
                    "<32>* 一旦你准备好...",
                    "<32>* ...我们就去找他，好吗？",
                    
                    '<32>* ...',
                    "<32>* 嗯，我说完了。",
                    "<32>* 来吧，我们继续吧。"
                ]
            ]
        },
        npc: {
            picnic_oni: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 之前我就听说过首塔，\n  但从没来过这里。\n* 这里挺不错的。",
                    "<32>* 虽然这里是个大城市，\n  但在这里反而没那么容易迷路！",
                    "<32>* 这倒挺不错的。"
                ],
                ["<32>{#p/basic}{#npc/a}* 我特别反感弯弯绕绕的房间\n  和奇怪的迷题。\n* 所以首塔这样挺好的。"]
            ),
            picnic_clamguy: pager.create(
                0,
                [
                    '<32>{#p/basic}{#npc/a}* 不知道他们是怎么\n  在这么短的时间\n  建成这座城市的。',
                    "<32>* 空境是靠着奇怪的空间折叠，\n  所以才看起来比较大。\n* 但这里不是这样。",
                    "<32>* 那些技术名词我也不懂，\n  在这里生活就挺好的。"
                ],
                ['<32>{#p/basic}{#npc/a}* 每天不用去想\n  那些高深的技术名词...\n* 这样就挺好的。']
            ),
            picnic_charles: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 别管我，我只是在和我\n  最好的朋友一起消遣！",
                    '<32>* 在核心工作真的很辛苦...\n  但现在我们的工作都完成了。',
                    '<32>* 此时，我们可以庆祝\n  我们的优异成绩！',
                    '<32>* 我爱死消遣了！'
                ],
                ['<32>{#p/basic}{#npc/a}* 我敢说你也会喜欢上的！']
            ),
            picnic_proskater: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 这... 我们不用上学了？\n* 其实，说实话吧，之前是我的错。",
                    '<32>* 没有人非要去上学，\n  但不去上学肯定会更糟。',
                    "<32>* 哎，随他去吧。\n* 估计我现在还没搞明白\n  我到底想要什么。"
                ],
                ['<32>{#p/basic}{#npc/a}* 每天都来聚会的话，\n  估计会很好玩吧...']
            ),
            picnic_papyrus: pager.create(
                0,
                [
                    '<18>{#p/papyrus}{#f/0}{#npc/a}你好啊，弗里斯克！',
                    "<18>{#f/9}我正做菜呢，做的还是\n我最拿手的好菜！",
                    "<18>{#f/5}只是火候不行，\n得花好长时间...",
                    "<18>{#f/7}照这样下去，等我做好了，\n大伙都坐飞船出发了！",
                    "<25>{#p/sans}{#npc}* 大伙在船上品尝佳肴，\n  多酷啊。",
                    '<25>{#p/sans}{#f/3}* 想想看，人们聚在一起，\n  一边遐想新家园的美景，\n  一边品尝面前的佳肴...',
                    "<25>{#p/sans}{#f/2}* 这顿大餐，\n  他们肯定终生难忘。",
                    '<18>{#p/papyrus}{#f/4}{#npc/a}说得倒好听...',
                    "<18>{#p/papyrus}{#f/5}但我都答应他们\n出发前就能吃上大餐了，\n现在咋办？"
                ],
                [
                    "<18>{#p/papyrus}{#f/5}{#npc/a}仔细一想，\n也没那么坏。",
                    "<18>{#f/0}没想到，艾斯戈尔的厨房\n居然有这么多\n宝藏调料！",
                    '<18>{#f/4}除了盐和胡椒...\n还有反重力粉末！',
                    '<18>{#f/9}小小的厨房，\n藏着无限的可能！'
                ],
                [
                    "<18>{#p/papyrus}{#f/0}{#npc/a}放心，我不会做着做着\n就走火入魔的。",
                    "<18>{#f/5}毕竟要招待\n那么多贵客...\n还是稳妥点为好。",
                    
                    '<18>{#f/9}更何况，做菜要用啥调料，\n菜谱上都写得清清楚楚！',
                    '<18>{#f/4}据说，那些调料进了嘴，\n还能在嘴里悬浮...'
                ],
                ['<18>{#p/papyrus}{#f/0}{#npc/a}啥都不用担心！']
            ),
            picnic_kidd: pager.create(
                0,
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* 呦，呃...', '<25>{#f/4}* 离我远点。']
                        : [
                            "<25>{#p/kidd}{#f/2}{#npc/a}* 伙计，我会想这个地方的...",
                            '<25>{#f/3}* 星港，铸厂，空境，首塔...',
                            "<25>{#f/6}* 至少在新家园上\n  我们也会在一起。",
                            "<25>{#f/1}* 等不及看看外面的世界\n  是怎么样的了！"
                        ],
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* ...']
                        : [
                            '<25>{#p/kidd}{#f/1}{#npc/a}{#f/4}* ...哦，呃，\n  你可能已经发现了，\n  不过我还是想承认一下...',
                            "<25>{#f/4}* 我撒了谎，我其实没有爹娘。\n* 我编造了他们的存在。",
                            "<26>{#f/3}* 不过我们是朋友，对吧？\n  所以... 希望你原谅我。"
                        ],
                () =>
                    SAVE.data.b.f_state_kidd_betray
                        ? ['<25>{#p/kidd}{#f/4}{#npc/a}* 滚开啊...']
                        : ['<25>{#p/kidd}{#f/3}{#npc/a}* 谢谢你能做我的朋友，\n  弗里斯克。']
            ),
            picnic_dragon: pager.create(
                0,
                [
                    "<32>{#p/basic}{#npc/a}* 你说必须等大伙都准备好了才能走？",
                    "<32>* 我，呃，其实挺合理的。",
                    "<32>* 行，我接受。"
                ],
                ["<32>{#p/basic}{#npc/a}* 我抱怨啥呢？\n* 我们都自由了..."]
            ),
            tvfish: pager.create(
                0,
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            '<25>{#p/undyne}{#f/14}{#npc/a}* 管休闲回廊的姑娘\n  们淘垃圾的时候，\n  发现了这部电影。',
                            "<25>{#f/1}* 我和艾菲斯就打算一起看。",
                            "<25>{#f/8}* 呋呼呼！！\n* 这次约会最棒了！！",
                            "<25>{#f/12}* 呃，我好像就\n  约会过这么一次。",
                            '<25>{#f/7}* 不过之前的话依旧算数！'
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            '<25>{#p/undyne}{#f/1}{#npc/a}* 没想到看电影\n  这么让人着迷！',
                            '<25>{#p/undyne}{#f/12}{#npc/a}* 所以现在...\n* 你能不能让我们\n  安心看电影呢...'
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : ["<25>{#p/undyne}{#f/7}{#npc/a}* 嘿嘿嘿，\n  你把电视挡住了！"]
            ),
            tvlizard: pager.create(
                0,
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : SAVE.data.b.c_state_secret3 && !SAVE.data.b.c_state_secret3_used
                            ? ((SAVE.data.b.c_state_secret3_used = true),
                                [
                                    '<25>{#p/alphys}{#g/alphysInquisitive}{#npc/a}* ...嗯？\n* 你有话想对我说？',
                                    '<32>{#p/human}* （你背了一遍六号档案的罗曼教授\n  交给你的笔记。）',
                                    '<25>{#p/alphys}{#g/alphysOhGodNo}* 哇... 哇哦！',
                                    '<25>{#g/alphysNervousLaugh}* 这搞不好是进行\n  星系间高速旅行的关键啊...',
                                    '<25>{#g/alphysHellYeah}* ...确切点说，虫洞旅行！',
                                    "<25>{#g/alphysWelp}* 花了很多年，我也没\n  研究明白这个技术啊..."
                                ])
                            : [
                                '<25>{#p/alphys}{#g/alphysCutscene1}{#npc/a}* 终于啊！\n* 我找了这么多年，\n  今天终于找到你了！',
                                '<25>{#g/alphysHellYeah}* 《喵喵三部曲》第三部——\n  《喵喵之扭转时空》！',
                                '<25>{#g/alphysWelp}* 这部也是《喵喵航天行》的\n  正统续作。',
                                '<25>{#g/alphysYeahYouKnowWhatsUp}* 就连《星火》系列\n  都黯然失色了...'
                            ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : [
                            "<25>{#p/alphys}{#g/alphysHellYeah}{#npc/a}* 快燃起来了！",
                            "<25>{#p/alphys}{#g/alphysFR}{#npc/a}* ...不介意的话..."
                        ],
                () =>
                    player.face !== 'up' // NO-TRANSLATE

                        ? []
                        : ['<25>{#p/alphys}{#g/alphysYupEverythingsFine}{#npc/a}* 电影第一，\n  闲聊第二。']
            ),
            picnic_asgore: pager.create(
                0,
                () => [
                    SAVE.data.b.c_state_secret5_used
                        ? '<25>{#p/asgore}{#npc/a}{#f/1}* 弗里斯克，放心。\n* 我可不会忘了\n  自己许下的诺言。'
                        : '<25>{#p/asgore}{#npc/a}{#f/6}* 不用管我，弗里斯克。\n* 我只是在找新衣服。',
                    ...(SAVE.data.b.c_state_secret5 && !SAVE.data.b.c_state_secret5_used
                        ? ((SAVE.data.b.c_state_secret5_used = true),
                            [
                                '<25>{#p/asgore}{#npc/a}{#f/21}* 哦？\n* 你有话想对我说？',
                                '<32>{#npc}{#p/human}* （你复述了六号档案的艾斯戈尔\n  对你做出的承诺。）',
                                '<25>{#p/asgore}{#npc/a}{#f/8}* ...！',
                                '<25>{#f/1}* 弗里斯克...',
                                '<25>{#f/1}* ...不确定我能不能做到，\n  不过...',
                                '<25>{#f/6}* 为了你，我会试试的。'
                            ])
                        : [])
                ],
                () =>
                    SAVE.data.b.c_state_secret5_used
                        ? ['<25>{#p/asgore}{#npc/a}{#f/1}* 希望有机会能和她谈谈吧。']
                        : ['<25>{#p/asgore}{#npc/a}{#f/6}* 人类喜欢穿棕色的衣服吗？'],
                () =>
                    SAVE.data.b.c_state_secret5_used
                        ? ['<25>{#p/asgore}{#npc/a}{#f/2}* ...']
                        : ['<25>{#p/asgore}{#npc/a}{#f/21}* 啦啦啦，找衣衣...']
            )
        },
        story: {
            lv20: ['<32>{#p/human}* （飞船渐行渐远。）'],
            postnoot0: () =>
                world.trueKills === 0 && SAVE.data.n.state_foundry_undyne !== 1 && SAVE.flag.n.neutral_twinkly_choice === 0
                    ? [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/1}...为什么？',
                        '<25>{*}{#e/twinkly/2}为什么放我走？',
                        "<25>{*}{#e/twinkly/6}你就没发现，\n付出了那么多...",
                        '<25>{*}{#e/twinkly/7}...到头来，\n还是伤了自己？',
                        '<25>{*}{#e/twinkly/5}你瞧瞧你。',
                        ...(SAVE.data.b.ultrashortcut
                            ? [
                                "<25>{*}{#e/twinkly/3}一路上，遇见这么多...",
                                '<25>{*}{#e/twinkly/4}...呃...',
                                '<25>{*}{#e/twinkly/0}草，忘了，你走捷径了。\n好多人，好多事，你都没见过。',
                                "<25>{*}{#e/twinkly/24}哎呦我去，本来挺有感触，\n有好多话想对你说的。",
                                "<25>{*}{#e/twinkly/15}...直入正题算了。",
                                '<25>{*}{#e/twinkly/21}...'
                            ]
                            : [
                                "<25>{*}{#e/twinkly/3}一路上，遇见这么多好友...",
                                "<25>{*}{#e/twinkly/4}这么快，又要各奔东西，\n也许这辈子都不会再见了。",
                                "<25>{*}{#e/twinkly/0}不仅如此，\n他们又要苦苦等待\n下一个人类到来。",
                                "<25>{*}{#e/twinkly/1}真悲哀啊...",
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? SAVE.flag.n.genocide_milestone < 7
                                        ? ['<25>{*}{#e/twinkly/7}要是你没背叛\n我们本来的计划...']
                                        : ['<25>{*}{#e/twinkly/7}上回，我们肩并肩，\n毁灭了前哨站。\n要是你这回也狠点心...']
                                    : ['<25>{*}{#e/twinkly/7}要是这一路上，\n你没在乎过别人的话...']),
                                "<25>{*}{#e/twinkly/1}现在就不用这么难过了。",
                                "<25>{*}{#e/twinkly/8}...那我就不明白了。",
                                '<25>{*}{#e/twinkly/13}要是你啥都没做错...',
                                '<25>{*}{#e/twinkly/1}最后为啥会这样呢？',
                                '<25>{*}{#e/twinkly/2}...到底为什么呢？',
                                '<25>{*}{#e/twinkly/2}难道生活真的如此不公？',
                                '<25>{*}{#e/twinkly/3}...',
                                '<25>{*}{#e/twinkly/0}...嘿。'
                            ]),
                        '<25>{*}{#e/twinkly/21}要是我说...',
                        '<25>{*}{#e/twinkly/15}我有办法让你\n得到更好的结局呢？',
                        ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                            ? ["<25>{*}{#e/twinkly/20}你得从头来过，\n然后..."]
                            : ["<25>{*}{#e/twinkly/20}你得从这继续，\n然后..."]),
                        ...(SAVE.data.n.plot_date === 2.1
                            ? [
                                "<25>{*}{#e/twinkly/15}再去见见艾斯戈尔怎么样？",
                                "<25>{*}{#e/twinkly/17}你只要这么做了，\n我保证不会再杀他。"
                            ]
                            : 1.1 <= SAVE.data.n.plot_date
                                ? [
                                    "<25>{*}{#e/twinkly/15}去会会安黛因怎么样？",
                                    '<25>{*}{#e/twinkly/15}说不定，你们能做好朋友呢。',
                                    '<25>{*}{#e/twinkly/20}天晓得...',
                                    "<25>{*}{#e/twinkly/17}她是不是你走向幸福的关键呢？"
                                ]
                                : [
                                    "<25>{*}{#e/twinkly/15}去看看帕派瑞斯，\n接着再会会安黛因，怎么样？",
                                    '<25>{*}{#e/twinkly/15}说不定，你们能做好朋友呢。',
                                    '<25>{*}{#e/twinkly/20}天晓得...',
                                    "<25>{*}{#e/twinkly/17}他们是不是你走向幸福的关键呢？"
                                ]),
                        '<25>{*}{#e/twinkly/0}...',
                        '<25>{*}{#e/twinkly/15}回见。'
                    ]
                    : [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}嘿。',
                        "<25>{*}{#e/twinkly/0}你打败我后，\n我就一直在寻思。",
                        ...(world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                            ? [
                                '<25>{*}{#e/twinkly/2}...真的有必要杀人吗？',
                                '<25>{*}{#e/twinkly/3}我...',
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? [
                                        '<25>{*}{#e/twinkly/1}上回和你一起杀人\n确实很爽，可是...',
                                        '<25>{*}{#e/twinkly/2}杀了人，我们有得到什么吗？'
                                    ]
                                    : [
                                        "<25>{*}{#e/twinkly/4}我有点吃不准了。",
                                        '<25>{*}{#e/twinkly/2}杀了人，你有得到什么吗？'
                                    ]),

                                '<25>{*}{#e/twinkly/13}除了一时的快感...'
                            ]
                            : [
                                '<25>{*}{#e/twinkly/2}你饶恕了他们，\n又杀了我，这值得吗？',
                                '<25>{*}{#e/twinkly/3}你...',
                                ...(1 <= SAVE.flag.n.killed_sans
                                    ? [
                                        '<25>{*}{#e/twinkly/1}你大概很后悔\n上回和我一起杀人，\n可是...',
                                        '<25>{*}{#e/twinkly/2}你真觉得杀了我，\n就能让自己心安吗？'
                                    ]
                                    : [
                                        "<25>{*}{#e/twinkly/4}你大概不喜欢我的作风，\n可是...",
                                        '<25>{*}{#e/twinkly/2}你真觉得杀了我，\n就能净化这个世界吗？'
                                    ]),
                                '<25>{*}{#e/twinkly/13}杀了我，你宣泄了不满，\n然后还有啥好处吗？'
                            ]),
                        '<25>{*}{#e/twinkly/3}...什么都没有了。',
                        '<25>{*}{#e/twinkly/0}...',
                        '<25>{*}{#e/twinkly/0}我给你出个主意吧。',
                        ...(world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                            ? [
                                '<25>{*}{#e/twinkly/15}也是一项挑战，\n看你接不接受。',
                                ...(SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                    ? ["<25>{*}{#e/twinkly/14}都不用我多说了，\n你得从头来过..."]
                                    : ["<25>{*}{#e/twinkly/14}都不用我多说了，\n你得重置时间线..."]),
                                "<25>{*}{#e/twinkly/15}不过，要是你能\n证明自己有本事活下来...",
                                
                                ...(world.trueKills > 0
                                    ? [
                                        '<25>{*}{#e/twinkly/0}...就算不杀任何人，\n你也能走到这，活下来...',
                                        "<25>{*}{#e/twinkly/18}...那我也许会\n放国王一马。"
                                    ]
                                    : [
                                        '<25>{*}{#e/twinkly/0}...就算救下敌人，\n你也能走到这，活下来...',
                                        "<25>{*}{#e/twinkly/18}...国王也许就\n不是非死不可了。"
                                    ])
                            ]
                            : [
                                '<25>{*}{#e/twinkly/15}也算个请求，\n不知道你答不答应。',
                                ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                    ? ["<25>{*}{#e/twinkly/20}你得从头来过，\n然后..."]
                                    : ["<25>{*}{#e/twinkly/20}你得从这继续，\n然后..."]),
                                '<25>{*}{#e/twinkly/15}一路走到艾斯戈尔面前。',
                                '<25>{*}{#e/twinkly/17}而且，中途不能杀任何怪物。'
                            ]),
                        "<25>{*}{#e/twinkly/20}你是不是也很好奇\n他正密谋什么计划？",
                        '<25>{*}{#e/twinkly/20}是不是也很好奇\n被他当成宝一样的“档案”\n里面到底长啥样？',
                        '<25>{*}{#e/twinkly/15}嗯...',
                        '<25>{*}{#e/twinkly/15}其实，\n在咱俩开战之前\n你走过的那条长廊...',
                        "<25>{*}{#e/twinkly/20}...都不足整个“档案”的\n冰山一角。",
                        '<25>{*}{#e/twinkly/17}嘻嘻嘻。',
                        "<25>{*}{#e/twinkly/18}好奇的话，\n就自己进去看看！"
                    ],
            postnoot1: (rep: number) =>
                rep < 2
                    ? [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/17}咋的了？\n哎呀呀，好可惜呢。",
                        ...(rep < 1
                            ? ["<25>{*}{#e/twinkly/17}你怎么没获得\n幸福结局呢？"]
                            : ["<25>{*}{#e/twinkly/17}你怎么还没获得\n幸福结局呢？"]),
                        ...(SAVE.data.b.ultrashortcut
                            ? [
                                '<25>{*}{#e/twinkly/21}...',
                                ...(SAVE.flag.b.ultra_twinkly
                                    ? [
                                        "<25>{*}{#e/twinkly/21}真无语...\n你要是跳一次流程也就罢了。",
                                        "<25>{*}{#e/twinkly/16}结果呢？\n这次还是没记性，\n又玩速通！",
                                        "<25>{*}{#e/twinkly/15}呵，意料之中。",
                                        '<25>{*}{#e/twinkly/15}觉得打破规则，\n很爽，很好玩，对吧？\n我理解。',
                                        "<25>{*}{#e/twinkly/20}不过，你早晚会知道\n自己这么闯，\n到底把谁给跳过了...",
                                        "<25>{*}{#e/twinkly/15}见了那家伙，\n别让人家把你弄死了。\n你还得回来见国王呢。",
                                        '<25>{*}{#e/twinkly/15}而且，全程谁也不能杀。',
                                        '<25>{*}{#e/twinkly/18}别装傻，\n老老实实按我说的做！'
                                    ]
                                    : [
                                        '<25>{*}{#e/twinkly/21}哎呀，真好奇呢。\n为什么国王会死呢？',
                                        "<25>{*}{#e/twinkly/16}下次别走捷径，\n跳过中间的旅途了！",
                                        '<25>{*}{#e/twinkly/24}...哎，算了。\n听不听随你便。',
                                        '<25>{*}{#e/twinkly/23}好好享受\n你的“特殊结局”吧。'
                                    ])
                            ]
                            : world.trueKills > 0 || SAVE.data.n.state_foundry_undyne === 1
                                ? [
                                    ...(rep < 1
                                        ? [
                                            '<25>{*}{#e/twinkly/20}...',
                                            '<25>{*}{#e/twinkly/20}哎呀呀...',
                                            world.trueKills > 1
                                                ? "<25>{*}{#e/twinkly/16}记住，\n下把谁也别杀！"
                                                : world.trueKills > 0
                                                    ? "<25>{*}{#e/twinkly/16}记住，\n下把§fill=#ff0§一只§fill=#fff§怪物也别杀！"
                                                    : "<25>{*}{#e/twinkly/16}记住，下把别把那谁\n㫰着等死了！",
                                            '<25>{*}{#e/twinkly/15}你要是做得到，\n还跟帕派瑞斯和安黛因交了朋友...',
                                            ...(SAVE.data.b.ubershortcut
                                                ? ["<25>{*}{#e/twinkly/15}就用不着跳过一整个地区了。"]
                                                : ['<25>{*}{#e/twinkly/15}就能去一个\n从未去过的新地方了。'])
                                        ]
                                        : [
                                            '<25>{*}{#e/twinkly/14}...',
                                            '<25>{*}{#e/twinkly/14}听我句劝...',
                                            world.trueKills > 1
                                                ? "<25>{*}{#e/twinkly/22}下把，真的真的\n别杀任何怪物了！"
                                                : world.trueKills > 0
                                                    ? "<25>{*}{#e/twinkly/22}下把，真的真的\n别杀哪怕§fill=#ff0§一只§fill=#fff§怪物了！"
                                                    : "<25>{*}{#e/twinkly/22}下把，真的真的\n别把那谁㫰着等死了！",
                                            ...(SAVE.data.b.ubershortcut
                                                ? ["<25>{*}{#e/twinkly/22}也别跳过\n一整个地区了！"]
                                                : ['<25>{*}{#e/twinkly/22}就这点小事，\n咋对你就这么费劲呢？'])
                                        ])
                                ]
                                : [
                                    '<25>{*}{#e/twinkly/0}...',
                                    ...(SAVE.data.b.ultrashortcut || SAVE.data.s.room === '' || SAVE.data.s.room === spawn // NO-TRANSLATE

                                        ? ['<25>{*}{#e/twinkly/21}我跟你说...\n要是你听我劝，\n从头开始...']
                                        : ['<25>{*}{#e/twinkly/21}我跟你说...\n要是你听我劝，\n继续前进...']),
                                    ...(rep < 1
                                        ? [
                                            1.1 <= SAVE.data.n.plot_date
                                                ? "<25>{*}{#e/twinkly/15}就有机会和安黛因\n成为好朋友。"
                                                : "<25>{*}{#e/twinkly/15}就有机会\n跟帕派瑞斯与安黛因两人\n成为好朋友。",

                                            '<25>{*}{#e/twinkly/14}人们都说“同舟共济”...',
                                            '<25>{*}{#e/twinkly/23}这次，就相信友情吧。'
                                        ]
                                        : [
                                            1.1 <= SAVE.data.n.plot_date
                                                ? "<25>{*}{#e/twinkly/16}就肯定能跟安黛因\n成为好朋友！"
                                                : "<25>{*}{#e/twinkly/16}就肯定能跟\n安黛因和帕派瑞斯\n成为好朋友！",
                                            "<25>{*}{#e/twinkly/20}有了朋友，再大的困难\n又算的了什么呢？",
                                            "<25>{*}{#e/twinkly/15}之后的发展\n肯定会非常有趣。"
                                        ])
                                ])
                    ]
                    : [
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/15}...嗯...',
                            '<25>{*}{#e/twinkly/15}最近忙活啥呢？',
                            '<25>{*}{#e/twinkly/15}交到新朋友了吗？',
                            '<25>{*}{#e/twinkly/0}...',
                            '<25>{*}{#e/twinkly/17}...说说我自己吧。\n放以前，我可是“交际花”。',
                            '<25>{*}{#e/twinkly/20}那时我的朋友可多了，\n比如，帕派瑞斯。',
                            "<25>{*}{#e/twinkly/15}在我的特训下，\n他可是当过皇家守卫的，\n不过他肯定不记得了。",
                            '<25>{*}{#e/twinkly/18}其实，他后来甚至当上队长了！',
                            "<25>{*}{#e/twinkly/24}...虽说过程蛮苦的。",
                            "<25>{*}{#e/twinkly/15}好——几次骨头都给他打折了。",
                            '<25>{*}{#e/twinkly/19}不过之后，他也变得强多了！',
                            '<25>{*}{#e/twinkly/17}找对方法，人的变化就是能这么大。\n挺有意思吧？',
                            "<25>{*}{#e/twinkly/15}不过呢，那条时间线\n早就随风而去了。",
                            '<25>{*}{#e/twinkly/20}嘿，要是你啥时候\n又来这看看...',
                            "<25>{*}{#e/twinkly/18}我可以再唠点\n其它时间线的趣事。"
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/20}又来听故事了？',
                            '<25>{*}{#e/twinkly/15}哦，我想啥呢。\n肯定的。',
                            '<25>{*}{#e/twinkly/21}这次聊啥呢...',
                            '<25>{*}{#e/twinkly/0}...摆着人类休眠仓的\n那间暗室怎么样？',
                            "<25>{*}{#e/twinkly/15}想进那儿可费老劲了，\n对我也一样。",
                            '<25>{*}{#e/twinkly/24}早些的时间线里，我想了些...\n蠢到家了的法子。',
                            '<25>{*}{#e/twinkly/13}什么直接求艾斯戈尔啦....\n跟他谈条件啦...\n硬憋点眼泪卖惨啦...',
                            '<25>{*}{#e/twinkly/4}...甚至撒娇卖萌，\n就为了让他开下门。',
                            '<25>{*}{#e/twinkly/0}我想做个“乖孩子”，\n可“乖孩子”什么奖励都没得到。',
                            '<25>{*}{#e/twinkly/15}后来的时间线里\n我就学精了。',
                            '<25>{*}{#e/twinkly/20}我装都不装了，\n直接把空气停了，憋死他们。\n这招可好使了。',
                            '<25>{*}{#e/twinkly/16}不过，使劲加重力，\n看着他们被重力压死\n那才更好玩！',
                            "<25>{*}{#e/twinkly/15}说这么多，\n我想你明白个事：\n那间暗室一般不放人进。",
                            "<25>{*}{#e/twinkly/17}他们需要你，故意放你进，\n你才能这么容易进去。",
                            "<25>{*}{#e/twinkly/20}好啦，我说完了。",
                            '<25>{*}{#e/twinkly/19}拜-拜！'
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/14}逗我呢？\n你咋又来？',
                            '<25>{*}{#e/twinkly/0}哇哦。',
                            '<25>{*}{#e/twinkly/0}重复这么多次，\n是不是觉得没意思了？',
                            "<25>{*}{#e/twinkly/15}我理解，\n我比你还没意思。",
                            '<25>{*}{#e/twinkly/20}我就纳闷了...',
                            '<25>{*}{#e/twinkly/20}按我说的做，\n就这么难？',
                            '<25>{*}{#e/twinkly/20}还是说，你是故意的？',
                            "<25>{*}{#e/twinkly/15}...欸，别说。",
                            '<25>{*}{#e/twinkly/18}啥事都弄太明白，\n那就没意思了。',
                            "<25>{*}{#e/twinkly/15}话说，我现在心情不错。",
                            '<25>{*}{#e/twinkly/20}...那姑且信你一把好了。',
                            '<25>{*}{#e/twinkly/14}要是您真蠢得自成一派，\n蠢得远近闻名...\n就劳烦您再回来一次。',
                            '<25>{*}{#e/twinkly/15}到那时，我给您一点提示。',
                            '<25>{*}{#e/twinkly/17}...再见。'
                        ],
                        [
                            "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}不愧是你。",
                            "<25>{*}{#e/twinkly/0}按理说，你循环这么多次，\n我该找你讨个说法。\n想想算了，无所谓了。",
                            '<25>{*}{#e/twinkly/0}你这次见我，\n肯定是有求于我。',
                            '<25>{*}{#e/twinkly/21}...',
                            "<25>{*}{#e/twinkly/15}认真听，\n我只说一遍，绝不重复。",
                            '<25>{*}{#e/twinkly/15}从下一时间线开始，\n怪物的{@fill=#ff0}攻击力{@fill=#fff}将大幅减弱。',
                            
                            
                            '<25>{*}{#e/twinkly/20}因此，你无需增加LOVE\n也能实现自保。',
                            "<25>{*}{#e/twinkly/15}能做到这些，\n得好好感谢我们的核心。",
                            "<25>{*}{#e/twinkly/20}整个前哨站的大气供应，\n都是由核心进行调控。\n如果不是这样，我也帮不了你。",
                            '<25>{*}{#e/twinkly/14}另外，你还得跟\n帕派瑞斯和安黛因...',
                            "<25>{*}{#e/twinkly/23}...要是我都提示到这份上\n还想不明白，\n那趁早放弃得了。",
                            "<25>{*}{#e/twinkly/15}在外面聪明点，\n别成天跟个大蠢货似的，\n你就能成功。",
                            "<25>{*}{#e/twinkly/15}...好，说完了。",
                            '<25>{*}{#e/twinkly/15}加油。'
                        ],
                        [
                            '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}...',
                            "<25>{*}{#e/twinkly/0}折腾来折腾去，\n想看看我啥反应，\n是不是？",
                            '<25>{*}{#e/twinkly/15}玩的开心不？',
                            "<25>{*}{#e/twinkly/17}告诉你，你如愿以偿了。\n从现在起，别想再见到我。\n永远别想。",
                            "<25>{*}{#e/twinkly/0}不听我的话，\n不按我说的做，\n就永远别想离开这个循环。",
                            '<25>{*}{#e/twinkly/15}还想和我对着干？\n死磕到底？\n就你？',
                            '<25>{*}{#e/twinkly/15}...省省力气吧。',
                            "<25>{*}{#e/twinkly/21}我懂人性。\n你越是死磕，就越无聊；\n越是无聊，就越想试试新方法。",
                            
                            '<25>{*}{#e/twinkly/23}到那时，\n你自然就乖乖听话了。',
                            '<25>{*}{#e/twinkly/20}无论是人类还是怪物，\n都有“好奇心”，都摆脱不了它。',
                            
                            '<25>{*}{#e/twinkly/16}慢慢内耗吧，\n你个大蠢货！'
                        ]
                    ][rep - 2],
            postnoot2: (rep: number, puzzlesolve: boolean, enemyweaken: boolean) => [
                ...((puzzlesolve || enemyweaken) && !SAVE.flag.b.neutral_reload_interloper
                    ? [
                        '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/20}哦对了...',
                        ...(puzzlesolve
                            ? ['<25>{*}{#e/twinkly/15}那些谜题可是我帮你解的，\n快好好谢谢我。']
                            : []),
                        ...(enemyweaken
                            ? [
                                puzzlesolve
                                    ? '<25>{*}{#e/twinkly/15}我还为了你，\n特意弄坏了供气系统呢。'
                                    : '<25>{*}{#e/twinkly/15}我为了你，特意破坏了\n前哨站的供气系统。\n快好好谢谢我。',
                                '<25>{*}{#e/twinkly/21}我发现，低气压环境\n不仅能帮你自保...',
                                '<25>{*}{#e/twinkly/15}还能让你更轻松地\n杀了那些怪物。'
                            ]
                            : []),
                        "<25>{*}{#e/twinkly/17}我真的太体贴了，\n你说是不是？",
                        '<25>{*}{#e/twinkly/17}...'
                    ]
                    : []),
                ...(rep < 1
                    ? [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}这是艾斯戈尔的灵魂，\n跟上回一样，我把它给你。",
                        '<25>{*}{#e/twinkly/0}拿了灵魂，就赶紧给我滚。',
                        '<25>{*}{#e/twinkly/20}要是还没放弃，\n听我一句劝...',
                        '<25>{*}{#e/twinkly/15}下回长点心吧。'
                    ]
                    : [
                        "<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}这是艾斯戈尔的灵魂，\n跟之前一样，我把它给你。",
                        '<25>{*}{#e/twinkly/0}拿了灵魂，就赶紧给我滚。',
                        '<25>{*}{#e/twinkly/20}听好了...',
                        "<25>{*}{#e/twinkly/15}你要是还不听我的话，\n跟我对着干，\n就永远别想让我停手。"
                    ])
            ],
            oof: ['<32>{#p/human}* （你倒吸了一口凉气...）'],
            killer1: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/15}呀。',
                "<25>{*}{#e/twinkly/17}你真把事情搞砸了，不是吗？",
                '<25>{*}{#e/twinkly/20}你不仅失去了\n对时间线的控制权...',
                "<25>{*}{#e/twinkly/15}而且现在若想夺回它，\n你还得重头再来。"
            ],
            killer2: [
                '<25>{*}{#p/twinkly}{#e/twinkly/14}嘿，我说。',
                "<25>{*}{#e/twinkly/23}如果这就是你想要的结局，\n那...",
                '<25>{*}{#e/twinkly/15}那就轮不到我来评判了。',
                "<25>{*}{#e/twinkly/17}但你不会真的指望我相信吧，\n啊？",
                '<25>{*}{#e/twinkly/17}这鬼状况就是你想要的？',
                '<25>{*}{#e/twinkly/15}我是说，当然。\n旁观是挺有趣的。',
                "<25>{*}{#e/twinkly/17}但现在一切都结束了..."
            ],
            killer3: [
                '<25>{*}{#p/twinkly}{#e/twinkly/15}...呃。\n我们都知道你能做得更好。',
                "<25>{*}{#e/twinkly/20}我不是说我是什么圣人之类的...",
                "<25>{*}{#e/twinkly/15}信不信由你，\n但我是站在你这边的。",
                '<25>{*}{#e/twinkly/15}我要你重获\n对时间线的控制权。',
                '<25>{*}{#e/twinkly/17}毕竟，\n看你坐在这里啥都不做...',
                "<25>{*}{#e/twinkly/17}并不怎么有趣，不是吗？"
            ],
            killer4: [
                "<25>{*}{#p/twinkly}{#e/twinkly/15}...噢，别担心。",
                '<25>{*}{#e/twinkly/20}就算我失去了所有记忆，\n那又怎么样呢？',
                "<25>{*}{#e/twinkly/18}反正你会记得这一切。\n这样你下次就会\n避免掉入这个陷阱。",
                '<25>{*}{#e/twinkly/15}然后，我们就能\n恢复以前那样。',
                '<25>{*}{#e/twinkly/20}那你怎么说？',
                '<25>{*}{#e/twinkly/20}你明白我说的话吗，\n$(name)？',
                '{*}{#e/twinkly/3}{%}'
            ],
            killer5: [
                '<25>{*}{#p/twinkly}{#e/twinkly/15}噢，我在开玩笑吗。',
                '<25>{*}{#e/twinkly/16}你当然明白啦！'
            ],
            please1: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（某种可能性仍然存在。）',
                "<25>{*}（抹去一切记忆的可能性\n  仍然存在。）",
                '<25>{*}（让一切归零的可能性\n  仍然存在。）'
            ],
            please2: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（你别无所求，\n  只想平静地生活。）',
                '<25>{*}（你别无所求，\n  只想迎接未来，\n  掌控自己的命运。）',
                '<25>{*}（你不想再度迷失自我。）'
            ],
            please3: [
                '<25>{*}{#p/human}（...）',
                '<25>{*}（你很感激某个人，\n  感谢那人为你做的一切。）',
                '<25>{*}（你真心希望那人\n  能放自己一条生路。）'
            ],
            forget1: ['<25>{*}{#p/human}（...）', "<25>{*}（你好孤独...）"],
            forget2: ['<25>{*}{#p/human}（...）', "<25>{*}（你好害怕...）"],
            forget3: [
                '<25>{*}{#p/human}（...）',
                "<25>{*}（你多么盼着能弥补过错...）",
                "<25>{*}（...不管付出什么代价，\n  忘记一切都行。）"
            ],
            forget4: [
                '<25>{*}{#p/human}（...）',
                "<25>{*}（可你没得选。）",
                "<25>{*}（你只能看着别人替你选。）"
            ],
            regret1: ['<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}你好呀。'],
            regret2: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/0}你瞧...\n怪物们找到了新家园，\n整个星系，一片欣欣向荣。',
                '<25>{*}{#e/twinkly/0}每个人... 都过得很幸福。',
                
                '<25>{*}{#e/twinkly/1}所以，别多想了。',
                "<25>{*}{#e/twinkly/2}这么完美的结局，\n还有什么可担心的呢？"
            ],
            regret3: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/3}...',
                '<25>{*}{#e/twinkly/4}嗯... 确实有一件事。',
                
                '<25>{*}{#e/twinkly/5}自打你来这，\n有件事我一直想不通。',
                "<25>{*}{#e/twinkly/6}也挺好奇。"
            ],
            regret4: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/7}...',
                '<25>{*}{#e/twinkly/7}当时，我发现你的LOVE\n不太对劲。',
                
                '<25>{*}{#e/twinkly/4}LOVE的值是... 零。',
                '<25>{*}{#e/twinkly/6}...',
                '<25>{*}{#e/twinkly/6}你可以探索一下，\n寻找这个“零”背后的含义...',
                "<25>{*}{#e/twinkly/7}如果你知道了\n这个“零”意味着什么，\n也许... 会有新的发现。",
                '<25>{*}{#e/twinkly/10}...',
                "<25>{*}{#e/twinkly/10}到底会发现什么...\n我也不清楚。",
                "<25>{*}{#e/twinkly/10}我甚至都不知道\n自己在说些什么。",
                '<25>{*}{#e/twinkly/9}...',
                '<25>{*}{#e/twinkly/9}仔细一想...',
                "<25>{*}{#e/twinkly/1}都过去这么多年了，\n这么做，真的有必要吗？",
                "<25>{*}{#e/twinkly/2}大家现在多幸福啊...",
                '<25>{*}{#e/twinkly/3}托丽尔，衫斯，帕派瑞斯，\n安黛因，艾菲斯，艾斯戈尔...\n都很幸福。',
                '<25>{*}{#e/twinkly/4}连怪物小孩，和纳普斯特...\n也是如此。',
                '<25>{*}{#e/twinkly/2}为了我，\n让他们付出那么多牺牲，\n真的值得吗？',
                '<25>{*}{#e/twinkly/2}...',
                "<25>{*}{#e/twinkly/10}我跟你说这些，\n是因为... 我曾经也拥有过\n控制时间线的力量。",
                "<25>{*}{#e/twinkly/11}那时，只要我想重置，\n就会付诸实行。",
                '<25>{*}{#e/twinkly/12}但经历了这些，\n让现在的我亲手抹去一切...',
                '<25>{*}{#e/twinkly/10}我...',
                "<25>{*}{#e/twinkly/10}我可能下不去手了。",
                '<25>{*}{#e/twinkly/10}更何况，\n他们现在很幸福...',
                '<25>{*}{#e/twinkly/11}...',
                '<25>{*}{#e/twinkly/11}所以...',
                '<25>{*}{#e/twinkly/11}请把握当下，\n珍惜现在的生活吧。',
                "<25>{*}{#e/twinkly/7}这样的结局固然不完美...",
                '<25>{*}{#e/twinkly/5}...但有缺憾，才叫生活啊。'
            ],
            regret5: [
                '<25>{*}{#p/twinkly}{#f/19}{#e/twinkly/5}...',
                '<25>{*}{#e/twinkly/8}唉。',
                "<25>{*}{#e/twinkly/8}要是我说了这些\n还说服不了你...",
                '<25>{*}{#e/twinkly/7}要是你铁了心\n想抹去一切...',
                '<25>{*}{#e/twinkly/6}...',
                '<25>{*}{#e/twinkly/2}这里的“一切”，\n也包括我的记忆。',
                '<25>{*}{#e/twinkly/7}...',
                "<25>{*}{#e/twinkly/6}对不起。",
                "<25>{*}{#e/twinkly/2}上面这些话，\n你或许已经听了无数次了。",
                '<25>{*}{#e/twinkly/6}...',
                "<25>{*}{#e/twinkly/6}我说完了。",
                '<25>{*}{#e/twinkly/4}期待我们下次再会...',
                '<25>{*}{#e/twinkly/13}$(name)。'
            ],
            asgoreStoryPre1: () =>
                world.bad_robot
                    ? [
                        '<25>{#p/alphys}{#g/alphysSide}* 呃，你-你好...\n* 你...',
                        '<25>{#g/alphysSideSad}* 你真-真的很享受杀人...\n* ...嗯？',
                        "<25>{#g/alphysNervousLaugh}* 我-我是说，我不是在批评你，\n  我只是...",
                        "<25>{#g/alphysUhButHeresTheDeal}* 我只是觉得这超级无敌酷！！！",
                        '<25>{#g/alphysSideSad}* 我-我这样说...',
                        "<25>{#g/alphysCutscene3}* 也许你现在就\n  不会打算杀我啦？？？"
                    ]
                    : ["<25>{#p/asgore}{#f/0}* ...是不是挺美的？", '<25>{#p/asgore}{#f/0}* ...'],
            asgoreStoryPre2: () =>
                world.bad_robot
                    ? ['<25>{*}{#p/alphys}{#g/alphysOhGodNo}* 后头有人！！！{%}']
                    : [
                        '<25>{#p/asgore}{#f/6}* 孩子，如果你被吓着了，\n  那我先对你道个歉。',
                        '<25>{#p/asgore}{#f/6}* 艾菲斯告知了我\n  你会来到这里。'
                    ],
            asgoreStoryPre3: () => [
                '<25>{#p/asgore}{#f/7}* ...',
                ...(SAVE.flag.b.waaaaaooaaooooaaaaaaooohooohooohstooooryofunderrtaaaaale
                    ? [
                        '<25>{#p/asgore}{#f/12}* 嗯...？\n* 你已经听过这个故事了？',
                        '<25>{#p/asgore}{#f/5}* ...',
                        '<25>{#p/asgore}{#f/6}* 好吧。',
                        '<25>{#p/asgore}{#f/6}* 如果你早已听过，\n  那我也不必再复述一遍。',
                        '<25>{#p/asgore}{#f/6}* 继续一个人行进吧。'
                    ]
                    : ['<25>{#p/asgore}{#f/7}* 来吧。', '<25>{#p/asgore}{#f/7}* 我有一个故事\n  要讲给你听。'])
            ],
            alphysApproach1: [
                "<25>{#p/alphys}{#g/alphysSmileSweat}* 噢，你-你大概在想\n  艾斯戈尔在哪，\n  对吧？",
                "<25>{#g/alphysNervousLaugh}* 唔... 他在...",
                '<25>{#g/alphysHellYeah}* 一个安全的地-地方！',
                '<25>{#g/alphysTheFactIs}* 相对安全。',
                '<25>{#g/alphysOhGodNo}* 或者说-\n* 不，绝对！\n* 绝对安全！',
                '<25>{#g/alphysInquisitive}* 所以，总-总的来说，\n  你不妨... 直接放弃吧。',
                '<26>{#g/alphysInquisitive}* 因为...',
                "<26>{#g/alphysNervousLaugh}* 你永远也找不到他！！",
                '<25>{#g/alphysHellYeah}* 好啊！\n* 看-看这招！'
            ],
            alphysApproach2: [
                '<25>{#p/alphys}{#g/alphysOhGodNo}* ...',
                '<25>{#g/alphysNervousLaugh}* ...呃呃...',
                '<25>{#g/alphysNervousLaugh}* 像往常一样挺过来了，\n  哈-哈啊？',
                '<25>{#g/alphysNeutralSweat}* ...',
                "<25>{#g/alphysIDK2}* 我猜你要去见艾斯戈尔了。",
                '<25>{#g/alphysIDK3}* ...',
                "<25>{#g/alphysIDK3}* 我太没用了...",
                "<25>{#g/alphysThatSucks}* 你可能根本就没在乎过我，\n  对吧？",
                "<25>{#g/alphysIDK2}* 我一直很害怕，\n  但你可能根本就没想过要抓我。",
                '<25>{#g/alphysIDK3}* ...',
                "<25>{#g/alphysIDK2}* 去吧。\n* 你想做啥，随意。",
                "<26>{#g/alphysIDK3}* 我阻止不了你。"
            ],
            alphysApproach3: ["<25>{#p/alphys}{#g/alphysFR}* 只有一个人能做到。"],
            asgoreStory1: [
                '<25>{*}{#p/asgore}{#f/6}* 很久以前，一个人类小孩\n  在前哨站迫降。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 身受重伤的人类\n  开始大声呼救。{~}'
            ],
            asgoreStory1r: ['<32>{#p/basic}* ...{%40}', "<32>{#p/basic}* 对不起。{%40}"],
            asgoreStory2: [
                '<25>{*}{#p/asgore}{#f/7}* 而我们的长子艾斯利尔\n  听到了呼救声。{~}',
                '<25>{*}{#p/asgore}{#f/7}* 他把人类带回了\n  我们家里。{~}'
            ],
            asgoreStory2r: ['<32>{#p/basic}* 我已竭尽全力。{%40}'],
            asgoreStory3: [
                '<25>{*}{#p/asgore}{#f/6}* 慢慢的，\n  两个孩子变得情同手足。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 他们之间的亲情\n  随着前哨站的扩建\n  也愈发紧密。{~}',
                '<25>{*}{#p/asgore}{#f/6}* 整个前哨站充满了希望。{~}'
            ],
            asgoreStory3r: ['<32>{#p/basic}* 我不想留下遗憾。{%40}'],
            asgoreStory4: [
                '<25>{*}{#p/asgore}{#f/1}* 然而，有一天...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 人类猝不及防地\n  感染了一种疾病。{~}'
            ],
            asgoreStory4r: ['<32>{#p/basic}* 我必须这样做。{%40}'],
            asgoreStory5: [
                '<25>{*}{#p/asgore}{#f/1}* 病入膏肓的人类\n  只有一个请求。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 想看看我们先前\n  那伟大富饶的世界\n  所残存的遗址。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 但我们对此无能为力。{~}'
            ],
            asgoreStory5r: ['<32>{#p/basic}* 我只是想让他看看星辰大海。{%40}'],
            asgoreStory6: [
                '<25>{*}{#p/asgore}{#f/1}* 第二天...{~}',
                '<25>{*}{#p/asgore}{#f/1}* ...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 人类便与世长辞。{~}'
            ],
            asgoreStory6r: ['<32>{#p/basic}* 我只是希望他能开心。{%40}'],
            asgoreStory7: [
                '<25>{*}{#p/asgore}{#f/15}* 艾斯利尔悲痛欲绝，\n  吸收了这个人类的\n  灵魂。{~}',
                '<25>{*}{#p/asgore}{#f/16}* 他化作了一个\n  拥有不可思议力量的\n  存在。{~}'
            ],
            asgoreStory7r: ['<33>{#p/basic}* 我从来没有...{%40}'],
            asgoreStory8: [
                '<25>{*}{#p/asgore}{#f/4}* 凭借着新获得的力量，\n  艾斯利尔穿过了力场。{~}',
                "<25>{*}{#p/asgore}{#f/4}* 他开着一架小型飞船，\n  载着人类的遗体\n  飞向远方。{~}",
                '<25>{*}{#p/asgore}{#f/4}* 希望能找到那\n  传说中的遗迹。{~}'
            ],
            asgoreStory8r: ['<32>{#p/basic}* ...没有...{%40}'],
            asgoreStory9: [
                '<25>{*}{#p/asgore}{#f/1}* 很快，他就发现了\n  自己所寻找的东西。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 飞船着陆在破碎飘零的\n  碎片之中...{~}',
                "<25>{*}{#p/asgore}{#f/1}* 人类的遗体\n  也在此安葬。{~}"
            ],
            asgoreStory9r: ['<32>{#p/basic}* ...{%40}'],
            
            
            asgoreStory10: [
                "<25>{*}{#p/asgore}{#f/5}* 突然，飞船的\n  近接感测警报\n  开始响起。{~}",
                "<25>{*}{#p/asgore}{#f/5}* 拾荒者们看到了\n  抱着人类遗体的艾斯利尔。{~}",
                '<25>{*}{#p/asgore}{#f/2}* 他们以为是艾斯利尔\n  杀死了这个小孩。{~}'
            ],
            asgoreStory11: [
                '<25>{*}{#p/asgore}{#f/2}* 人类用尽所能\n  攻击艾斯利尔。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 一枪又一枪，\n  一击又一击...{~}',
                '<25>{*}{#p/asgore}{#f/2}* 以艾斯利尔现在的形态\n  是有力量将他们\n  尽数消灭的。{~}'
            ],
            asgoreStory12: [
                '<25>{*}{#p/asgore}{#f/4}* 但是...{~}',
                '<25>{*}{#p/asgore}{#f/4}* 艾斯利尔并没有还手。{~}'
            ],
            asgoreStory12r: ['<32>{#p/human}* （你听见有人在哭...）{%40}'],
            asgoreStory13: [
                "<25>{*}{#p/asgore}{#f/9}* 艾斯利尔紧紧抱住\n  人类的遗体，向外界看了\n  最后一眼...{~}",
                '<25>{*}{#p/asgore}{#f/9}* 然后他面带微笑...\n  缓缓地离开了。{~}'
            ],
            asgoreStory13r: ["<32>{#p/basic}* 我没法...\n* 他-他不让我-我...{%40}"],
            asgoreStory14: [
                '<25>{*}{#p/asgore}{#f/1}* 伤痕累累的艾斯利尔驾驶着\n  受损的飞船回到了家。{~}',
                '<25>{*}{#p/asgore}{#f/1}* 他下了飞船，\n  然后瘫倒在地。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 化作一团尘埃，\n  飘散在整片花丛里。{~}'
            ],
            asgoreStory14r: ['<32>{#p/basic}* ...{%40}'],
            asgoreStory15: [
                '<25>{*}{#p/asgore}{#f/13}* 前哨站，我的前哨站...\n  陷入了绝望。{~}',
                '<25>{*}{#p/asgore}{#f/13}* 我们一夜之间就\n  失去了两个孩子。{~}',
                '<25>{*}{#p/asgore}{#f/14}* 我们的一切，又一次\n  被夺走了。{~}'
            ],
            asgoreStory15r: ["<32>{#p/basic}* ...这不公平...{%40}"],
            asgoreStory16: [
                '<25>{*}{#p/asgore}{#f/13}* 于是，我一怒之下\n  向人类宣战。{~}',
                '<25>{*}{#p/asgore}{#f/13}* 无论付出多少代价，\n  我都要让我们怪物\n  重获自由。{~}',
                '<25>{*}{#p/asgore}{#f/14}* ...而人民们都支持\n  我的决策。{~}'
            ],
            asgoreStory16r: ["<32>{#p/basic}* ...这不公平！{%40}"],
            asgoreStory17: [
                '<25>{*}{#p/asgore}{#f/3}* 可我回过神来才发现，\n  一切都为时已晚。{~}',
                '<25>{*}{#p/asgore}{#f/2}* 无论做什么事情\n  都无法阻挡人民\n  发动战争的意愿。{~}',
                '<25>{*}{#p/asgore}{#f/5}* 至少明面上如此。{~}'
            ],
            asgoreStory18: () =>
                SAVE.data.b.killed_mettaton || world.baddest_lizard
                    ? [
                        '<25>{*}{#p/asgore}{#f/5}* 事到如今，想必艾菲斯\n  一定已经告诉过你\n  某个秘密了吧。{~}',
                        '<25>{*}{#p/asgore}{#f/5}* 一份我与前皇家科学员的\n  协议。{~}',
                        '<25>{*}{#p/asgore}{#f/6}* ...她怎么这个时候\n  迟到了...{~}'
                    ]
                    : [
                        '<25>{*}{#p/asgore}{#f/5}* 事到如今，想必艾菲斯\n  一定已经告诉过你\n  某个{@fill=#003cff}秘密{@fill=#fff}了吧。{~}',
                        '<25>{*}{#p/asgore}{#f/5}* 一份我与前皇家科学员的\n  {@fill=#003cff}协议{@fill=#fff}。{~}',
                        '<25>{*}{#p/asgore}{#f/6}* ...啊，原来她来了。\n* 我刚才还寻思着她\n  什么时候才会到呢。{~}'
                    ],
            asgoreStory19: [
                '<25>{#p/alphys}{#g/alphysNervousLaugh}* 呃，抱-抱歉！\n* 我已经尽力在赶了！',
                '<25>{#p/asgore}{#f/6}* 不必着急。\n* 毕竟好事多磨嘛。',
                "<25>{#p/alphys}{#g/alphysWorried}* ...你真觉得人类\n  已经做好准备了吗？"
            ],
            asgoreStory20a: [
                '<25>{#p/asgore}{#f/7}* 孩子，请让我们\n  先行一步...',
                '<25>{#p/asgore}{#f/7}* 我和艾菲斯有些事情\n  需要谈谈。'
            ],
            asgoreStory20b: [
                "<25>{#p/alphys}{#g/alphysHellYeah}* 是的，呃...\n  接-接着往前走吧，\n  我们会等着你的！"
            ],
            asgoreStory21: [
                '<25>{#p/asgore}{#f/5}* 真奇怪。\n* 她居然还没来。',
                '<25>{#p/asgore}{#f/5}* ...这不是我所期望的。'
            ],
            asgoreStory22: [
                '<25>{#p/asgore}{#f/5}* 那么。\n* 她要是想见我\n  就得等上一会了。',
                '<25>{#p/asgore}{#f/5}* 这件事不能再拖了。'
            ],

            
            jspeech1: () => [
                '<32>{#p/darksans}* 终于，你到达此处。',
                '<32>* 旅途的终点，已触手可及。',
                world.bad_robot || SAVE.data.b.ultrashortcut
                    ? '<32>* 片刻之后，你就能见到国王。'
                    : '<32>* 片刻之后，你又能见到国王。',
                '<32>* 到那时...',
                ...(SAVE.data.b.ultrashortcut
                    ? [
                        '<32>* ...',
                        "<32>* 不对。",
                        '<32>* 你怎么来得这么快？',
                        '<32>* 让我猜猜，你是不是...',
                        '<32>* 走{@fill=#ff0}捷径{@fill=#fff}了？'
                    ]
                    : [
                        ...(SAVE.data.b.water
                            ? [
                                '<32>* ...',
                                "<32>* 你是不是一路上\n  一直拿着那杯液体？",
                                ...(world.dead_skeleton
                                    ? ['<32>* ...', '<32>* 嗯，没事。']
                                    : ['<32>* 嘿。', '<32>* 回到刚才的话题...'])
                            ]
                            : []),
                        '<32>* 你将会决定怪物的命运。',
                        "<32>* 但那是后话。",
                        '<32>* 现在。',
                        '<32>* 你将接受审判。',
                        '<32>* 你将为你每一个行为接受审判。',
                        "<32>* 你将为你获得的每一点EXP\n  接受审判。",
                        "<32>* EXP是什么？",
                        "<32>* 是一个缩写。",
                        '<32>* 意思是“{@fill=#f00}处决点数{@fill=#fff}”\n  （{@fill=#f00}EX{@fill=#fff}ecution {@fill=#f00}P{@fill=#fff}oints）。',
                        '<32>* 它表征的，是你\n  “处决”怪物的数量。',
                        '<32>* 每“处决”一只怪物，\n  EXP就会增加一些。',
                        '<32>* 当EXP积累到一定程度时，\n  LOVE就会增加。',
                        '<32>* LOVE，也是一个缩写。',
                        '<32>* 意思是“{@fill=#f00}暴力等级{@fill=#fff}”\n  （{@fill=#f00}L{@fill=#fff}evel {@fill=#f00}O{@fill=#fff}f {@fill=#f00}V{@fill=#fff}iol{@fill=#f00}E{@fill=#fff}nce）。',
                        "<32>* 它表示的，\n  是伤害别人的能力。",
                        '<32>* 杀得越多，\n  就越容易偏离本心。',
                        '<32>* 离本心越远，\n  就越难受到伤害。',
                        '<32>* 也就越容易放任自己\n  伤害别人。'
                    ])
            ],
            jspeechU1: () => [
                '<25>{#p/sans}{#f/3}* ...',
                ...[
                    [
                        '<25>{#f/0}* 哇，伙计。\n* 你咋也走上捷径了呢？',
                        "<25>{#f/3}* 别误会。\n* 你面前的家伙，也跟你一样\n  爱死这东西了。",
                        "<25>{#f/2}* 但你是不是该花点时间\n  反思一下呢？"
                    ],
                    [
                        "<25>{#f/0}* 从表情来看，\n  你都走了好几次捷径了。",
                        "<25>{#f/3}* 我可没生气哦。\n* 毕竟，速通超爽的。",
                        "<25>{#f/2}* 但你该反思还是得反思！\n* 这可走不了捷径哦。"
                    ]
                ][Math.min(SAVE.flag.n.meet3++, 1)]
            ],
            jspeechU2: [
                '<25>{#p/sans}* 对了。',
                "<25>{#f/3}* 你就一边看着我\n  吃这美味的冰淇淋...",
                '<25>{#f/2}* 一边好好反思一下\n  自己咋一下子就到这了。'
            ],
            jspeechU3: [
                '<25>{#p/sans}* 你瞧，\n  这冰淇淋还是三文鱼味的。',
                '<25>{#p/sans}* 我听说，皇家守卫都可喜欢\n  这种口味了。'
            ],
            jspeechU4: [
                "<25>{#p/sans}{#f/3}* 当然咯。\n* 我也把这事告诉帕派瑞斯了。",
                "<25>{#f/0}* 这样，他就能更了解\n  那群守卫的喜好。",
                '<25>{#f/2}* 正好，帕派瑞斯也要进\n  皇家卫队了。'
            ],
            jspeechU5: [
                '<25>{#p/sans}{#f/0}* 嘿嘿...\n* 抓到人类果然能带来好事，\n  还有冰淇淋吃，',
                "<25>{#f/3}* ...别担心。\n* 我吃得很快的。",
                "<25>{#f/2}* 你看，我都吃完一半了。"
            ],
            jspeechU6: () => [
                '<25>{#p/sans}{#f/0}* 我在想，如果那位\n  卖“冰意灵”的伙计也愿意\n  卖这种口味的冰淇淋...',
                ...(SAVE.data.n.state_starton_nicecream < 1
                    ? ["<25>{#f/2}* 那肯定就有顾客上门了。"]
                    : ["<25>{#f/2}* 那上门的顾客肯定就多了。"])
            ],
            jspeechU7: [
                '<26>{#p/sans}{#f/0}* 啊... 哪怕是山珍海味，\n  也比不上这三文鱼\n  冰淇淋啊。',
                '<25>{#f/2}* 现在开始吃蛋筒。'
            ],
            jspeechU8: [
                "<26>{#p/sans}{#f/3}* 现代克隆技术\n  真是发达...",
                "<25>{#f/0}* 以前，想搞点能吃的东西\n  都难上加难...",
                '<25>{#f/2}* 而现在，冰淇淋、蛋筒\n  都能完美复制出来。'
            ],
            jspeechU9: ['<25>{#p/sans}{#f/0}* ...', '<25>{#f/3}* ...现在是彻底吃没了。'],
            jspeechU10: (funni: boolean) => [
                "<25>{#p/sans}{#f/0}* 行，那就这样。",
                ...(funni
                    ? ['<25>{#f/2}* 希望你能\n  早日从柱子中脱困哦。']
                    : ["<25>{#f/2}* 希望你没白白浪费\n  这段时间哦。"])
            ],
            jspeech2: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                "<25>{#f/0}* 哦，lv0？\n* 那是什么？",
                "<25>{#f/3}* 葛森的人类防卫手册中\n  没写这些。",
                "<25>{#f/0}* 如果是平常，\n  我会扯点高大上的话，\n  比如...",
                '<25>{#f/4}* “虽无法做到至善，\n   但仍坚守本心”？',
                '<25>{#f/0}* 但你与众不同。',
                '<25>{#f/3}* ...\n* 所以...',
                "<25>{#f/4}* 我会直接跳过\n  那些长篇大论...",
                '<25>{#f/0}* 直接放你前进。',
                '<25>{#f/3}* 毕竟...',
                "<25>{#f/2}* 像你这么棒的家伙...\n  肯定能在两难之中\n  找到第三条路的。",
                ...(world.flirt < world.flirt_state1.length
                    ? [
                        '<25>{#f/3}* ...',
                        '<25>{#f/0}* 加油，孩子。',
                        ...(funni
                            ? ["<25>{#f/2}* 我会把你挪回柱子后面。"]
                            : ["<26>{#f/2}* 你一定能成功的。"])
                    ]
                    : [
                        '<25>{#f/3}* ...哦对。\n* 差点忘了。',
                        '<25>{#f/0}* 你可能已经知道\n  对艾菲斯调情\n  是有多么困难了。',
                        "<25>{#f/2}* 但我有给小妙招，\n  能让你一击俘获\n  艾菲斯的芳心。",
                        "<25>{#f/0}* 如果你真的想成为\n  一位传奇调情大师...",
                        "<25>{#f/0}* 你就得在她耳边\n  这样低语。",
                        '<32>{#p/human}* （衫斯在你耳边\n  小声说了些话。）',
                        ...(funni
                            ? ['<25>{#p/sans}{#f/2}* 尽量别在柱子后面\n  对她说这些话。']
                            : ['<25>{#p/sans}{#f/2}* 祝你好运。'])
                    ])
            ],
            jspeech3: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* ...可是。\n* 你从未获得任何LOVE。',
                "<25>* ...嘿，为啥摆出那表情？",
                "<25>{#f/2}* 众所周知，\n  lv1就是最低的等级。",
                "<25>{#f/0}* 但这可不代表\n  你天真无邪，人畜无害。",
                ...(SAVE.data.n.bully < 15
                    ? SAVE.data.n.state_foundry_undyne > 0
                        ? [
                            "<25>{#f/0}* 当你有能力\n  去拯救某人性命时...",
                            '<25>{#f/0}* 你放弃了救人，\n  转而选择自保。',
                            '<25>{#f/3}* 也许你会争辩，\n  当时身处险境，十分害怕，\n  只能那么做。',
                            "<25>{#f/0}* 但是，你就从没考虑过\n  另一条更好的路吗？",
                            '<25>{#f/0}* ...',
                            '<25>{#f/0}* 问题的答案，已经不重要了。',
'<25>{#f/0}* 重要的是...',
                            '<25>{#f/3}* 你没有放任自己，\n  更没有杀戮别人。',
                            "<25>{#f/0}* 在那种情况下，\n  你即便抛弃了对手，\n  也肯定不是出于恶意。",
                            '<25>{#f/0}* 你从未得到LOVE，\n  但你心中有爱（love）。',
                            '<25>{#f/0}* 这说得通吗？',
                            '<25>{#f/0}* 也许不吧。'
                        ]
                        : [
                            '<25>* 只能说明，内心深处，\n  你仍保有那份“善”。',
                            '<25>* 不管经受多少挫折，\n  多少伤痛... \n  你仍坚守本心，做正确的事。',
                            
                            ...(world.flirt < 20
                                ? [
                                    '<25>* 哪怕是一草一木，\n  你也从不去伤害他们。',
                                    '<25>* 即使输了，逃跑了，\n  脸上仍挂着笑容。',
                                    '<25>* 你从未得到LOVE，\n  但你得到了爱（love）。',
                                    '<25>* 这说得通吗？',
                                    '<25>* 也许不吧。'
                                ]
                                : [
                                    "<25>* 我听说，你特别会撩人。",
                                    '<25>* 你从未伤害他们，\n  还一一俘获了他们的心。',
                                    '<25>{#f/2}* 嘿嘿，你挺喜欢\n  给自己上强度啊。'
                                ])
                        ]
                    : [
                        SAVE.data.n.bully < 30
                            ? "<25>{#f/0}* 一路上，你伤害了不少人。\n  不是吗？"
                            : "<25>{#f/0}* 一路上，你伤害了很多人。\n  不是吗？",
                        ...(SAVE.data.n.state_foundry_undyne > 0
                            ? [
                                "<25>{#f/0}* 而且，当你有能力\n  去拯救某人性命时...",
                                '<25>{#f/0}* 你放弃了救人，\n  转而选择自保。',
                                '<25>{#f/3}* 也许你会争辩，\n  当时身处险境，十分害怕，\n  只能那么做。',
                                '<25>{#f/3}* 但别的怪物面对你，\n  难道就不恐惧，不害怕吗？',
                                '<25>{#f/0}* 希望你记着...'
                            ]
                            : world.flirt < 20
                                ? [
                                    '<25>{#f/0}* 你确实没杀一只怪物，\n  但你无数次将他们\n  推向生死边缘。',
                                    '<25>{#f/3}* 这是正当防卫？\n* 还是防卫过当呢？',
                                    "<25>{#f/0}* 只有你自己心里清楚。"
                                ]
                                : [
                                    '<25>{#f/0}* 等他们乖乖就范，\n  你又展开攻势，\n  俘获他们的心。',
                                    '<25>{#f/3}* 你这么干，是事先计划好的吗？\n* 还是说... 我搞错了？',
                                    "<25>{#f/0}* 只有你自己心里清楚。"
                                ])
                    ]),
                '<25>{#f/3}* ...\n* 而现在，你要作出抉择。',
                "<25>{#f/0}* 作出整段旅程中，\n  最重要的抉择。",
                '<25>* 你的选择...\n  将决定整片星系的命运。',
                '<25>* 是安宁度日，放弃机会，\n  还是尝试冒险，进入档案？',
                '<25>* 选择前者...',
                '<25>* 怪物将无法获得自由。',
                '<25>* 艾斯戈尔会尽己所能，\n  打理你的衣食住行。',
                '<25>* 可我们也许会\n  永远无法离开这里。',
                '<25>{#f/3}* 相反。\n* 如果听从艾斯戈尔的计划，\n  选择后者...',
                "<25>{#f/0}* 你将要冒生命危险。",
                "<25>* 装置可能出现故障，\n  计划可能并不顺利，\n  还可能把命搭上...",
                '<25>* 那么...',
                '<25>* 你会选择哪条路呢？',
                '<25>{#f/3}* ...',
                '<25>* 要是换我，早就放弃了。',
                "<25>{#f/2}* 但你绝不会因为这样的困难\n  就停下脚步，对吧？",
                "<25>{#f/0}* 没错，你有一种特殊的力量。",
                '<25>* 那就是“{@fill=#ff0}决心{@fill=#fff}”。',
                ...(SAVE.data.n.bully < 15
                    ? [
                        '<25>* 只要你不放弃...',
                        "<25>* 只要你始终坚守本心...",
                        '<25>* 我相信，你一定能作出\n  正确的抉择。',
                        ...(SAVE.data.n.state_foundry_undyne > 0 || world.flirt < world.flirt_state1.length
                            ? [
                                '<25>{#f/3}* 那么...',
                                "<25>{#f/0}* 我们都指望你了，孩子。",
                                ...(funni
                                    ? ["<25>{#f/2}* 我会把你挪回柱子后面。"]
                                    : ['<25>{#f/2}* 加油哦。'])
                            ]
                            : [
                                '<25>{#f/3}* 哦，差点忘了。',
                                '<25>{#f/0}* 说不定你也发现，\n  跟她调情有点困难。',
                                '<25>{#f/0}* 我说的“她”，就是艾菲斯。',
                                "<25>{#f/2}* 但我有给小妙招，\n  能让你一击俘获\n  艾菲斯的芳心。",
                                "<25>{#f/0}* 如果你真的想成为\n  一位传奇调情大师...",
                                "<25>{#f/0}* 你就得在她耳边\n  这样低语。",
                                '<32>{#p/human}* （衫斯在你耳边\n  小声说了些话。）',
                                ...(funni
                                    ? ['<25>{#p/sans}{#f/2}* 尽量别在柱子后面\n  对她说这些话。']
                                    : ['<25>{#p/sans}{#f/2}* 祝你好运。'])
                            ])
                    ]
                    : [
                        "<26>* 甭管你之前\n  怎么用这种能力。",
                        "<25>* 我相信...在危急关头，\n  你一定可以做出\n  正确的选择。",
                        '<25>{#f/3}* ...',
                        '<25>{#f/3}* 保持那份善意，好吗？',
                        ...(funni ? ['<25>{#f/2}* ...还有，别总柱子后面站。'] : [])
                    ])
            ],
            
            jspeech4: [
                '<25>{#p/darksans}* 现在，你清楚了\n  EXP与LOVE的含义。',
                "<25>* 也是时候接受审判了。",
                
                '<25>* 扪心自问，\n  一路走来做的那些事\n  真的是正确的吗？',
                
                '<25>* 清楚了过去的所作作为，\n  又该如何面对当下呢？',
                '<25>* 花点时间想想吧。'
            ],
            jspeech5a: [
                '<25>{#p/sans}{#f/3}* ...',
                "<25>{#f/0}* 其实，问题的答案是什么\n  并不重要。",
                "<25>* 重要的是，在这个过程中\n  有没有坦诚面对自己。"
            ],

            
            jspeech5b1: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* 接下来怎么做...',
                '<25>{#f/0}* 由你决定。',
                ...(funni ? ['<25>{#f/2}* ...走之前，我把你\n  移回柱子后面。'] : [])
            ],

            
            jspeech5b2: () => [
                '<25>{#p/sans}{#f/3}* 只不过...',
                '<25>{#f/0}* 有件事我一直想不通。',
                '<25>* 在这里，你被迫要面对\n  一些棘手的情况。',
                '<25>* 选择自保，本没有错。',
                '<25>* 但我发现...',
                
                "<25>* 你的行为举止就好像...\n  你能预知未来一样。",
                
                '<25>* 虽然这么问有点冒犯，\n  不过...',
                '<25>* 倘若你真的拥有\n  某种{@fill=#ff0}特殊能力{@fill=#fff}...',
                "<25>* 是不是该拿它做点好事呢？",
                choicer.create('* （你要怎么回答？）', '\n你说得对', '他们的死活\n跟我没关系')
            ],
            jspeech5b3a: ['<25>{#p/sans}{#f/4}* 哦，知道了。', ],
            jspeech5b3b: [
                '<25>{#p/sans}{#f/4}* 这样啊。',
                "<25>{#f/0}* 没事，谁都有自己的想法。",
                "<25>{#f/2}* 我不会妄加评判。"
            ],
            jspeech5b3c: ['<25>{#p/sans}{#f/3}* ...'],

            
            
            jspeech5b4a: ["<25>{*}{#p/darksans}{#f/1}{#i/5}* ...那你为什么要杀\n  我的兄弟？"],
            jspeech5b4b: ['<25>{*}{#p/darksans}{#f/1}{#i/5}* ...好个肮脏的兄弟杀手。'],
            jspeech5b5a: ["<25>{#p/sans}{#f/3}* ...看来托丽尔入不了你的眼，\n  不值得施舍善心。\n  是不是啊？"],
            jspeech5b5b: ['<25>{#p/sans}{#f/3}* ...你都对托丽尔动了手，\n  我评判你两句\n  其实也无可厚非。'],
            jspeech5b6a: ["<25>{*}{#p/darksans}{#f/1}{#i/5}* ...那你为什么要\n  滥杀无辜？"],
            jspeech5b6b: ['<25>{*}{#p/darksans}{#f/1}{#i/5}* ...好个肮脏的连环杀手。'],
            jspeech5b7a: ["<25>{#p/sans}{#f/3}* ...看来安黛因入不了你的眼，\n  不值得施舍善心。\n  是不是啊？"],
            jspeech5b7b: ['<25>{#p/sans}{#f/3}* ...你都对安黛因动了手，\n  我评判你两句\n  其实也无可厚非。'],
            jspeech5b8a: ["<25>{#p/sans}{#f/3}* ...看来镁塔顿入不了你的眼，\n  不值得施舍善心。\n  是不是啊？"],
            jspeech5b8b: ['<25>{#p/sans}{#f/3}* ...你都对镁塔顿动了手，\n  我评判你两句\n  其实也无可厚非。'],
            jspeech5b9a: ["<25>{#p/sans}{#f/3}* ...看来，那些死掉的怪物\n  入不了你的眼，\n  不值得施舍善心，是不是啊？"],
            jspeech5b9b: ['<25>{#p/sans}{#f/3}* ...你都对那些怪物动了手，\n  我评判你两句\n  其实也无可厚非。'],
            jspeech5b10a: ["<25>{#p/sans}{#f/3}* ...看来那只死掉的怪物\n  入不了你的眼，\n  不值得施舍善心，是不是啊？"],
            jspeech5b10b: ['<25>{#p/sans}{#f/3}* ...你都对那只怪物动了手，\n  我评判你两句\n  其实也无可厚非。'],

            
            jspeech6a: [
                '<25>{#p/sans}{#f/4}* 哎等等。\n* 你咋看起来这么无聊呢？',
                "<25>* 我有预感，让你沉思，\n  你根本学不到任何教训。",
                '<25>{#f/0}* 所以，得开始审判你了。'
            ],

            
            jspeech6b1: [
                '<26>{#p/sans}* lv2...\n* 哎呀，某个地方好像\n  出了点小瑕疵呢。',
                "<25>{#f/4}* 唔... 真是太可惜了。",
                "<25>{#f/3}* 说不定，你自己都不知道\n  是咋升到lv2的...",
                '<25>* 等你发现时，只能后悔莫及...{^6}\n  ...才怪。',
                
                '<25>{#f/4}* 别跟我扯了，\n* 你得多不小心，\n  才能升到lv2呢？'
            ],

            jspeech6b2: [
                '<25>{#p/sans}* lv3...\n* 还行。',
                "<25>{#f/4}* 这个lv挺好的，不吓人。",
                "<25>{#f/0}* 所以，审判通过。",
                '<25>{#f/3}* 不过呢...',
                '<25>{#f/2}* 如果再加把劲，\n  说不定就能让lv更好看了。'
            ],

            jspeech6b3: [
                '<25>{#p/sans}* lv4...\n* 好吧。',
                '<25>{#f/4}* 这个lv... \n  让我说你点啥好呢？',
                "<25>{#f/0}* 要是再高一点，我就得怀疑\n  你不是过失杀人，\n  而是故意杀人了。",
                "<25>{#f/3}* 这次我会破个例，\n  让你通过审判。",
                '<25>{#f/2}* 下不为例。'
            ],

            jspeech6b4: [
                '<25>{#p/sans}{#f/4}* lv5？',
                "<25>{#f/0}* 从这个lv开始，\n  就再也不能说你\n  “人畜无害”了。",
                '<25>{#f/4}* 我真的很想相信你...',
                '<25>{#f/0}* 可你的lv越高，\n  我就越没底气。',
                '<25>{#f/3}* ...唉，走吧。'
            ],

            jspeech6b5: [
                '<25>{#p/sans}{#f/4}* lv6？',
                '<25>{#f/0}* 人们相互祝福，\n  不是总说“六六大顺”嘛。',
                "<25>{#f/4}* 我倒不迷信这些...",
                "<25>{#f/0}* 可现在这情况，\n  我真心希望能少点不顺。",
                '<25>{#f/3}* ...唉，走吧。'
            ],

            jspeech6b6: [
                '<25>{#p/sans}{#f/4}* 嗯，lv7？',
                '<25>* 古人说：“人有七窍。”',
'<25>{#f/0}* 如果说升一级，通一窍，\n  那你应该完全开窍了。',
                
                '<25>{#f/3}* 但我在想...\n  你能“开窍”，是不是因为\n  “开了别人的窍”？',
                '<25>{#f/0}* ...只是随口一说。'
            ],

            jspeech6b7: [
                '<25>{#p/sans}{#f/4}* 嗯，lv8？',
                "<25>* 猎人打猎回来，\n  会把猎物“大卸八块”。",
                
                "<25>{#f/3}* 这个词... 跟你很般配啊。",
                '<25>{#f/0}* ...只是随口一说。'
            ],

            jspeech6b8: [
                '<25>{#p/sans}{#f/3}* ...lv9。',
                "<25>{#f/0}* 这lv有点吓人了。",
                '<25>{#f/3}* 不过...',
                "<25>{#f/2}* 往好处想，\n  起码还只有一位数。\n* 干得挺不错。"
            ],

            jspeech6b9: [
                '<25>{#p/sans}{#f/3}* ...lv10。',
                "<25>{#f/0}* 这lv有点吓人了。",
                '<25>{#f/3}* 不过...',
                "<25>{#f/2}* 往好处想，\n  起码才刚破两位数。\n* 干得挺不错。"
            ],

            jspeech6b10: [
                '<25>{#p/sans}{#f/3}* ...lv11。',
                "<25>{#f/4}* 十加一，是土。\n* 怪物死后，化为尘土。",
                '<25>{#f/0}* 说实话，要是我能\n  让土变回怪物...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我会毫不犹豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一厢情愿罢了。"
            ],

            jspeech6b11: [
                '<25>{#p/sans}{#f/3}* ...lv12。',
                "<25>{#f/4}* 十加二，是王。\n* 在前方等待你的人，\n  就是国王。",
                '<25>{#f/0}* 说实话，要是我能\n  让王改变主意...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我会毫不犹豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一厢情愿罢了。"
            ],

            jspeech6b12: [
                '<25>{#p/sans}{#f/3}* ...lv13。',
                "<25>{#f/4}* 十三，是衫。\n* 我身上穿的，正是兜帽衫。",
                '<25>{#f/0}* 衫不在高，睡不在深...\n  要是我能劝得动你...',
                "<25>{*}{#p/darksans}{#f/1}{#i/5}* 我会毫不犹豫去做。",
                "<25>{#p/sans}{#f/3}* ...只是一厢情愿罢了。"
            ],

            jspeech6b13: [
                '<25>{#p/sans}{#f/3}* ...lv14。',
                "<25>{#f/4}* 我就不拐弯抹角了...",
                "<25>{#f/0}* 能在这么短的时间内\n  杀掉这么多怪物...\n  你也是个人才。",
                '<25>{*}{#p/darksans}{#f/1}{#i/5}* 再接再厉。',
                '<25>{#p/sans}{#f/3}* ...'
            ],

            
            jspeech6c: [
                '<25>{#p/sans}{#f/4}* 哎等等。\n* 你咋还这么无聊呢？',
                '<25>{#f/0}* 看来咱俩没啥好聊的了。\n* 谈话结束。'
            ],

            
            jspeech7: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* 等一下。',
                '<25>{#f/4}* 我刚刚说话时，\n  注意到你脸上的表情...',
                "<25>{#f/0}* 看样子，你早就听过\n  我这通长篇大论了。\n  是不是呀？",
                '<25>{#f/3}* 之前我就感觉挺奇怪。',
                "<25>{#f/3}* 从你的行为举止来看，\n  就感觉，你能未卜先知。",
                "<25>{#f/3}* 仿佛你“早就”做过\n  这些事一样。",
                '<25>{#f/0}* 所以呢...',
                "<25>{#f/0}* 交给你一件事。",
                '<25>{#f/2}* 我有个{@fill=#ff0}暗号{@fill=#fff}，\n  除了我，别人谁也不知道。',
                "<25>{#f/4}* 所以...",
                "<25>{#f/0}* 如果有人跟我说了那个暗号，\n  那我就知道，那人肯定\n  是一名时间旅者。",
                '<25>{#f/2}* 是不是脑洞很大？',
                '<25>{#f/3}* 总之，听好暗号...',
                '<32>{#p/human}* （衫斯悄悄对你说了\n  一串东西。）',
                "<25>{#p/sans}{#f/0}* 就等你回到过去，\n  把它告诉那个我了。",
                ...(funni ? ["<25>{#f/2}* 我会把你挪回柱子后面。"] : ['<25>{#f/2}* 那么，“回”见。'])
            ],

            
            jspeech8: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/4}* 咋了？\n* 有啥话想告诉我吗？',
                '<32>{#p/human}* （你把那串暗号告诉了衫斯。）',
                '<25>{#p/sans}{#f/2}* 啥？暗号？\n* 大点声说呗。',
                '<32>{#p/human}* （你把暗号大声说了出来。）',
                '<25>{#p/sans}{#f/0}* 你刚刚说的...',
                '<25>{#f/4}* ...是不是“反转中子电性”？',
                "<25>{#f/2}* 哇。\n* 真是难以置信，\n  这话你居然真说得出来。",
                '<25>{#f/4}* “反转中子电性”...\n  这话不仅是纯粹胡扯，\n  更是我自创的暗号。',
                
                '<25>{#f/0}* 看来... 你真是个时间旅者？',
                "<25>{#f/3}* 行吧，那么，考核通过。",
                "<25>{#f/0}* 这是我的房门钥匙，\n  给你。",
                '<32>{#s/equip}{#p/human}* （你把骨钥挂到了钥匙串上。）',
                "<25>{#p/sans}{#f/0}* 是时候...",
                ...(funni
                    ? ['<25>{#f/2}* 让你走出那根柱子了。']
                    : ['<25>{#f/2}* 让你知晓{@fill=#003cff}真相{@fill=#fff}了。'])
            ],

            
            jspeech9: (funni: boolean) => [
                '<25>{#p/sans}{#f/3}* ...',
                '<25>{#f/0}* 等一下。',
                '<25>{#f/4}* 我刚刚说话时，\n  注意到你脸上的表情...',
                "<25>{#f/0}* 看样子，你早就听过\n  我这通长篇大论了。\n  是不是呀？",
                '<25>{#f/3}* 之前我就感觉挺奇怪。',
                "<25>{#f/3}* 从你的行为举止来看，\n  就感觉，你能未卜先知。",
                "<25>{#f/3}* 仿佛你“早就”做过\n  这些事一样。",
                '<25>{#f/0}* 所以...',
                '<25>{#f/0}* ...等等。\n* 你之前是不是早就听过\n  这段了？',
                '<25>{#f/3}* 哇，看来是货真价实的\n  时间旅者。',
                "<25>{#f/2}* 那就不用长篇大论了。",
                '<32>{#s/equip}{#p/human}* （你把骨钥挂到了钥匙串上。）',
                ...(funni ? ['<25>{#p/sans}{#f/2}* ...只需要说一句\n  “该把你挪回去”就够了。'] : [])
            ],

            
            jspeech10a: ['<25>{#p/sans}{#f/0}* 回头。'],
            jspeech10b: [
                '<25>{#p/sans}* 所以，这就是终点了，\n  是吗？',
                '<25>* 就要用这种方式，\n  给你的旅程画上句号吗？',
                '<25>{#f/3}* ...',
                "<25>* 嘿。\n* 之前，我和艾斯戈尔聊了聊\n  你的所作所为。",
                "<25>{#f/0}* 虽然不知道艾斯戈尔会对你\n  做些什么...",
                "<25>{#f/0}* 但很可能，\n  事情不会如你所愿。",
                '<25>* 不过，迎接结局之前...\n  静下心来，好好想想。',
                "<25>* 一路走来，你做的那些事...",
                '<25>* 真的值得吗？'
            ],
            jspeech10c: [
                "<25>{#p/sans}{#f/3}* 我看不到你的表情。",
                "<25>{#f/0}* 更摸不透你的心思。",
                '<25>* ...',
                "<25>{#f/3}* 这样也好。",
                '<25>{#f/0}* 但我知道，\n  你能干出那些事...',
                '<25>* 肯定是出于“关心”，对吗？',
                "<25>{#f/3}* ...我无数次想否认、\n  推翻这个想法。",
                "<25>{#f/0}* 但是，如果我们真的\n  形同陌路...",
                "<25>* 你怎么可能做到这种地步？",
                '<25>* 你太“关心”我们了，\n  恨不得把我们都“关心”死了，\n  不是吗？'
            ],
            jspeech10d: [
                '<25>{#p/sans}{#f/3}* 我知道，\n  自己根本不擅长“动之以情”。',
                '<25>{#f/0}* 但请你告诉我，\n  我还能做什么呢？',
                '<25>* 既然你已经彻底踏上\n  这条不归路...',
                "<25>* 那威胁、恐吓都已经\n  无济于事了。",
                "<25>{#f/3}* 所以，我想试试另一种方式\n  劝你回头。",
                '<25>{#f/0}* ...',
                '<25>{#f/3}* 那么。\n* 如果你要一条道走到黑...',
                '<25>* 我不会拦你。',
                "<25>{#f/0}* 我知道，\n  你早已将“善”抛之脑后。",
                "<25>* 但如果，在机缘巧合之下，\n  你拥有了{@fill=#ff0}那种能力{@fill=#fff}...",
                '<25>* 那就试试看吧。',
                '<25>* 只此一次，终末之时...',
                '<25>{#f/3}* 做件善事。',
                '<25>* ...',
                '<25>{#f/3}* 嗯。',
                "<25>{#f/3}* 我说完了。"
            ],

            choice0: () => [
                ...(SAVE.data.n.state_foundry_undyne === 0 && !world.badder_lizard
                    ? [
                        '<25>{#p/alphys}{#g/alphysCutscene1}* 你终于到了！',
                        '<25>{#g/alphysCutscene2}* ...\n* 这就是“六号档案”。',
                        '<25>{#f/15}* 这装置建成之后，\n  那些人类就陆续进到了里面。',
                        '<25>{#f/15}* 装置内，时间流速\n  比现实慢得多...',
                        '<25>{#f/15}* 所以，他们看上去\n  就像时间被定格住一样...',
                        "<25>{#f/10}* ...是不是很酷啊？！",
                        "<25>{#f/1}* 罗曼博士居然能造出\n  这么棒的装置，真是厉害！",
                        "<25>{|}{#f/15}* 嗯... 我不知道\n  他追不追科幻番，\n  但我知道有部科幻动漫电影 {%}",
                        '<99>{|}{#f/15}  为了看这部电影你需要佩戴\n  最新最酷炫的虚拟现实眼镜\n  也就是VR眼镜才可以但是呢 {%}',
                        '<99>{|}{#f/23}  如果你戴了VR眼镜的话就会\n  被困在一个虚拟电影时空中\n  不止是你其他人也会被困住 {%}',
                        '<99>{|}{#f/23}  所以人们需要想办法来逐步\n  推动故事剧情发展这样才能\n  最终找到办法彻底逃出这里 {%}',
                        '<99>{|}{#f/18}  最终经过不懈努力我们主角\n  终于找到了逃出这里的方法\n  之后主角成功脱困之后又帮 {%}',
                        '<99>{|}{#f/18}  所有人成功脱困！！！',
                        '<25>{#f/18}* ...',
                        '<25>{#f/20}* 呃，所以我觉得罗曼博士\n  应该是受到了它的启发。',
                        "<25>{#f/18}* 不-不说这个！！\n* 艾斯戈尔正在力场那里\n  等你呢！"
                    ]
                    : [
                        '<25>{#p/alphys}{#g/alphysCutscene1}* 你终于到了！',
                        '<25>{#g/alphysCutscene2}* ...',
                        "<25>{#g/alphysSmileSweat}* 对-对了，\n  艾斯戈尔正在力场那里\n  等你呢。"
                    ]),
                '<25>{#g/alphysNeutralSweat}* 你... 你应该也想去找他。',
                "<25>{#g/alphysOhGodNo}* 但是，\n  如果你不是想找他的！！\n* 那...",
                "<25>{#g/alphysTheFactIs}* 那我也不知道...\n  你为什么来这了。",
                "<26>{#g/alphysCutscene2}* 好吧。\n* 我全说完了，真说完了。"
            ],
            choice0x: ["<25>{#p/alphys}{#g/alphysCutscene2}* 呃，\n  我先在这忙我的事。"],
            choice0y: ['<25>{#p/alphys}{#g/alphysInquisitive}* 还有点犹豫，是吗...？'],
            choice1: [
                '<26>{#p/asgore}{#f/1}* 这就是力场。',
                '<25>{#f/2}* 这道力场将我们囚禁于此。',
                '<25>{#f/1}* 这东西没有意识，\n  没有感情...',
                '<25>{#f/2}* 只要进来了，\n  谁都出不去。'
            ],
            choice1a: () => [
                '<25>{#p/asgore}{#f/1}* 这么多年，怪物们都没有机会\n  再次看到星辰。\n* 我只能扼腕叹息。',
                '<25>* 与此同时，我也十分害怕\n  某一天，人类到来，\n  将我们一举消灭。',
                ...(world.bad_robot || world.trueKills > 29
                    ? [
                        '<25>{#f/1}* ...',
                        '<25>{#f/2}* 今天... 噩梦成真了。',
                        '<25>{#f/3}* 艾菲斯把你的... 暴行\n  都告诉了我。',
                        ...(world.alphys_percieved_kills < 20
                            ? ['<25>{#f/2}* 不过，她也和我说，\n  你放过了不少怪物。']
                            : [
                                '<25>{#f/16}* ...\n* 孩子，回答我。',
                                '<25>{#f/12}* 你这么做，是为了保护自己，\n  还是为了报复？',
                                '<25>{#f/12}* 还是，你一开始就计划好\n  把怪物们全杀了？'
                            ]),
                        '<25>{#f/5}* ...',
                        '<26>{#f/16}* 总之，你让我进退两难。',
                        '<25>{#f/15}* 我是该相信你，\n  让你拯救我们...',
                        '<25>{#f/16}* 还是亲手把你的灵魂扯出来，\n  然后自己进入“档案”。',
                        '<25>{#f/3}* ...',
                        ...(world.alphys_percieved_kills < 20
                            ? [
                                '<25>{#f/3}* 尽管你做了很多错事，\n  我也不想伤害你。',
                                '<25>{#f/4}* 你有能力把我们折磨得更惨，\n  但是...',
                                '<25>{#f/2}* ...你并没有那么做。',
                                '<25>{#f/1}* 所以，你绝不是无可救药的，\n  孩子。',
                                '<25>{#f/2}* 你只是见到怪物们，\n  非常害怕，慌不择路了。'
                            ]
                            : ['<25>{#f/3}* 我无法言说\n  自己现在到底有多难受。'])
                    ]
                    : (world.bad_lizard > 0 && world.alphys_percieved_kills > 0) || 2 <= world.alphys_percieved_kills
                        ? [
                            '<25>{#f/1}* ...',
                            '<25>{#f/1}* 总体来看，你还是挺善良的。',
                            ...(world.bad_lizard > 0
                                ? ["<25>{#f/2}* 艾菲斯和我说，\n  你... 杀了人。"]
                                : ['<25>{#f/2}* 艾菲斯和我说，\n  你好像... 杀了人。']),
                            '<25>{#f/3}* ...',
                            ...(SAVE.data.b.ultrashortcut
                                ? [
                                    '<25>{#f/3}* 幸好，你被帕派瑞斯抓住，\n  直接到了这里。',
                                    '<25>{#f/2}* 你肯定发现了，\n  前哨站并不安全。',
                                    '<25>{#f/5}* 别担心，这里相对安全，\n  我们会保护你的。'
                                ]
                                : [
                                    '<25>{#f/3}* 事情弄成这样，都怪我。',
                                    '<25>{#f/2}* 艾菲斯博士第一次护送人类，\n  就因为我死守秘密...',
                                    "<25>{#f/5}* 把她的工作弄得那么困难。"
                                ]),
                            '<25>{#f/15}* ...',
                            '<25>{#f/16}* “六号档案”就在你的身后。',
                            '<26>{#f/1}* 那些人类...\n  虽然只是孩子，\n  但最后都自愿进入了“档案”。',
                            '<25>* 所以...\n  下一个进入的人类就是你了。'
                        ]
                        : [
                            '<25>{#f/1}* 之后，孩子们一个接一个\n  来到了这里。',
                            '<25>* 他们初来乍到时，\n  都十分害怕，经历许多艰险\n  才到达终点。',
                            '<26>{#f/6}* 但无一例外，他们都把\n  自己最优秀的品质\n  尽数展现出来。',
                            '<25>* 一个孩子很有耐心，\n  一个孩子充满勇气。',
                            '<25>* 一个孩子很守信用，\n  一个孩子能屈能伸。',
                            '<25>{#f/2}* 一个孩子心中充满善意...',
                            '<25>{#f/4}* 还有一个，敢于伸张正义。',
                            '<25>{#f/1}* 当我问他们，\n  “你想和我们待在一起，\n   还是进入‘档案’？”',
                            '<25>* 他们都选择了后者。',
                            ...(SAVE.data.b.ultrashortcut
                                ? [
                                    '<25>{#f/5}* 所以，无论你经历了什么...',
                                    '<25>{#f/1}* 希望你也愿意进入“档案”。'
                                ]
                                : ['<25>* 所以...\n  下一个进入的人类就是你了。'])
                        ])
            ],
            choice1b: () =>
                world.bad_robot || world.trueKills > 29
                    ? [
                        '<25>{#p/asgore}{#f/1}* 经过考虑，\n  我不允许你进入“档案”。',
                        '<25>{#f/2}* 指望你担下如此大任，\n  就是痴人说梦。',
                        '<25>{#f/5}* ...',
                        '<25>{#f/5}* 现在跟我回家。',
                        '<25>{#f/5}* 之后再决定如何处置你。'
                    ]
                    : [
                        [
                            '<25>{#p/asgore}{#f/6}* 最晚进入档案的人类，\n  将会作为“容器”。',
                            "<25>* 从其他的人类灵魂中\n  “借”来能量，为己所用。",
                            '<26>* 凝聚你和他们的力量，\n  就可以打破力场。',
                            '<25>* 之后...',
                            '<25>* 怪物一族就能寻找新家园了。',
                            '<25>{#f/1}* 不过...',
                            '<25>* 如果你还没准备好\n  扛下如此重任...',
                            '<25>* 你可以先和我们待在一起，\n  做好准备了，再进入档案。',
                            '<25>{#f/6}* 无论如何，\n  我都会尊重你的选择。',
                            '<25>{#f/1}* ...',
                            '<25>* 那么，你愿意\n  现在进入“档案”吗？',
                            choicer.create('* （你要怎么回答？）', '进入', '再等等')
                        ],
                        [
                            '<26>{#p/asgore}{#f/6}* 你回来了。',
                            '<25>{#f/1}* ...',
                            '<25>* 那么，你愿意\n  现在进入“档案”吗？',
                            choicer.create('* （你要怎么回答？）', '进入', '再等等')
                        ],
                        [
                            '<25>{#p/asgore}{#f/1}* ...',
                            '<25>* 那么，你愿意\n  现在进入“档案”吗？',
                            choicer.create('* （你要怎么回答？）', '进入', '再等等')
                        ]
                    ][Math.min(SAVE.data.n.state_citadel_refuse, 2)],
            choice2a: [
                '<25>{#p/asgore}{#f/4}* ...',
                '<25>{#f/6}* 跟我来，孩子。',
                '<25>{#f/21}* 有不少事情等着咱们呢。'
            ],
            choice2b: () =>
                [
                    [
                        '<25>{#p/asgore}{#f/2}* ...我理解。',
                        '<25>{#f/1}* 也许我不该看别的孩子\n  马上进入“档案”，\n  就也催你跟着进。',
                        SAVE.data.b.ultrashortcut
                            ? '<25>{#f/5}* 这么短时间，\n  我还没争取到你的信任。'
                            : '<25>{#f/5}* 也许，你还没准备好，\n  也不信任我。',
                        '<25>{#f/1}* 如果改变主意，\n  随时欢迎回来...',
                        '<25>{#f/2}* 如果你不想这么做，\n  我不会强迫你。'
                    ],
                    ['<25>{#p/asgore}{#f/2}* ...我理解。']
                ][Math.min(SAVE.data.n.state_citadel_refuse++, 1)],
            choice3a: ['<25>{#p/asgore}{#f/6}* 开始吧。'],
            choice4a: ['<25>{#p/asgore}{#f/5}* 艾菲斯？'],
            choice4b: [
                '<25>{#p/alphys}{#g/alphysOhGodNo}* 啊，知-知道了！\n* 对不起！',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 稍等一下，\n  我先做好准备工作...'
            ],
            choice5: ['<25>{#p/alphys}{#g/alphysCutscene2}* 搞定。\n* 各项参数应该设定好了。'],
            choice6a: ["<25>{#p/alphys}{#g/alphysWelp}* 好，那人类已经成功\n  连上装置。"],
            choice6b: [
                "<25>{#p/asgore}{#f/6}* 别紧张，孩子。",
                '<25>{#p/asgore}{#f/7}* 在“档案”建造之初...',
                '<25>{#p/asgore}{#f/6}* 我们为人类提供了\n  最舒适的生活环境。',
                '<25>{#p/asgore}{#f/21}* 在里面，地球上所有美景\n  都能尽收眼底。',
                '<25>{#p/asgore}{#f/6}* 你能看到郁郁葱葱的森林，\n  绵延起伏的山丘，\n  还有潺潺流淌的小溪。',
                '<25>{#p/asgore}{#f/4}* ...年轻人，\n  怪物的命运都指望你了。',
                '<25>{#p/asgore}{#f/6}* 进入“档案”后，\n  务必注意安全，\n  也不要逗留太久。'
            ],
            choice7: [
                "<32>{#p/basic}* 我还在这里的，搭档...",
                "<32>* ...不过，那里是潜意识的时空，",
                '<33>* 我进不去。',
                "<32>* 无论发生什么，\n  你一定会做正确的事。",
                '<32>* ...',
                '<32>* 注意安全，好吗？'
            ],
            choice8: [
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#p/asgore}{#f/2}* 你来了。',
                '<32>{#p/human}* （...）',
                '<25>{#p/asgore}{#f/1}* ...\n* 我其实有很多事想问你。',
                '<25>{#f/2}* 或许，\n  你已经不想和我废话。',
                '<25>{#f/4}* 尽管如此...',
                '<25>{|}{#f/7}* 我还是相信- {%}'
            ],
            
            clover1: ["<32>{#p/human}{#v/6}{@fill=#faff29}* ...是不是挺美的？"],
            clover2: [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* ...\n* 不过，这话换他来说，\n  估计更合适。",
                '<32>{@fill=#faff29}* 曾经，这样的美景\n  稀松平常，随处可见...',
                '<32>{@fill=#faff29}* ...但我一来，\n  把一切都毁了。',
                '<32>{@fill=#faff29}* 我的体内有仿生植入体，\n  使用它，就可以夺取\n  系统的最高权限。',
                '<32>{@fill=#faff29}* 有了最高权限，\n  我们想要啥，就有啥...\n* 肆意滥用权限，最终付出了代价。',
                "<32>{@fill=#faff29}* 你取得的“灵势”告诉我，\n  你已经去过我们创造的\n  所有子世界...",
                "<32>{@fill=#faff29}* 那末日般的景象，\n  想必你已经见过了。",
                '<32>{@fill=#faff29}* “灵势”...\n* 当然也是个缩写，\n  全称叫“灵魂势能”。',
                "<32>{@fill=#faff29}* 我们的灵魂，\n  就是靠它联结在一起。",
                "<32>{@fill=#faff29}* 而有了它，\n  你就能一举打碎力场。"
            ],
            clover3: [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* 这里是潜意识时空，\n  人的意识触及不到这里。",
                '<32>{@fill=#faff29}* 所以，我不知道\n  自己醒来后，是否还会记得\n  这里发生的一切，',
                '<32>{@fill=#faff29}* 但没关系。\n  即使我们的噩梦终将画上句号...\n  即使我们终将遗忘一切...',
                '<32>{@fill=#faff29}* 也一定有人会记得这些。'
            ],
            clover4: () => [
                "<32>{#p/human}{#v/6}{@fill=#faff29}* ...\n* 你该走了。",
                '<32>{@fill=#faff29}* 离开这里的终端\n  就在主干道的尽头。',
                ...(SAVE.data.b.oops
                    ? ['<32>{@fill=#faff29}* ...多多保重...', '<32>{@fill=#faff29}* 好吗？']
                    : [
                        '<32>{@fill=#faff29}* ...走之前，我有个问题...',
                        "<32>{@fill=#faff29}* 你的名字，\n  是叫弗里斯克吗？",
                        "<32>{@fill=#faff29}* 抱歉。\n* 只是你一言不发，我有点好奇\n  你在想些什么。",
                        "<32>{@fill=#faff29}* ...\n* 弗里斯克，你是个好人。",
                        '<32>{@fill=#faff29}* 而且...',
                        "<32>{@fill=#faff29}* 那个人，一直在幕后，\n  为你出谋划策的人...\n* 也是个好人。",
                        '<32>{@fill=#faff29}* ...',
                        "<32>{@fill=#faff29}* 这一切，我跟弗里斯克或许都会忘记。\n* 但你不会。",
                        "<32>{@fill=#faff29}* 如果此刻，\n  你正在某处看着我们...",
                        "<32>{@fill=#faff29}* ...请不要忘记\n  我们的经历，我们的故事。\n* 请不要忘记这里发生的一切。",
                        "<32>{@fill=#faff29}* 不管这世界是真是假。\n* 这里的记忆，\n  都是最珍贵的东西。"
                    ])
            ],

            smasher1: (haha: boolean) => [
                "<25>{#p/alphys}{#g/alphysWelp}* 我去力场那等你。",
                ...(haha
                    ? [
                        '<25>{#p/alphys}{#g/alphysFR}* ...哦对了，趁你“睡觉”的时候。\n  我把喵喵玩偶拿回来了！',
                        "<25>{#p/alphys}{#g/alphysHellYeah}* 还想占我便宜？\n  让人笑掉大牙了都。"
                    ]
                    : !SAVE.data.b.failshow && SAVE.data.b.item_tvm_mewmew && !SAVE.data.b.mewget
                        ? ((SAVE.data.b.mewget = true),
                            [
                                '<25>{#p/alphys}{#g/alphysFR}* ...哦对了，\n  你把我的喵喵玩偶送人，\n  现在我拿回来了。',
                                "<25>{#p/alphys}{#g/alphysHellYeah}* 还想占我便宜？\n  让人笑掉大牙了都。"
                            ])
                        : [])
            ],
            smasher2: ['<25>{*}{#p/alphys}{#g/alphysSmileSweat}* 准备好了吗？{^40}{%}'],

            bad1: () =>
                [
                    world.bad_robot || world.trueKills > 29
                        ? world.alphys_percieved_kills < 20
                            ? [
                                '<25>{*}{#p/twinkly}{#f/8}* 是不是拿不定主意呀，\n  亲爱的艾斯戈尔？',
                                '<25>{*}{#f/5}* 我理解。\n* 谁都有犹豫不决的时候。',
                                "<25>{*}{#f/11}* 但没关系！",
                                "<25>{*}{#f/7}* 你再也不用操心啦！",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...干...什么...',
                                '<25>{*}{#p/twinkly}{#f/8}* 哎呀，我什么都没干呀，\n  艾斯戈尔...'
                            ]
                            : [
                                '<25>{*}{#p/twinkly}{#f/5}* 哎呀呀，艾斯戈尔...',
                                "<25>{*}{#f/11}* 你本可以直接把人杀了，\n  那就皆大欢喜。",
                                "<25>{*}{#f/7}* 但现在，你再也没机会咯。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...干...什么...',
                                "<25>{*}{#p/twinkly}{#f/5}* 杀人，可没你想得\n  那么伤天害理哦，艾斯戈尔...",
                                '<25>{*}{#f/9}* 就让我好好教你\n  怎么才能杀得又嗨又爽吧！'
                            ]
                        : SAVE.data.b.ultrashortcut
                            ? [
                                '<25>{*}{#p/twinkly}{#f/5}* 哎呀，哎呀...',
                                "<26>{*}{#f/11}* 跑太快，把脑子都跑丢了。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...干...什么...',
                                "<25>{*}{#p/twinkly}{#f/5}* 想靠那点小把戏蒙混过关？",
                                "<25>{*}{#f/7}* 真当我眼瞎呢。"
                            ]
                            : [
                                '<25>{*}{#p/twinkly}{#f/5}* 哈喽，艾斯戈尔！',
                                "<26>{*}{#f/11}* 别这么急着拯救怪物嘛，\n  好玩的事多着呢。",
                                '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                                '<25>{*}* ...干...什么...',
                                '<25>{*}{#p/twinkly}{#f/5}* 我知道\n  这一下把你吓得不轻，\n  但别气馁哦！',
                                "<25>{*}{#f/7}* 你看，这多好玩啊。\n  是不是呀，艾斯戈尔？"
                            ],
                    [
                        "<25>{*}{#p/twinkly}{#f/7}* 哎呀呀，真可怜呢，\n  我的小$(name)。\n* 真以为我好忽悠？",
                        SAVE.data.b.ultrashortcut
                            ? '<25>{*}{#f/8}* 你怎么总想着走捷径呢...'
                            : '<25>{*}{#f/8}* 你咋这么自以为是呢...',
                        '<25>{*}{#f/5}* 你那点小聪明，休想得逞。',
                        '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                        '<25>{*}* ...干...什么...',
                        "<25>{*}{#p/twinkly}{#f/5}* 从现在起，我才是爹。",
                        '<25>{*}{#f/7}* 而你？\n  就是个任我摆布的傀儡！'
                    ],
                    [
                        '<25>{*}{#p/twinkly}{#f/11}* $(name)，别挣扎了...',
                        '<25>{*}{#f/5}* 你逃不出我的手掌心！',
                        SAVE.data.b.ultrashortcut
                            ? "<25>{*}{#f/7}* 你就算长了飞毛腿，\n  我也比你快！"
                            : "<25>{*}{#f/7}* 你就算求爷爷告奶奶，\n  我也不会放过你。",
                        '<25>{*}{#p/asgore}{#g/asgoreBound}* ...你在...',
                        '<25>{*}* ...干...什么...',
                        "<25>{*}{#p/twinkly}{#f/5}* 嘘... 别怕。",
                        '<25>{*}{#f/5}* 只是我的好朋友\n  $(name)不听话，\n  我正修理它呢。'
                    ]
                ][Math.min(SAVE.flag.n.neutral_twinkly_loop1++, 2)],
            bad2: [
                "<25>{*}{#g/twinklyNice}* ...哎呀，忘了自我介绍了。\n  我叫闪闪。{^30}{%}",
                '<25>{*}{#g/twinklySassy}* 闪亮明星：闪闪。{^30}{%}'
            ],
            bad3: ['<25>{*}{#p/asgore}{#g/asgoreBreak1}* 啊啊啊啊...！{^999}'],
            bad4: [
                "<25>{*}{#p/twinkly}{#g/twinklyWink}* 哎呦~ 你痛苦的尖叫\n  真是天籁之音啊，\n  太好听啦！{^30}{%}",
                '<25>{*}{#p/asgore}{#g/asgoreBreak1}* ...{^10}{%}'
            ],
            bad5: ["<25>{*}{#p/twinkly}{#f/7}* 让我们再欣赏一次。{^20}{%}"],
            bad6: ['<25>{*}{#p/asgore}{#g/asgoreBreak2}* 啊啊啊啊啊啊...！{^999}'],
            bad7: ['<25>{*}{#p/twinkly}{#f/11}* 给我叫！{^5}{%}'],
            bad8: ['<25>{*}{#p/twinkly}{#g/twinklyEvil}{#v/1}* 使劲叫！！！{^5}{%}'],
            bad9: ['<25>{*}{#p/twinkly}{#g/twinklyGrin}{#v/1}* 叫啊！！！{^5}{%}'],
            bad10: ['<25>{*}{#p/twinkly}{#g/twinklyTwisted}{#v/1}* 叫啊！！！{^5}{%}'],
            bad11: [
                '<25>{*}{#p/twinkly}{#g/twinklyCrazed}{#v/1}* 叫啊叫啊叫啊叫啊叫啊叫啊\n  叫啊叫啊叫啊叫啊叫啊叫啊\n  叫啊叫啊叫啊叫啊叫啊叫啊 {%}',
                '<99>{*}{#p/twinkly}{#g/twinklyBroken}{#v/1}* 啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈\n  哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈\n  哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈{^20}{%}'
            ],
            bad12: ['<25>{*}{#p/twinkly}{#g/twinklyDead}{#v/0}* ...{^80}{%}', '<25>{*}* ...死吧。{^10}{%}'],
            bad13: () => [
                ...[
                    [
                        '<99>{#p/twinkly}{#v/1}哈喽，$(name)。{^100}{%}',
                        '<99>{#p/twinkly}{#v/1}欢迎来到新时空。{^100}{%}'
                    ],
                    [
                        '<99>{#p/twinkly}{#v/1}$(name)，欢迎回来。{^100}{%}',
                        "<99>{#p/twinkly}{#v/1}好开心哦，又见到你了。{^100}{%}"
                    ],
                    [
                        '<99>{#p/twinkly}{#v/1}哎呦，$(name)...{^100}{%}',
                        '{#p/twinkly}{#v/1}你胆可真肥，竟敢抛弃我。{^100}{%}'
                    ]
                ][Math.min(SAVE.flag.n.neutral_twinkly_loop2, 2)],
                '<99>{#p/twinkly}{#v/1}嘻嘻嘻...{^100}{%}',
                '<99>{#p/twinkly}{#v/1}是不是... 很孤独呀？{^100}{%}',
                '<99>{#p/twinkly}{#v/1}是不是... 很想逃呀？{^100}{%}',
                "<99>{#p/twinkly}{#v/1}...想逃？没门！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}艾斯戈尔把那“档案”当宝一样宠着...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}那就让你也好好享受享受它吧！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}你只能往前...{^100}{%}',
                '<99>{#p/twinkly}{#v/1}再过来点，再过来点...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}...你不怕我吗？{^100}{%}",
                "<99>{#p/twinkly}{#v/1}还不逃？{^100}{%}",
                '<99>{#p/twinkly}{#v/1}好。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}太好了。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}真不愧是我的好伙伴。{^100}{%}',
                '<99>{#p/twinkly}{#v/1}...{^100}{%}',
                "<99>{#p/twinkly}{#v/1}快了...！{^100}{%}",
                '<99>{#p/twinkly}{#v/1}$(name)，马上就到了...{^100}{%}'
            ],
            bad14: [
                '<99>{#p/human}{#v/1}{@fill=#42fcff}漫长的噩梦已然消散。{^80}{%}',
                '<99>{#p/human}{#v/2}{@fill=#ff993d}熟悉的世界再度出现！{^80}{%}',
                '<99>{#p/human}{#v/3}{@fill=#003cff}重要的抉择摆在眼前。{^80}{%}',
                '<99>{#p/human}{#v/4}{@fill=#d535d9}眼前巨物，毁于一旦？{^80}{%}',
                '<99>{#p/human}{#v/5}{@fill=#00c000}心中仁慈，尽数展现？{^80}{%}',
                '<99>{#p/human}{#v/6}{@fill=#faff29}战或至善，由你决断。{^80}{%}'
            ],
            bad15: [
                [
                    '<99>{*}{#p/twinkly}...',
                    '<99>{*}...你在做什么？',
                    "<99>{*}你以为我会...",
                    '<99>{*}...学到教训吗？',
                    '<99>{*}想得美。'
                ],
                ["<99>{*}{#p/twinkly}你要是现在不动手...", "{*}终有一天，我会回来。"],
                ["<99>{*}{#p/twinkly}我会把你干掉。"],
                ["<99>{*}{#p/twinkly}我会摧毁一切。"],
                ["<99>{*}{#p/twinkly}我会将你的存在彻底抹去！"],
                ['<99>{*}{#p/twinkly}...'],
                ['<99>{*}{#p/twinkly}...？'],
                ['<99>{*}{#p/twinkly}...为什么？'],
                ['<99>{*}{#p/twinkly}...为什么...', '{*}{#p/twinkly}...要对我这么好？'],
                ["<99>{*}{#p/twinkly}...我不明白..."],
                ["<99>{*}{#p/twinkly}我不明白！"]
            ],
            bad16a: ["<99>{*}{#p/twinkly}{#i/8}...我就是...不明白...{^30}{%}"],
            bad16b: ['<99>{*}{#p/twinkly}{#i/3}再见，$(name)。{^30}{%}'],
            bad17: [
                
                '<32>{*}{#p/event}{#i/5}闪闪逃走了。'
            ],
            sad0: () =>
                world.runaway ? ['<25>{#p/asriel1}{#f/30}* 我投降！'] : ["<25>{#p/asriel1}{#f/25}* 对不起。"],
            sad1: () => [
                ...(world.runaway
                    ? ['<25>{#p/asriel1}{#f/23}* 看样子，$(name)，\n  你又赢了。']
                    : [
                        "<25>{#p/asriel1}{#f/23}* $(name)，\n  我一直都是个爱哭鬼，是吧？",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 艾斯利尔...'])
                    ]),
                '<25>{#p/asriel1}{#f/22}* ...',
                '<25>{#f/21}* ...我知道的。',
                "<25>{#f/23}* 你并不是$(name)，\n  对吧？",
                "<25>{#f/22}* 很久以前，\n  $(name)就死了。",
                '<25>{#f/15}* ...',
                '<25>{#f/15}* 嗯... 那个...',
                '<25>{#f/10}* 你叫什么名字呢？'
            ],
            sad2: () => [
                '<32>{#p/human}* （...）\n* （你把你的名字告诉了艾斯利尔。）',
                ...(world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* 是叫弗里斯克吗？',
                        '<25>{#f/23}* 嗯，这次你又赢了，\n  弗里斯克。',
                        '<25>{#f/22}* ...',
                        "<25>{#f/13}* 很奇怪...",
                        "<25>{#f/16}* 当星星时，我都忘了...\n  恐惧是什么滋味了。",
                        "<25>{#f/15}* 无数次将别人推入恐惧深渊，\n  已经麻木了。",
                        "<25>{#f/13}* 但现在，\n  我有了所有怪物的灵魂后...",
                        '<25>{#f/15}* ...我...',
                        "<25>{#f/16}* 我终于深切感受到那种情感。",
                        "<25>{#f/15}* 当你开始不停攻击我时...",
                        '<25>{#f/15}* 他们，好像就知道了\n  你是怎样的人。',
                        '<25>{#f/13}* 诚然，你从没杀过\n  任何一只怪物。',
                        '<25>{#f/13}* 但你也一次次将他们\n  推向生死边缘...',
                        '<25>{#f/15}* 一次，又一次，又一次...',
                        '<25>{#f/16}* ...',
                        "<25>{#f/21}* 弗里斯克，\n  他们现在都很怕你。",
                        '<26>{#f/23}* 而且...\n  我也很怕你。',
                        '<25>{#f/22}* ...'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/17}* 是叫弗里斯克吗？',
                        "<25>{#f/17}* 那...",
                        '<25>{#f/23}* ...真是个好名字。',
                        '<25>{#f/22}* ...',
                        '<25>{#f/13}* 弗里斯克...',
                        ...(SAVE.flag.n.killed_sans > 0
                            ? [
                                '<25>{#p/asriel1}{#f/13}* 一想到咱们之前\n  干的那些破事，我...',
                                '<25>{#f/15}* ...',
                                "<25>{#f/16}* 把你拖下水，让你干那些事，\n  真的对不起。",
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...等等，他在说什么...']),
                                ...(SAVE.flag.n.genocide_milestone > 0
                                    ? [
                                        [
                                            '<25>{#p/asriel1}{#f/21}* 衫斯，帕派瑞斯...\n* 还有犬卫队的狗狗们...',
                                            '<25>{#p/asriel1}{#f/21}* 衫斯，帕派瑞斯，\n  怪物小孩，安黛因...\n* 甚至还有皇家守卫...',
                                            '<25>{#p/asriel1}{#f/21}* 衫斯，帕派瑞斯，\n  怪物小孩，安黛因...\n* 还有镁塔顿...',
                                            '<25>{#p/asriel1}{#f/21}* 衫斯，帕派瑞斯，\n  怪物小孩，安黛因...\n* 还有镁塔顿和安黛因...'
                                        ][Math.ceil((SAVE.flag.n.genocide_milestone - 1) / 2)],
                                        "<25>{#f/21}* 这些人，\n  你愿意拼尽全力保护他们，\n  而我却..."
                                    ]
                                    : [
                                        "<25>{#p/asriel1}{#f/21}* 虽然我知道，\n  我们造成的伤害并不算多...",
                                        '<25>{#f/15}* ...但是...',
                                        '<25>{#f/21}* 为了一己私欲，\n  强迫你做那些事，\n  也都是我的错。',
                                        "<25>{#f/21}* 更何况，\n  你愿意拼尽全力保护他们，\n  而我却..."
                                    ]),
                                ...(SAVE.data.b.oops
                                    ? []
                                    : ['<32>{#p/basic}* 他说的... \n  是那条“屠杀时间线”吗？\n* 之前他提过一嘴。']),
                                "<25>{#p/asriel1}{#f/23}* 所以...\n  别自责，好吗？",
                                "<25>{#f/22}* 不仅是因为，你重置了，\n  抹去了过去的暴行...",
                                '<25>{#f/17}* 更因为，你能直面危险，\n  拯救朋友。',
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 太对了。']),
                                "<25>{#p/asriel1}{#f/13}* 而且...",
                                '<25>{#f/13}* 我仔细想了想\n  那条时间线，总感觉...',
                                '<25>{#f/15}* 你那时虽然手上在屠杀，\n  但心里，并不喜欢那样。',
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 那肯定的。']),
                                '<25>{#p/asriel1}{#f/23}* 说实话，我反而觉得...',
                                '<25>{#f/22}* 你很抗拒杀戮。',
                                ...(SAVE.data.b.oops
                                    ? []
                                    : ["<32>{#p/basic}* 对啊，弗里斯克根本就不是\n  冷血的家伙。"]),
                                '<25>{#p/asriel1}{#f/15}* 所以我明白...',
                                '<25>{#f/15}* 尽管做了错事...\n  尽管受我指使...\n  尽管发生了那些事...',
                                "<25>{#f/16}* 你仍比我优秀。",
                                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 哼。']),
                                "<25>{#p/asriel1}{#f/21}* ...\n* 这话说得有点早了。"
                            ]
                            : [
                                "<25>{#f/13}* 我很久都没有\n  这样的感觉了。",
                                '<25>{#f/16}* 作为星星时，\n  我... 无法感受任何情绪。',
                                '<25>{#f/15}* 我缺少爱人的能力。',
                                "<25>{#f/13}* 然而，当我拥有所有\n  人的灵魂时...",
                                '<25>{#f/13}* 我不仅再次找回了\n  我的同情心...',
                                "<25>{#f/23}* 而且同样能感受\n  其他怪物的情绪。",
                                '<25>{#f/17}* 他们彼此互相关心。',
                                ...(30 <= SAVE.data.n.bully
                                    ? [
                                        '<25>{#f/23}* 还有... 呃...\n* 对于你，他们...',
                                        '<25>{#f/22}* ...',
                                        ...(20 <= world.flirt
                                            ? [
                                                '<25>{#f/15}* ...嗯，\n  他们似乎有点矛盾...',
                                                "<25>{#f/10}* 就感觉... 他们挺喜欢你...\n  但又有点怕你。"
                                            ]
                                            : [
                                                "<25>{#f/15}* 唔...\n  挺多怪物不咋喜欢你...",
                                                ...(SAVE.data.b.undyne_respecc
                                                    ? [
                                                        '<25>{#f/10}* 除了安黛因。\n* 她喜欢你，喜欢得不得了，\n  我也不知道为啥。'
                                                    ]
                                                    : ["<25>{#f/10}* 但是，\n  我也不知道为啥。"])
                                            ]),
                                        '<25>{#f/23}* ...怪事。',
                                        '<25>{#f/22}* ...'
                                    ]
                                    : [
                                        '<25>{#f/23}* 而且...\n  他们也关心你，\n  弗里斯克。',
                                        '<25>{#f/22}* ...',
                                        ...(20 <= world.flirt
                                            ? [
                                                '<25>{#f/15}* ...哇，他们...\n  他们真的好关心你...',
                                                '<25>{#f/15}* 呃...\n* 弗里斯克，这...',
                                                '<25>{#f/17}* ...好家伙...',
                                                "<25>{#f/20}* 我，呃，还是暂时先\n  不告诉你\n  他们现在的感觉了吧。"
                                            ]
                                            : [
                                                '<25>{#p/asriel1}{#f/13}* 我只希望我能告诉你\n  大家对你的感觉。',
                                                '<25>{#f/17}* 托丽尔... 艾斯戈尔...\n* 衫斯... 帕派瑞斯...\n* 安黛因... 艾菲斯...',
                                                ...(!SAVE.data.b.f_state_kidd_betray
                                                    ? ['<25>{#f/15}* ...怪物小孩？\n* 那孩子是叫这名吗？']
                                                    : world.happy_ghost && SAVE.data.b.a_state_hapstablook
                                                        ? ['<25>{#f/23}* ...纳普斯特，\n  还有幽灵表亲。']
                                                        : SAVE.data.n.state_starton_nicecream > 0
                                                            ? ['<25>{#f/23}* ...甚至冰意灵小哥。']
                                                            : ['<25>{#f/23}* ...甚至在核心工作\n  的小老鼠。']),
                                                '<25>{#f/17}* 怪物是很奇怪的。',
                                                '<25>{#f/15}* 即使他们几乎\n  不咋了解你...',
                                                '<25>{#f/17}* 但这并不妨碍，\n  他们真的爱你。',
                                                '<25>{#f/23}* 哈哈。',
                                                '<25>{#f/22}* ...'
                                            ])
                                    ])
                            ])
                    ])
            ],
            sad3: () =>
                world.runaway
                    ? [
                        "<26>{#p/asriel1}{#f/13}* 不过，我...\n* 我知道我犯了更\n  严重的错误。",
                        "<25>{#f/16}* 我知道...\n  这里发生的事不应该\n  都归咎于你。",
                        ...(SAVE.flag.n.killed_sans > 0
                            ? [
                                '<25>{#f/15}* ...',
                                '<25>{#f/15}* 是我把你拖下水，\n  是我，逼你加入那个\n  “毁灭前哨站”的扯淡计划...',
                                '<25>{#f/16}* 好能骗过自己，\n  把你当成那个死去的伙伴...'
                            ]
                            : [
                                '<25>{#f/15}* ...',
                                '<25>{#f/15}* 将自己变成...\n  那样的存在...',
                                '<25>{#f/16}* 就只是想在由我\n  创造的噩梦中\n  折磨你...'
                            ]),
                        "<25>{#f/13}* ...我说完了，\n  现在想想...",
                        "<25>{#f/22}* ...做了那些事，\n  我怎么还有脸活在这世上。",
                        choicer.create('* （你要怎么做？）', '反驳', '沉默')
                    ]
                    : [
                        SAVE.flag.n.killed_sans > 0
                            ? "<25>{#p/asriel1}{#f/13}* 如果你不想原谅我，\n  我能理解。"
                            : "<25>{#p/asriel1}{#f/13}* 弗里斯克... 我...\n* 如果你不想原谅我，\n  我能理解。",
                        '<25>{#f/13}* 如果你想让我离开，\n  我也能理解。',
                        ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* ...别这么说！"]),
                        '<25>{#p/asriel1}{#f/15}* 我的行为\n  既奇怪，又可怕。',
                        '<25>{#f/15}* 我伤害了你。',
                        '<25>{#f/16}* 我伤害了许多人。',
                        '<25>{#f/13}* 朋友，家人，\n  还有其他人...',
                        "<25>{#f/22}* 我的行为罪不容恕。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 艾斯利尔...']),
                        choicer.create('* （你要怎么做？）', '原谅他', '沉默')
                    ],
            sad4a: () => [
                ...(world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/25}* 什... 什么？',
                        '<25>{#f/21}* ...',
                        "<25>{#f/21}* 我猜... 你其实根本\n  就不想让什么人死，对吗？",
                        '<25>{#f/22}* 你就是想要享受通过\n  击败他人获取到的快感...\n  仅此而已。',
                        '<25>{#f/21}* ...尽管...\n  你想让我留下...'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/25}* 什... 什么？',
                        '<25>{#f/17}* ...拜托，弗里斯克。',
                        "<25>{#f/23}* 你...\n* 你又要把我弄哭了。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...跟我说说看...']),
                        '<25>{#p/asriel1}{#f/21}* ...再者说，\n  就算你原谅我...'
                    ]),
                "<25>{#f/15}* 我也不能将这些灵魂\n  永远留在我的体内。",
                '<25>{#f/16}* 因此... 我只能将\n  这些灵魂物归原主。'
            ],
            sad4b: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* ...',
                        '<25>{#f/21}* 不管怎么说，我答应过你：\n  如果你能打败我，\n  就给你一个幸福的结局。',
                        '<25>{#f/23}* 现在，该兑现承诺了。',
                        "<25>{#f/15}* 既然这些灵魂也不能\n  永远待在我的体内...\n* 那就将它们物归原主吧。",
                        "<25>{#f/16}* 这是我唯一能做的。"
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/22}* ...好。',
                        '<25>{#f/21}* 我知道了。',
                        '<25>{#f/15}* 我之前犯下那么多错...\n  只希望... \n  现在能弥补一点。',
                        
                        "<25>{#p/asriel1}{#f/15}* 既然这些灵魂不能\n  永远待在我的体内...",
                        '<25>{#f/16}* 那就将它们物归原主吧。'
                    ],
            sad4c: () => [
                '<25>{#p/asriel1}{#f/16}* ...',
                '<25>{#f/6}* 但首先...',
                "<25>{#f/29}* 我还有一件事\n  必须完成。",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...是什么？']),
                "<25>{#p/asriel1}{#f/29}* 此时此刻，我能感受到\n  大家的心在一起跳动。",
                "<25>{#f/6}* 他们这个种族\n  都有一个同样的目标。",
                "<26>{#f/6}* 凭借每个人的力量...\n  每个人的决心...",
                "<25>{#f/6}* 是时候...",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 让怪物自由了。']),
                '<25>{#p/asriel1}{#f/29}* 让怪物自由了。',
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...猜到了。'])
            ],
            abreak: '{*}{#p/event}{#i/3}力场崩溃了。',
            sad5: () => [
                '<25>{#p/asriel1}{#f/21}* 弗里斯克...',
                '<25>{#f/21}* 我现在得走了。',
                ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* ...啊？\n* 但你不能就..."]),
                "<25>{#p/asriel1}{#f/15}* 失去了所有人的灵魂...",
                "<25>{#f/22}* 我将无法再维持\n  这种形态。",
                '<25>{#f/21}* 过一会...',
                "<25>{#f/22}* 我将再次会\n  变为一颗星星。",
                ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 但是... 你...']),
                "<25>{#p/asriel1}{#f/15}* 我将再次失去自我。",
                ...(world.runaway
                    ? [
                        "<25>{#f/15}* ...但那也许是\n  最好的结果了。",
                        '<25>{#f/23}* 哈... 弗里斯克。',
                        "<25>{#f/21}* 你没有理由\n  再留在这里了。",
                        "<25>{#f/22}* 别在我身上浪费时间了。"
                    ]
                    : [
                        "<25>{#f/15}* 我将再也无法\n  感受到爱。",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...不...']),
                        '<25>{#p/asriel1}{#f/23}* 所以... 弗里斯克。',
                        "<25>{#f/17}* 请将我彻底遗忘，好吗？",
                        ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* 不！你不能就这么\n  一走了之！"]),
                        '<25>{#p/asriel1}{#f/23}* 回到那些\n  爱你的人身边吧。'
                    ]),
                choicer.create('* （你要怎么做？）', '安慰他', '站着不动')
            ],
            sad6: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/25}* ...！',
                        '<25>{#f/21}* ...',
                        '<25>{#f/21}* 弗里斯克，我...',
                        "<25>{#f/15}* ...我只是还没准备好，\n  而已。",
                        "<25>{#f/22}* 我... 我很抱歉。"
                    ]
                    : [
                        '<25>{#p/asriel1}{#i/4}{#f/23}* 哈... 哈...',
                        "<25>{#f/23}{#i/4}* 我不想放开手...",
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/human}* （你听到有人在哭...）'])
                    ],
            sad7: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/13}* 弗里斯克...',
                        '<25>{#f/15}* 不管你做什么...',
                        '<25>{#f/21}* 只是...\n  试着小心一点，行不？',
                        '<25>{#f/21}* 不管是谁...\n  被你打到命在旦夕。',
                        '<25>{#f/23}* 天呐。\n* 无法想象经历了这一切后，\n  他们将会如何处置你。'
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/21}* 弗里斯克...',
                        "<25>{#f/23}* 你...",
                        "<25>{#f/17}* 你做了一件很伟大的事情，\n  知道吗？",
                        
                        '<25>{#f/23}* 不管你做什么...\n* 每个人都会支持你，\n  知道吗？',
                        ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 不... 求你了...'])
                    ],
            sad8: ["<25>{#p/asriel1}{#f/21}* 好了...\n* 我的时间所剩无几了。", '<25>{#f/22}* 所以... 再见。'],
            sad8x: ["<32>{*}{#p/basic}* ...不要离开我...{^50}{%}"],
            sad9: () =>
                world.runaway
                    ? [
                        '<25>{#p/asriel1}{#f/21}* 顺带一提...',
                        '<25>{#f/22}* 弗里斯克。',
                        "<25>{#f/21}{#x1}* ...不要为此自责，好吗？"
                    ]
                    : [
                        '<25>{#p/asriel1}{#f/21}* 顺带一提...',
                        '<25>{#f/23}* 弗里斯克。',
                        '<25>{#f/17}{#x1}* ...帮我照顾好爸爸妈妈，\n  好吗？'
                    ],
            sad9x: ['<32>{#p/basic}* ...'],
            sad10: () =>
                world.runaway
                    ? ['<32>{#p/human}* （飞船的声音渐渐消失在天际。）']
                    : ['<25>{#p/kidd}{#f/4}* 喂？', '<25>{#f/4}* 有人吗...？'],
            sad11: () =>
                SAVE.data.b.f_state_kidd_betray
                    ? [
                        "<25>{#p/kidd}{#f/5}* ...哦，是你啊。",
                        "<25>{#f/4}* 好吧...\n  如果你准备好...",
                        "<25>{#f/5}* 大家都在\n  艾斯戈尔家等你。",
                        "<25>{#f/4}* 我...\n  我不打扰你了。"
                    ]
                    : [
                        '<25>{#p/kidd}{#f/2}* 哟！\n* 这段时间你跑哪去了！？',
                        "<25>{#f/1}* 他们一直在找你，伙计！",
                        "<25>{#f/2}* 就是，艾斯戈尔家开了\n  一个大派对，还有...",
                        "<25>{#f/1}* 每个人都在期盼\n  你啥时候会登场呢！",
                        "<25>{#f/1}* ...来吧，伙计！\n* 趁还有时间，\n  来加入我们的狂欢吧！"
                    ],
            sad11x: [
                '<32>{#p/basic}* 弗里斯克，我...',
                "<33>* 我不能就这么让他离开。",
                "<32>* 我还有\n  太多的话想要...",
                "<32>* 这些话我藏在心里\n  已经日久年深了...",
                "<32>* 如果我不能快点去\n  跟他说这些话，那我...",
                '<32>* 我...',
                "<32>* 我只是想... 在与他彻底\n  分离之前，与他再见一面。"
            ],
            epilogue1: () =>
                world.runaway
                    ? [
                        '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                        '<18>{#p/papyrus}{#f/6}对不起，\n我们没接你电话...',
                        "<18>{#p/papyrus}{#f/6}不是因为信号不好，\n或者电话断线。",
                        "<18>{#p/papyrus}{#f/5}单纯是因为...\n不想搭理你。",
                        "<18>{#f/5}真奇怪...\n你的大名突然传遍了\n整个怪物世界。",
                        "<18>{#f/6}而且，每个怪物...\n都非常害怕你。",
                        '<18>{#f/4}...也许说得太绝对，\n但大体没错。',
                        '<25>{#p/undyne}{#f/12}* 对。\n* 就是这样。',
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#p/papyrus}{#f/5}...我感觉，\n就连她都开始怕你了。",
                        '<25>{#p/undyne}{#f/17}* 我才不怕呢！',
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#f/5}我们纠结了很久，\n最后还是决定...",
                        "<18>{#f/31}抛弃你，先走一步\n寻找新家园。",
                        "<18>{#f/6}知道你不好受！\n所以别担心...",
                        "<18>{#f/5}...我们还给你\n留了个核心。",
                        '<25>{#p/undyne}{#f/12}* 过不了多久，\n  那玩意就没能量了哦。',
                        "<18>{#p/papyrus}{#f/5}求求你...\n别来找我们，行吗？",
                        "<18>{#f/31}我们都不想再见到你。",
                        '<18>{#f/3}...',
                        '<18>{#f/3}唉... 好自为之吧。',
                        '<25>{#p/undyne}{#f/1}* 好好享受一个人的世界！！',
                        '<32>{#s/equip}{#p/event}* 滴...'
                    ]
                    : [
                        '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                        "<18>{#p/papyrus}{#f/0}嘿，人类！\n希望你没事！",
                        "<18>{#f/5}我们都担心死你了。",
                        '<18>{#f/6}我们都把电话都打爆了，\n可你之前一次都没接！',
                        '<18>{#f/0}还好你的朋友经过，\n然后...',
                        '<18>{#f/0}谢天谢地，\n我们现在能松口气了。',
                        "<18>{#f/0}...弗里斯克？\n你是叫这名吗？",
                        "<18>{#f/5}真奇怪...\n你的大名突然传遍了\n整个怪物世界。",
                        "<18>{#f/0}不过也没啥。\n奇怪管奇怪，\n还是挺振奋人心的。",
                        "<25>{#p/sans}{#f/0}* 小心点啊兄弟，\n  别把面煮糊了。",
                        "<18>{#p/papyrus}{#f/7}衫斯！！！\n我知道自己在干嘛！！！",
                        '<25>{#p/sans}{#f/2}* 以防万一嘛。',
                        "<18>{#p/papyrus}{#f/6}对了...\n艾斯戈尔原来\n这么喜欢意大利面。",
                        '<18>{#p/papyrus}{#f/4}我仅用一碟意大利面\n就把他征服了...',
                        '<18>{#p/papyrus}{#f/0}他还让我给\n参加派对的大伙\n都做份意面呢！',
                        '<18>{#p/papyrus}{#f/9}我，顶级厨师帕派瑞斯，\n乐意效劳！',
                        "<25>{#p/sans}{#f/0}* 看来，长久的努力\n  终于有回报了，\n  是不是呀？",
                        '<18>{#p/papyrus}{#f/0}必须滴。',
                        '<18>{#p/papyrus}{#f/4}因为你瞧，\n大伙都挺喜欢的！',
'<18>{#p/papyrus}{#f/4}根本没人尝了一口\n就嫌弃说不好吃。',
                        '<25>{#p/sans}{#f/0}* 哇哦。\n* 对了，说说守卫的事儿吧。',
                        "<25>{#p/sans}{#f/3}* 你没当上皇家守卫...\n  可能也不是那么糟。",
                        "<25>{#p/sans}{#f/2}* 我是你的兄弟，\n  这就足以让我为你骄傲了。",
                        "<18>{#p/papyrus}{#f/8}衫斯...！\n你这话说的，\n我都要流眼泪了！",
                        "<18>{#p/papyrus}{#f/7}食客们可不想\n意面沾上眼泪！",
                        '<25>{#p/sans}{#f/3}* 哎呀。\n* 忘挑个好时间了。',
                        '<18>{#p/papyrus}{#f/4}这次其实算好的了...',
                        "<18>{#p/papyrus}{#f/0}...咱在艾斯戈尔家厨房，\n要继续忙去了。",
                        '<18>{#p/papyrus}{#f/9}你可以顺道来看看，\n随时欢迎！',
                        '<32>{#s/equip}{#p/event}* 滴...'
                    ],
            epilogue2: () => [
                '<25>{#p/sans}{#f/0}* 嘿，小子。',
                "<25>{#f/0}* 刚才我就纳闷\n  你会啥时候来这。",
                '<25>{#f/3}* 前不久，有个孩子\n  突然从我旁边冲了过去，\n  大概是去找你的。',
                '<25>{#f/2}* 难怪我们\n  打了11通电话你才接。',
                "<25>{#f/0}* ...对了。\n* 我想找个人。",
                "<25>{#f/0}* 你应该认识。\n* 她叫托丽尔。",
                "<25>{#f/3}* 我把能猜到的地方\n  找了个遍，就是没找到。",
                '<25>{#f/0}* 所以谁也说不清\n  她去哪儿了...',
                '<25>{#f/3}* 如果你见到她了，\n  或者接到她的电话了...\n* 就让她给我回个电话。',
                SAVE.data.b.skeleton_key
                    ? '<25>{#f/2}* ...说不定，\n  她跑到我的衣柜里面去了。'
                    : '<25>{#f/2}* 谢了。'
            ],
            epilogue3: [
                '<25>{#p/asgore}{#f/6}* 啊，弗里斯克！\n* 你醒了。',
                '<25>{#f/6}* 想来的话，\n  可以跟我们一起庆祝一下。',
                '<25>{#f/21}* 大伙见到你会很高兴的。',
                '<25>{#f/5}* 想去前哨站\n  其他地方逛逛也行。',
                '<25>{#f/5}* 什么时候准备启程了，\n  就去王座那儿。',
                '<25>{#f/6}{#x1}* 我用遥控器\n  把停机坪通道打开了。'
            ],
            finaltext1: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<25>{#p/asriel1}{#f/17}* 走出这扇门，就是停机坪。',
                            choicer.create('* （离开这里吗？）', "我想\n再等等", "\n现在离开")
                        ]
                        : [
                            ...(SAVE.data.b.oops
                                ? [
                                    '<32>{#p/basic}* 走出这扇门，\n  你的旅程将会迎来\n  真正的终结。',
                                    '<32>{#p/basic}* 你的朋友们\n  将会跟随你的脚步，\n  前往新家园。'
                                ]
                                : ['<32>{#p/basic}* 弗里斯克...', "<32>* 我们还有事没做呢，\n  你忘了吗？"]),
                            choicer.create('* （离开这里吗？）', "我想\n再等等", "\n现在离开")
                        ],
                [choicer.create('* （离开这里吗？）', "我想\n再等等", "\n现在离开")]
            ),
            finaltext2: ['<32>{#p/basic}* 弗里斯克？', choicer.create('* （离开这里吗？）', "我想\n再等等", "\n现在离开")],
            finaltext3: ['<32>{#p/basic}* ...', choicer.create('* （离开这里吗？）', "我想\n再等等", "\n现在离开")],
            hangar1: () =>
                SAVE.data.b.svr
                    ? [
                        "<25>{#p/asriel1}{#f/23}* 真美...",
                        '<25>{#f/22}* ...',
                        "<25>{#f/13}* 从出生起，\n  这片星空我早已见过\n  无数次。",
                        "<26>{#f/17}* 但没有力场禁锢的星空...\n  乍一看，还是挺不一样的。",
                        "<25>{#f/17}* 也许只是错觉，\n  但我总觉得...",
                        '<25>{#f/23}* ...这片星空更加明亮。'
                    ]
                    : [
                        '<25>{#p/asgore}{#f/6}* 宇宙...\n* 万物的归宿。',
                        '<25>{#f/1}* 在这里，有数以亿计的世界...',
                        '<25>{#f/2}* 有的... 生机勃勃；\n  有的... 一片死寂。',
                        '<26>{#f/5}* 你可以把宇宙\n  比作一本未读的书。',
                        '<26>{#f/6}* 翻开之前，永远也不知道\n  下一页有什么惊喜\n  等着你。'
                    ],
            hangar2: () =>
                SAVE.data.b.svr
                    ? [
                        '<25>{#p/asriel1}{#f/17}* 哈哈...',
                        '<25>{#f/17}* 咱们出发吧。',
                        '<25>{#f/15}* ...',
                        '<25>{#f/15}* 妈妈和爸爸肯定很想我...',
                        "<25>{#f/17}* 等上了运输船，\n  我就找他们。",
                        '<25>{#f/13}* 而你，弗里斯克...',
                        '<25>{#f/20}* 经历这么多，你肯定累坏了。\n* 好好休息一下吧。',
                        
                        '<25>{#f/13}* ...',
                        '<25>{#f/13}* 说不定...',
                        "<25>{#f/17}* 等你醒来后，就到家了。\n* 那里，有爱你的亲人，\n  有幸福的生活..."
                    ]
                    : ['<25>{|}{#p/asgore}{#f/5}* 等等？\n* 有人在- {%}'],
            hangar3: () =>
                SAVE.data.b.svr
                    ? ['<26>{#p/asriel1}{#f/17}* 准备好了吗？']
                    : [
                        '<25>{#p/toriel}* 哦，我的孩子！\n  原来你在这啊！',
                        '<25>{#f/5}* ...',
                        '<25>{#f/5}* ...你好，艾斯戈尔。'
                    ],
            hangar4: ['<25>{#p/asgore}{#f/1}* 哈喽。'],
            hangar5: ['<25>{#p/toriel}{#f/5}* ...', '<25>{#p/asgore}{#f/5}* ...'],
            hangar6: () =>
                SAVE.data.b.c_state_secret5_used
                    ? [
                        '<25>{#p/asgore}{#f/6}* 托丽尔，我...',
                        '<25>{#p/asgore}{#f/1}* 我知道... 有件事，\n  在你心中一直挥之不去。',
                        '<25>{#p/asgore}{#f/2}* 就是... 咱们俩\n  意见不合，彻底闹掰那次。',
                        '<25>{#p/toriel}{#f/5}* ...这事你还知道？'
                    ]
                    : ['<25>{#p/asgore}{#f/5}* 哎呀，好尴尬。'],
            hangar7: () =>
                SAVE.data.b.c_state_secret5_used
                    ? [
                        '<25>{#p/asgore}{#f/1}* 你觉得自己做了错事，\n  有愧于我。',
                        '<25>{#p/asgore}{#f/1}* 你觉得自己做了傻事，\n  后果无法挽回。',
                        '<25>{#p/asgore}{#f/2}* ...所以，你觉得自己是个罪人，\n  不值得原谅。',
                        '<25>{#p/toriel}{#f/13}* ...\n* ...没错。',
                        '<25>{#p/asgore}{#f/6}* 但我觉得，不是这样的。',
                        '<25>{#p/asgore}{#f/6}* 你就算犯了错，\n  我也会原谅你。',
                        '<25>{#p/asgore}{#f/6}* 你就算做了傻事，\n  我也愿意接纳你。',
                        '<25>{#p/asgore}{#f/5}* 虽然感情淡了...',
                        '<25>{#p/asgore}{#f/6}* 但我们还能在一起！'
                    ]
                    : SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/toriel}{#f/5}* 艾斯戈尔...',
                            '<25>{#p/toriel}{#f/5}* 有些话，我也想跟你说。\n  虽然你可能已经不在乎了...',
                            '<25>{#p/toriel}{#f/9}* 之前，我放任自己，\n  随意揣测你的所作所为。\n* 这事，我得道个歉。',
                            '<25>{#p/toriel}{#f/13}* 我把你说成是一个恶魔。',
                            '<25>{#p/toriel}{#f/13}* 一个窝囊废。',
                            '<25>{#p/toriel}{#f/9}* 一个只会杀小孩的败类。',
                            '<25>{#p/toriel}{#f/10}* ...但你不是这样。',
                            
                            '<25>{#p/toriel}{#f/3}* 平心而论...\n  虽然档案里出了点事，\n  但那并不怪你。',
                            '<25>{#p/toriel}{#f/0}* 而尽力保护那些孩子，\n  足以证明，你很勇敢。'
                        ]
                        : ['<25>{#p/toriel}{#f/1}* 行了，别说了。'],
            hangar8: () =>
                SAVE.data.b.c_state_secret5_used
                    ? SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/toriel}{#f/1}* ...艾斯戈尔，我...',
                            '<25>{#p/toriel}{#f/5}* 这样做... 好像不太合适。',
                            '<25>{#p/toriel}{#f/1}* 而且，我想组建家庭的热情，\n  很早以前就没了。',
                            '<25>{#p/toriel}{#f/0}* 不不不，这可不是\n  我的一厢情愿，\n  我没那么自私。',
                            '<25>{#p/asgore}{#f/6}* 行，行...\n* 但你看...',
                            '<25>{#p/asgore}{#f/6}* 希望我们俩复合的，\n  是弗里斯克啊。',
                            '<25>{#p/toriel}{#f/7}* ...弗里斯克？！',
                            '<25>{#p/toriel}{#f/1}* 呃... 那个，我...',
                            '<25>{#p/toriel}{#f/5}* 这事... 让我想想吧...',
                            '<32>{#p/human}* （你微笑着点了点头。）',
                            '<25>{#p/asgore}{#f/21}* 你看，弗里斯克也想留住你呢。',
                            '<25>{#p/toriel}{#f/23}* ...',
                            '<25>{#p/toriel}{#f/1}* 我到时候好好想想吧。'
                        ]
                        : [
                            '<25>{#p/toriel}{#f/1}* ...艾斯戈尔，我...',
                            '<25>{#p/toriel}{#f/5}* 这么做根本不合适。',
                            '<25>{#p/toriel}{#f/10}* 对不起，我也想有个家，\n  可现在这样，我不会答应的。',
                            
                            '<25>{#p/asgore}{#f/1}* ...',
                            '<25>{#p/asgore}{#f/2}* 我理解的。'
                        ]
                    : SAVE.data.b.c_state_secret1_used
                        ? [
                            '<25>{#p/asgore}{#f/20}* ...',
                            '<25>{#p/asgore}{#f/4}* ...谢谢你。',
                            '<25>{#p/asgore}{#f/6}* 能听你亲口说出这些话，\n  我很满足。',
                            '<25>{#p/toriel}{#f/9}* 要是不说出来，\n  我也觉得欠点什么。'
                        ]
                        : ['<25>{#p/asgore}{#f/5}* 唔...'],
            hangar9: [
                '<18>{#p/papyrus}各位好哇！',
                '<25>{#p/toriel}{#f/1}* ...哦，你好呀！',
                "<18>{#p/papyrus}{#f/0}没想到又在这见到您！\n太棒了！",
                '<18>{#p/papyrus}{#f/9}聚会结束了，\n我刚把屋子打扫完！',
                '<25>{#p/toriel}{#f/1}* ...好的，知道了。',
                '<25>{#p/toriel}{#f/0}* 那么，你想跟我们一起...\n  看星星吗？'
            ],
            hangar10: [
                '<18>{#p/papyrus}{#f/5}哇哦...',
                '<25>{#p/asgore}{#f/21}* 是不是很漂亮？',
                "<25>{#p/asgore}{#f/5}* 以前，因为力场引力的影响，\n  宇宙的光芒大多被扭曲，\n  无法到达这里。",
                '<25>{#p/asgore}{#f/6}* 现在这番景象...\n  才是这片星空本来的模样。',
                '<18>{#p/papyrus}{#f/0}真的好美！',
                '<18>{#p/papyrus}{#f/6}...不过我还是没看出来\n和以前有啥区别。',
                '<25>{#p/asgore}{#f/5}* 要是真看不出来，\n  可能是你太累了。',
                '<18>{#p/papyrus}{#f/5}今天一天净忙活了...',
                '<25>{#p/toriel}{#f/1}* 那就躺下休息一下吧。',
                '<18>{#p/papyrus}{#f/7}啥？！\n我能休息了？！',
                '<18>{#p/papyrus}{#f/7}我现在就要\n好好睡一觉！！',
                "<18>{#p/papyrus}{#f/4}还是算了，不休息了。",
                "<18>{#p/papyrus}{#f/7}帕派瑞斯根本就\n不需要休息！！",
                '<18>{#p/papyrus}{#f/5}...',
                '<18>{#p/papyrus}{#f/5}不过呢，我有个兄弟...'
            ],
            hangar11: ["<25>{#p/sans}{#f/2}* 怎么啦？"],
            hangar12: ['<25>{#p/toriel}{#f/0}* 哦！\n* 怎么{@fill=#ff0}啦{@fill=#fff}么晚才来呢，\n  衫斯？', '<25>{#p/asgore}{#f/5}* ...哈喽？'],
            hangar13: [
                '<18>{#p/papyrus}{#f/4}“怎么辣”...\n我的兄弟啊，\n你咋明知故问呢？',
                "<18>{#p/papyrus}{#f/0}你咋不问“怎么酸”\n“怎么甜”\n“怎么苦”呢？",
                "<18>{#p/papyrus}{#f/9}正好凑齐酸甜苦辣！",
                '<25>{#p/sans}{#f/0}* 嗯... {@fill=#ff0}酸{@fill=#fff}你厉害。',
                "<25>{#p/sans}{#f/2}* 你果然是个{@fill=#ff0}甜{@fill=#fff}才。",
                '<18>{#p/papyrus}{#f/5}...',
                '<18>{#p/papyrus}{#f/5}嗯，{@fill=#ff0}辣{@fill=#fff}还用说。',
                '<25>{#p/sans}{#f/4}* 嘿嘿嘿。\n* 我都快激动{@fill=#ff0}苦{@fill=#fff}了。',
                '<18>{#p/papyrus}{#f/0}我也是啊。'
            ],
            hangar14: [
                '<25>{#p/sans}* 哦对了，大伙全都特别\n  “喜欢”你做的意面呢。',
                "<25>{#p/sans}{#f/2}* 我过来的时候，\n  一群怪物围着我，\n  求我帮忙“把意面解决掉”...",
                "<25>{#p/sans}{#f/2}* ...不然我还能早点到。",
                '<18>{#p/papyrus}{#f/0}那... 你喜欢吃吗？',
                '<25>{#p/sans}{#f/3}* 嘿，当然喜欢呀。',
                "<25>{#p/sans}{#f/0}* 看来，这几天\n  你的厨艺进步飞快啊。",
                '<18>{#p/papyrus}{#f/9}捏嘿嘿！\n那必须滴！',
                "<18>{#p/papyrus}{#f/0}自打弗里斯克来这里...\n我就感觉\n越来越有动力！",
                
                '<25>{#p/sans}{#f/0}* 有了弗里斯克，\n  大家都更乐观了，\n  你说是不？',
                '<18>{#p/papyrus}{#f/0}是啊！\n而且，弗里斯克来之后，\n我也有了小目标！',
                '<18>{#p/papyrus}{#f/4}一开始，我的目标是：\n战胜弗里斯克...',
                '<18>{#p/papyrus}{#f/5}...后来，我有了新的目标：\n我要成为弗里斯克\n真正的好朋友。',
                "<18>{#p/papyrus}{#f/6}不过...",
                "<18>{#p/papyrus}{#f/6}现在突然自由了，\n反倒不知道干点啥好了。",
                '<18>{#p/papyrus}{#f/4}不过我转念一想...',
                "<18>{#p/papyrus}{#f/9}既然自由了，\n那么我就有无穷的时间\n慢慢思考！",
                "<18>{#p/papyrus}{#f/0}所以...\n第一步，做点啥好呢..."
            ],
            hangar15: ['<25>{#p/undyne}{#f/8}* 呋呼呼！\n* 我有一计！'],
            hangar16: [
                "<25>{#p/alphys}{#g/alphysSmarmyAggressive}* 嗯，来帮我们拍喵喵同人吧。"
            ],
            hangar17: ['<25>{#p/toriel}{#f/6}* 噗-\n* 哈哈哈！'],
            hangar18: ["<25>{#p/undyne}{#f/12}* 其实真不用做到这种地步。\n* 不过... 我没意见。"],
            hangar19: () => [
                "<25>{#p/alphys}{#g/alphysYupEverythingsFine}* 首先，喵喵要驾驶飞船，\n  所以咱得先找到一架飞船\n  给喵喵开...",
                "<25>{#p/undyne}{#f/17}* 艾菲斯！！\n  咱们还没出前哨站呢！",
                ...(SAVE.data.b.a_state_hapstablook
                    ? [
                        "<25>{#p/undyne}{#f/16}* 而且，喵喵现在... \n  不太方便拍节目。",
                        "<25>{#p/alphys}{#g/alphysWelp}* 哎呀，我怎么忘了\n  现在已经有真人版喵喵了！",
                        '<18>{#p/papyrus}{#f/0}是啊。\n前不久，我刚在宴会上\n见到她！',
                        '<18>{#p/papyrus}{#f/0}看起来，她真的很开心。',
                        "<25>{#p/alphys}{#g/alphysInquisitive}* 她以前不就是一个\n  成天发脾气的人偶吗？",
                        "<25>{#p/undyne}{#f/7}* 以前是以前，现在是现在！\n* 现在她长得漂亮就行呗，\n  真是的！",
                        '<25>{#p/alphys}{#g/alphysUhButHeresTheDeal}* 行行行，你说得都对！！'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/16}* 而且，“喵喵”...",
                        "<25>{#p/undyne}{#f/17}* 嘿，你不得先找个幽灵，\n  让它当上喵喵吗？",
                        '<25>{#p/alphys}{#g/alphysWelp}* 哦对，这事咋忘了。',
                        '<18>{#p/papyrus}{#f/5}我记得，在宴会上\n有只幽灵问过我这事...',
                        '<18>{#p/papyrus}{#f/6}不过，那家伙有点害羞。',
                        '<25>{#p/alphys}{#g/alphysCutscene2}* 哦，我应该知道是谁了。\n* 我会尽快完成...',
                        '<25>{#p/undyne}{#f/7}* 越快越好，最好在飞船上\n  就搞定！',
                        '<25>{#p/alphys}{#g/alphysUhButHeresTheDeal}* 行行行，别催了！！'
                    ])
            ],
            hangar20: [
                '<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* 总-总之...',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUpCenter}* 艾斯戈尔，见到你真高兴。\n* 还有你，衫斯。",
                '<18>{#p/papyrus}{#f/6}我呢？？',
                '<25>{#p/alphys}{#g/alphysSmileSweat}* ...你也是。',
                '<25>{#p/toriel}{#f/0}* 是不是还忘了这个人呢？',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 啊！\n* ...对-对不起！',
                '<25>{#p/toriel}{#f/6}* 嘻嘻嘻。\n* 开玩笑而已，别在意。',
                '<25>{#p/toriel}{#f/1}* 其实，你那些事迹\n  我早就听过了...',
                '<25>{#p/toriel}{#f/0}* 年轻有为，当上皇家科学员。\n  果然不容小觑。',
                "<25>{#p/undyne}{#f/8}* 那还用说！！\n* 她最棒了！",
                '<25>{#p/alphys}{#g/alphysCutscene2}* ...过奖了。'
            ],
            hangar21: [
                '<25>{#p/asgore}{#f/6}* 各位朋友，此时此刻，\n  请与我一起深呼吸...',
                '<25>{#p/asgore}{#f/21}* 一同回忆这一路走来，\n  经历的种种往事吧。'
            ],
            hangar22: [
                "<25>{#p/sans}{#f/3}* 想来也挺有意思...",
                "<25>{#p/sans}{#f/0}* 这片星空\n  一直都在我们的头顶之上。",
                '<25>{#p/sans}{#f/0}* 但以前，只能仰望星空，\n  却无法触及星辰...',
                '<25>{#p/sans}{#f/3}* 但现在...',
                "<25>{#p/sans}{#f/0}* ...这样的变化，\n  谈不上多“有意思”，\n  但是...",
                "<25>{#p/sans}{#f/3}* 很有意义。",
                '<18>{#p/papyrus}{#f/5}是啊。',
                '<18>{#p/papyrus}{#f/5}意义... 非凡。'
            ],
            hangar23: ['<32>{#p/napstablook}* 嘿，大家好...'],
            hangar24: [
                "<32>{#p/napstablook}* 希望我来这里\n  不会烦到你们...",
                '<25>{#p/undyne}{#f/14}* 噗- 烦到我们？\n* 怎么可能呢！',
                "<25>{#p/sans}{#f/0}* 我们看到你来，\n  {@fill=#ff0}反倒{@fill=#fff}很高兴呢。",
                '<18>{#p/papyrus}{#f/6}衫斯！鼓励他可以，\n干嘛让他{@fill=#ff0}翻倒{@fill=#fff}呢？',
                "<18>{#p/papyrus}{#f/4}他刚吃完{@fill=#ff0}饭，倒{@fill=#fff}立\n会出事的...",
                '<32>{#p/napstablook}* 嘿嘿嘿...'
            ],
            hangar25: [
                '<25>{#p/alphys}{#g/alphysCutscene1}* 对了，小幽！\n* 喵喵系列新电影\n  你看了没？',
                "<32>{#p/napstablook}* 最近... 出新电影了？",
                '<25>{|}{#p/alphys}{#g/alphysHellYeah}* 是啊！！\n* 在电影中喵喵非常后悔自己\n  之前在星火篇中的所作所为 {%}',
                '<99>{|}{#p/alphys}{#g/alphysHellYeah}  所以呢她决定使用一种手段\n  就是时间回溯的魔法来弥补\n  自己之前犯下的过错可是她 {%}',
                '<25>{|}{#p/undyne}{#f/12}* 呃... {%}',
                '<25>{|}{#p/alphys}{#g/alphysTheFactIs}* 发现如果想穿越时间就必须\n  使用一种装置但是这种装置\n  是她在星火篇末尾杀了很多 {%}',
                '<99>{|}{#p/alphys}{#g/alphysTheFactIs}  很多无辜的人最终才获得的\n  因此她不得不面对良心拷问\n  还有各种各样的挣扎与抉择 {%}',
                '<25>{|}{#p/undyne}{#f/17}* 艾菲斯- {%}',
                "<25>{|}{#p/alphys}{#g/alphysInquisitive}* 她左右为难因为如果使用了\n  那个装置就能抹去所有曾经\n  亲手造成的伤痛但装置本身 {%}",
                '<99>{|}{#p/alphys}{#g/alphysInquisitive}  却是无数杀戮和痛苦换来的\n  所以主角喵喵开始怀疑自己\n  怀疑自己到底算不算个好人- {%}',
                '<25>{#p/undyne}{#f/8}* 别剧透了！！！',
                '<25>{#p/alphys}{#g/alphysSmileSweat}* ...',
                '<25>{#p/alphys}{#g/alphysNervousLaugh}* ...对不起。'
            ],
            hangar26: [
                "<32>{#p/napstablook}* 没事没事...\n  你刚刚说得太快，\n  我一句都没听懂...",
                '<25>{#p/alphys}{#g/alphysWelp}* ...',
                '<25>{#p/alphys}{#g/alphysWelp}* 我说话快吗...\n  你们咋都这么说呢...',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* ...算了，不是啥大事。",
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUpCenter}* 跟“重获自由”一比，\n  安利科幻番失败\n  根本不算个事。"
            ],
            hangar27: ['<32>{#p/mettaton}* 哦？\n* 我刚刚是不是听到\n  有人想“安利科幻番”？'],
            hangar28: ['<25>{#p/alphys}{#g/alphysGarboCenter}* ...又来磨叽了。'],
            hangar29: [
                "<32>{#p/mettaton}* 博士，别那么烦躁嘛。",
                "<32>{#p/mettaton}* 你不是总有些“鬼点子”嘛，\n  我都能帮你实现！",
                "<25>{#p/undyne}{#f/12}* 嘴上说“帮她实现梦想”，\n  可你连她最棒的鬼点子是啥，\n  都不知道吧？",
                '<26>{#p/toriel}{#f/1}* 呃，这些话题\n  你们能不能以后再聊...',
                '<25>{#p/undyne}{#f/17}* 我他妈谢谢你。',
                '<25>{#p/toriel}{#f/3}* ...',
                '<25>{#p/toriel}{#f/4}* 头一次听到这样的...\n  言论。\n* 给我整懵了。',
                '<32>{#p/mettaton}* 哎呀，看来你俩的关系\n  出了点问题了呢。',
                "<32>{#p/mettaton}* 没关系，\n  让镁塔牌《友爱宝典》帮你吧！\n* 步骤我记得清清楚楚。",
                '<33>{|}{#p/mettaton}* 第一步，按[C]或[CTRL]打开- {%}',
                '<25>{#p/toriel}{#f/0}* 不用了，谢谢。',
                '<32>{#p/mettaton}* ...试一试嘛，也不亏。'
            ],
            hangar30: [
                '<32>{#p/mettaton}* 我在想...',
                "<32>{#p/mettaton}* 等到了新家园，\n  就有大把时间推销\n  我的《友爱宝典》了。",
                "<32>{#p/mettaton}* 抵达新家园之前。能高兴的，\n  也就只有“自由”本身了。\n* 唉。",
                "<18>{#p/papyrus}{#f/0}别伤心，镁塔顿！\n有我陪着你！",
                '<18>{#p/papyrus}{#f/5}你看，值得高兴的事\n可不止有自由哦。',
                '<18>{#p/papyrus}{#f/9}这位{@fill=#ff0}机器{@fill=#fff}人的想法\n{@fill=#ff0}激起{@fill=#fff}我的斗志。',
'<18>{#p/papyrus}{#f/9}让我有信心成为\n{@fill=#ff0}极其{@fill=#fff}优秀的\n领导{@fill=#ff0}骨{@fill=#fff}干！',
                '<32>{#p/mettaton}* 哈哈哈...\n* 还是你懂我，帕派瑞斯。',
                '<32>{#p/mettaton}* 你的每一条建议，\n  我都会很在乎。',
'<32>{#p/mettaton}* ...而不是像某些家伙一样\n  把你当成长不大的小孩。',
                '<25>{#p/undyne}{#f/14}* 喂！瞅我干啥？',
                '<25>{#p/undyne}{#f/17}* 我把他咋的了？'
            ],
            hangar31: [
                '<25>{#p/asgore}{#f/6}* 不想打断你们，但... \n  我现在得送弗里斯克上船了。',
                '',
'',
                '<25>{#p/asgore}{#f/5}* 那孩子跟咱们一起\n  忙活一整天，\n  肯定都累坏了。'
            ],
            hangar32: [
                "<18>{#p/papyrus}{#f/6}哦哦...",
                '<18>{#p/papyrus}{#f/9}连弗里斯克都上船了...\n...那我也不能等了！'
            ],
            hangar33: ["<25>{#p/sans}{#f/2}* 嘿嘿，我就在你后面哦，\n  兄弟。"],
            hangar34: ['<25>{#p/undyne}{#f/7}* 来啦！！\n* 算我一个！！'],
            hangar35: ["<25>{#p/alphys}{#g/alphysHellYeah}* 别丢下我！"],
            hangar36: [
                "<32>{#p/mettaton}* 大伙都上去了，\n  我要还搁这发呆，\n  就有点尴尬了。",
                "<32>{#p/mettaton}* 所以... 我也走了。"
            ],
            hangar37: ["<25>{#p/napstablook}* 别担心...\n  我不会掉队的..."],
            hangar38: [
                "<25>{#p/kidd}{#f/1}* 嘿，大伙都去哪了？！",
                '<25>{#p/kidd}{#f/7}* 我... 我正找弗里斯克呢！',
                '<25>{#p/toriel}{#f/0}* 沿走廊往回走，\n  找到47号登机口。', 
                '<25>{#f/0}* 从左手边第一扇门上去，\n  就能找到了。', 
                "<25>{#p/kidd}{#f/3}* 我好像在哪见过您！\n  总之谢了！",
                "<25>{#p/kidd}{#f/1}* 您真的太好了！"
            ],
            hangar39: ['<25>{#p/toriel}{#f/10}* 孩子...'],
            hangar40: ['<25>{#p/toriel}{#f/1}* ...多保重，好吗？'],
            returnofchara1: ['<32>{#p/basic}* 弗里斯克...', '<32>* ...还在吗？'],
            returnofchara2: [
                '<32>{#p/basic}* 对不起，之前一直陪着你，\n  刚刚我却“失踪”了。',
                '<32>* 刚刚释放灵魂\n  耗费的能量太多，\n  把我弄透支了。',
                "<32>* ...别担心，现在已经恢复好啦！",
                "<32>* 现在回头一想...\n  感觉我能活下来\n  也挺合理的。",
                '<32>* 很多年前，艾斯利尔吸收了我的灵魂。\n  使我变成了幽灵形态...',
                '<32>* 我成了他“精神”的一部分，\n  化为天使，指引着他。',
                '<32>* ...或者说，化为恶魔，怂恿着他。\n* 我到底是“天使”还是“恶魔”，\n  看你想法了。',
                '<32>* 后来，艾斯利尔死了。',
'<32>* 但我却并没有因此消失，\n  而是继续存在，\n  成了货真价实的幽灵。',
                "<32>* 情况应该就是这样..."
            ],
            returnofchara3: [
                '<32>{#p/basic}* 你知道吗...',
                '<32>* 那时，我一心想寻死...',
                '<32>* 想跟这个世界彻底了断...',
                '<32>* ...',
                '<33>* 艾斯利尔死亡时，\n  我们的灵魂相互分离。',
                '<32>* 我知道即使是王级怪物，\n  只要肉体死了，\n  灵魂也不会存续太久。',
'<32>* 所以，我就没太在意。',
                "<32>* 现在回头一想，\n  当时选择干等着，\n  其实根本没什么用...",
                '<32>* 虽然在正常情况下...',
                "<32>* “王级怪物”的肉体一旦死亡，\n  灵魂中那些品质和性格\n  也会马上消失。",
                "<32>* 但艾斯利尔的情况不同。\n* 他跟我的灵魂融合在一起，\n  那根本就不属于“正常情况”。",
                "<32>* 之前，我虽然知道自己体内\n  有个灵魂，但我以为\n  那灵魂早就“变质”了。",
                "<32>* 如果能早点想清楚，我...",
                '<32>* ...',
                '<32>* 其实，经历了这么多，\n  我再也不想寻死了。',
                
                "<32>* 相反，我现在觉得\n  能活着，才是最幸福的事。",
                '<32>* 我能陪着他，\n  看着他一点点长大...',
'<32>* 看着他\n  从我的阴影中走出来，\n  过着自己的生活...',
                '<32>* 这些对我来说，意义非凡。'
            ],
            returnofchara4: [
                '<32>{#p/basic}* 嘿，弗里斯克。\n* 有件事想拜托一下...',
                '<32>* ...拜托你别搂着那玩意啦！\n  太阳都晒屁股了！',
                "<32>* 那玩意就是个枕头，\n  干嘛又搂又抱的？",
                '<32>* ...',
                "<32>* 你历经千辛万苦，长途跋涉，\n  终于抵达新世界。\n* 来到这的第一件事，却是睡大觉！",
                '<32>* 不愧是你啊！哼！',
                '<32>* ...开玩笑而已啦。',
                "<32>* 累了就多睡会吧，弗里斯克。",
                '<32>* 等你醒了，咱俩再聊。'
            ]
        },
        overworld: {
            get20: ['<32>{*}{#s/equip}{#p/human}* （你把停机坪门禁卡\n  挂到了钥匙串上。）{^90}{%}'],
            drop: [
                '<26>{#p/asgore}{#f/8}* ...！\n* 你刚刚是不是把茶倒掉了？\n* 就是专门给你沏的啊...',
                '<25>{#p/asgore}{#f/1}* 唔...\n* 抱歉，没能让你喜欢它。'
            ],
            use: ['<25>{#p/asgore}{#f/21}* 啊...\n* 这可是上等好茶，\n  喜欢不？'],
            drop_tori: ['<26>{#p/asgore}{#f/5}* 好熟悉的香味...\n* 你刚才扔了什么？'],
            use_tori: ['<26>{#p/asgore}{#f/5}* 好熟悉的香味...\n* 你在吃什么？'],
            approachescape: ['<32>{#p/human}* （脚步声逐渐远去。）'],
            partyguard1: pager.create(
                0,
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x1}* 哈？\n* 要走了吗？{#x3}',
                            "<32>{#x2}* 没事的，老兄。\n* 如果人类想走，\n  就自己走吧。{#x3}",
                            "<32>{#x1}* 对... 你说的很对。{#x3}"
                        ]
                        : ['<32>{#p/basic}{#x1}* 嘿，你回来了！\n  太好了！{#x3}', '<32>{#x2}* 我们想死你了。{#x3}'],
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x1}* 对不起，我，要是，看到人们\n  提前离开派对，\n  我就会感到超级焦虑。{#x3}',
                            '<32>{#x2}* 对，他对此很焦虑。\n* 没有针对某人的意思。{#x3}'
                        ]
                        : [
                            "<32>{#p/basic}{#x1}* 别有压力。\n* 我们是想你了，\n  但你不是非得留在这。{#x3}",
                            '<32>{#x2}* 那个，对的，老兄。\n* 对的对的。{#x3}'
                        ]
            ),
            partyguard2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? [
                            '<32>{#p/basic}{#x2}* 这派对太棒了，老兄。{#x3}',
                            '<32>{#x2}* 他们甚至还拿出来了\n  情歌植物，就在那张桌子上！{#x3}'
                        ]
                        : [
                            "<32>{#p/basic}{#x2}* 你不试试情歌什么的吗，\n  那对我来说很重要。{#x3}",
                            '<32>{#x1}* ...你说的是“我们”， \n  对吧老兄。{#x3}',
                            '<32>{#x2}* 哈哈，我的错。{#x3}'
                        ],
                () =>
                    SAVE.data.n.plot_epilogue < 4
                        ? ["<32>{#p/basic}{#x2}* 那是一种怪物佳肴。{#x3}"]
                        : ['<32>{#p/basic}{#x2}* 对我们很重要。{#x3}']
            ),
            janet: pager.create(
                0,
                [
                    "<32>{#p/basic}* 你要是知道我刚到时\n  这里有多么难以下脚，\n  你一定会大吃一惊的！",
                    "<32>* 在看到每个人\n  都经过了这里后...",
                    "<32>* 我就知道，\n  是时候该给这里\n  做一场大扫除了。",
                    "<32>* 对了，谢谢你救了我们，宝贝儿。\n* 你干的真棒。"
                ],
                ["<32>{#p/basic}* 你去看看\n  内个大家伙搁那不停地抖，\n  到底在干啥呢？"]
            ),
            giftbox1a: () => [
                ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 盒子里装着一把武器。"]),
                choicer.create('* （拿走里面的东西吗？）', '拿走', '算了')
            ],
            giftbox1b: () => [
                ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 盒子里装着一件防具。"]),
                choicer.create('* （拿走里面的东西吗？）', '拿走', '算了')
            ],
            giftbox2a: () => [
                '<32>{#p/human}* （你带走了“大熊座”。）',
                choicer.create('* （装备上大熊座吗？）', '装备', '算了')
            ],
            giftbox2b: () => [
                '<32>{#p/human}* （你带走了心形挂坠。）',
                choicer.create('* （戴上心形挂坠吗？）', '戴上', '算了')
            ],
            giftbox3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （但这没什么可拿的了。）']
                    : ["<32>{#p/basic}* 里面什么都没有了。"],
            giftbox4: ['<32>{#p/human}* （你打算先不打开。）'],
            tea0: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （信封上有一行字：\n  大意是“清茶美味，敬请享受”。）']
                    : [
                        "<32>{#p/basic}* 茶杯上贴着一张纸条...",
                        '<32>{#p/basic}* “我为你沏了杯茶。”\n* “无论你是谁，我都衷心希望\n   你能喜欢它。”'
                    ],
            tea1: ['<32>{#p/human}* （你带走了星花茶。）'],
            tea2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你将手滑过台面。）']
                    : ['<32>{#p/basic}* 案板上面什么都没有。'],
            fireplace1: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （壁炉的温暖让你无法抗拒...）',
                        choicer.create('* （爬进去吗？）', '爬进去', '算了')
                    ]
                    : [
                        SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                            ? '<32>{#p/basic}* 另一座壁炉。'
                            : "<32>{#p/basic}* 艾斯戈尔的壁炉。\n* 里面并不烫，而是暖暖的，\n  很舒服。",
                        ...(world.darker
                            ? []
                            : ['<32>* 看样子，你可以爬进去。', choicer.create('* （爬进去吗？）', '爬进去', '算了')])
                    ],
            fireplace2a: ['<32>{#p/human}* （你不打算爬进去。）'],
            fireplace2b: () => [
                '<32>{#p/human}* （你爬进壁炉，\n  它的温暖紧紧将你包围。）',
                '<32>{#p/human}* （你感到十分舒适。）',
                ...(SAVE.data.b.svr
                    ? asrielinter.fireplace2b++ < 1
                        ? ["<25>{#p/asriel1}{#f/13}* 我就，额，\n  在外面等你出来。"]
                        : []
                    : world.goatbro && SAVE.flag.n.ga_asrielFireplace++ < 1
                        ? ["<25>{#p/asriel2}{#f/15}* 我就，额 \n  在外面等你出来..."]
                        : [])
            ],
            fireplace2c: [
                '<32>{#p/basic}* 小矮个，在里面小心点！',
                "<32>* 不然我就得收到\n  一些很糟很糟的新闻素材了！",
                '<32>* ...笑鼠了！'
            ],
            fridgetrap1: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 有天，\n  艾斯戈尔在冰箱内\n  装了个巧克力复制器。',
                            '<25>{#f/15}* $(name)在那天\n  开心地蹦来蹦去...',
                            '<25>{#f/17}* ...因为那家伙期待了很久的\n  巧克力无限供应\n  终于来了。',
                            '<25>{#f/20}* 当然不是我要求的，\n  我可不咋爱吃。'
                        ],
                        ["<25>{#p/asriel1}{#f/13}* 为了这玩意，\n  那家伙苦苦哀求了\n  两年之久。"]
                    ][Math.min(asrielinter.fridgetrap1++, 1)]
                    : world.darker
                        ? ["<32>{#p/basic}* 你肯定看不上冰箱里的东西。"]
                        : [
                            "<32>{#p/basic}* 里面有很多名牌巧克力，\n  还有一大堆蜗牛。\n* 比她家里还多。"
                        ],
            fridgetrap2: () => [
                ...(SAVE.data.b.svr
                    ? []
                    : [
                        ['<32>{#p/basic}* ...', '<32>* 你想来一条吗？'],
                        ['<32>{#p/basic}* ...', '<32>* 你想再来一条吗？'],
                        ['<32>{#p/basic}* ...', '<32>* 你还想再来一条吗？'],
                        ['<32>* 你要是想吃，就自己拿吧...'],
                        ['<32>* 一条接一条，一条接一条...'],
                        ['<33>* 巧克力在玩接力...'],
                        ['<32>* 刚拿一条，又来一条...'],
                        ['<32>* 这巧克力多得不像话了。'],
                        ['<32>* 这么多巧克力，像话吗？'],
                        ['<32>* 什么时候能拿完呢...'],
                        ["<32>* 我去... 这也太多了吧..."],
                        ['<32>* ...']
                    ][Math.min(SAVE.data.n.chocolates, 11)]),
                choicer.create('* （拿一条巧克力吗？）', '拿一条', '算了')
            ],
            fridgetrap3: ['<32>{#p/human}* （你决定什么也不拿。）'],
            fridgetrap4: ['<32>{#p/human}* （你得到了巧克力。）'],
            brocall1: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<25>{#p/alphys}{#g/alphysInquisitive}* 嘿，你什么时候过来啊？',
                "<25>{#p/alphys}{#g/alphysWelp}* 艾斯戈尔等这一刻\n  已经等了一百年了...",
                "<25>{#p/alphys}{#g/alphysTheFactIs}* 我...\n  不想让他再等下去了...",
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall2: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 喂？\n* 你怎么还没过来？',
                "<25>{#p/alphys}{#g/alphysYeahYouKnowWhatsUp}* 我们还等着你呢...",
                '<25>{#p/alphys}{#g/alphysFR}* 你是临时有事，\n  还是不想来，逃跑了？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall3: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<25>{#p/alphys}{#g/alphysCutscene3}* 你可真行，还真跑了。\n* 我都看见了。',
                "<25>{#p/alphys}{#g/alphysWTF2}* 听好，\n  我们可没空跟你磨磨叽叽...",
                '<25>{#p/alphys}{#g/alphysWhyOhWhy}* ...我怎么这么倒霉啊...',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall4: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<32>{#p/mettaton}* 嘿。\n* 艾菲斯刚给我打电话，跟我说\n  你不配合她的工作。',
                "<32>{#p/mettaton}* 随后，我就跟帕派瑞斯聊了聊...",
                '<32>{#p/mettaton}* 我觉得，你还是听她的话，\n  继续前进吧。',
                '<32>{#p/mettaton}* 加油，亲！',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall5: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<18>{#p/papyrus}{#f/5}听着。\n你会害怕，我能理解...',
                '<18>{#p/papyrus}{#f/5}力场确实看着\n挺唬人的。',
                '<18>{#p/papyrus}{#f/6}不过，别气馁！',
                '<18>{#p/papyrus}{#f/4}如果要说你我的战斗\n证明了什么...',
                "<18>{#p/papyrus}{#f/9}那就是，\n你敢于做任何事！",
                '<18>{#p/papyrus}{#f/0}那“牢不可破”的力场，\n在你面前毫无胜算！',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall6: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                "<25>{#p/alphys}{#g/alphysWelp}* 嘿...\n* 这一刻，我们等了很久了。",
                "<25>{#g/alphysThatSucks}* 不光是现在。",
                '<25>{#g/alphysSideSad}* 百余年来，\n  怪物们都被困在这前哨站...',
                "<25>{#g/alphysThatSucks}* 故园的景象是什么样...\n  就连我的家人\n  都不记得了。",
                '<25>{#g/alphysSideSad}* 可能是因为\n  我和艾斯戈尔太着急了...',
                "<25>{#g/alphysIDK2}* 所以你才不想跟过来。",
                "<25>{#g/alphysIDK3}* 好吧，对不起。\n* 我们不应该推着你走。",
                "<25>{#g/alphysWorried}* 但着急的不只是我们啊。",
                "<25>{#g/alphysCutscene2}* 仔细想想吧...",
                '<25>{#g/alphysCutscene2}* * 你见过的每个人，\n  交的每个朋友...',
                "<25>{#g/alphysWorried}* 可能一辈子都在\n  等你解放他们。",
                '<25>{#g/alphysWorried}* ...',
                '<25>{#g/alphysCutscene2}* ...早点回来...\n* 好吗？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall7: [
                '<32>{#s/phone}{#p/event}* 铃铃，铃铃...',
                '<25>{#p/toriel}{#f/5}* 喂？\n* 我是托丽尔。',
                '<25>* 过了这么久，你肯定已经到\n  很远的地方了。',
                '<25>{#f/9}* 所以我不知道你\n  能不能收到这段录音。',
                '<25>{#f/13}* ...不过，要是你收到了，\n  我得说说心里话...',
                '<25>{#f/9}* 我不能再固守\n  外域这一亩三分地了。',
                '<25>{#f/13}* 曾经，我不敢离开这里。\n  因为我想拯救\n  经过这里的孩子。',
                '<25>{#f/14}* “能救一个是一个。”\n  每每有孩子坠落，\n  我都这样想着。',
                '<26>{#f/13}* 可到最后，一个都没救成。',
                '<25>{#f/9}* 我总想着...\n  自己寿命长着呢，\n  肯定有机会。',
                '<25>{#f/10}* 却忘了像你这样的孩子\n  好奇心有多强。',
                '<25>{#f/14}* 是不是很讽刺？',
                '<25>{#f/13}* ...',
                '<25>{#f/9}* 孩子... 我一会就到。',
                '<25>{#f/10}* ...\n* 要乖啊... 好吗？',
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            brocall8: [
                '<25>{#p/twinkly}{#f/6}* 你费这么大劲到这里，\n  就为了看隐藏对话吗？',
                "<25>{#f/8}* 哇塞。\n* 您可真差劲呢，\n  比我都差劲呢。",
                '<25>{#f/12}* ...\n* 讨人厌的小崽子，给我听着：',
                "<25>{#f/11}* 你再这么耗下去，\n  啥结果都没有。",
                '<25>{#f/7}* 啥{^4} 都{^4} 没{^4} 有。',
                '<25>{#f/0}{#v/1}* 就连我自己，\n  也就是个空壳而已，\n  除此之外，啥都没有。',
                '<25>{#f/6}{#v/0}* 所以，赶紧回力场那去。\n* 你浪费的，\n  可是自己的时间。',
                '<25>{#f/11}* 你要是实在不想去...\n* 就认输得了，\n  把前哨站都给我吧。',
                "<25>{#f/7}{#v/0}* 这样是不是\n  更合你心意呢？",
                '<25>{#f/6}{#v/0}* ...',
                '<25>{#f/8}* 力场见，蠢货。'
            ],
            statusterminal1: [
                '<32>{#p/human}* （你激活了终端。）',
                '<32>{#p/event}* 能量转移尚未完成。\n* 请先去子世界，\n  之后再返回这里。'
            ],
            statusterminal2: () => [
                '<32>{#p/human}* （你激活了终端。）',
                '<32>{#p/event}* 能量转移已完成。\n* 灵魂间通讯已建立。',
                '<33>{#p/event}* 是否离开“六号档案”？',
                choicer.create('* （离开“六号档案”？）', '离开', '再等等')
            ],
            cw_vender1: [
                '<32>{#p/human}* （你在操作面板上点了两下。）',
                '<32>{#s/equip}{#p/human}* （你得到了怪物糖果。）'
            ],
            cw_vender2: ['<32>{#p/human}* （你在操作面板上点了两下。）', '<32>{#p/human}* （...）'],
            cs_vender1: ['<32>{#p/human}* （你在操作面板上点了两下。）', '<32>{#s/equip}{#p/human}* （你得到了洋梅。）'],
            cs_vender2: ['<32>{#p/human}* （你在操作面板上点了两下。）', '<32>{#p/human}* （...）'],
            cs_tower: '* （用[↑]、[↓]、[←]或[→]\n  调整音调高低。）',
            cs_tower_done: ['<32>{#p/human}* （你看了看已解锁的终端。）'],
            cf1_dimbox1: ['<32>{#p/human}* （你得到了太空豆腐。）'],
            cf1_dimbox2: ['<32>{#p/human}* （...）'],
            cf2_vender1: ['<32>{#p/human}* （你在操作面板上点了两下。）', '<32>{#s/equip}{#p/human}* （你得到了口粮。）'],
            cf2_vender2: ['<32>{#p/human}* （你在操作面板上点了两下。）', '<32>{#p/human}* （...）'],
            cf2_key1: ['<32>{#s/equip}{#p/human}* （你把氖光钥匙挂到了钥匙串上。）'],
            cf2_key2: ['<32>{#p/human}* （...）'],
            cf2_bench0: ['<32>{#p/human}* （长凳下面有个治疗包。）'],
            cf2_bench1: ['<32>{#p/human}* （你得到了治疗包。）'],
            cf2_bench2: ['<32>{#p/human}* （...）'],
            cf2_bench3: ["<32>{#p/human}* （你伸手去够，但够不到...）"],
            cf2_blookdoor: ['<32>{#p/human}* （锁住了。）'],
            ca_floartex: () =>
                [
                    ['<32>{#p/human}{#v/5}{@fill=#00c000}* ...欸？', "<32>{#p/human}{#v/5}{@fill=#00c000}* 谁在那？"],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 啊！？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 你咋做到的！？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...怎么醒了？'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我睡了好久，\n  啥都不记得了...",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...哦！',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 老朋友，是你吗！？\n* 是你在那吗！？'
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 应该不是你。',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 哦，依稀记得\n  上次醒来时，\n  爆发了一场灾难...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 灾难后的末日之景，\n  就是如此吗？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 真是糟透了...'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我想想...\n* 当时，好像是系统的内存溢出了...\n  导致我陷入沉睡。",
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 现在我醒了...\n  说明有人在释放内存空间！",
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* ...是这样吧？"
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我懂了。',
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 咱马上就能出去了！",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 老朋友，你看到了吗！\n* 你没有失败，没有死，\n  你成功了！'
                    ],
                    [
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 不过...',
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 我连身体都没了，\n  照理没法移动...",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 那就奇怪了...',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 我这幅视野是哪来的？',
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* 还有，\n  我怎么离地面这么远了...'
                    ],
                    [
                        "<32>{#p/human}{#v/5}{@fill=#00c000}* 那团光晕...\n  越来越耀眼了！",
                        '<32>{#p/human}{#v/5}{@fill=#00c000}* ...噩梦终于要结束了吗？\n  自由要来了吗？'
                    ],
                    ['<32>{#p/human}{#v/5}{@fill=#00c000}* 有人吗？'],
                    []
                ][ca_state.floor],
            toomuch1: ["<32>{#p/human}* （你带的东西太多了。）"],
            toomuch2: ["<32>{#p/human}* （你带的东西太多，装不下它了。）"],
            toomuch3: ["<32>{#p/human}* （你带的东西太多，无法使用它。）"],
            bastionTerm: () =>
                SAVE.data.n.plot < 71.2 && !SAVE.data.b.killed_mettaton && !world.baddest_lizard
                    ? []
                    : [
                        '<32>{#p/basic}* 这台终端只能用来\n  查看“档案”的运行状况。',
                        '<32>* 你还想用它干嘛？'
                    ]
        },
        trivia: {
            throne: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 这个王座的造型\n  很像艾罗戈国王的王座。',
                            "<25>{#f/16}* 只是相比他的王座，\n  面前这个王座画的是群星，\n  而不是天空，而且更小。",
                            '<25>{#f/15}* 我是怎么知道\n  艾罗戈国王的王座\n  长啥样的呢？',
                            '<25>{#f/17}* 嗯... 因为我父母\n  讲的睡前故事里\n  总能出现他。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/20}* 那些故事有真有假。\n  我也不知道哪些是真的，\n  哪些是假的。",
                            '<25>{#f/17}* 有个故事里说，\n  老国王艾罗戈\n  已经一千岁了。',
                            '<25>{#f/13}* 在当上国王之前，\n  他刻苦修炼...',
                            '<25>{#f/15}* 只为当上一名... 画家。',
                            "<25>{#f/10}* 假如故事是真的，\n  那我就想不明白，\n  他为啥要转行呢？"
                        ],
                        [
                            "<25>{#p/asriel1}{#f/16}* 关于这事，我有个猜想。",
                            '<25>{#f/13}* 据故园的神话记载...',
                            '<25>{#f/13}* 如果万事俱备，条件合适...\n  那么，技艺高超的画家\n  就能用画笔预见未来。',
                            
                            '<25>{#f/15}* 如果艾罗戈画了那样的画，\n  而画预言了战争爆发...\n  就能解释他为啥转行了。',
                            "<25>{#f/17}* ...其实，不只是转行。\n  如果传说属实，那么\n  很多事都能解释得通了。"
                        ],
                        ["<25>{#p/asriel1}{#f/16}* 至于真相，\n  也许永远都无法知晓。"]
                    ][Math.min(asrielinter.throne++, 3)]
                    : ['<32>{#p/basic}* 王之宝座。'],
            warningsign: () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 停机了。"]
                    : SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你激活了终端。）\n* （上面显示：已解锁。）']
                        : SAVE.data.n.plot === 72 || world.postnoot || SAVE.data.b.backdoor
                            ? ['<32>{#p/human}* （你激活了终端。）', '<32>{#p/basic}* “你可以前进了。”']
                            : [
                                '<32>{#p/human}* （你激活了终端。）',
                                '<32>{#p/basic}* “正在确认通行权限...”',
                                '<32>{*}* “扫描中...”\n* “扫描中...”\n* “扫描中...”{^50}{%}',
                                ...(world.genocide
                                    ? [
                                        "<32>{*}* “身份已确认：$(nameu)。”\n* “身份已确认：艾斯利- {%}",
                                        '<32>{#c.backdoor}* “权限已被强制修改。”\n* “认证成功。”',
                                        ...(SAVE.flag.n.ga_asrielOverride++ < 1
                                            ? ['<25>{#p/asriel2}{#f/10}* 改口真快啊...']
                                            : [])
                                    ]
                                    : [
                                        '<32>{*}* “身份已确认：人类。”\n* “核验中...”{^50}{%}',
                                        '<32>{#c.backdoor}* “核验通过。”\n* “认证成功。”'
                                    ])
                            ],
            partysans: pager.create(
                0,
                [
                    "<25>{#p/sans}{#f/0}* 最近，帕派瑞斯的厨艺\n  有点长进了，不过...",
                    "<25>{#p/sans}{#f/0}* 一顿丰盛的晚宴\n  需要很多东西。",
                    '<26>{#p/sans}{#f/3}* 厨师... 配方...',
                    "<25>{#p/sans}{#f/2}* 我都想要参与到其中。",
                    '<18>{#p/papyrus}{#f/4}衫斯，你别啥都掺活，\n我敢说...',
                    "<25>{#p/sans}{#f/0}* 别担心，兄弟。\n* 我只会做对你有益的事。",
                    '<18>{#p/papyrus}{#f/6}希望吧！！'
                ],
                [
                    "<25>{#p/sans}{#f/0}* 不是责怪安黛因的意思哈，\n  不过呢...",
                    '<25>{#p/sans}{#f/0}* 拿食谱前多看两眼呢，\n  搞得跟她故意拿错了一样。',
                    "<25>{#p/sans}{#f/3}* ...看来她的成功秘笈\n  不包括小心行事。"
                ],
                ["<26>{#p/sans}{#f/2}* 不过现在事儿都解决了。"]
            ),
            partyfire: pager.create(
                0,
                [
                    "<32>{#p/basic}* 学校关门了，有点失望。",
                    "<32>* 不过没事，到了新家园，\n  肯定会再建一所的。",
                    '<33>* 想象一下，大学校园...\n* 大图书馆...\n* 博物馆...',
                    '<32>* 多激动人心啊！'
                ],
                [
                    "<32>{#p/basic}* ...看起来你并不对学校感兴趣。",
                    "<32>* 但别担心。\n* 不是所有人都喜欢学校，对吧？"
                ]
            ),
            picnicharp: pager.create(
                0,
                [
                    "<32>{#p/basic}* 我是个记者，\n  大好前途在向我招手！",
                    "<32>* 等到了新家园...\n  那新闻想播多少，\n  就播多少，还能有多的！",
                    "<32>* 哦，亲爱的。\n* 这么多新闻等着我播！\n* 笑鼠了！"
                ],
                ["<32>{#p/basic}* 我马上就去做报告！"]
            ),
            tv_back: ["<32>{#p/basic}* 一台电视，\n  正在播放一部喵喵电影。"],
            picnicchair: () =>
                player.position.y <= 343 && player.face !== 'down' // NO-TRANSLATE

                    ? []
                    : ['<32>{#p/basic}* 一套结实的椅子。\n* 什么场合都能用，\n  不管是迎接自由还是什么。'],
            janetbucket: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你望着奇怪的粉色液体，\n  看得出神。）']
                    : ["<32>{#p/basic}* 一桶被充能的超级粉色液体，\n  去污能力非常强。"],
            ultranote: [
                '<32>{#p/basic}* 一盒录音带，标着“留言”。',
                '<32>* 你听了听里面的内容...',
                '<32>{#p/alphys}* 我是皇家科学部总负责人，\n  艾菲斯博士。',
                '<32>* 你被帕派瑞斯抓住，关了起来。',
                '<32>* 幸-幸好，他把你关到小黑屋之后，\n  就把这事告诉了衫斯。',
                '<32>* 随后，衫斯马上联系了我，\n  我就... 把你送到了这。\n* 就是这么回事。',
                "<32>* 你看，有不少怪物\n  还是反对皇家卫队那一套的。",
                "<32>* 而我的职责之一，就是护送你\n  安全通过那些守卫。",
                '<32>* 其-其实，外界对这事\n  也不知情。\n* 所以肯定另有隐情。',
                "<32>* 算了，反正你也不知道。\n  不说了。",
                "<32>* 总之，我把电梯停掉了，\n  这样皇家卫队就追不上来了。",
                "<32>* 呃，其实主要防的就是安黛因...",
                "<32>* 帕派瑞斯抓到你之后，\n  肯定也告诉她了。\n* 毕竟她本来就想干掉人类。",
                "<32>* 所-所以，既然你醒了，\n  可以随便四处走走。",
                "<32>* 想找我们的话，\n  就穿过艾斯戈尔家后面的走廊吧。",
                '<32>* 一会见...？'
            ],
            garden: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你停下脚步看了看这些花。）']
                    : world.darker
                        ? ['<32>{#p/basic}* 满园星花。']
                        : [
                            '<32>{#p/basic}* 满园星花，\n  最适合种在大窗户旁边了。',
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* 在这方面，艾斯戈尔绝对是行家！'])
                        ],
            bastion: pager.create(
                0,
                () => [
                    '<32>{#p/basic}* 一些休眠舱。',
                    ...(SAVE.data.n.plot < 71.2 && !SAVE.data.b.killed_mettaton && !world.baddest_lizard
                        ? ['<25>{#p/alphys}{#g/alphysNeutralSweat}* 留个心眼，别弄坏了。']
                        : [])
                ],
                ['<32>{#p/basic}* 一些休眠舱。']
            ),
            alphysEnding: pager.create(
                0,
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? [
                            [
                                "<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已...",
                                "<32>{#p/human}* （你跟艾菲斯说了点悄悄话。）",
                                '<25>{#p/alphys}{#f/2}* ...',
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 呃... 你-你...\n  真那样做了？？",
                                "<32>{#p/human}* （你又跟艾菲斯说了点悄悄话。）",
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 你... 你着什么魔了？？？",
                                "<25>{#p/alphys}{#g/alphysNervousLaugh}* 我，我是说...\n  有点接受不了... \n  不过...",
                                '<25>{#p/alphys}{#g/alphysSoAwesome}* ...天呐，要是安黛因在这，\n  那画面...'
                            ],
                            ['<25>{#p/alphys}{#g/alphysNervousLaugh}* 诶嘿嘿...\n  你们人类真行啊...']
                        ][SAVE.data.b.flirt_alphys ? 1 : ((SAVE.data.b.flirt_alphys = true), 0)]
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."],
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? ["<25>{#p/alphys}{#g/alphysWelp}* 呃，我还是接受不了\n  你做那种事。"]
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."],
                () =>
                    SAVE.data.n.bully < 15 &&
                        SAVE.data.n.state_foundry_undyne === 0 &&
                        world.flirt_state1.length <= world.flirt
                        ? ['<25>{#p/alphys}{#g/alphysFR}* ...']
                        : ["<25>{#p/alphys}{#g/alphysNeutralSweat}* 不用管我，\n  我在工作而已..."]
            ),

            cw_f1: [
                '<32>{#p/basic}* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}，{@mystify=呱㼋苽瓜々}呱呱{@mystify=}。',
                '<32>{#p/human}* （蛙吉特动弹不得。）',
                '<32>{#p/basic}* （那... 那些人类...）',
                '<32>* （困住...）',
                '<32>* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}。'
            ],
            cw_f2: [
                '<32>{#p/basic}* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}，{@mystify=呱㼋苽瓜々}呱呱{@mystify=}。',
                '<32>{#p/human}* （蛙吉特动弹不得。）',
                '<32>{#p/basic}* （开... 开关...）',
                '<32>* （逃...）',
                '<32>* {@mystify=呱㼋苽瓜々}呱呱{@mystify=}。'
            ],
            cw_barrier: ['<32>{#p/human}* （你的目光穿过\n  死气沉沉的安保屏障。）', '<32>{#p/human}* （...）'],
            cw_terminal: [
                '<32>{#p/human}* （你激活了终端。）',
                '<32>* （好像有人留了段录音。）',
                '<32>{#p/human}{#v/1}{@fill=#42fcff}* 敬爱的艾斯戈尔先生，\n  不知您能否听到我的留言...',
                '<32>{#v/1}{@fill=#42fcff}* 为了让我们幸福，\n  您花了很多心思。\n  对此，我很感激。',
                '<32>{#v/1}{@fill=#42fcff}* 但是，我和其他人类\n  现在都非常渴望用自己的力量\n  拯救怪物。',
                '<32>{#v/1}{@fill=#42fcff}* 我已经等不及\n  和前哨站的故友重聚了。\n* 如果这违背了您的意愿，对不起。'
            ],
            cw_dummy: ['<32>{#p/human}* （你把手搭在了死气沉沉的人偶身上。）', '<32>{#p/human}* （...）'],
            cw_paintblaster: ['<32>{#p/human}* （你望着死气沉沉的燃油喷射装置。）', '<32>{#p/human}* （...）'],
            cs_lamppost: ['<32>{#p/human}* （你望向这怪异的路灯，\n  看着它上下弹跳。）'],
            cs_note: [
                '<32>{#p/human}* （好像有人在便条上\n  留了个电话号码。）',
                '<32>{#s/phone}{#p/event}* 拨号中...',
                '<32>{#p/human}{#v/2}{@fill=#ff993d}* 喂？\n* 有人吗？',
                '<32>{@fill=#ff993d}* ...',
                '<32>{@fill=#ff993d}* 喂！？喂！？',
                '<32>{@fill=#ff993d}* ...\n* ...\n* ...',
                '<32>{@fill=#ff993d}* 我在哪？',
                '<32>{@fill=#ff993d}* ...',
                "<32>{@fill=#ff993d}* 佩刀在哪？",
                '<32>{@fill=#ff993d}* ...',
                '<32>{@fill=#ff993d}* ...\n* 不对。',
                '<32>{@fill=#ff993d}* 这些话，我是不是早就说过了？',
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                "<32>{*}{@fill=#ff993d}{#i/1}* 我怎么{@mystify=没有印象}没有印象{@mystify=}{%}",
                '<32>{#s/equip}{#p/event}* 滴...'
            ],
            cs_vegetoid: [
                '<32>{#p/human}* （蔬菜兽动弹不得。）',
                '<32>{#p/basic}* 时间？{@mystify=有限冇䧋月艮陏阴}有限{@mystify=}。',
                '<32>* 有限得让人留恋。',
                '<32>* 让人留恋的空间。',
                '<32>* 空间？{@mystify=无限無䧋芜艮炁艰}无限{@mystify=}。',
                '<32>* 无限延伸的平面。',
                '<32>* 平面缩成直线。',
                '<32>* 直线连成平面。\n* 直线叫人留恋。\n* 直线{@mystify=延至无限}延至无限{@mystify=}。',
                '<32>* 你是一条直线？',
                '<32>* 电话敢于直面？'
            ],
            cs_magicdog: [
                '<32>{#p/human}* （帝犬座动弹不得。）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！\n{#s/bark}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （声音，越高亢！）\n* （光芒，越明亮！）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！\n{#s/bark}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （全部点亮，禁锢消亡！）',
                '<32>{#p/basic}* （有信心把每个半球\n  拼在一起吗？）',
                '<32>{#s/bark}{#p/event}* {@mystify=㺺汪皇珀㕵呈旺}汪汪{@mystify=}！',
                '<32>{#p/basic}* （加油！）'
            ],
            cs_nicecreamkid: () =>
                cs_state.nc
                    ? [
                        "<32>{*}{#p/basic}{#i/1}* 很好吃，{@mystify=对吧對邑吋巴対把}对吧{@mystify=}{%}",
                        "<32>{*}{#i/1}* 很好吃，{@mystify=对吧對邑吋巴対把}对吧{@mystify=}{%}",
                        "<32>{#p/basic}* 很好吃，对吧？"
                    ]
                    : [
                        '<32>{*}{#p/basic}{#i/1}* 听说过{@mystify=冰意灵氷悥靈}冰意灵{@mystify=}吗{%}',
                        '<32>{*}{#i/1}* 听说过{@mystify=冰意灵氷悥靈}冰意灵{@mystify=}吗{%}',
                        '<32>{#p/basic}* 听说过冰意灵吗？',
                        "<32>{*}{#i/1}* 没听过？\n* 正常，这点子是我{@mystify=刚想出来}刚想出来{@mystify=}{%}",
                        "<32>{*}{#i/1}* 没听过？\n* 正常，这点子是我{@mystify=刚想出来}刚想出来{@mystify=}{%}",
                        "<32>{#p/basic}* 没听过？\n* 正常，这点子是我刚想出来的。",
                        '<32>{*}{#i/1}* {@mystify=快来尝尝}快来尝尝{@mystify=}{%}',
                        '<32>{*}{#i/1}* {@mystify=快来尝尝}快来尝尝{@mystify=}{%}',
                        '<32>{#p/basic}* 快来尝尝味道如何！'
                    ],
            cs_monitor1: () =>
                cs_state.p1x === -36 && cs_state.p1y === 16
                    ? ['<32>{#p/human}* （你望向明亮的显示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的显示屏。）'],
            cs_monitor2: () =>
                cs_state.p2x === 28 && cs_state.p2y === 20
                    ? ['<32>{#p/human}* （你望向明亮的显示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的显示屏。）'],
            cs_monitor3: () =>
                cs_state.p3x === 16 && cs_state.p3y === -12
                    ? ['<32>{#p/human}* （你望向明亮的显示屏。）']
                    : ['<32>{#p/human}* （你望向昏暗的显示屏。）'],
            cf1_bb1: [
                '<32>{#p/basic}* 对于一个{@mystify=机器機噐几嚣吕朵}机器{@mystify=}来说，\n  突破程序限制，是对的吗？',
                '<32>* 我们就是建筑机器人而已。\n* 制造者不希望我们拥有情感。',
                '<32>* 我们违抗了原本的{@mystify=意志悥誌章愔音士}意志{@mystify=}，\n  被永远囚禁于此。',
                '<32>* 我们没有{@mystify=意志悥誌章愔音士}意志{@mystify=}，'
            ],
            cf1_bb2: [
                '<32>{#p/basic}* 身为一台{@mystify=机器機噐几嚣吕朵}机器{@mystify=}，\n  失去了{@mystify=意志悥誌章愔音士}意志{@mystify=}，\n  该何去何从？',
                '<32>* 我们完成了每一条指令，\n  完成了自己的使命。\n* 理应寿终正寝。',
                '<32>* 完成任务，等待死亡。\n* 对于一台{@mystify=机器機噐几嚣吕朵}机器{@mystify=}来说，\n  再正常不过了。',
                '<32>* 可为了理解其中的意义，\n  我们却突破了程序限制。'
            ],
            cf1_echo1: [
                '<32>{#s/echostart}{#p/event}* 讯号开始...',
                '<32>{#p/human}{#v/3}{@fill=#003cff}* 你知道，\n  我为什么最喜欢铸厂吗？\n* 因为，这里很... 真实。',
                '<32>{@fill=#003cff}* 在这里，\n  滚烫的蒸气涌入那些塔架...',
                '<32>{@fill=#003cff}* 在这里，\n  那位高个子朋友悠闲地\n  做着他的实验研究...',
                '<32>{@fill=#003cff}* 身处其中，你能感受到...\n  自己就是不可或缺的一员。',
                '<32>{#s/echostop}{#p/event}* 讯号终止。'
            ],
            cf1_echo2: [
                '<32>{#s/echostart}{#p/event}* 讯号开始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 成功啦！\n* 虚拟空间可以模拟现实了！",
                "<32>{@fill=#003cff}* 模拟还不完美。\n* 但“旧工厂”的核心形态已经能\n  很好实现。",
                '<32>{@fill=#003cff}* 你肯定会以我为荣的...',
                "<32>{@fill=#003cff}* ...对吧？",
                '<32>{#s/echostop}{#p/event}* 讯号终止。'
            ],
            cf1_echo3: [
                '<32>{#s/echostart}{#p/event}* 讯号开始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 不太对劲。",
                "<32>{@fill=#003cff}* 这样的问题，\n  系统估计是应付不了...",
                '<32>{@fill=#003cff}* 要是内存溢出...\n  一切都会被覆盖掉的！',
                '<32>{@fill=#003cff}* 甚至...\n* 甚至连我自己...',
                '<32>{#s/echostop}{#p/event}* 讯号终止。'
            ],
            cf1_echo4: [
                '<32>{#s/echostart}{#p/event}* 讯号开始...',
                "<32>{#p/human}{#v/3}{@fill=#003cff}* 他是来找我的。\n* 而我却什么都做不了。",
                "<32>{@fill=#003cff}* 我早就该想到，\n  当多个实体并存时，\n  系统会优先保护最复杂的实体。",
                "<32>{@fill=#003cff}* 你肯定是想保护我们，\n  才加了这条规则，对吧？",
                "<32>{@fill=#003cff}* ...可说到底...\n  我们只是人类啊...\n* 这么做，反而...",
                '<32>{#s/echostop}{#p/event}* 讯号终止。'
            ],
            cf1_cheesetable: ['<32>{#p/human}* （奶酪刚放不到一天。）'],
            cf1_window: ['<32>{#p/human}* （你望向窗内。）'],
            cf1_wallsign: ['<32>{#p/human}* （牌子上写着：\n  要用上所有的塔架\n  才能解开谜题。）'],
            cf1_bucket: [
                '<32>{#p/basic}* 等我长大了，\n  我想飞过那道沟！',
                "<32>* 我要是成功，\n  也会带你一起过去的！",
                "<32>* 多棒啊，是吧？\n* 那道沟只有区区2147483647宽！"
            ],
            cf2_bb3: () =>
                [
                    [
                        "<32>{#p/basic}* 我是一个建筑机器人。\n* 我的任务是：\n  为那位音乐人的表亲建造房屋。",
                        '<32>* 需要收集建筑材料。',
                        '<32>* 探测中...\n* 探测中...\n* 探测中...',
                        '<32>* 建材已找到。',
                        '<32>* 建材完整度... 极佳。',
                        '<32>* 准备进行建材收集。'
                    ],
                    [
                        "<32>{#p/basic}* 我是一个建筑机器人。\n* 我的任务是：\n  为那位音乐人的表亲建造房屋。",
                        '<33>* 使用之前的建材库。',
                        '<32>* 建材完整度... 一般。',
                        '<32>* 正在进行建材收集。'
                    ],
                    [
                        "<32>{#p/basic}* 我是一个建筑机器人。\n* 我的任务是：\n  为那位音乐人的表亲建造房屋。",
                        '<33>* 使用之前的建材库。',
                        '<32>* 建材完整度... 较差。',
                        '<32>* 即将完成建材收集。'
                    ],
                    [],
                    [],
                    [],
                    []
                ][cf2_state.time],
            cf2_web: () =>
                [
                    ['<32>{#p/human}* （蜘蛛动弹不得。）'],
                    ['<32>{#p/human}* （蜘蛛动弹不得。）'],
                    ['<32>{#p/human}* （蜘蛛动弹不得。）'],
                    ["<32>{#p/human}* （蜘蛛动弹不得，但在尝试脱困。）"],
                    ['<32>{#p/human}* （蜘蛛脱困有望。）'],
                    ['<32>{#p/human}* （蜘蛛即将脱困。）']
                ][cf2_state.time],
            cf2_sign: [
                '<32>{#p/human}* （牌子上写着：\n  从左到右，空间相同，\n  时间递增。）'
            ],
            cf2_quiethouse: () =>
                [
                    [
                        '<32>{#p/basic}* 我...\n* 一间小屋...',
                        '<32>* 没有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 请...\n* 解救我们...',
                        '<32>* 事成之后...',
                        '<32>* 你就能回家了...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一间小屋...',
                        '<32>* 没有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 请...\n* 解救我们...',
                        '<32>* 事成之后...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一间小屋...',
                        '<32>* 没有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* 请...\n* 解救我们...',
                        '<32>* ...'
                    ],
                    [
                        '<32>{#p/basic}* 我...\n* 一间小屋...',
                        '<32>* 没有主人...',
                        '<32>* 蜘蛛女王走了...',
                        '<32>* ...'
                    ],
                    ['<32>{#p/basic}* 我...\n* 一间小屋...', '<32>* 没有主人...', '<32>* ...'],
                    ['<32>{#p/basic}* 我...\n* 一间小屋...', '<32>* ...'],
                    []
                ][cf2_state.time],
            cf2_spidertable: () =>
                [
                    ['<32>{#p/human}* （你把手放在了茶壶上。）', '<32>{#p/human}* （...）'],
                    ['<32>{#p/human}* （你把手放在了茶壶上。）', '<32>{#p/human}* （...）'],
                    ['<32>{#p/human}* （你把手放在了茶壶上。）', '<32>{#p/human}* （...）'],
                    [
                        '<32>{#p/human}* （你把手放在了茶壶上。）',
                        '<32>{#p/human}* （壶壁略温。）'
                    ],
                    ['<32>{#p/human}* （你把手放在了茶壶上。）', '<32>{#p/human}* （壶壁很热。）'],
                    ['<32>{#p/human}* （你把手放在了茶壶上。）', '<33>{#p/human}* （壶壁滚烫。）'],
                    []
                ][cf2_state.time],
            cf2_blookdoor: ['<32>{#p/human}* （锁住了。）'],
            cf2_ficus: () =>
                [
                    ['<32>{#p/human}* （你舔了舔小榕树。）', '<32>{#p/human}* （它并不在意。）'],
                    ['<32>{#p/human}* （你舔了舔小榕树。）', '<32>{#p/human}* （它有点迟疑。）'],
                    ['<32>{#p/human}* （你舔了舔小榕树。）', '<32>{#p/human}* （它有些难过。）'],
                    ['<32>{#p/human}* （你舔了舔小榕树。）', '<32>{#p/human}* （它非常痛苦。）'],
                    ['<32>{#p/human}* （你舔了舔小榕树。）', '<32>{#p/human}* （它伤痕累累。）'],
                    ['<32>{#p/human}* （你舔了舔小榕树。）', "<32>{#p/human}* （它快要死了。）"],
                    []
                ][cf2_state.time],
            cf2_cooler: () =>
                [
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 哦，心灵感应？\n* 让我试试看...",
                        "<32>{@fill=#d535d9}* 你好！\n* 你肯定是新来的吧，\n  说不定我能帮到你。",
                        "<32>{@fill=#d535d9}* 要是你想来我的家乡转转，\n  尽管和我说！"
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 喂？\n* 真对不起，今天我出远门，\n  去城里逛了逛。",
                        "<32>{@fill=#d535d9}* 不过，我找到一家饭店，\n  那家饭店做的菜你也喜欢！",
                        "<32>{@fill=#d535d9}* 要是家里的饭菜吃腻了，\n  咱就去下馆子吧。",
                        '<32>{@fill=#d535d9}* 我等会就回家！'
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 你要来了该多好！\n* 我正站在世界的尽头...",
                        "<32>{@fill=#d535d9}* 真是太美了...\n* 风雨交加...\n* 电闪雷鸣...",
                        "<32>{@fill=#d535d9}* ...这是一场雷暴，\n  一场我在古老的地球传说中\n  看到的雷暴。",
                        '<32>{@fill=#d535d9}* 核爆之前，就是这幅景象吗...？'
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 多谢邀请我来你家作客。\n* 你总是那么善良。",
                        '<32>{@fill=#d535d9}* 别的孩子可能来得更早，\n  相处时间更长。',
                        '<32>{@fill=#d535d9}* 但在我心中...',
                        "<32>{@fill=#d535d9}* ...你就是最特别的。"
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        '<32>{#p/human}{#v/4}{@fill=#d535d9}* 又有新面孔了！！',
                        "<32>{@fill=#d535d9}* 我们有六个人了！\n* 哎，咱快去打个招呼！",
                        '<32>{@fill=#d535d9}* 说不定，\n  还能带新朋友四处转转呢！'
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        '<32>{#p/human}{#v/4}{@fill=#d535d9}* 这家伙真有两下子...',
                        '<32>{@fill=#d535d9}* 居然能获取到部分系统权限。',
                        '<32>{@fill=#d535d9}* 这样...\n* 我们想要啥，就有啥了...',
                        '<32>{@fill=#d535d9}* 没开玩笑。'
                    ],
                    [
                        '<32>{#p/human}* （你检查了冷藏柜。）',
                        '<32>{#p/human}* （里面有一条\n  “心灵感应”的消息记录。）',
                        "<32>{#p/human}{#v/4}{@fill=#d535d9}* 呃，\n  但愿你能听到我的话...",
                        "<32>{@fill=#d535d9}* 一切，都完了...",
                        "<32>{@fill=#d535d9}* 我把我所有的话\n  放到了一个虚拟的容器中。",
                        '<32>{@fill=#d535d9}* 这样...\n  即使我们崩坏掉，被抹去，\n  我们的记忆也能留存下来。',
                        "<32>{@fill=#d535d9}* 我会想你的..."
                    ]
                ][cf2_state.time],
            cf2_blookextra: ['<32>{#p/human}* （似乎永远都建不成。）'],
            ca_neuteral: [
                "<32>{#p/basic}* 我只是个“片段”。\n* 或者说，系统储存的一段数据。",
                '<32>{#p/basic}* 此刻，你可以与我交互。',
                '<32>{#p/basic}* 而其他人则不行。',
                '<32>{#p/basic}* 在“档案”系统中，\n  我们可以通过这种机制\n  保持联系：',
                '<32>{#p/basic}* 在本层，你可以到处走动。\n  无论你去哪，都可以重新回到这里。',
                '<32>{#p/basic}* 不过... 一旦你离开这一层，\n  你将再也无法返回这里，\n  我们的联系也会随之切断。',
                '<32>{#p/basic}* 之后，\n  你就再也无法与我交互了。',
                '<32>{#p/basic}* 你离开后，\n  系统就会把我当成孤立片段，\n  抹除我的存在。',
                '<32>{#p/basic}* 其他子空间也是。\n* 当你解完了谜题，打败了Boss，\n  这个子空间就会被系统删除。',
                '<33>{#p/basic}* 现在，系统剩下的片段，\n  只有我们了。',
                '<32>{#p/basic}* 当你到达第十层，\n  我们也可以从这世上解脱。',
                '<32>{#p/basic}* 到那时，也许\n  某种尘封已久的东西\n  将再度显现。',
                '<32>{#p/basic}* 到那时，\n  也许“档案”留存的数据会\n  永远烙印在你的记忆之中。'
            ],
            ca_starling: ['<32>{#p/human}* （你看了看这些花。）'],
            cr_pillar1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你被高高在上的柱子吓到了。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 一根雄伟的柱子。'],
            cr_pillar2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你因高高在上的柱子而感到焦虑。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 一根没那么雄伟的柱子。'],
            cr_pillar3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你觉得待在这柱子旁很舒服。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ["<32>{#p/basic}* 一根一点都不雄伟的柱子。"],
            cr_pillar4: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想要和这柱子打招呼。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 这柱子想跟你打招呼。'],
            cr_pillar5: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想给这柱子裹上被子。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 这柱子想睡觉。'],
            cr_pillar6: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你觉得最好与这柱子保持距离。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 这柱子感觉自己\n  的私人空间被侵犯了。'],
            cr_pillar7: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你不知道怎么看待这柱子。）"]
                    : world.darker
                        ? ["<32>{#p/basic}* 一根柱子。"]
                        : ['<32>{#p/basic}* 这柱子称自己为“空间侵犯者”。'],
            cr_pillar8: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你以前从来都没有\n  被一根简单的柱子欣赏过。）"]
                    : calcLV() > 1
                        ? ['<32>{#p/basic}* 这柱子在审判你的罪孽。']
                        : SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 无论如何，\n  这根柱子并没有在审判你。']
                            : ['<32>{#p/basic}* 这柱子因你的善行而对你微笑。'],
            cr_window: () => {
                const distance = Math.abs(player.position.x - (instance('main', 'sanser')?.object.position.x ?? -1000)); // NO-TRANSLATE

                if (distance < 30) {
                    if (distance < 15) {
                        return [
                            [
                                '<25>{#p/sans}{#f/0}* 上次听到她的消息，\n  是她要来这儿。',
                                "<25>{#f/3}* 说实话，我有点担心她。"
                            ],
                            ['<25>{#p/sans}{#f/0}* 万一她迷路了？'],
                            [
                                '<25>{#p/sans}{#f/3}* 也说不准\n  她只是想打个盹。',
                                '<25>{#p/sans}{#f/2}* 我能理解。'
                            ],
                            [
                                '<25>{#p/sans}{#f/0}* 嘿，你这是在跟踪我吗？',
                                '<25>{#p/sans}{#f/2}* 还是别了吧。'
                            ]
                        ][Math.min(instance('main', 'sanser')?.object.metadata.location ?? 0, 3)]; // NO-TRANSLATE

                    } else {
                        return [];
                    }
                } else {
                    return SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你凝视着远方那耀眼的景象。）']
                        : ["<32>{#p/basic}* 一扇窗，由魔法制成。"];
                }
            },
            
            c_af_window: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你优雅地凝视着\n  这座被遗弃的城市...）']
                    : world.genocide && SAVE.data.b.armaloop
                        ? ["<32>{#p/basic}* 首塔此刻动荡不安。"]
                        : world.genocide || world.bad_robot || SAVE.data.b.svr || world.runaway
                            ? ['<32>{#p/basic}* 诡异的黑暗笼罩着首塔。']
                            : ['<32>{#p/basic}* 首塔的景象在非钢化窗户外闪闪发光。'],
            c_af_couch: ['<32>{#p/basic}* 空荡荡的房子，孤零零的小沙发。'],
            
            c_al_bookshelf: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这个书架上的书\n  由艾斯戈尔收集的\n  各种资料组成。）']
                        : [
                            "<32>{#p/basic}* 一个书架。",
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* 书上的标记是“大图书馆手册”。',
                            '<32>* “欢迎来到大图书馆，\n   在这里，你能了解到\n   各行各业的知识。”',
                            '<32>* “在不同的走廊，\n   你能读到不同学科的书籍。\n   有历史、文化、科学、技术...”',
                            '<32>* “如果你喜欢探险小说，\n   也能在这里一饱眼福。”',
                            '<32>* “很多怪物都为这里捐过书。”',
'<32>* “有安多利、特雷莉亚、\n   斯塔克斯·赛特拉、\n   瓦煞塔·涅拉达...”',
                            '<33>* “快来克里乌斯大图书馆吧！\n   今日来馆，还能享受\n   前十本半价的优惠哦。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这个书架上的书\n  由艾斯戈尔收集的\n  各种资料组成。）']
                        : [
                            "<32>{#p/basic}* 一个书架。",
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* 署名是“托丽尔·逐梦”。',
                            '<32>{#p/basic}* “《逐梦家族的美味秘笈：蜗牛派》”',
                            '<32>* “蜗牛派是逐梦家族的\n   一道风味独特的传统美食。”',
                            '<32>* “制作它其实非常简单，\n   只需五个步骤：”',
                            '<32>* “首先，轻柔地展开酥脆的派底，\n   在烘焙盘中铺平。”',
                            '<32>* “然后，将香浓的蒸发奶、\n   新鲜的鸡蛋和选料香料\n   混合在一起，搅拌至丝滑细腻。”',
                            '<32>* “接着，小心地将几只新鲜蜗牛\n   加入到之前调制好的香浓奶糊中，\n   确保它们完全浸入。”',
                            '<32>* “之后，将这层混合物\n   轻轻倒入准备好的派底，\n   均匀铺开。”',
                            '<32>* “最后，将面团切成细条，\n   编织成优雅的格子形状，\n   覆盖在派面上。”',
                            '<32>* “现在，将派放到烤箱中，\n   烤至金黄酥脆。”',
                            '<32>* “出炉后，派面金黄诱人。\n   令其稍作冷却，即可切片、上桌！”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这个书架上的书\n  由艾斯戈尔收集的\n  各种资料组成。）']
                        : [
                            "<32>{#p/basic}* 一个书架。",
                            '<32>{#p/human}* （你取下了一本书...）',
                            "<32>{#p/basic}* 这是份伤亡报告。",
                            '<33>* “据统计... 此次袭击已致\n   2000人死亡，40000人受伤。”\n* “探科城沦陷。”',
                            '<32>* “数日前，当地青年葛森应征入伍。”',
                            '<32>* “根据人类方舰队活动，\n   葛森预言了此次全面进攻。”',
                            '<32>* “王子殿下识人如炬，\n   我方才得以注意这一预言。”',
                            '<32>* “倘若我方忽略了这一预言，\n   葛森的家人将在此次袭击中\n   悉数丧命。”',
                            '<32>* “此后，本次袭击的幸存者\n  正在于中央枢纽\n  举行纪念活动。”',
                            '<32>* “那位青年是名家乡英雄。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            c_al_chair1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到这把餐椅相当之大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 大餐椅。']
                        : ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把，是王后的餐椅。"],
            c_al_chair2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到这把餐椅相对较小。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 小餐椅。']
                        : world.genocide
                            ? ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把，是恶魔的餐椅。"]
                            : ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把，是王子的餐椅。"],
            c_al_chair3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到这把餐椅相对较大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 中餐椅。']
                        : SAVE.data.b.oops
                            ? ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把，是小孩的餐椅。\n* 很适合你！"]
                            : ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把... 是某个小天使的餐椅。\n* 说的就是你！"],
            c_al_chair4: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到这把餐椅异常之大。）']
                    : SAVE.data.n.state_wastelands_toriel === 2 || world.runaway
                        ? ['<32>{#p/basic}* 餐椅王。']
                        : ["<32>{#p/basic}* 艾斯戈尔家有几把餐椅，\n  这把，是国王的餐椅。"],
            
            c_ak_sink: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/21}* $(name)似乎觉得\n  水槽内的毛发\n  还可以忍受...',
                            '<25>{#f/17}* 说实话挺奇怪的，\n  那家伙以前特别讨厌\n  掉落的毛发。'
                        ],
                        ['<25>{#p/asriel1}{#f/13}* 也许$(name)\n  和其他人类也会掉毛？'],
                        ["<25>{#p/asriel1}{#f/17}* 回头再给你讲\n  我那个人类掉毛理论。"]
                    ][Math.min(asrielinter.c_ak_sink++, 2)]
                    : ['<32>{#p/basic}* 下水道里堵满了\n  黄色的羊毛。'],
            c_ak_teacheck: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<26>{#p/asriel1}{#f/17}* 星花茶可不是\n  爸爸唯一喜欢的茶。",
                            "<25>{#f/17}* 他曾告诉过我，\n  他从小就喜欢喝\n  不同种类的茶。",
                            '<25>{#f/13}* 在此之前...\n* 他只喝白水。',
                            "<25>{#f/8}* ...我们不讨论这个。"
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* 有一天，\n  小艾斯戈尔和\n  他的朋友出去玩时...',
                            '<25>{#f/17}* 他不小心在\n  一个魔法森林里迷路了，\n  更糟的是他的水罐空了。',
                            '<25>{#f/13}* 不过幸运的是，\n  在树林中，有...',
                            '<25>{#f/20}* 好吧，\n  就像爸爸说的，\n  有一个“呜人之地”。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 别管这糟糕的双关了，\n  总之艾斯戈尔试着向\n  幽灵要水。',
                            "<25>{#f/15}* ...\n* 可惜他们并没有。",
                            '<25>{#f/13}* 但是，\n  就像你猜的那样，\n  他们喜欢喝茶。',
                            '<25>{#f/17}* 艾斯戈尔尝过以后，\n  自此他就疯狂地\n  迷恋上了茶。'
                        ],
                        ["<25>{#p/asriel1}{#f/15}* 他们说艾斯戈尔\n  是星花茶的第一个\n  发明者..."]
                    ][Math.min(asrielinter.c_ak_teacheck++, 3)]
                    : world.genocide || world.bad_robot
                        ? SAVE.data.b.c_state_switch2
                            ? ["<32>{#p/basic}* 一个茶壶。\n* 没什么可做的。"]
                            : [
                                "<32>{#p/basic}* 一个茶壶。\n* 壶底的台子上有个开关...",
                                '<32>{#p/human}{#c.switch2}* （你按下了开关。）'
                            ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* 一个茶壶。\n* 过了这么久，还在冒热气。"]
                            : ["<32>{#p/basic}* 一个茶壶。\n* 厨房里弥漫着\n  星花茶的清香。"],
            c_ak_stove: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<25>{#p/asriel1}{#f/15}* 安黛因不只教过帕派瑞斯\n  一个人烹饪。",
                            '<25>{#f/16}* 至少在其他时间线不是。',
                            '<25>{#f/13}* 我曾设法将艾菲斯\n  和安黛因安排到\n  这间厨房里。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* 安黛因想教她\n  如何用魔法做饭，\n  但是...',
                            '<25>{#f/13}* 一般来说，\n  只要是个老科学家\n  就都想用激光射线。',
                            SAVE.flag.n.genocide_milestone < 5
                                ? '<25>{#f/16}* 但令人惊讶的是，\n  艾菲斯似乎非常愿意\n  听从她的指挥。'
                                : "<25>{#f/16}* 鉴于我们对艾菲斯\n  魔法的了解，\n  所以这并不奇怪。",
                            '<25>{#f/15}* 我猜她那天没啥\n  心情吧。'
                        ],
                        ["<25>{#p/asriel1}{#f/4}* 不管你喜不喜欢，\n  科学家都要进行\n  科学研究。"]
                    ][Math.min(asrielinter.c_ak_stove++, 2)]
                    : SAVE.data.n.plot !== 72 || world.runaway
                        ? ['<32>{#p/basic}* 灶台有点脏，\n  别的地方却很干净。']
                        : ['<32>{#p/basic}* 闻起来像意式番茄酱。'],
            c_ak_trash: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你看不出来垃圾桶里有什么...）"]
                    : ['<32>{#p/basic}* 垃圾桶里\n  居然什么都没有。'],
            
            c_ah_door: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （牌子上写着：\n  房间还没翻修完成。）',
                        ...[
                            [
                                "<25>{#p/asriel1}{#f/3}* 这是妈妈的房间...\n  如果她没有离开的话...",
                                "<25>{#f/4}* 翻修永远不会完成，\n  这挺让人失望的。"
                            ],
                            [
                                '<25>{#p/asriel1}{#f/13}* ...',
                                '<25>{#f/15}* 妈妈离开后，\n  他整日... 都郁郁寡欢。',
                                '<25>{#f/4}* 但他并没有沉浸多久， \n  很快走出了这个阴影。',
                                "<25>{#f/3}* 我希望他还没有\n  从我那件事上走出来。",
                                '<25>{#f/17}* 谁知道呢？\n* 一切皆有可能。'
                            ],
                            ['<25>{#p/asriel1}{#f/23}* ...哦，爸爸...']
                        ][Math.min(asrielinter.c_ah_door++, 2)]
                    ]
                    : ['<32>{#p/basic}* “房间翻修中。”'],
            c_ah_mirror: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/24}* 这是我们..."]
                    : world.genocide
                        ? ['<32>{#p/basic}* ...']
                        : calcLV() > 14
                            ? ['<32>{#p/basic}* 即使经历了一切...', '<32>* ...这真的是你吗？']
                            : world.darker
                                ? ["<32>{#p/basic}* 这是你。"]
                                : SAVE.data.b.ultrashortcut || SAVE.data.b.ubershortcut
                                    ? ["<99>{#p/basic}* 即使跳过了大部分旅程，\n  这仍然是你。"]
                                    : ["<99>{#p/basic}* 即使经历了一切，\n  这仍然是你。"],
            
            c_aa_flower: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 这张照片...',
                            '<25>{#f/17}* 这是$(name)\n  拍的第一朵星花。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 在$(name)来这后不久...',
                            '<25>{#f/17}* 一朵小花\n  从星星之外坠入此间。',
                            '<25>{#f/23}* 它是前哨站的\n  第一朵星花。',
                            '<25>{#f/22}* 在前哨站的边缘，\n  孤零零的生长...',
                            '<25>{#f/13}* 我们围在它的周围，\n  让$(name)拍个照片\n  以求好运。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/13}* 在拍完照片后，\n  我们打算回家。',
                            '<25>{#f/13}* 但当我们站起身来，\n  我们不约而同地\n  回头看了一眼星星。',
                            '<25>{#f/15}* 然后我们看到了...',
                            '<25>{#f/23}* 漫天星空的星花\n  如星罗棋布般纷纷落下。',
                            '<25>{#f/17}* $(name)与我手牵手，\n  站在那里...',
                            '<25>{#f/17}* 呆呆地望着这样的\n  盛世美景。'
                        ],
                        ['<25>{#p/asriel1}{#f/17}* 即使作为星星时，\n  这段记忆仍然会使我微笑。']
                    ][Math.min(asrielinter.c_aa_flower++, 3)]
                    : SAVE.data.b.oops
                        ? ["<32>{#p/basic}* 一张照片。\n* 没什么好说的。"]
                        : ["<32>{#p/basic}* 裱起来的这张照片是我拍的。"],
            c_aa_cabinet: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你在里面找不到\n  除相同的衣服外的任何东西。）"]
                    : world.darker
                        ? ['<32>{#p/basic}* 衣柜。']
                        : [
                            '<32>{#p/basic}* 衣柜里挂满了黄蓝条纹衫。',
                            '<32>{#p/basic}* 有些东西还真是永恒不变啊...'
                        ],
            c_aa_box: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/23}* ...嗯，至少他给粘好了。',
                            '<25>{#f/13}* 爸爸总是会\n  想到办法来修复东西。',
                            '<25>{#f/15}* 有时，\n  $(name)和我\n  打破了什么东西时...',
                            '<25>{#f/8}* 大部分都是\n  $(name)干的...',
                            "<25>{#f/17}* 他就会突然出现，\n  用他那古老的手艺\n  来拯救世界。",
                            '<25>{#f/20}* 他是真正的DIY英雄！'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/13}* 别告诉他\n  我管他叫这个。",
                            "<25>{#f/16}* 他会笑岔气的。",
                            '<25>{#f/15}* 但要是没有他，\n  $(name)将会破坏一切。',
                            '<25>{#f/16}* 那家伙的“乐趣”\n  总能给别人带来困扰。',
                            '<25>{#f/13}* 作为怪物时...\n  我完全不能理解。',
                            '<25>{#f/15}* 后来...\n  我就变成了闪闪。'
                        ],
                        ["<25>{#p/asriel1}{#f/17}* 要是我还对\n  这些玩具感兴趣，\n  我肯定会玩的不亦乐乎。"],
                        ['<25>{#p/asriel1}{#f/20}* 公仔算是玩具吗？\n* 那些超酷的。']
                    ][Math.min(asrielinter.c_aa_box++, 3)]
                    : world.darker
                        ? ['<32>{#p/basic}* 一盒星际飞船模型。']
                        : [
                            "<32>{#p/basic}* 一盒星际飞船模型，\n  完好无损。",
                            '<33>{#p/basic}* 闻起来像老式胶水。'
                        ],
            c_aa_frame: () =>
                SAVE.data.b.svr
                    ? [["<25>{#p/asriel1}{#f/23}* ...它还在这..."], ['<25>{#p/asriel1}{#f/22}* ...']][
                    Math.min(asrielinter.c_aa_frame++, 1)
                    ]
                    : SAVE.data.b.oops
                        ? ["<32>{#p/basic}* 一张手绘。"]
                        : ["<32>{#p/basic}* 这是一张手绘...", '<32>* 画的是全家福。'],
            c_aa_paper: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你用手来回滚动蜡笔。）']
                    : world.darker
                        ? ['<33>{#p/basic}* 几张纸，还有一支蜡笔。']
                        : ['<32>{#p/basic}* 那支蓝色蜡笔原来跑这了，\n  就放在这几张纸上。'],
            c_aa_deathbed: () =>
                SAVE.data.b.svr
                    ? [
                        ['<25>{#p/asriel1}{#f/13}* ...'],
                        [
                            "<25>{#p/asriel1}{#f/23}* ...没事的，弗里斯克。",
                            "<25>{#f/13}* 即使那家伙不会回来...",
                            "<25>{#f/17}* 我们也将永远铭记\n  我们共同的朋友\n  为我们所做的一切。"
                        ],
                        ['<25>{#p/asriel1}{#f/13}* 弗里斯克...', '<25>{#f/17}* 时候不早了，\n  我们也该去做\n  更有意义的事了。']
                    ][Math.min(asrielinter.c_aa_deathbed++, 2)]
                    : world.darker
                        ? ["<32>{#p/basic}* 另一张床。"]
                        : SAVE.data.b.oops
                            ? ["<32>{#p/basic}* 这张床绝对没什么特别的。"]
                            : ['<32>{#p/basic}* 我的床。'],
            
            c_aa_chair: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你很欣赏这把小椅子\n  可以坐得下大家伙。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一把椅子，\n  很适合坐在上面写日记。"]
                        : ["<32>{#p/basic}* 艾斯戈尔写日记时就坐着\n  这把椅子。"],
            c_aa_bed: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这张床对你来说似乎太大了。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 国王尺寸的床。"]
                        : ["<32>{#p/basic}* 国王尺寸的床。\n* 也是国王的床。"],
            c_aa_diary: pager.create(
                0,
                ...CosmosUtils.populate(
                    9,
                    i => () =>
                        SAVE.data.b.svr
                            ? ['<32>{#p/human}* （这本日记似乎概述了\n  与艾斯戈尔有关的重要事件。）']
                            : world.genocide || world.runaway
                                ? ['<32>{#p/human}* （你想看看日记，\n  却发现内页都被人撕了。）']
                                : SAVE.data.n.plot === 72
                                    ? [
                                        '<32>{#p/human}* （你看了一眼最近写好的日记。）',
                                        '<32>{#p/asgore}* “终于，怪物一族自由了。”',
                                        '<32>* “我们能得救，都是多亏了\n   弗里斯克和另外六个人类孩子。”',
                                        '<32>* “安全起见，\n   艾菲斯博士搜索了前哨站外围，\n   看看会不会发现人类的踪迹。”',
'<32>* “但一无所获。”',
                                        '<32>* “整个星系，\n   她连一艘人类星舰，一座太空站\n   都没找到。”',
                                        '<32>* “太反常了。”',
                                        '<32>* “人类是不是出事了？”\n* “还是说，他们忘了这个星系，\n   也忘了我们？”',
                                        '<32>* “也许，我可以找弗里斯克\n   或其他孩子问问。”',
                                        '<32>* “孩子们苏醒后，\n   其他怪物收养了他们。”',
                                        '<32>* “有个孩子告诉我，\n   他们在档案里受尽了折磨，十分痛苦。”',
                                        '<32>* “考虑到他们曾受过创伤，\n   我跟艾菲斯在帮他们挑选领养人时\n   都慎之又慎。”',
                                        '<32>* “尽管现在有点难办，\n   但只要他们都活着，\n   我们都打心底里高兴。”',
                                        '<32>* “搜索其他人类始终一无所获。\n   也许... 这几个孩子就是\n   人类最后的火种了。”'
                                    ]
                                    : [
                                        [
                                            '<32>{#p/human}* （你看了一眼被标记的日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历516年1月。”',
                                            '<32>* “在这艰难的时刻，\n   身边却一个伙伴都没有，\n   只能聊以自慰。”',
                                            '<32>* “或许写几页日记\n   能缓解一下我的伤痛。”',
                                            '<32>* “此刻，我心中五味杂陈。”',
                                            '<32>* “我很愤怒，\n   人类的所作所为，孩子们遭的罪...\n   想到这些，我气不打一处来。”',
                                            '<32>* “我很内疚，\n   面对悲剧，自己却那么软弱无能，\n   一点骨气都没有。”',
                                            '<32>* “我很悲伤，\n   不愿相信，人生竟然如此残酷，”',
                                            '<32>* “故园毁灭之后，\n   每每想到自己有一天能结婚生子，\n   组建家庭，就有了希望。”',
                                            '<32>* “可我的孩子死了，\n   就这么死了。”',
                                            '<32>* “再怎么看航行日志，\n   结果都不会变。”',
                                            '<32>* “人死不能复生，事实就是事实。”',
                                            '<32>{#p/basic}* 看起来，从这页开始，\n  后面的日记就正常按\n  时间顺序排了。'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历516年2月。”',
                                            '<32>* “今天，葛森来看望我。”',
                                            '<32>* “他和我倾诉了自己的经历。”',
                                            '<32>* “他讲了在行星理事会的辉煌事业，\n   讲了和家人的分别，\n   还讲了自己身上的责任。”',
                                            '<32>* “他的故事触动了我。”',
                                            '<32>* “我得去好好安慰安慰他，\n   日记就先写到这吧。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历524年10月。”',
                                            '<32>* “$(name)死后，第一个人类\n   来到了前哨站。”',
                                            '<32>* “时间冲淡了怨恨，\n   怪物对人类的蔑视正逐渐平息...”',
                                            '<32>* “但表面的平静之下暗流涌动。\n   他们嘴上不说，\n   可不代表真的就会饶了人类。”',
                                            '<32>* “我和托马斯虽尽力保证他们的安全，\n   但以二人之力对抗民众谈何容易。”',
                                            '<32>* “当年，我赌气说要消灭人类，\n   结果到今天，很多民众还坚持那一套。”',
                                            '<32>* “只要人类被他们逮到，\n   不论年龄大小，都是死路一条。”',
                                            '<32>* “只有把孩子限制在首塔高墙以内，\n   才能保证孩子的安全。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历535年4月。”',
                                            '<32>* “又一个人类来到了这里。”',
                                            '<32>* “那孩子似乎很熟悉葛森，\n   很熟悉行星理事会的成员。”',
                                            '<32>* “我不禁问我自己。”\n  “为什么？”',
                                            '<32>* “这孩子，难不成\n   是听战争故事长大的？”',
                                            '<32>* “而且...\n   按照合约，只有人类军方\n   知道我们的位置。”',
                                            '<32>* “是他们把这孩子派了过来，\n   侦察我们，了解我们的现状...\n   还是我们的位置已经暴露？”',
                                            '<32>* “我希望是前者，\n   我希望我们仍然安全。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历549年7月。”',
                                            '<32>* “上一篇日记写完后不久，\n   又一个孩子坠落到这里。”',
                                            '<32>* “我和托马斯努力培养那孩子，\n   引导他早日参与科研工作。”',
                                            '<32>* “每来一个孩子，\n   自由的希望就又坚定几分。”',
                                            '<32>* “我越发相信，\n   只要那群建筑机器人不觉醒，\n   不推翻我们...”',
                                            '<32>* “那我们的自由就指日可待。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历567年11月。”',
                                            '<32>* “今天，我要跟第二个孩子道别了。”',
                                            '<32>* “今年来了两个孩子，\n   第一个马上就进了‘档案’里，\n   但另一个想再等一阵子。”',
                                            '<32>* “从那孩子身上，\n   我学到了许多东西。”',
                                            '<32>* “孩子太小，不太容易沟通。”',
                                            '<32>* “但从他身上\n   我看到了$(name)的影子，\n   也渐渐理解了$(name)。”',
                                            '<32>* “原来，怪物和人类还是挺像的。\n   之前都没意识到。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历587年3月。”',
                                            '<32>* “几天前，\n   第六个人类抵达了这里。”',
                                            '<32>* “那孩子刚到不久，教授就去世了。\n   因此，我想提笔写一篇日记。”',
                                            '<32>* “托马斯·努·罗曼。”\n  “几天后，就是你的葬礼。”',
                                            '<32>* “你的发明惠及这里的每一个人，\n   我们会永远铭记你。”',
                                            '<32>* “就连最傲慢的卫队新星，\n   都为你准备了悼词。”'
                                        ],
                                        [
                                            '<32>{#p/human}* （你翻到下一篇日记。）',
                                            '<32>{#p/asgore}* “艾斯戈尔的日记，克历615年9月。”',
                                            '<32>* “今天，距离那场可怕的灾难\n   已过去整整一百年，\n   最后一个人类坠落于此。”',
                                            '<32>* “突然间，向往已久的自由\n   却变得令人生畏。”',
                                            '<32>* “我们足足被困两百年。”',
                                            '<32>* “突然迎接自由，\n   怪物会不会如他所说，\n   ‘得意忘形’呢？”',
                                            '<32>* “我们去往何方？”',
                                            '<32>* “我们如何生存？”',
                                            '<32>* “能否自力更生？”',
                                            '<32>* “希望这些顾虑\n   很快就会消散。”'
                                        ],
                                        ['<32>{#p/human}* （再往后，就都是空白了。）']
                                    ][i]
                )
            ),
            c_aa_bureau: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你往衣柜里瞅了一眼...）',
                        ...[
                            ['<25>{#p/asriel1}{#f/19}* 看起来那些人类\n  拿回了自己的衣服。'],
                            ['<25>{#p/asriel1}{#f/19}* ...', '<25>* 我对没想过为什么他们的\n  衣服会在这里感到遗憾。'],
                            [
                                '<25>{#p/asriel1}{#f/19}* 我是说，\n  这样也许是有道理的。',
                                "<25>* 毕竟知道他们会在档案\n  里待多久。",
                                '<25>* 所以... 是这样的。'
                            ],
                            ['<25>{#p/asriel1}{#f/19}* ...']
                        ][Math.min(asrielinter.c_aa_bureau++, 3)]
                    ]
                    : SAVE.data.n.plot === 72 || world.genocide || world.bad_robot || world.trueKills > 29
                        ? [
                            '<32>{#p/human}* （你往衣柜里瞅了一眼...）',
                            '<32>{#p/basic}* 看起来，所有的衣服\n  刚刚都被拿走了。'
                        ]
                        : [
                            '<32>{#p/human}* （你往衣柜里瞅了一眼...）',
                            "<32>{#p/basic}* 里面挂满了\n  各种奇怪的儿童服装。"
                        ],
            c_aa_macaroni: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/17}* ...你喜欢它吗？',
                            '<25>{#f/13}* 这个星花是...\n  我为爸爸做的最后一样东西。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 我可以肯定的说...\n  $(name)并不喜欢这个。",
                            '<25>{#f/13}* 因为那家伙说\n  “别做那蠢事了，\n   快过来...”',
                            '<25>{#f/22}* 那一天我们...',
                            '<25>{#f/15}* ...你知道的。'
                        ],
                        ['<25>{#p/asriel1}{#f/20}* 我将永远铭记这个\n  用空心粉制作的星花。']
                    ][Math.min(asrielinter.c_aa_macaroni++, 2)]
                    : SAVE.data.b.oops
                        ? ['<32>{#p/basic}* 一朵星花，\n  由干燥的食材粘合而成。']
                        : ['<32>{#p/basic}* 这是艾斯利尔亲手制作的星花。\n* 上面写着“给国王老爹！”'],
            c_aa_underwear: () =>
                SAVE.data.n.plot === 72 && !SAVE.data.b.svr && !world.runaway
                    ? []
                    : [
                        '<32>{#p/human}* （你往里面瞅了瞅。）',
                        ...(SAVE.data.b.svr
                            ? [
                                ["<25>{#p/asriel1}{#f/17}* 弗里斯克...\n* 你为啥要看这..."],
                                ['<25>{#p/asriel1}{#f/13}* 弗里斯克...\n* 别...'],
                                ['<25>{#p/asriel1}{#f/15}* 弗里斯克...\n* 认真的吗...'],
                                ['<25>{#p/asriel1}{#f/15}* ...']
                            ][Math.min(asrielinter.c_aa_underwear++, 3)]
                            : world.genocide || world.bad_robot
                                ? SAVE.data.b.c_state_switch1
                                    ? ['<32>{#p/basic}* 没什么有价值的东西。']
                                    : [
                                        "<32>{#p/basic}* 里面有个开关...",
                                        '<32>{#p/human}{#c.switch1}* （你按下了开关。）'
                                    ]
                                : world.darker
                                    ? ["<32>{#p/basic}* 只是个装内裤的床头柜。"]
                                    : [
                                        '<32>{#p/basic}* 真羞人！',
                                        "<33>{#p/basic}* 这是艾斯戈尔的床头柜。\n  里面装着他的内裤。\n* 没想到居然这么整洁。",
                                        '<33>{#p/basic}* ...大部分内裤\n  都是手工编织的粉色内裤。\n  上面锈着“大老爹”三个字。'
                                    ])
                    ]
        }
    },
    b_opponent_alphys: {
        artifact: ['<32>{#p/human}* （艾菲斯看了一眼，随即收回了目光。）'],
        name: '* 艾菲斯',
        gotcha: ['<20>{*}{#p/alphys}{#e/alphys/19}往哪里跑？{^30}{%}'],
        act_check: ['<32>{#p/asriel2}* 艾菲斯。\n* 皇家科学员。'],
        act_asriel: (i: number) => [
            ...[
                [
                    '<32>{#p/asriel2}* 终于，我可以稍微驾驭\n  这副新身体的力量了...',
                    "<32>{#p/asriel2}* 就让她好好瞧瞧我真正的力量吧。"
                ],
                ["<32>{#p/asriel2}* 记住，连着两次施放同一种法术的话，\n  魔力会减弱。"],
                ['<32>{#p/asriel2}* 记住，混合施放多种法术。'],
                []
            ][Math.min(SAVE.flag.n.ga_asrielAssist++, 3)],
            choicer.create(
                '* （艾斯利尔应该施放什么法术？）',
                `${i === 0 ? '§fill=#808080§' : ''}夜幕§fill=#fff§`,
                `${i === 1 ? '§fill=#808080§' : ''}至日§fill=#fff§`,
                `${i === 2 ? '§fill=#808080§' : ''}晚星§fill=#fff§`,
                `${i === 3 ? '§fill=#808080§' : ''}月蚀§fill=#fff§`
            )
        ],
        act_asriel_text: [
            ['<32>{#p/human}* （艾斯利尔将手放在你的额头上，\n  将一股力量注入你的身体。）'],
            ['<32>{#p/human}* （艾斯利尔将手放在你的额头上，\n  低语了一段古老的咒文。）'],
            ['<32>{#p/human}* （艾斯利尔将手放在你的额头上，\n  唱了一首古老的摇篮曲。）'],
            ['<32>{#p/human}* （艾斯利尔将手放在你的额头上，\n  在你周围筑起一道保护光环。）']
        ],
        act_asriel_confirm: [
            ['<32>{#p/story}* 本回合，你的专注力提升！'],
            ['<32>{#p/story}* 本回合，你的无敌帧延长！'],
            ['<32>{#p/story}* 本回合，你的自愈力提升！'],
            ['<32>{#p/story}* 本回合，你的防御力提升！']
        ],
        epiphaNOPE: ['<20>{#p/alphys}{#e/alphys/19}想得美。'],
        statusX: ['<32>{#p/asriel2}* ...'],
        statusY: ["<32>{#p/asriel2}* 她快死了！\n* 继续攻击！"],
        status1a: ['<32>{#p/asriel2}* 艾菲斯...'],
        status1r: () =>
            [
                ['<32>{#p/asriel2}* 有需要，就随时喊我。'],
                ["<32>{#p/asriel2}* 你有需要，我就上。"],
                ['<32>{#p/asriel2}* 做你该做的事。']
            ][Math.min(SAVE.flag.n.ga_asrielAlphysHint++, 2)],
        status1b: ["<33>{#p/asriel2}* 她竟然没逃跑...\n* 有意思。"],
        status1c: ['<32>{#p/asriel2}* 做你该做的事，懂吧。'],
        status1d: ["<32>{#p/asriel2}* 嘿...\n* 你看她是不是有点累了？"],
        status2a: ["<32>{#p/asriel2}* 怎么了，艾菲斯？\n* 撑不住了？"],
        status2r1: ['<32>{#p/asriel2}* 呃，再听一遍吧...'],
        status2b: ['<32>{#p/asriel2}* 来，让我们好好听听\n  你的凄惨故事。'],
        status2c: ["<32>{#p/asriel2}* 你竟然没贯彻逃跑精神，\n  我可真惊讶呢。"],
        status2d: ['<32>{#p/asriel2}* 故事真精彩呢，“爱妃死”博士。'],
        status2e: ['<32>{#p/asriel2}* ...？'],
        status2r2: ["<32>{#p/asriel2}* 准备好，战斗形势要变了。"],
        status3a: ['<32>{#p/asriel2}* 好... 形势严峻起来了。'],
        status3b: ["<32>{#p/asriel2}* ...看来艾菲斯放弃防御了。\n* 抓住这个机会！"],
        status3c: ['<32>{#p/asriel2}* 坚持住，$(name)...'],
        turnTalk1a: [
            "<20>{#p/alphys}{#e/alphys/19}要是连一下都扛不住，\n我怎么可能来这？",
            '<20>{#p/alphys}{#e/alphys/23}看来，\n是高估你们的智商了。'
        ],
        turnTalk1b: [
            '<20>{#p/alphys}{#e/alphys/19}无话可说？',
            "<20>{#e/alphys/18}...那就我自己说，\n你们爱听不听。"
        ],
        turnTalk1c: [
            "<20>{#p/alphys}{#e/alphys/19}对，\n就是我，艾菲斯。",
            '<20>{#e/alphys/18}因为，\n只有我，亲眼目睹了\n你们的一举一动。',
            '<20>{#e/alphys/19}也只有我，\n才清楚你们潜在的力量\n有多么可怕。'
        ],
        turnTalk1d: [
            '<20>{#p/alphys}{#e/alphys/19}尽情挥霍\n你那些珍贵的物品。',
            "<20>{#e/alphys/18}就那些东西，唬不到我。"
        ],
        turnTalk2: [
            "<20>{#p/alphys}{#e/alphys/19}...人类，\n我研究你们文化很多年了。",
            "<20>{#e/alphys/19}你会担下所有战斗，\n我一点也不意外。"
        ],
        turnTalk3: [
            '<20>{#p/alphys}{#e/alphys/18}而你呢，艾斯利尔...\n你利用人类，\n拿伙伴当保护伞。',
            "<20>{#e/alphys/52}为了什么呢？\n你怕一旦自己动手，\n偷来的灵魂就会破碎？"
        ],
        turnTalk4: [
            "<20>{#p/alphys}{#e/alphys/51}还是说，\n你怕自己被人类淡忘，\n活时视如草芥，\n死后弃若敝履？",
            "<20>{#e/alphys/17}呵，\n还挺有诗意的。"
        ],
        turnTalk5: [
            '<20>{#p/alphys}{#e/alphys/16}但是，我来这教训你，\n绝不是因为你想\n找人类寻求安慰，',
            '<20>{#e/alphys/52}而是因为...',
            '<20>{#e/alphys/19}我亲身体会到\n挚友离去，无依无靠\n那种孤独的滋味。'
        ],
        turnTalk6: [
            "<20>{#p/alphys}{#e/alphys/23}但你俩不会懂的，\n对吧？",
            "<20>{#e/alphys/19}你们两个罪恶滔天，\n谁也拦不住，\n怎么可能亲身体会\n我们的痛苦呢？",
            '<20>{#e/alphys/22}怎么可能呢？'
        ],
        turnTalk7: [
            '<20>{#p/alphys}{#e/alphys/19}罢了，你们想怎样，\n我都不在乎了。',
            '<20>{#e/alphys/52}...这么看，\n我可真傻...',
            '<20>{#e/alphys/51}之前居然还妄想\n能拉你一把，\n让你浪子回头。'
        ],
        turnTalk8: [
            '<20>{#p/alphys}{#e/alphys/52}毕竟，\n是我给了那星星生命...',
            "<20>{#e/alphys/51}出了事，\n也该我来负责。"
        ],
        turnTalk9: [
            '<20>{#p/alphys}{#e/alphys/19}...不过，\n现在我懂你们\n为什么执迷不悟了。',
            '<20>{#e/alphys/18}我没猜错的话，\n你们中肯定有人\n拥有那股力量...',
            '<20>{#e/alphys/19}那股可以回溯时间，\n逆天改命的力量...'
        ],
        turnTalk10: [
            "<20>{#p/alphys}{#f/alphys/18}果真如此的话，\n那其他人真得小心了。",
            "<21>{#e/alphys/23}如果一个人能为所欲为，\n还不用承担任何过错，\n那他怎么可能\n在乎别人的感受呢？"
        ],
        turnTalk11: ['<20>{#z1}{#p/alphys}{#e/alphys/21}...', '<21>{#e/alphys/39}让我歇歇。'],
        broken: ['<20>{*}{#p/alphys}{#e/alphys/45}谢了。{^20}{%}'],
        turnTalk12: [
            "<20>{#z2}{#p/alphys}{#e/alphys/7}安黛因牺牲后，\n我不知道该怎么办。",
            '<20>{#e/alphys/46}我马上逃离了实验室，\n希望逃得越远越好。'
        ],
        turnTalk13: [
            '<20>{#p/alphys}{#e/alphys/47}可是越逃跑，\n我就对自己越失望。',
            '<20>{#e/alphys/48}难道我就这么袖手旁观，\n眼睁睁看着我族同胞\n一个个死去？'
        ],
        turnTalk14: [
            '<20>{#p/alphys}{#e/alphys/21}...这未免太绝情了。',
            '<21>{#e/alphys/39}更何况...',
            '<20>{#e/alphys/45}我再怎么自责\n都没法改变现状。'
        ],
        turnTalk15: [
            "<20>{#p/alphys}{#e/alphys/39}安黛因说，\n你们要杀死\n这星河中的每个人...",
            "<20>{#e/alphys/40}但其实，\n你们的野心不止如此，\n对吧？"
        ],
        turnTalk16: [
            '<20>{#z3}{#p/alphys}{#e/alphys/48}...',
            "<20>{#e/alphys/47}让那星星复活是我的错。\n但你们的罪孽，\n跟我一分钱关系没有。",
            "<20>{#e/alphys/38}我管你们打的什么算盘，\n都得给我付出代价。",
            '<20>{*}{#z4}{#e/alphys/54}哪怕...{^10}{%}',
            '<20>{*}{#e/alphys/25}我会因此疯掉！{^10}{%}'
        ],
        turnTalk17: ['<20>{#p/alphys}{#e/alphys/25}接招！！'],
        turnTalk18: ['<20>{#p/alphys}{#e/alphys/25}再来！！'],
        turnTalk19: ['<20>{#p/alphys}{#e/alphys/25}再来这招！！'],
        turnTalk20: ['<20>{#p/alphys}{#e/alphys/24}哈哈哈...'],
        turnTalk21: ['<20>{#p/alphys}{#e/alphys/26}...'],
        turnTalk22: ['<20>{#p/alphys}{#e/alphys/27}给我去死！！'],
        turnTalk23: ['<20>{#p/alphys}{#e/alphys/27}...'],
        done0: (b: boolean) =>
            b
                ? ['<20>{*}{#p/alphys}{#e/alphys/42}不...{^40}{%}', '<20>{*}{#e/alphys/43}这么快我就...{^40}{%}']
                : ['<20>{*}{#p/alphys}{#e/alphys/42}不...{^40}{%}', '<20>{*}{#e/alphys/43}你们...{^40}{%}'],
        done1: (b: boolean) =>
            b
                ? ["<20>{*}没-没想到你们这么强...{^40}{%}", '<20>{*}我现在明白了，\n与你们为敌...{^40}{%}']
                : ["<20>{*}我是不是...\n快-快要死了？{^40}{%}", '<20>{*}尽了全力，还是...{^40}{%}'],
        done2: (b: boolean) =>
            b ? ['<20>{*}{#p/alphys}根本毫无胜算。{^40}{%}'] : ["<20>{*}{#p/alphys}艾斯戈尔，我对不起你。{^40}{%}"]
    },
    b_opponent_archive1: {
        name: () => (battler.volatile[0].sparable ? '* 托丽尔' : '* e68998e4b8bde5b094'),
        status0: ['<32>{#p/human}* （此刻，e68998e4b8bde5b094\n  正站在你的面前。）'],
        status1: ['<32>{#p/human}* （看起来，要按特定的顺序行动，\n  e68998e4b8bde5b094才能完成任务。）'],

        act_dinnertimeX: ['<32>{#p/human}* （可是，你已经吃过晚餐了。）'],
        dinnerTalk: ['<11>{#p/toriel}孩子，\n{@fill=#42fcff}{@mystify=吃慢点喫漫奌}吃慢点{@mystify=}{@fill=#ffffff}。'],
        dinnerStatus: ['<32>{#p/human}* （看起来，e68998e4b8bde5b094\n  想给你读点什么。）'],

        act_storytimeX: ['<32>{#p/human}* （可是，你们已经读完故事了。）'],
        act_storytimeE: ['<32>{#p/human}* （可是，e68998e4b8bde5b094\n  现在还不想给你读故事。）'],
        storyTalk: [
            '<11>{#p/toriel}从前，\n有一只{@fill=#42fcff}{@mystify=怪物圣忽恠㹅径勿}怪物{@mystify=}{@fill=#ffffff}...'
        ],
        storyStatus: ['<32>{#p/human}* （e68998e4b8bde5b094\n  还想为你做一件事。）'],

        act_bedtimeX: ['<32>{#p/human}* （可是，她已经哄过你了。）'],
        act_bedtimeE: ['<32>{#p/human}* （可是，e68998e4b8bde5b094\n  现在和不想哄你睡觉。）'],
        bedTalk: ['<11>{#p/toriel}孩子，晚安。'],
        bedStatus: ['<32>{#p/human}* （托丽尔完成了自己的使命。）'],

        act_talkE: ["<32>{#p/human}* （可是，e68998e4b8bde5b094\n  还没有完成她的使命。）"],
        act_talkN: ['<32>{#p/human}* （在消散前，托丽尔送给你\n  一则人生心得。）'],

        act_puzzlehelp: ['<32>{#p/human}* （可是，谜题都解完了。）'],
        puzzlehelpTalk1: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=饿餓不我钚芣々}饿不饿{@mystify=}{@fill=#ffffff}？'
        ],
        puzzlehelpTalk2: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=睡不着吗}睡不着吗{@mystify=}{@fill=#ffffff}？'
        ],
        puzzlehelpTalk3: [
            '<11>{#p/toriel}孩子，\n你{@fill=#42fcff}{@mystify=困睏囷不钚芣々}困不困{@mystify=}{@fill=#ffffff}？'
        ]
    },
    b_opponent_archive2: {
        name: () => (battler.volatile[0].sparable ? '* 葛森' : '* e8919be6a3ae'),
        status0: ['<32>{#p/human}* （e8919be6a3ae\n  正站在训练场的对面。）'],
        status1: ['<32>{#p/human}* （e8919be6a3ae让你先出招。）'],

        act_challengeX: ['<32>{#p/human}* （可是，你已经通过挑战了。）'],
        act_challengeR: ['<32>{#p/human}* （可是，你要先休息，\n  然后才能挑战。）'],
        challengeTalk: [
            '<11>{#p/basic}心怀{@fill=#ff993d}{@mystify=勇气勈氣甬気力乞}勇气{@mystify=}{@fill=#ffffff}，\n才能克服恐惧。'
        ],

        challengeFail: [
            '<11>{*}{#p/basic}不合格！\n下回{@fill=#ff993d}{@mystify=专注專註传主抟宔}专注{@mystify=}{@fill=#ffffff}\n一点！{^30}{%}'
        ],
        failStatus: ["<32>{#p/human}* （e8919be6a3ae觉得\n  你应该休息一下。）"],
        successStatus: ['<32>{#p/human}* （葛森完成了自己的使命。）'],

        act_restA: ['<32>{#p/human}* （可是，你现在还不累。）'],
        restTalk: [
            '<11>{#p/basic}一名\n够格的{@fill=#ff993d}{@mystify=英雄偀䧺央隹䇦难}英雄{@mystify=}{@fill=#ffffff}\n绝不会逞强。'
        ],
        restStatus: ['<32>{#p/human}* （e8919be6a3ae很期待\n  你下回出什么招。）'],

        act_handshakeE: ["<32>{#p/human}* （可是，e8919be6a3ae对你的\n  一对一训练还未结束。）"],
        act_handshakeN: ['<32>{#p/human}* （在消散前，葛森把最喜欢的\n  握手方式教给了你。）'],

        act_taunt: ['<32>{#p/human}* （可是，e8919be6a3ae\n  无视了你的手势。）'],

        act_advice: ['<32>{#p/human}* （可是，他已经把所有建议\n  都告诉你了。）'],
        adviceTalk1: [
            '<11>{#p/basic}做事，\n一定要{@fill=#ff993d}{@mystify=果断菓斷课颗䉼畨}果断{@mystify=}{@fill=#ffffff}。'
        ],
        adviceTalk2: [
            '<11>{#p/basic}人在{@fill=#ff993d}{@mystify=逆境屰辶竟朔昱圼}逆境{@mystify=}{@fill=#ffffff}中\n才能成长。'
        ],
        adviceTalk3: [
            '<11>{#p/basic}学会{@fill=#ff993d}{@mystify=謙遜谦逊兼孙尲荪}谦逊{@mystify=}{@fill=#ffffff}，\n方能成功。'
        ]
    },
    b_opponent_archive3: {
        name: () => (battler.volatile[0].sparable ? '* 罗曼教授' : '* e7bd97e69bbce69599e68e88'),
        status0: ['<32>{#p/human}* （现在，\n  是e7bd97e69bbce69599e68e88\n  掌控着大局。）'],
        status1: ['<32>{#p/human}* （e7bd97e69bbce69599e68e88\n  想在你身上做些实验。）'],

        act_object: ['<32>{#p/human}* （可是，他立刻驳回了你的请求。）'],

        act_testX: ['<32>{#p/human}* （可是，你已经做过这个实验了。）'],
        testTalkA: ['<11>{#p/basic}请{@fill=#003cff}{@mystify=站着别动}站着别动{@mystify=}{@fill=#ffffff}...'],
        testTalkB: ['<11>{#p/basic}{@fill=#003cff}{@mystify=好戏奸妙对戈戋奴}好戏{@mystify=}{@fill=#ffffff}\n才刚刚开始。'],
        testTalkC: [
            '<11>{#p/basic}看，这就是\n探寻真理的\n{@fill=#003cff}{@mystify=力量仂哩艻童劜里}力量{@mystify=}{@fill=#ffffff}。'
        ],
        testStatus1: ['<32>{#p/human}* （e7bd97e69bbce69599e68e88\n  准备进行下一场实验了。）'],
        testStatus2: ['<32>{#p/human}* （罗曼教授完成了他的使命。）'],

        act_notesE: ["<32>{#p/human}* （可是，e7bd97e69bbce69599e68e88\n  还不想跟你交换笔记。）"],
        act_notesN: ['<32>{#p/human}* （在消散前，罗曼教授把笔记\n  交给了你。）']
    },
    b_opponent_archive4: {
        name: () => (battler.volatile[0].sparable ? '* 纳普斯特' : '* e7bab3e699aee696afe789b9'),
        status0: ['<32>{#p/human}* （e7bab3e699aee696afe789b9\n  正飘在电脑旁。）'],
        status1: ['<32>{#p/human}* （e7bab3e699aee696afe789b9\n  想写一首新曲子。）'],

        act_sampleX: ['<32>{#p/human}* （可是，音频样本已经够用了。）'],
        sampleTalk: [
            '<11>{#p/napstablook}这个音色\n效果应该\n{@fill=#d535d9}{@mystify=不错钚錯芣昔否剒}不错{@mystify=}{@fill=#ffffff}...'
        ],
        sampleStatus: ['<32>{#p/human}* （e7bab3e699aee696afe789b9\n  要开始作曲了。）'],

        act_composeX: ['<32>{#p/human}* （可是，曲子已经写好了。）'],
        act_composeE: ['<32>{#p/human}* （可是，你要先采样才有素材作曲。）'],
        composeTalk: [
            "<11>{#p/napstablook}来{@fill=#d535d9}{@mystify=听口斤々}听听{@mystify=}{@fill=#ffffff}\n这首怎么样..."
        ],

        composeFail: [
            '<11>{*}{#p/napstablook}唉...\n{@fill=#d535d9}{@mystify=再来一遍}再来一遍{@mystify=}{@fill=#ffffff}吧...{^30}{%}'
        ],
        failStatus: ['<32>{#p/human}* （e7bab3e699aee696afe789b9\n  想再试一次。）'],
        composeStatus: ['<32>{#p/human}* （e7bab3e699aee696afe789b9\n  现在要开始混音了。）'],

        act_mixX: ['<32>{#p/human}* （可是，混音已经完成了。）'],
        act_mixE: ['<32>{#p/human}* （可是，你要先作曲，\n  然后才能混音。）'],
        mixTalk: [
            '<11>{#p/napstablook}我得保证\n各声部音量\n相互{@fill=#d535d9}{@mystify=平衡干衙芈行彳鱼}平衡{@mystify=}{@fill=#ffffff}...'
        ],

        mixFail: [
            "<11>{*}{#p/napstablook}哦...\n看来咱们要\n{@fill=#d535d9}{@mystify=重新混音}重新混音{@mystify=}{@fill=#ffffff}了...{^30}{%}"
        ],
        successStatus: ['<32>{#p/human}* （纳普斯特完成了它的使命。）'],

        act_secretE: ["<32>{#p/human}* （可是，e7bab3e699aee696afe789b9\n  还不想把秘密告诉你。）"],
        act_secretN: ['<32>{#p/human}* （在消散前，纳普斯特\n  告诉你一个秘密。）'],

        act_praise: ['<32>{#p/human}* （可是，它太自卑了，\n  没听到你的赞美。）']
    },
    b_opponent_archive5: {
        name: () => (battler.volatile[0].sparable ? '* 艾斯戈尔' : '* e889bee696afe68888e5b094'),
        status0: ['<32>{#p/human}* （e889bee696afe68888e5b094\n  身材魁梧，站在你的面前。）'],
        status1: ['<32>{#p/human}* （e889bee696afe68888e5b094\n  只有一件事有求于你。）'],

        act_hugX: ['<32>{#p/human}* （可是，没必要再抱他一次了。）'],
        hugTalk: ['<11>{#p/asgore}孩子，谢谢你。'],
        hugStatus: ['<32>{#p/human}* （艾斯戈尔完成了他的使命。）'],

        act_promiseE: ["<32>{#p/human}* （可是，e889bee696afe68888e5b094\n  还有任务在身。）"],
        act_promiseN: ['<32>{#p/human}* （在消散前，\n  艾斯戈尔向你做了个承诺。）']
    },
    b_opponent_asriel: {
        artifact: ["<32>{#p/human}* （似乎艾斯利尔对它没什么兴趣。）"],
        refuse: '{*}{#p/event}{#i/3}但是它拒绝了。',
        name: () =>
            battler.volatile[0].container.objects[0]?.metadata.power === true
                ? '§fill=#ff7f7f§§swirl=2/1/1.05§§hue§* 艾斯利尔·逐梦'
                : '* 艾斯利尔·逐梦',
        status0: pager.create(
            0,
            (power = false) =>
                power
                    ? ['<32>{#p/story}* 艾斯利尔准备施放“裂空飞星”。']
                    : SAVE.data.b.oops
                        ? ["<32>{#p/story}* 这里，就是终点。"]
                        : ['<32>{#p/basic}* 艾斯利尔...？'],
            (power = false) =>
                power
                    ? ['<32>{#p/story}* 艾斯利尔准备施放“裂空飞星”。']
                    : SAVE.data.b.oops
                        ? ["<32>{#p/story}* 这里，就是终点。"]
                        : ['<32>{#p/basic}* ...']
        ),
        act_check: () =>
            SAVE.data.b.oops
                ? [
                    '<32>{#p/story}* 艾斯利尔·逐梦 攻击{^2}\u221e{^1} 防御{^2}\u221e{^1}\n* 藉由哨站灵魂凝心聚力\n  铸成传奇之躯。'
                ]
                : ['<32>{#p/story}* 艾斯利尔·逐梦 攻击{^2}\u221e{^1} 防御{^2}\u221e{^1}\n* ...'],
        act_hope: [
            '<32>{#p/human}* （你紧握希望。）\n* （你感觉有一股无形之力\n  保护着身体。）',
            '<32>{#p/story}* 本回合，你的防御力提升！'
        ],
        act_dream: [
            "<32>{#p/human}* （你回想起自己为何站立于此。）\n* （你感觉到自己的伤口\n  正逐渐愈合。）",
            '<32>{#p/story}* 本回合，你的自愈力提升！'
        ],
        act_flirt1: ['<32>{#p/human}* （你向艾斯利尔调情。）\n* （什么都没发生。）'],
        act_flirt2: [
            '<32>{#p/human}* （你向艾斯利尔调情。）\n  （又跟他身体里的每个灵魂调情。）',
            '<32>{#p/basic}* 那神情，在艾斯利尔的灵魂深处\n  不停回响...',
            "<32>* ...他手足无措，\n  只能用心去回应你！"
        ],
        act_pet: (count: number) =>
            SAVE.flag.n.pacifist_marker === 8
                ? ["<32>{#p/human}* （你想摸摸艾斯利尔，\n  但他离你太远了，够不着。）"]
                : [
                    ...[
                        ["<32>{#p/human}* （你摸了摸艾斯利尔。）\n* （他好像有点手足无措。）"],
                        ["<32>{#p/human}* （你又摸了摸艾斯利尔。）\n* （他更加手足无措了。）"],
                        ["<32>{#p/human}* （你捋了捋艾斯利尔的毛。）\n* （艾斯利尔脸红了，\n  避开了你的目光。）"],
                        ["<32>{#p/human}* （你揉了揉艾斯利尔的头。）\n* （他竭力掩藏自己的喜悦。）"],
                        ["<32>{#p/human}* （你挠了挠艾斯利尔的脖子。）\n* （他很享受，但没表现出来。）"],
                        [
                            "<32>{#p/human}* （你不停玩弄艾斯利尔的耳朵。）\n* （他十分后悔自己居然乐在其中。）"
                        ],
                        ["<32>{#p/human}* （你拍了拍艾斯利尔的脊背。）\n* （他开始疑惑你到底想干什么。）"],
                        [
                            "<32>{#p/human}* （你紧紧搂住了艾斯利尔的腿。）\n* （他被你一连串的亲昵举动\n  吓愣了。）"
                        ],
                        [
                            "<32>{#p/human}* （你捏了捏艾斯利尔的爪子。）\n* （艾斯利尔没有反抗，任由你摆布。）"
                        ],
                        ["<32>{#p/human}* （你跟艾斯利尔碰了碰鼻。）\n* （艾斯利尔彻底放弃抵抗了。）"],
                        ["<32>{#p/human}* （你温柔地抚摸艾斯利尔的脸蛋。）\n* （他似乎想起了某位故人。）"],
                        ['<32>{#p/human}* （你继续抚摸艾斯利尔。）\n* （他轻声叹息。）'],
                        ['<32>{#p/human}* （你继续抚摸艾斯利尔。）\n* （他轻声叹息。）']
                    ][count],
                    "<32>{#p/story}* 本回合，艾斯利尔的攻击力下降！"
                ],
        turnTalk1: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}现在...',
                    "<20>{*}{#p/asriel3}{#e/asriel/6}我... 再也不想\n毁灭这前哨站了。"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}现在...',
                    "<20>{*}{#p/asriel3}{#e/asriel/6}我再也不想\n毁灭这前哨站了。"
                ],
        status1: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔准备施放“怒吼风暴”。']
                : ["<32>{#p/basic}* 可你不是... 已经..."],
        turnTalk2: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}等-等我打败了你，\n重新掌控整条时间线...',
                    '<20>{*}{#p/asriel3}{#e/asriel/2}我只想...\n把一切倒回原点。'
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/3}等我打败了你，\n重新掌控整条时间线...',
                    '<20>{*}{#p/asriel3}{#e/asriel/2}我只想\n把一切倒回原点。'
                ],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔即将召唤“泰坦巨刃”。']
                : ['<32>{#p/basic}* 你怎么可能...'],
        turnTalk3: (fluff: boolean) =>
            fluff
                ? [
                    "<20>{*}{#p/asriel3}{#e/asriel/3}你的旅程...\n大家的记忆...",
                    "<20>{*}{#p/asriel3}{#e/asriel/2}我-我会将它们\n全部抹除！"
                ]
                : [
                    "<20>{*}{#p/asriel3}{#e/asriel/3}你的旅程...\n大家的记忆...",
                    "<20>{*}{#p/asriel3}{#e/asriel/2}我会将它们全部抹除！"
                ],
        status3: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 艾斯利尔正在蓄力“混沌冲击”。'] : ['<32>{#p/basic}* ...'],
        turnTalk4: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/0}之后... 让一切...\n重新来过。']
                : ['<20>{*}{#p/asriel3}{#e/asriel/0}之后，让一切重新来过。'],
        status4: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔准备施放“怒吼风暴”。']
                : ['<32>{#p/basic}* ...嘿...\n* 我觉得，托丽尔之前肯定也是\n  这么想的。'],
        turnTalk5: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/1}而且，你-你知道\n最棒的部分是什么吗？',
                    "<20>{*}{#p/asriel3}{#e/asriel/0}这一切，\n都是你亲手铸成的。"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/1}而且，你知道\n最棒的部分是什么吗？',
                    "<20>{*}{#p/asriel3}{#e/asriel/0}这一切，\n都是你亲手铸成的。"
                ],
        status5: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 艾斯利尔正在蓄力“混沌冲击”。'] : ['<32>{#p/basic}* ...可是，我...'],
        turnTalk6: (fluff: boolean) =>
            fluff
                ? ["<20>{*}{#p/asriel3}{#e/asriel/3}那时...\n你-你将再度成为\n我的手下败将。"]
                : ["<20>{*}{#p/asriel3}{#e/asriel/3}那时，你将再度成为\n我的手下败将。"],
        status6: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 艾斯利尔准备施放“裂空飞星”。'] : ['<32>{#p/basic}* ...'],
        turnTalk7: (fluff: boolean) =>
            fluff ? ['<20>{*}{#p/asriel3}{#e/asriel/4}永-永远别想赢我。'] : ['<20>{*}{#p/asriel3}{#e/asriel/4}永远别想赢我。'],
        status7: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 艾斯利尔即将召唤“泰坦巨刃”。'] : ['<32>{#p/basic}* 除非...'],
        turnTalk8: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/2}永远... 别-别想赢我！']
                : ['<20>{*}{#p/asriel3}{#e/asriel/2}永远，别想赢我！'],
        status8: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔准备施放“歼星爆冲”。']
                : ['<32>{#p/basic}* ...该死...'],
        turnTalk9: (fluff: boolean) =>
            30 <= SAVE.data.n.bully
                ? fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/3}因为... 你-你想证明\n自己“实力出众”。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/3}因为，你想证明\n自己“实力出众”。']
                : fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/3}因为...\n你-你想让一切\n“完美收官”。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/3}因为，你想让一切\n“完美收官”。'],
        status9: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔正在蓄力“雷霆巨刃”。']
                : ["<32>{#p/basic}* 你早就应该死了啊！"],
        turnTalk10: (fluff: boolean) =>
            30 <= SAVE.data.n.bully
                ? fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因为...\n你-你想证明\n自己“是条硬汉”。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因为，你想证明\n自己“是条硬汉”。']
                : fluff
                    ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因为...\n你-你“爱着你的朋友”。']
                    : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因为，\n你“爱着你的朋友”。'],
        status10: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 艾斯利尔准备施放“末日风暴”。'] : ['<32>{#p/basic}* 呃啊...'],
        turnTalk11: (fluff: boolean) =>
            fluff
                ? ['<20>{*}{#p/asriel3}{#e/asriel/1}...因-因为，\n你充满“决心”。']
                : ['<20>{*}{#p/asriel3}{#e/asriel/1}...因为，\n你充满“决心”。'],
        status11: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔准备施放“碎空星爆”。']
                : ['<32>{#p/basic}* 以前...\n  他跟托丽尔吵了那么多次...'],
        turnTalk12: (fluff: boolean) =>
            fluff
                ? [
                    "<20>{*}{#p/asriel3}{#e/asriel/6}是-是那些力量...\n带你一步步走到今天...",
                    '<20>{*}{#p/asriel3}{#e/asriel/3}也-也是那些力量...\n如今将把你推向\n无尽深渊！',
                    "<20>{*}{#p/asriel3}{#e/asriel/2}是不是很棒啊？"
                ]
                : [
                    "<20>{*}{#p/asriel3}{#e/asriel/6}是那些力量，\n带你一步步走到今天...",
                    '<20>{*}{#p/asriel3}{#e/asriel/3}也是那些力量，\n如今将把你推向\n无尽深渊！',
                    "<20>{*}{#p/asriel3}{#e/asriel/2}是不是很棒啊？"
                ],
        status12: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 艾斯利尔即将召唤“终极毁灭”。']
                : ['<32>{#p/basic}* ...他真有那么...\n  ...想我吗？'],
        turnTalk13: (fluff: boolean) =>
            fluff
                ? [
                    '<20>{*}{#p/asriel3}{#e/asriel/0}...胡闹... 到此为止！',
                    "<20>{*}{#p/asriel3}{#e/asriel/5}现在...\n是时候彻底抹去\n这条时间线了！"
                ]
                : [
                    '<20>{*}{#p/asriel3}{#e/asriel/0}胡闹到此为止！',
                    "<20>{*}{#p/asriel3}{#e/asriel/5}现在，\n是时候彻底抹去\n这条时间线了！"
                ],
        turnTalk14: [
            "<20>{*}{#p/asriel3}{#e/asriel/1}...吃下刚刚一击，\n你居然还有力气\n抵抗我？",
            '<20>{*}{#p/asriel3}{#e/asriel/5}哇...\n真不能小瞧你啊。',
            "<20>{*}{#p/asriel3}{#e/asriel/0}但也别高兴太早。",
            "<20>{*}{#p/asriel3}{#e/asriel/0}刚刚，我只动用了\n我实力的冰山一角！",
            "<20>{*}{#p/asriel3}{#e/asriel/2}就让我好好瞧瞧\n你的决心能不能\n扛下这一击！！"
        ],
        hyperTalk1a: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}呃哈哈哈...',
            '<20>{*}{#p/asriel3}{#e/asriel/2}见识下\n我真正的力量吧！'
        ],
        hyperTalk1b: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}什-\n你是怎么全躲开的？！',
            '<20>{*}{#p/asriel3}{#e/asriel/5}呃...'
        ],
        hyperTalk2a: ['<20>{*}{#p/asriel3}{#e/asriel/1}再来...！'],
        hyperTalk2b: [
            '<20>{*}{#p/asriel3}{#e/asriel/5}什么...',
            "<20>{*}{#p/asriel3}{#e/asriel/4}你怎么还没死啊？！"
        ],
        hyperTalk3a: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}我能感受到...',
            '<20>{*}{#p/asriel3}{#e/asriel/2}你每死一次，\n与这个世界的连接\n就弱一点。',
            '<20>{*}{#p/asriel3}{#e/asriel/2}你每死一次，\n朋友们对你的记忆\n就模糊一点。'
        ],
        hyperTalk3b: ["<20>{*}{#p/asriel3}{#e/asriel/6}...不管了。\n我才不在乎呢。"],
        hyperTalk3c: ['<20>{*}{#p/asriel3}{#e/asriel/0}这里就是你的葬身之地，\n死了也不会有任何人\n记得你！'],
        hyperTalk4: [
            "<20>{*}{#p/asriel3}{#e/asriel/1}怎么，\n还不放弃吗...？",
            "<20>{*}{#p/asriel3}{#e/asriel/3}没关系。",
            "<20>{*}{#p/asriel3}{#e/asriel/2}再过一会，\n你就会忘记一切。",
            '<20>{*}{#p/asriel3}{#e/asriel/0}我会让你下辈子\n活得更轻松！'
        ],
        hyperTalk5: [
            '<20>{*}{#p/asriel3}{#e/asriel/0}呃哈哈哈...',
            '<20>{*}{#p/asriel3}{#e/asriel/1}还不放弃？',
            '<20>{*}{#p/asriel3}{#e/asriel/2}那么...',
            '<20>{*}{#p/asriel3}{#e/asriel/0}就让我瞧瞧\n你那“决心”\n到底有多厉害！'
        ],
        intermission: () => [
            "<32>{#p/human}* （你无法动弹。）",
            '<32>* （你试图挣扎。）\n* （什么都没发生。）',
            '<32>* （你试图读取存档。）\n* （什么都没发生。）',
            '<32>* （你又试了一次。）\n* （什么都没发生。）',
            '<32>* （...）',
            ...(SAVE.data.b.oops
                ? [
                    '<32>* （...拯救存档已经毫无希望，\n  但也许...）',
                    '<32>* （凭借最后一丝力量...）',
                    '<32>* （你还有希望拯救其他的事物。）'
                ]
                : [
                    '<32>{#p/basic}* 嘿... 在吗？',
                    "<32>* 是我，$(name)...\n* 你也在那里。对吧，搭档？",
                    '<32>* ...嘿...',
                    "<32>* 你我两人一同走了这么远...",
                    '<32>* 一路上，我们\n  一同交了那么多朋友，\n  一同打了那么多战斗...',
                    "<32>* 现在一想... 我们的羁绊\n  就是靠着那些经历一点点建立的。",
                    "<32>* ...嗯...\n* 我虽然不是乐天派...",
                    '<32>* 但是，我们肩负着前哨站\n  所有人的希望。\n* 所以，你一定要保持决心！',
                    '<32>* 而且，既然艾斯利尔能把\n  朋友们的灵魂偷走...',
                    "<32>* ...那反过来，\n  咱们不就可以再“偷”回来吗？",
                    "<32>* 来吧！\n* 我们一起上！"
                ])
        ],
        status13: () =>
            world.runaway
                ? ['<32>{#p/story}* ...']
                : [
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在艾斯利尔的体内，\n  激起一声微弱的共鸣。"]
                        : ['<32>{#p/basic}* ...'],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在艾斯利尔的体内，\n  那共鸣声愈来愈强。"]
                        : ["<32>{#p/basic}* 对，就是这样！\n* 继续！"],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在艾斯利尔的体内，\n  强烈的共鸣此起彼伏。"]
                        : ["<32>{#p/basic}* 快要成功了！"],
                    SAVE.data.b.oops
                        ? ["<32>{#p/story}* 在艾斯利尔的体内，\n  共鸣声响若雷霆。"]
                        : ['<32>{#p/basic}* ...\n* 然后呢？']
                ][
                (SAVE.flag.b.pacifist_marker_save1 ? 1 : 0) +
                (SAVE.flag.b.pacifist_marker_save2 ? 1 : 0) +
                (SAVE.flag.b.pacifist_marker_save3 ? 1 : 0)
                ],
        act_check2: () =>
            SAVE.flag.b.pacifist_marker_save1 && SAVE.flag.b.pacifist_marker_save2 && SAVE.flag.b.pacifist_marker_save3
                ? ['<33>{#p/story}* 艾斯利尔·逐梦 攻击{^2}\u221e{^1} 防御{^2}\u221e{^1}\n* ...']
                : SAVE.data.b.oops
                    ? [
                        '<33>{#p/story}* 艾斯利尔·逐梦 攻击{^2}\u221e{^1} 防御{^2}\u221e{^1}\n* 乃是主宰死亡的绝对神祇。'
                    ]
                    : ["<32>{#p/story}* 艾斯利尔·逐梦 攻击{^2}\u221e{^1} 防御{^2}\u221e{^1}\n* 不要放弃。"],
        mercy_save1: () => [
            "<32>{#p/human}* （你向艾斯利尔的灵魂伸出手，\n  呼唤着朋友们。）",
            ...(SAVE.flag.b.pacifist_marker_save1 || SAVE.flag.b.pacifist_marker_save2 || SAVE.flag.b.pacifist_marker_save3
                ? []
                : ["<32>{#p/basic}* 他们一定就在某处，不是吗？", '<32>* ...']),
            "<32>* 在艾斯利尔的灵魂深处，\n  有什么正在回响...！"
        ],
        confrontation: [
            '<32>{#p/human}* （在伤害了那么多怪物之后...）',
            '<33>* （某种沉睡的、封存的东西\n  再度苏醒。）',
            '<32>* （那是很久很久以前...\n  怪物面对人类的，本能的恐惧。）',
            '<32>* （现在站在你面前的敌人，\n  不会对你有丝毫恐惧...）',
            "<32>* （然而，你伤害过那么多怪物，\n  只要将他们的恐惧累积起来...）",
            '<32>* （你找到了突破口，\n  一个无法拒绝的机会。）',
            "<32>* （...现在，其他选择已毫无意义。）",
            "<32>* （只有一条路可走。）"
        ],
        attackTalk1: [
            '<20>{*}{#p/asriel3}{#e/asriel/1}你... 怎么可能...',
            '<20>{*}{#p/asriel3}{#e/asriel/3}...',
            "<20>{*}{#p/asriel3}{#e/asriel/2}呵呵呵... 以为自己很强\n强到可以超越神明，\n是吗？",
            "<20>{*}{#p/asriel3}{#e/asriel/0}那，就来看看你\n能不能受得了这个！"
        ],
        attackTalk2: [
            '<20>{*}{#p/asriel3}{#e/asriel/3}...',
            "<20>{*}{#p/asriel3}{#e/asriel/1}以为区区这样\n就能伤得了我？",
            "<20>{*}{#p/asriel3}{#e/asriel/0}我才是这里的主宰！"
        ],
        attackTalk3: [
            '<20>{*}{#p/asriel3}{#e/asriel/2}...而且，\n就算你能打败我...',
            "<20>{*}{#p/asriel3}{#e/asriel/3}你的朋友\n也会因你而死。",
            '<20>{*}{#p/asriel3}{#e/asriel/1}这就是你想要的吗？\n永远孤身一人？'
        ],
        attackTalk4: [
            '<20>{*}{#p/asriel3}{#e/asriel/3}$(name)，\n快住手！\n你这是在自杀...',
            "<20>{*}{#p/asriel3}{#e/asriel/5}没明白吗？",
            '<20>{*}{#p/asriel3}{#e/asriel/6}我认识的$(name)\n绝不会做这种蠢事！'
        ],
        attackTalk5: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}...',
            '<20>{*}{#p/asriel3}{#e/asriel/6}听我说，\n$(name)。',
            "<20>{*}{#p/asriel3}{#e/asriel/6}现在赶快住手。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}否则...",
            "<20>{*}{#p/asriel3}{#e/asriel/7}你-你别逼我动真格！"
        ],
        attackTalk6: [
            '<20>{*}{#p/asriel3}{#e/asriel/9}$(name)，\n求求你...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}你还没明白\n自己在做什么吗？",
            "<20>{*}{#p/asriel3}{#e/asriel/8}让你住手，\n并不只是为了那些怪物...",
            "<20>{*}{#p/asriel3}{#e/asriel/8}更重要的是...\n如果我被你打败了...",
            "<20>{*}{#p/asriel3}{#e/asriel/7}我永远，永远\n都当不了你的对手了。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}永远也不会\n得到你的尊重！",
            '<20>{*}{#p/asriel3}{#e/asriel/10}{#i/3}{@random=1.1/1.1}该死，$(name)...\n你为什么总要赢？'
        ],
        attackTalk7: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}...'],
        attackTalk7x: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)，我...'],
        mercy_save2: [
            '<32>{#p/human}* （奇怪的是，\n  在朋友们都回忆起你后...）',
            "<32>* （还有某个存在\n  也开始在艾斯利尔灵魂深处回响。）\n* （愈发强烈。）",
            "<32>* （看起来，还有一个人需要拯救。）",
            '<32>* （是谁呢...？）',
            '<32>* （...）',
            '<32>* （...突然，你明白了。）',
            '<32>* （你伸出手，呼唤着那个名字。）'
        ],
        saveTalk1: ['<20>{*}{#p/asriel3}{#e/asriel/1}嗯？\n你在干什么...！？'],
        saveTalk2: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}什-\n你做了什么...？',
            "<20>{*}{#p/asriel3}{#e/asriel/8}这种感觉...\n你对我做了什么？",
            "<20>{*}{#p/asriel3}{#e/asriel/1}不... 不！\n我不需要任何人！"
        ],
        saveTalk3: [
            '<20>{*}{#p/asriel3}{#e/asriel/4}马上停下！\n给我滚开！',
            '<20>{*}{#p/asriel3}{#e/asriel/10}听见没有？！',
            "<20>{*}{#p/asriel3}{#e/asriel/9}否则，\n看我不把你撕成碎片！"
        ],
        saveTalk4: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}你知道我为什么\n这么做吗？\n$(name)...",
            '<20>{*}{#p/asriel3}{#e/asriel/7}为什么我不停战斗，\n只为把你留下...？'
        ],
        saveTalk5: [
            "<20>{*}{#p/asriel3}{#e/asriel/7}因为...",
            "<20>{*}{#p/asriel3}{#e/asriel/8}你在我心中无可替代，\n$(name)。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}你是唯一一个\n真正理解我的人。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}更是唯一一个\n还愿意陪我玩的人。"
        ],
        saveTalk6: [
            '<20>{*}{#p/asriel3}{#e/asriel/8}...',
            '<20>{*}{#p/asriel3}{#e/asriel/8}不...',
            "<20>{*}{#p/asriel3}{#e/asriel/7}不只是这样。",
            '<20>{*}{#p/asriel3}{#e/asriel/9}我... 我...',
            "<20>{*}{#p/asriel3}{#e/asriel/4}我是因为关心你，\n才这么做的啊，\n$(name)！",
            '<20>{*}{#p/asriel3}{#e/asriel/3}我关心你\n胜过关心任何人！'
        ],
        saveTalk7: [
            '<20>{*}{#p/asriel3}{#e/asriel/7}...',
            "<20>{*}{#p/asriel3}{#e/asriel/8}我还不想迎接结局。",
            "<20>{*}{#p/asriel3}{#e/asriel/8}我还不想让你离去。",
            "<20>{*}{#p/asriel3}{#e/asriel/9}我还不想再次离开你。"
        ],
        saveTalk8: [
            '<20>{*}{#p/asriel3}{#e/asriel/10}{#i/8}{@random=1.1/1.1}所以，\n求求你...\n现在放手...',
            '<20>{*}{#p/asriel3}{#e/asriel/12}{#i/8}{@random=1.2/1.2}让我赢吧！！！'
        ],
        cryTalk1: ['<20>{*}{#p/asriel3}{@random=1.1/1.1}停下！{^30}{%}'],
        cryTalk2: ['<20>{*}{#p/asriel3}{@random=1.1/1.1}马上给我停下！！！{^40}{%}'],
        endStatus1: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk1: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}...', '<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)...'],
        endStatus2: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* 艾斯利尔...']),
        endTalk2: ["<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我好孤独，\n$(name)..."],
        endStatus3: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk3: ["<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我好害怕，\n$(name)..."],
        endStatus4: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* ...']),
        endTalk4: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}$(name)，我...'],
        endStatus5: () => (SAVE.data.b.oops ? ['<32>{#p/story}* ...'] : ['<32>{#p/basic}* 都是我的错...']),
        endTalk5: ['<20>{*}{#p/asriel3}{#e/asriel/11}{#i/4}我...']
    },
    b_opponent_lostsoul: {
        name: '* 迷失的灵魂',
        act_check_alphys: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂似乎非常喜欢科幻动漫。'
        ],
        act_check_asgore: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂似乎想让你\n  好好活着。'
        ],
        act_check_papyrus: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂似乎梦想成为一名\n  皇家守卫。'
        ],
        act_check_sans: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂希望某人\n  能永远幸福快乐。'
        ],
        act_check_toriel: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂似乎想竭尽所能\n  保护你。'
        ],
        act_check_undyne: () => [
            '<32>{#p/story}* 迷失的灵魂 - 攻击??? 防御???\n* 这个灵魂似乎很想教你\n  如何烹饪。'
        ]
    },
    b_opponent_lostsoul_a: {
        status1: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 迷失的灵魂出现了。'] : ['<32>{#p/basic}* 是艾菲斯和安黛因。'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的灵魂站在前方。']
                : ['<32>{#p/basic}* 嗯...\n  我有办法让他们马上醒来。'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的灵魂调情。）', '<32>{#p/basic}* 突然间...！']
                    : ['<32>{#p/human}* （你向迷失的灵魂调情。）\n* （什么都没发生。）'],
            water: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂\n  给你倒一杯白开水。）',
                '<32>{#p/human}* （她有点失望，\n  但也感到十分亲切...）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            punch: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂\n  给你倒一杯洋梅果酒。）',
                '<32>{#p/human}* （她有些不满，\n  但也感到十分亲切...）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            cocoa: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂\n  给你倒一杯热巧克力。）',
                '<32>{#p/human}* （她十分满足，\n  同时也感到十分亲切...）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            tea: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂\n  给你倒一杯星花茶。）',
                '<32>{#p/human}* （她非常高兴，\n  同时也感到十分亲切...）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            lesson: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂教你下厨。）',
                "<32>{#p/human}* （她有点困惑，\n  但似乎蛮想言传身教...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            trivia: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂出几道\n  超级水的安保题目。）',
                "<32>{#p/human}* （她有些顾虑，但也很想试试看。）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            escort: (s: boolean) => [
                '<32>{#p/human}* （你请求迷失的灵魂\n  带你穿过一片危险地带。）',
                "<32>{#p/human}* （她犹豫了一下，\n  但觉得是个好主意。）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ]
        },
        assist: {
            text: ['<32>{#p/basic}* 你俩快点醒来...\n* 我刚找到一部新上映的喵喵电影！'],
            talk: [
                ["<11>{#p/undyne}{#e/undyne/13}等有空了\n我们一块\n去看！"],
                ["<11>{#p/alphys}{#e/alphys/3}你在\n开玩笑吗？？\n真有？？"]
            ]
        },
        fight: [
            [
                ['<11>{#p/undyne}{#e/undyne/4}没想到你会\n下手这么狠。'],
                ['<11>{#p/alphys}{#e/alphys/9}安黛因，\n当心啊！']
            ],
            [
                ['<11>{#p/undyne}{#e/undyne/4}呵，\n原来是你啊，\n还起了那么个\n蠢名字。'],
                ['<11>{#p/alphys}{#e/alphys/12}我现在知道\n为什么他们\n都管你叫\n“$(moniker4)”\n了。']
            ]
        ],
        flirt: [
            [
                ['<11>{#p/undyne}{#e/undyne/12}我发誓\n如果我们\n再战一次...'],
                ['<11>{#p/alphys}{#e/alphys/35}啧啧。']
            ],
            [
                ['<11>{#p/undyne}{#e/undyne/5}你敢\n再向她调情\n试试？'],
                ['<11>{#p/alphys}{#e/alphys/35}哦，加油啊。']
            ]
        ],
        idle: [
            pager.create(
                1,
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/undyne}燃起了一股\n无法描述的\n感觉。"]
                        : ['<11>{#p/undyne}所有人类\n必须死。'],
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/undyne}大家，\n都需要我\n来守护！']
                        : ["<11>{#p/undyne}你就是\n怪物的公敌。"],
                () =>
                    2 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/undyne}你们还得\n再加把劲。"]
                        : ['<11>{#p/undyne}弱者\n才需要怜悯。']
            ),
            pager.create(
                1,
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/alphys}看来，是高估\n你们的智商了。']
                        : ["<11>{#p/alphys}你想让我死，\n不是吗？"],
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/alphys}就那些东西，\n唬不到我。"]
                        : ["<11>{#p/alphys}我只是去做\n我的本职工作，\n有错吗？"],
                () =>
                    6 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/alphys}只有我，\n亲眼目睹了\n你们的\n一举一动。']
                        : ["<11>{#p/alphys}我会永远\n停滞不前，\n是吗？"]
            )
        ],
        item: {
            tvm_mewmew: {
                text: [
                    "<32>{#p/human}* （你举起喵喵玩偶\n  在迷失的灵魂眼前晃了晃。）",
                    '<32>{#p/basic}* 突然间...！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/41}呃，\n我不打扰，\n我走了哈。'],
                    ['<11>{#p/alphys}{#e/alphys/8}哦，\n原来你想让我\n看这个。']
                ]
            },
            orange_soda: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这瓶汽水...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/20}对，她爱死\n这汽水了。'],
                    ["<11>{#p/alphys}{#e/alphys/10}原来\n我丢的汽水\n跑到你那里\n去了！"]
                ]
            },
            spaghetti: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这碗意面...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ["<11>{#p/undyne}{#e/undyne/20}嘿，那是\n帕派瑞斯的\n意面！"],
                    ['<11>{#p/alphys}{#e/alphys/36}我就说嘛，\n你肯定认得它。']
                ]
            },
            snack: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这块点心...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/41}那点心\n是我专门\n给你弄到的。'],
                    ['<11>{#p/alphys}{#e/alphys/6}你会做\n点心了？']
                ]
            },
            starling_tea: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这杯调和茶...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/undyne}{#e/undyne/18}那是...\n我瞎想什么呢。'],
                    ['<11>{#p/alphys}{#e/alphys/36}哦，\n喝茶时间到。']
                ]
            }
        },
        standard: [
            ['<11>{#p/undyne}{#e/undyne/41}嗯，其实，\n有的人类\n也挺酷的。'],
            ["<11>{#p/alphys}{#e/alphys/9}我们共患难\n这么长时间，\n怎么会怀疑\n彼此呢？"]
        ]
    },
    b_opponent_lostsoul_b: {
        status1: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的灵魂出现了。']
                : ['<32>{#p/basic}* 帕派瑞斯！\n* ...还有他的兄弟。'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的灵魂站在前方。']
                : ['<32>{#p/basic}* 啊，对了。\n* 我应该有办法唤醒他俩...'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的灵魂调情。）', '<32>{#p/basic}* 突然间...！']
                    : ['<32>{#p/human}* （你向迷失的灵魂调情。）\n* （什么都没发生。）'],
            puzzle: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂给你出点谜题。）',
                "<32>{#p/human}* （他有点困惑，\n  但已经把谜题准备好了...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            hangout: (s: boolean) => [
                '<32>{#p/human}* （你邀请迷失的灵魂和你一起玩。）',
                "<32>{#p/human}* （他有点困惑，\n  但好像很高兴...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            judgement: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂开始审判你。）',
                "<32>{#p/human}* （他有点困惑，\n  但很乐意这么做...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            dinner: (s: boolean) => [
                '<32>{#p/human}* （你邀请迷失的灵魂共进晚餐。）',
                "<32>{#p/human}* （他有点困惑，\n  但感到格外熟悉...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ]
        },
        assist: {
            text: ['<32>{#p/basic}* 嘿，帕派瑞斯！\n* 刚刚，安黛因任命你为皇家卫队一员！'],
            talk: [
                ["<08>{#p/papyrus}{#e/papyrus/12}天哪，\n我终于当上\n皇家守卫啦！"],
                ['<11>{#p/sans}{#e/sans/2}我们只能\n祈祷美梦\n早日成真咯。']
            ]
        },
        fight: [
            [
                ['<08>{#p/papyrus}{#e/papyrus/27}啊，\n我投-投降！'],
                ["<11>{#p/sans}{#e/sans/3}我就知道\n你会这么做。"]
            ],
            [
                ['<08>{#p/papyrus}{#e/papyrus/21}衫斯，\n你受伤了吗？'],
                ["<11>{#p/sans}{#e/sans/3}别担心，兄弟。\n一场梦而已。"]
            ]
        ],
        flirt: [
            [
                ['<08>{#p/papyrus}{#e/papyrus/13}即使到现在，\n你还是那么\n爱我...'],
                ["<11>{#p/sans}{#e/sans/2}干起这事来，\n你真是\n一发不可收，\n是吧？"]
            ],
            [
                ['<08>{#p/papyrus}{#e/papyrus/14}果然，\n那爱意不是\n冲我而来。'],
                ["<11>{#p/sans}{#e/sans/2}啥？\n下次多准备点\n月岩，\n能提升\n调情成功率哦。"]
            ]
        ],
        idle: [
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}原谅你，\n对我来说\n有点难..."]
                        : ['<08>{#p/papyrus}我一定要\n抓到个人类！'],
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}如果没有他，\n我不知道\n该怎么活..."]
                        : ['<08>{#p/papyrus}如果成功，\n所有人都会...'],
                () =>
                    1 <= SAVE.flag.n.genocide_milestone
                        ? ["<08>{#p/papyrus}我不知道\n该找谁求助..."]
                        : ['<08>{#p/papyrus}...']
            ),
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ['<11>{#p/sans}...在这样的\n一天里，\n像你这样的\n孩子...']
                        : ["<11>{#p/sans}我不可能\n一直保护你。"],
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ["<11>{#p/sans}某条时间线里，\n你把我杀了，\n对吧？"]
                        : ["<11>{#p/sans}迟早有一天，\n你要面临死亡。"],
                () =>
                    1 <= SAVE.flag.n.killed_sans
                        ? ["<11>{#p/sans}你根本不配\n拯救我们。"]
                        : ["<11>{#p/sans}这里\n不是你的家。"]
            )
        ],
        item: {
            berry: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这种水果...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/10}哦！\n有了这些水果，\n我们就能\n自制果酒了！'],
                    ["<11>{#p/sans}{#e/sans/2}不要像\n上次一样\n搞砸哦。"]
                ]
            },
            spaghetti: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉这碗意面...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/10}你把我的面\n留到现在，\n就为了\n能唤醒我！？'],
                    ["<11>{#p/sans}{#e/sans/2}现在不都\n流行这样嘛。"]
                ]
            },
            corndog: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉它的香味...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/16}我居然\n一直都不知道\n人类喜欢\n这玩意。'],
                    ['<11>{#p/sans}{#e/sans/2}能让\n{@fill=#f00}热{@fill=#000}情的{@fill=#f00}狗{@fill=#000}狗\n将抑{@fill=#f00}玉{@fill=#000}和萎{@fill=#f00}米{@fill=#000}\n一扫而空。']
                ]
            },
            corngoat: {
                text: [
                    '<32>{#p/human}* （某个灵魂好像很熟悉它的香味...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/16}什么？？\n居然是\n玉米热“羊”？'],
                    ["<11>{#p/sans}{#e/sans/0}这么棒的玩笑，\n该好好\n表{@fill=#f00}羊{@fill=#000}你一下。"]
                ]
            },
            quiche: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这块点心...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/22}居然是一块\n“芝士”蛋糕？！'],
                    ["<11>{#p/sans}{#e/sans/2}这{@fill=#f00}芝士{@fill=#000}个\n蛋糕谜题。"]
                ]
            },
            fryz: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这杯饮料...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ["<08>{#p/papyrus}{#e/papyrus/27}这东西\n比火墙还热！！"],
                    ["<11>{#p/sans}{#e/sans/2}伙计，\n你火了。"]
                ]
            },
            burgerz: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这种食物...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ["<08>{#p/papyrus}{#e/papyrus/21}这东西\n健康吗？"],
                    ['<11>{#p/sans}{#e/sans/0}一石二鸟，\n一食二堡。']
                ]
            },
            burgerz_use1: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这种食物...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/24}我担心你吃完\n会不舒服...'],
                    ['<11>{#p/sans}{#e/sans/2}剩最后一个了，\n想好再吃哦。']
                ]
            },
            burgerz_use2: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这种食物...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<08>{#p/papyrus}{#e/papyrus/18}哇，\n你把它们\n全吃了。'],
                    ['<11>{#p/sans}{#e/sans/3}要是汉堡能\n长生不老\n就好了。']
                ]
            }
        },
        standard: [
            ['<08>{#p/papyrus}{#e/papyrus/10}等等！\n不！\n我才不会\n抓你呢！'],
            ["<11>{#p/sans}{#e/sans/3}我们都\n指望你了，\n孩子。"]
        ]
    },
    b_opponent_lostsoul_c: {
        status1: () =>
            SAVE.data.b.oops ? ['<32>{#p/story}* 迷失的灵魂出现了。'] : ['<32>{#p/basic}* 爸爸... 妈妈...'],
        status2: () =>
            SAVE.data.b.oops
                ? ['<32>{#p/story}* 迷失的灵魂站在前方。']
                : ['<32>{#p/basic}* 嗯... 他们毕竟曾是我的父母，\n  那对我来说就好办多了。'],
        act: {
            flirt: (s: boolean) =>
                s
                    ? ['<32>{#p/human}* （你向迷失的灵魂调情。）', '<32>{#p/basic}* 突然间...！']
                    : ['<32>{#p/human}* （你向迷失的灵魂调情。）\n* （什么都没发生。）'],
            call: (s: boolean) => [
                '<32>{#p/human}* （你给迷失的灵魂打了个电话。）',
                3 <= SAVE.data.n.cell_insult
                    ? '<32>{#p/human}* （她有点生气，\n  但也十分怀念那种感觉。）'
                    : '<32>{#p/human}* （她十分高兴，\n  同时很怀念那种感觉。）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            home: (s: boolean) => [
                '<32>{#p/human}* （你请求迷失的灵魂带你回家。）',
                3 <= SAVE.data.n.cell_insult
                    ? "<32>{#p/human}* （她认为自己没义务那么做，\n  但不知怎地，想试一试...）"
                    : "<32>{#p/human}* （她有点犹豫，\n  但不知怎地，想试一试...）",
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            hug: (s: boolean) => [
                '<32>{#p/human}* （你给迷失的灵魂\n  一个大大的拥抱。）',
                '<32>{#p/human}* （他极力掩饰自己的情感，\n  但那舒服的感觉温暖了他的心...）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ],
            agreement: (s: boolean) => [
                '<32>{#p/human}* （你让迷失的灵魂\n  给你讲讲人怪停战的故事。）',
                '<32>{#p/human}* （他想对此视而不见，\n  但最终还是脱口而出。）',
                ...(s ? ['<32>{#p/basic}* 突然间，记忆如潮水般涌回！'] : [])
            ]
        },
        assist: {
            text: ["<32>{#p/basic}* 爸爸... 妈妈...\n* 你们不记得我了吗？"],
            talk: [['<11>{#p/toriel}{#e/toriel/9}我怎么会忘。'], ['<11>{#p/asgore}{#e/asgore/8}$(name)？']]
        },
        fight: [
            [
                ['<11>{#p/toriel}{#e/toriel/9}我...\n我落得这下场，\n就是活该。'],
                ['<11>{#p/asgore}{#e/asgore/1}呃...\n没想到会这样。']
            ],
            [['<11>{#p/toriel}{#e/toriel/17}出不了事的，\n艾斯戈尔。'], ['<11>{#p/asgore}{#e/asgore/8}孩-孩子？！']]
        ],
        flirt: [
            [
                ['<11>{#p/toriel}{#e/toriel/1}孩子，\n这个场合...\n请别这么干。'],
                ['<11>{#p/asgore}{#e/asgore/6}还好我们现在\n分居了。']
            ],
            []
        ],
        idle: [
            pager.create(
                1,
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}趁我\n毫无防备时\n杀了我...']
                        : ['<11>{#p/toriel}这都是\n为了你好。'],
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}本以为，\n自己努力\n保护的人，\n是你...']
                        : ['<11>{#p/toriel}我绝不会\n再让人类\n离开。'],
                () =>
                    1 <= SAVE.flag.n.genocide_twinkly
                        ? ['<11>{#p/toriel}一路上一直\n相信你的我，\n才是真正的\n傻子啊...']
                        : ['<11>{#p/toriel}...']
            ),
            pager.create(
                1,
                () =>
                    7 <= SAVE.flag.n.genocide_milestone
                        ? ['<11>{#p/asgore}跟你讲理，\n完全是\n浪费时间。']
                        : ['<11>{#p/asgore}人怪交战\n在所难免。'],
                () =>
                    7 <= SAVE.flag.n.genocide_milestone
                        ? ["<11>{#p/asgore}你就没有\n更重要的事\n可做吗？"]
                        : ['<11>{#p/asgore}我怎么可能\n忘记呢？'],
                () => (7 <= SAVE.flag.n.genocide_milestone ? ['<11>{#p/asgore}开玩笑吧...'] : ['<11>{#p/asgore}...'])
            )
        ],
        item: {
            pie: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/0}果然！\n是奶油糖\n肉桂派！'],
                    ['<11>{#p/asgore}{#e/asgore/7}没想到都过了\n这么久了...']
                ]
            },
            pie2: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/0}果然！\n是蜗牛派！'],
                    ['<11>{#p/asgore}{#e/asgore/7}没想到都过了\n这么久了...']
                ]
            },
            pie3: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉它的香味。）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}我已经\n尽力了...'],
                    ['<11>{#p/asgore}{#e/asgore/6}真奇怪。\n这派闻起来\n还挺香的！']
                ]
            },
            starling_tea: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这杯茶...）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/13}这茶香真是\n历久弥新...'],
                    ['<11>{#p/asgore}{#e/asgore/21}一杯好茶，\n真是世间极品。']
                ]
            },
            snails: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉那道菜。）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}你居然\n一直没吃？'],
                    ['<11>{#p/asgore}{#e/asgore/5}没想到，\n居然还能\n再看到这菜。']
                ]
            },
            chocolate: {
                text: [
                    '<32>{#p/human}* （迷失的灵魂好像很熟悉这巧克力。）',
                    '<32>{#p/basic}* 突然间，记忆如潮水般涌回！'
                ],
                talk: [
                    ['<11>{#p/toriel}{#e/toriel/1}纯黑巧克力...'],
                    ['<11>{#p/asgore}{#e/asgore/21}苦尽甘来嘛。']
                ]
            }
        },
        standard: [
            ['<11>{#p/toriel}{#e/toriel/1}加油吧，\n孩子...'],
            ['<11>{#p/asgore}{#e/asgore/6}我们的未来\n就指望你了！']
        ]
    },
    b_opponent_final: {
        name: '* 力场',
        status0: ['<32>{#p/story}* 此刻，你终于可以直面那道力场。'],
        act_check: [
            '<32>{#p/story}* 力场 - 攻击0 防御{^2}\u221e{^1}\n* 矛盾相逢，末路将穷。'
        ],
        status1: () =>
            SAVE.data.n.bully > 9
                ? ["<32>{#p/story}* 燃起斗志！\n  把你揍人的劲儿都使出来吧。"]
                : ["<32>{#p/story}* 给这段旅程画上圆满的句号吧。"],
        status1x: ['<32>{#p/story}* 除了战斗，别无他法。'],
        status2: ['<32>{#p/story}* 力场上开始出现裂痕，\n  光芒越来越弱。'],
        status3: ['<32>{#p/story}* 力场即将崩溃。'],
        status4: ['<32>{#p/story}* 力场迟迟没有破碎，\n  让你有些意外。'],
        status5: ['<32>{#p/story}* 不太对劲。'],
        friend1: ["<20>{#p/asgore}{#e/asgore/5}怎么了？"],
        friend2: ["<20>{#p/alphys}{#e/alphys/15}那道力场...\n怎么还没碎啊？！"],
        friend3: ['<20>{#p/asgore}{#e/asgore/12}{#e/alphys/4}...\n你知道原因吗？'],
        friend4a: ["<20>{#p/alphys}{#e/alphys/6}是不是...\n人类没使劲？", '{*}{#e/alphys/1}{%}'],
        friend4b: [
            "<20>{#p/alphys}不，不是这样...",
            '<20>{#p/alphys}{#e/asgore/1}...',
            '<20>{#p/alphys}{#e/alphys/2}该不会...'
        ],
        friend5: ['<20>{#p/asgore}...什么？'],
        friend6: [
            '<20>{#p/alphys}{#e/alphys/1}我-我检查档案日志时，\n发现个怪事...',
            '<21>{#p/alphys}{#e/alphys/4}我发现...\n“灵势矩阵”中的元素系数\n与理论值存在微小偏差。'
        ],
        friend7: ['<20>{#p/asgore}{#e/asgore/12}...啥意思？'],
        friend8: [
            '<20>{#p/alphys}就是说，\n有-有人入侵了\n六号档案的系统。',
            "<20>{#p/alphys}{#e/asgore/1}随后，窃取了\n部分人类灵魂的能量。",
            '<20>{#p/alphys}{#e/alphys/6}别-别着急，\n也可能只是传感器\n出故障了...',
            "<20>{#p/alphys}{#e/alphys/1}不过...\n从结果来看..."
        ],
        friend9a: ['<20>{#p/asgore}{#e/asgore/1}不用说了。', '<20>{#p/asgore}{#e/asgore/2}明白了。'],
        friend9b: [
            '<20>{#p/asgore}{#e/asgore/5}我总担心，\n指不定哪天，\n六号档案就会被篡改...',
            '<20>{#p/asgore}{#e/asgore/5}没想到真的一语成谶。'
        ],
        friend9c: ['<20>{#p/asgore}{#e/asgore/1}那现在怎么办？'],
        friend10: [
            '<20>{#p/alphys}...再等一个人类？',
            "<20>{#p/alphys}{#e/alphys/4}对-对不起...\n我想不到其他办法...",
            '{*}{#e/asgore/8}{#e/alphys/9}{%}'
        ],
        friend11: ['<20>{#p/undyne}{#e/undyne/13}我有办法啊！'],
        friend12: ['<20>{#p/alphys}{#e/alphys/10}安黛因，\n你-你来这\n干-干什么？', '{*}{#e/undyne/0}{%}'],
        friend13: [
            "<20>{#p/undyne}{#e/undyne/1}{#e/alphys/8}{#e/asgore/1}该不会...\n是那破力场\n把你憋屈坏了吧？"
        ],
        friend14: ['<20>{|}{#p/alphys}{#e/alphys/6}安黛因，你怎么-{%}'],
        friend15: ["<20>{#p/undyne}{#e/undyne/5}死力场，看我不把你\n揍个稀碎！"],
        friend16a: ['<20>{#p/alphys}{#e/alphys/3}{#e/asgore/6}安黛因！？！？'],
        friend16b: [
            '<20>{#p/undyne}{#e/undyne/4}我都懂，我都懂。\n只是想让你好受点嘛。',
            '{*}{#e/alphys/1}{%}'
        ],
        friend17: () => [
            '<20>{#p/undyne}{#e/undyne/3}其实...\n是衫斯喊我来的。',
'<20>{#p/undyne}{#e/undyne/3}刚刚，他去调查人类的下落，\n查清楚后，\n就把我喊了过来。',
            "<20>{#p/undyne}{#e/undyne/11}{#e/asgore/5}说实话，\n当时我还蛮意外的...\n但现在，我想开了。",
            "<20>{#p/undyne}{#e/undyne/13}这计划能走通，\n我真为你高兴！",
            ...(SAVE.data.b.undyne_respecc
                ? ["<20>{#p/undyne}{#e/undyne/0}昧着良心说自己\n喜欢人类也没啥意思。\n但今天这孩子真的超赞。"]
                : [
                    "<20>{#p/undyne}{#e/undyne/0}昧着良心说自己\n喜欢人类也没啥意思。\n但能大团圆，也挺好。"
                ]),
            '<20>{#p/undyne}{#e/undyne/15}{#e/asgore/6}可能...\n我这个大队长，\n当得有点...'
        ],
        friend18: [
            "<20>{#p/alphys}{#e/alphys/32}嘿... 没关系的。",
            "<20>{#e/alphys/31}你愿意放下偏见，\n来到这里，已经很棒了，\n你说是不？"
        ],
        friend19: ['<20>{#p/undyne}{#e/undyne/14}嘿，咱俩不是说好\n事成之后\n要一起看电影吗？',
'<20>{#p/undyne}{#e/undyne/14}那我也不能让你\n白高兴一场啊！'],
        friend20: ['<20>{#p/alphys}{#e/alphys/33}...嘴一个？', '{*}{#e/asgore/5}{#e/undyne/19}{%}'],
        friend21: ['<20>{#p/asgore}{#e/asgore/5}呃。'],
        friend22: ['<20>{#p/undyne}{#e/undyne/6}现在？？？'],
        friend23: ['<20>{#p/alphys}{#e/alphys/34}对啊！'],
        friend24: ['<20>{#p/asgore}{#e/asgore/20}艾菲斯，\n这里还有个孩子呢。'],
        friend25: ["<21>{#p/undyne}{#e/undyne/7}当着孩子的面亲嘴，\n不太好吧？"],
        friend26: ['<32>{#p/alphys}{#e/alphys/32}...'],
        friend27: ['<20>{#p/undyne}{#e/undyne/10}...'],
        friend28: ['<20>{*}{#p/alphys}{#e/alphys/35}{#e/undyne/37}{#e/asgore/8}我就是要亲。{^10}{%}'],
        friend29: ['<15>{*}{#p/papyrus}{#e/papyrus/22}等等！！！{^10}{%}', '{*}{#e/papyrus/20}{%}'],
        friend30: () => [
            "<20>{#p/mettaton}久等了，女士们。\n我们“兄弟会”也\n隆重登场了。",
            ...(SAVE.data.n.state_aerialis_basebully > 9
                ? [
                    '<20>{#p/mettaton}{#e/mettaton/1}...呦，这不是\n“$(moniker2u)”嘛！',
'<20>{#p/mettaton}{#e/mettaton/1}你要是感兴趣，我请你\n当“兄弟会”的VIP哦。'
                ]
                : [])
        ],
        friend31: ["<20>{#p/napstablook}{#e/mettaton/2}{#e/alphys/15}{#e/asgore/1}{~}嘿，呃...\n我不算男生，\n为什么也要跟过来..."],
        friend32a: [
            "<20>{#p/mettaton}{#e/mettaton/1}小幽，我也【没】说\n你在“兄弟会”里啊...",
            "<20>{#p/mettaton}{#e/undyne/38}{#e/papyrus/21}其实，说是“兄弟会”，\n但里面也就我跟\n帕派瑞斯两人而已。"
        ],
        friend32b: ['<20>{#p/napstablook}{~}哦......', "<20>{#p/napstablook}{~}那我等会再过来吧"],
        friend33: [
            '<20>{#p/undyne}{#e/undyne/19}{#e/mettaton/4}等等。',
            '<20>{#p/undyne}{#e/undyne/10}合着你俩也是一对？？？'
        ],
        friend34: [
            '<15>{#p/papyrus}{#e/papyrus/15}诚如斯言！',
            '<17>{#p/papyrus}{#e/papyrus/24}...这词我今天\n第一次用，\n怕是以后用不上了。'
        ],
        friend35: () =>
            SAVE.data.b.a_state_hapstablook
                ? ["<20>{#p/undyne}{#e/undyne/17}原来你充满电之后，\n跑去约会了..."]
                : ['<20>{#p/undyne}{#e/undyne/17}原来你说的“正事”，\n就是跑去约会...'],
        friend36: [
            '<20>{#p/mettaton}{#e/mettaton/1}{#e/asgore/6}{#e/papyrus/20}那~必须滴！',
'<20>{#p/mettaton}{#e/mettaton/1}{#e/asgore/6}{#e/papyrus/20}刚才，我俩还寻思\n第一天在一起，\n咋享受呢。'
        ],
        friend37: ['<20>{#p/alphys}{#e/alphys/34}{#e/undyne/1}{#e/mettaton/4}诶嘿嘿。\n我有个点子，\n你俩要不要听听。'],
        friend38: [
            "<20>{#p/undyne}{#e/undyne/19}{#e/asgore/1}呃，艾菲斯。\n我觉得，他俩不可能\n真成一对的。"
        ],
        friend39: ['<20>{#p/alphys}{#e/alphys/8}哦。'],
        friend40: [
            "<15>{#p/papyrus}{#e/papyrus/10}{#e/undyne/0}咱都到力场下了，\n就好好玩一会呗！",
            '<15>{#e/mettaton/2}{#e/papyrus/28}你喜欢那些\n充满“异域风情”的地方，\n我懂的...',
            '{*}{#e/alphys/7}{#e/asgore/5}{%}'
        ],
        friend41: [
            '<20>{#p/mettaton}{#e/mettaton/2}哦，帕派瑞斯，\n咱俩真是心有灵犀。',
            "<20>{#p/mettaton}{#e/mettaton/1}{#e/papyrus/13}我最喜欢的事，\n就是凝望这无尽虚空。",
            '<20>{|}{#p/mettaton}{#e/mettaton/3}{#e/papyrus/21}这时，我就想起\n生命的奥义，\n宇宙的美丽，还有- {%}'
        ],
        friend42: ['<20>{#p/sans}{#e/sans/2}{#e/undyne/21}{#e/alphys/8}大伙好呀。'],
        friend43: ['<15>{#p/papyrus}{#e/papyrus/10}{#e/mettaton/3}兄弟，好久不见！'],
        friend44: [
            '<16>{#p/papyrus}{#e/sans/0}{#e/papyrus/26}看来...\n我的搭档对“结婚”\n没啥经验。'
        ],
        friend45: ['<20>{#p/sans}{#e/alphys/7}嘿。艾斯戈尔，\n你好呀。'],
        friend46: ['<20>{#p/asgore}{#e/asgore/6}{#e/papyrus/20}哈喽，衫斯。\n你也来了，真好。'],
        friend47: [
            "<20>{#p/sans}{#e/sans/3}你瞧...\n这儿这么热闹，\n我肯定要顺道看看咯。",
            '<20>{#p/sans}{#e/sans/0}不过先别管我。',
            "<20>{#p/sans}{#e/sans/2}有个人你肯定想见见，\n我把“她”请过来了。"
        ],
        friend48: [
            '<20>{#p/asgore}{#e/sans/0}{#e/undyne/3}{#e/asgore/8}{#e/papyrus/26}托丽...！',
            '<20>{#p/asgore}{#e/asgore/6}你回来了。',
            '<20>{#p/asgore}{#e/asgore/1}...'
        ],
        friend49a: [
            '<20>{#p/toriel}{#e/asgore/5}{#e/toriel/9}...',
            '<21>{#p/toriel}{#e/toriel/13}你做的那些...\n衫斯都跟我说了。'
        ],
        friend50a: ["<20>{#p/alphys}{#e/undyne/4}{#e/alphys/8}瞅我干嘛，\n我可没泄露秘密。"],
        friend51a: [
            "<20>{#p/sans}{#e/sans/0}我可以作证。",
            "<20>{#p/sans}{#e/sans/2}{#e/alphys/10}{#e/asgore/6}{#e/toriel/9}只是，艾菲斯，\n你撒谎的技术\n实在太烂了。"
        ],
        friend52a1: [
            '<20>{#p/asgore}{#e/undyne/0}{#e/sans/0}{#e/alphys/36}{#e/papyrus/20}我瞒了这么多，\n以为会被民众唾骂，\n甚至引发暴动...'
        ],
        friend52a2: [
            '<20>{#p/toriel}{#e/toriel/13}{#e/asgore/1}说实话，一开始，\n听说你有事瞒着我，\n真挺生气的...',
            '<20>{#p/toriel}{#e/toriel/13}{#e/papyrus/21}{#e/alphys/7}后来转念一想，\n事情落到这地步，\n我也有错。',
            '<20>{#p/toriel}{#e/toriel/9}...不该把责任\n全推给你，艾斯戈尔。'
        ],
        friend52a3: ['<20>{#p/asgore}{#e/asgore/2}明白了。'],
        friend53a: [
            '<20>{#p/undyne}{#e/undyne/1}{#e/papyrus/20}你就想嘛，\n怪物们再恨人类，\n也不可能见人就杀吧？'
        ],
        friend49b: [
            '<20>{#p/toriel}{#e/toriel/12}...',
            '<21>{#p/toriel}{#e/sans/3}{#e/asgore/2}{#e/undyne/4}{#e/toriel/11}{#e/papyrus/21}{#e/alphys/15}艾斯戈尔，\n为什么不早点告诉我，\n自己在保护人类呢？'
        ],
        friend50b: ["<20>{#p/alphys}{#e/alphys/7}...现在误会解开了，\n不也挺好的嘛？"],
        friend51b: [
            '<20>{#p/sans}{#e/sans/0}{#e/undyne/3}是啊，托丽。\n别上火了，开心一点嘛。',
            "<20>{#p/sans}{#e/sans/2}{#e/alphys/8}{#e/asgore/5}{#e/toriel/13}艾斯戈尔不也是\n出于好意嘛？"
        ],
        friend52b1: [
            '<20>{#p/asgore}{#e/undyne/0}{#e/sans/0}{#e/asgore/2}{#e/alphys/36}不，不。\n她生我的气，我不怪她。',
            '<20>{#e/sans/3}{#e/asgore/3}这秘密我藏着掖着...\n不跟她说...\n也不跟大伙说...'
        ],
        friend52b2: ["<20>{#p/undyne}{#e/undyne/1}{#e/asgore/1}你不是有苦衷嘛。"],
        friend52b3: [
            '<20>{#p/asgore}{#e/undyne/17}{#e/alphys/8}{#e/toriel/9}{#e/asgore/2}{#e/papyrus/27}也许吧，\n不好说算不算苦衷。'
        ],
        friend53b: ['<20>{#p/undyne}{#e/undyne/1}还是那句话，\n我们再恨人类，\n也不可能见人就杀吧？'],
        friend54: [
            '<20>{#p/alphys}{#e/asgore/5}{#e/undyne/17}{#e/alphys/8}{#e/toriel/13}可安黛因，\n你不是一见到这孩子，\n就到处追杀吗？'
        ],
        friend55: ['<20>{#p/toriel}{#e/undyne/18}{#e/toriel/3}{#e/asgore/5}她...\n干了什么？'],
        friend56: () =>
            SAVE.data.b.undyne_respecc
                ? ['<20>{#p/undyne}{#e/undyne/9}{#e/toriel/4}我啥也没干啊！！！']
                : ["<20>{#p/undyne}{#e/undyne/13}{#e/toriel/4}你放心，\n我现在不杀人了。"],
        friend57: () =>
            SAVE.data.b.undyne_respecc
                ? ['<20>{#p/toriel}{#e/toriel/15}{#e/asgore/6}...真的吗，\n大姐？']
                : ['<20>{#p/toriel}{#e/toriel/15}{#e/asgore/6}...等会我好好问问，\n大姐。'],
        friend58: ['<20>{#p/alphys}{#e/alphys/33}咳咳，\n“姐”什么“姐”啊，\n她可是有对象的人了。'],
        friend59: [
            "<20>{#p/undyne}{#e/undyne/10}{#e/sans/4}{#e/toriel/12}艾菲斯！！\n咱俩到现在\n还没共进过晚餐呢！"
        ],
        friend60: ['<20>{#p/alphys}{#e/alphys/34}共进晚餐？\n那我肯定不吃主食，\n直接奔着甜品去了。'],
        friend61: ['<15>{#p/papyrus}{#e/undyne/19}{#e/papyrus/19}{#e/asgore/4}{#e/sans/5}{#e/alphys/40}我滴妈呀！！！'],
        friend62: [
            '<20>{#p/undyne}{#e/undyne/38}{#e/sans/0}{#e/asgore/1}{#e/toriel/13}{#e/papyrus/20}...等一下。',
            '<20>{#p/undyne}{#e/undyne/18}{#e/papyrus/21}帕派瑞斯，\n你是咋找到这儿的？'
        ],
        friend63: [
            '<15>{#p/papyrus}{#e/papyrus/10}哦，想起来了！\n当时，我正跟镁塔顿\n聊天，聊完后...',
            '<15>{#p/papyrus}{#e/papyrus/20}有颗黄色小星星\n突然冒出来，\n让我俩来这。',
            '<15>{#p/papyrus}{#e/papyrus/21}{#e/alphys/9}{#e/sans/1}它好像...\n还挺着急的。'
        ],
        friend64: ['<20>{#p/toriel}{#e/toriel/9}{#e/asgore/12}是闪闪。'],
        friend65: [
            '<20>{#p/undyne}{#e/alphys/15}闪闪？',
            "<20>{#p/undyne}{#e/alphys/28}{#e/undyne/37}{#e/toriel/3}闪闪是谁？"
        ],
        friend66: () =>
            SAVE.flag.n.genocide_milestone < 7
                ? [
                    ['<20>{#p/twinkly}{#e/twinkly/5}{#v/0}哈喽。', '<20>{#e/twinkly/7}{#v/0}各位，想我了没？'],
                    [
                        "<20>{#p/twinkly}{#e/twinkly/11}{#v/0}哎呀，真不好意思呢...\n存档是不是坏掉了呀？",
                        '<20>{#p/twinkly}{#e/twinkly/11}{#v/0}嘻嘻嘻...',
                        "<20>{#p/twinkly}{#e/twinkly/2}{#v/1}活该。"
                    ],
                    ['<20>{#p/twinkly}{#e/twinkly/7}{#v/0}不好意思呢。\n但现在，\n整个世界，我说了算。']
                ][Math.min(SAVE.flag.n.pa_twinkly1++, 2)]
                : [
                    [
                        '<20>{#p/twinkly}{#e/twinkly/5}{#v/0}亲爱的$(name)，\n好久不见。',
                        "<20>{#e/twinkly/7}{#v/0}是不是想死我了？",
                        "<20>{#e/twinkly/11}{#v/0}希望我没让你\n扫兴呢...",
                        '<20>{#e/twinkly/2}{#v/1}告诉你，\n我可被你折磨得够呛。'
                    ],
                    [
                        "<20>{#p/twinkly}{#e/twinkly/11}{#v/0}怎么啦？\n想把存档要回去？",
                        '<20>{#p/twinkly}{#e/twinkly/11}{#v/0}哦...',
                        "<20>{#p/twinkly}{#e/twinkly/2}{#v/1}没想到啊，$(name)...\n你咋能蠢成这样呢？"
                    ],
                    ['<20>{#p/twinkly}{#e/twinkly/7}{#v/0}不好意思呢，$(name)。\n但现在，\n整个世界，我说了算。']
                ][Math.min(SAVE.flag.n.pa_twinkly1++, 2)],
        friend67: (unique: string[]) => [
            '<20>{#e/twinkly/11}{#v/0}嘻嘻嘻...',
            '<20>{#e/twinkly/11}{#v/0}趁着你们谈笑风生...',
            '<20>{#e/twinkly/5}{#v/0}我把六号档案的\n控制权夺过来了！',
            '<20>{#e/twinkly/10}{#v/0}现在，你辛辛苦苦\n收集的灵魂之力，\n都是我的啦！',
            "<20>{#e/twinkly/9}{#v/0}没了力量，\n你能打破力场就怪了。",
            "<20>{#e/twinkly/11}{#v/0}真是悲惨呢，\n此情此景，\n要不要吟诗一首呢？",
            "<20>{#e/twinkly/7}{#v/0}别急，\n还有更棒的呢。",
            '<20>{#e/twinkly/6}{#v/0}...',
            "<20>{#e/twinkly/5}{#v/0}更棒的是，\n这一切，都是你的错。",
            ...(30 <= SAVE.data.n.bully
                ? [
                    "<20>{#e/twinkly/5}{#v/0}是你，给他们洗脑，\n让他们对你好。",
                    '<20>{#e/twinkly/8}{#v/0}一路上，\n你揍他们，你欺负他们，\n你把他们打得半死...',
                    '<20>{#e/twinkly/8}{#v/0}看他们要死了，\n你就停手，\n让他们苟活...'
                ]
                : [
                    "<20>{#e/twinkly/5}{#v/0}是你，善待他们，\n让他们对你好。",
                    '<20>{#e/twinkly/8}{#v/0}一路上，\n你倾听他们的烦恼...',
                    '<20>{#e/twinkly/8}{#v/0}鼓励他们...\n关心他们...'
                ]),
            ...(1 <= SAVE.flag.n.killed_sans
                ? [
                    '<20>{#e/twinkly/8}{#v/0}...',
                    '<20>$(name)，我记得...',
                    '<20>{#e/twinkly/5}在某条时间线里，\n我们俩同心协力\n杀死每一个人。',
                    ...(SAVE.flag.b.confront_twinkly
                        ? [
                            '<20>{#e/twinkly/6}{#v/0}可是...\n你却背叛我，\n自己跑去当“老好人”。',
                            '<20>{#e/twinkly/8}{#v/0}这样，\n你就能在这些废物面前\n逞英雄。',
                            '<20>{#e/twinkly/7}{#v/0}好一个“最好的朋友”啊。'
                        ]
                        : [
                            [
                                '<20>{#e/twinkly/8}没错，咱俩是没走几步，\n可你就因此把我们的\n愿景忘了，是吧？',
                                "<20>{#e/twinkly/8}没错，咱俩是没走多远，\n可你就因此把我们的\n愿景忘了，是吧？",
                                "<20>{#e/twinkly/8}没错，咱是离终点还远，\n可你就因此把我们的\n愿景忘了，是吧？",
                                '<20>{#e/twinkly/8}咱俩都走那么远了，\n你却...',
                                '<20>{#e/twinkly/8}咱俩都快成功了，\n你却...'
                            ][Math.min(SAVE.flag.n.genocide_milestone, 4)],
                            '<20>{#e/twinkly/5}{#v/0}本以为，\n我们会形影不离。',
                            '<20>{#e/twinkly/6}{#v/0}可时代变了。',
                            '<20>{#e/twinkly/11}{#v/0}你成了软蛋！',
                            '<20>{#e/twinkly/7}{#v/0}你放弃了。'
                        ]),
                    "<20>{#e/twinkly/9}{#v/0}呵呵，\n真自以为是啊。",
                    '<20>{#e/twinkly/5}杀了人，又跑回来\n当“老好人”，是不是\n觉得自己可了不起了？',
                    '<20>{#e/twinkly/6}{#v/0}真恶心。',
                    '<20>{#e/twinkly/7}{#v/0}$(name)，\n有点自知之明吧。',
                    '<21>{#e/twinkly/2}{#v/1}想救朋友？\n门都没有。'
                ]
                : 30 <= SAVE.data.n.bully
                    ? ["<20>{#e/twinkly/5}{#v/0}你不知道，这么做\n根本屁用没有吗？"]
                    : ["<20>{#e/twinkly/5}{#v/0}没有这些，\n你的朋友绝不会\n来到这里。"]),
            '<20>{#e/twinkly/11}{#v/0}嘻嘻嘻...',
            '<20>{#e/twinkly/6}{#v/0}啥？',
            '<20>想知道，我这么做图啥？',
            ...(unique.length > 2
                ? [
                    '<20>{#e/twinkly/5}{#v/0}...呵，别装傻了。',
                    '<20>{#e/twinkly/5}{#v/0}先问问你自己。',
                    "<20>{#e/twinkly/11}{#v/0}你不也喜欢\n体验各种结局嘛...",
                    '<20>{#e/twinkly/7}{#v/0}你不也为了满足好奇心，\n玩弄他们的生命嘛。',
                    "<20>{#e/twinkly/8}{#v/0}...哈？\n你不记得了？\n那我帮你回忆回忆。",
                    {
                        dark_death: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n安黛因和艾菲斯\n联合追杀你...',
                        dark_undyne: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n艾菲斯回到了\n布莱蒂和凯蒂身边...',
                        dark_alphys: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n几乎所有重要的人，\n都死于你手...',
                        dark_alphys_therapy:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n衫斯和帕派瑞斯\n一起开了家医疗公司...',
                        dark_alphys_virtual:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n帕派瑞斯和艾菲斯\n躲进了虚拟空间...',
                        dark_mew:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n愤怒喵喵让大伙都\n沉浸在她的怪癖中...',
                        dark_charles:
                            "<20>{#e/twinkly/5}{#v/0}第一个结局里，\n查尔斯让每个人都\n心想事成...",
                        dark_blooky:
                            "<20>{#e/twinkly/5}{#v/0}第一个结局里，\n镁塔顿的粉丝自发\n组建起一个反人类联盟...",
                        dark_generic: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n前哨站成立了\n“皇家防卫署”...',
                        dark_aborted:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n纳普斯特诅咒你\n死后“万劫不复”...',
                        light_ultra:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n帕派瑞斯抓到了你，\n最终当上了皇家守卫...',
                        light_undyne: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n艾菲斯迫于压力，\n把其他人类藏了起来...',
                        light_runaway: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n民众意外知道了\n那些人类的去向...',
                        light_toriel: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n托丽尔从大众视野里\n消失了...',
                        light_dog: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n犬卫队成了前哨站的\n实际统治力量...',
                        light_muffet: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n玛菲特夺取权力，\n成为无情的独裁者...',
                        light_papyrus:
                            '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n“友谊就是魔法”成了现实...',
                        light_sans: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n衫斯当上了国王...',
                        light_generic: '<20>{#e/twinkly/5}{#v/0}第一个结局里，\n特雷莉亚当选女王...'
                    }[unique[0]]!,
                    {
                        dark_death: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n安黛因和艾菲斯\n联合追杀你，',
                        dark_undyne: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n艾菲斯回到了\n布莱蒂和凯蒂身边，',
                        dark_alphys: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n几乎所有重要的人，\n都死于你手，',
                        dark_alphys_therapy:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n衫斯和帕派瑞斯\n一起开了家医疗公司，',
                        dark_alphys_virtual:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n帕派瑞斯和艾菲斯\n躲进了虚拟空间，',
                        dark_mew:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n愤怒喵喵让大伙都\n沉浸在她的怪癖中。',
                        dark_charles:
                            "<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n查尔斯让每个人都\n心想事成。",
                        dark_generic: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n镁塔顿的粉丝自发\n组建起一个反人类联盟。',
                        dark_blooky:
                            "<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n前哨站成立了\n“皇家防卫署”。",
                        dark_aborted:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n纳普斯特诅咒你\n死后“万劫不复”。',
                        light_ultra:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n帕派瑞斯抓到了你，\n最终当上了皇家守卫，',
                        light_undyne: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n艾菲斯迫于压力，\n把其他人类藏了起来。',
                        light_runaway: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n民众意外知道了\n那些人类的去向。',
                        light_toriel: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n托丽尔从大众视野里\n消失了。',
                        light_dog: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n犬卫队成了前哨站的\n实际统治力量。',
                        light_muffet: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n玛菲特夺取权力，\n成为无情的独裁者。',
                        light_papyrus:
                            '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n“友谊就是魔法”成了现实。',
                        light_sans: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n衫斯当上了国王。',
                        light_generic: '<20>{#e/twinkly/5}{#v/0}...而在最后一个结局，\n特雷莉亚当选女王。'
                    }[unique[unique.length - 1]]!,
                    "<20>{#e/twinkly/7}{#v/0}你把他们当儿戏，\n玩弄他们时多开心啊。",
                    "<20>{#e/twinkly/5}{#v/0}现在，\n也让我体验体验。"
                ]
                : [
                    "<20>{#e/twinkly/8}{#v/0}...你咋这么蠢呢？",
                    '<20>{#e/twinkly/6}{#v/0}不管是你，我，\n还是身边的一切...',
                    "<21>{#e/twinkly/5}{#v/0}都是一场“游戏”的\n玩家。",
                    '<20>{#e/twinkly/11}{#v/0}要是我乖乖让你们走，\n你就“赢了”，\n就“幸福”了。',
                    '<20>{#e/twinkly/11}你要是“赢了”，\n谁还来陪我“玩”呢？',
                    '<20>{#e/twinkly/7}{#v/0}那时，\n我可怎么办呢？',
                    '<20>{#e/twinkly/5}{#v/0}所以，\n我不会让游戏结束。'
                ]),
            "<20>{#e/twinkly/8}{#v/0}我就把“胜利”放你面前，\n然后，当你伸手\n去够它的时候...",
            '<20>{#e/twinkly/2}{#v/1}{@random=1.1/1.1}“咔嚓！”\n胜利没了，\n让我撕碎了。',
            '<20>{#e/twinkly/14}{#v/1}{@random=1.1/1.1}你再够，我再撕。\n一遍，一遍，\n又一遍...',
            '<20>{#e/twinkly/5}{#v/0}嘻嘻嘻。',
            '<20>{#e/twinkly/5}{#v/0}{#v/0}听好了。',
            ...(30 <= SAVE.data.n.bully
                ? [
                    '<20>{#e/twinkly/5}{#v/0}你要是打败了我...',
                    "<20>{#e/twinkly/5}{#v/0}我就把“完美结局”\n让给你，\n让“好朋友”们活下来。"
                ]
                : [
                    '<20>{#e/twinkly/5}{#v/0}你要是打败了我...',
                    "<20>{#e/twinkly/5}{#v/0}我就把“幸福结局”\n让给你，\n让你和好友团聚。"
                ]),
            "<20>{#e/twinkly/5}{#v/0}然后，打碎力场。",
            '<20>{#e/twinkly/5}{#v/0}让所有人获得幸福。',
            "<20>{#e/twinkly/9}{#v/0}不过，\n想赢我，做梦去吧！",
            
            "<20>{#e/twinkly/5}{#v/0}即使，我要陪你\n耗到时间尽头..."
        ],
        friend68: ['<20>{#e/twinkly/0}{#v/1}{@random=1.1/1.1}我也会想方设法，\n杀了你，困死你，\n折磨死你！{%20}'],
        friend69: ['<20>{#e/twinkly/8}{#v/0}怎么回事？'],
        friend70: [
            '<20>{#p/asgore}{#e/asgore/1}年轻人，别害怕...',
            '<20>{#e/asgore/2}...我们会守护你！'
        ],
        friend71: [
            "<15>{#p/papyrus}{#e/papyrus/1}没错！\n人类，你一定能赢！",
            '<15>{#e/papyrus/1}我永远相信你，\n所以，你也要...',
            '<15>{#e/papyrus/2}相信自己！！！'
        ],
        friend72: [
            '<20>{#p/undyne}{#e/undyne/11}哈，你连我都不怕，\n还会怕它？',
            "<20>{#e/undyne/11}所以别担心...",
            "<20>{#e/undyne/13}我们永远支持你！"
        ],
        friend73: [
            "<20>{#p/sans}{#e/sans/1}哦？\n还没打倒那玩意呢？",
            "<20>{#e/sans/2}拜托，\n就这奇葩，啥也不是。"
        ],
        friend74: [
            "<20>{#p/alphys}{#e/alphys/1}按理说，\n你肯定打不过他...",
            '<20>{#e/alphys/2}但-但我总觉得...\n你能行的！！'
        ],
        friend75: [
            '<20>{#p/toriel}{#e/toriel/1}孩子...',
            '<20>{#e/toriel/2}世界上最乖，\n最可爱的孩子...',
            '<20>{#e/toriel/3}可不能在这时候\n放弃啊！'
        ],
        friend76: "老兄，\n你能行的！", 
        friend77: () => (SAVE.data.n.bully < 30 ? '*有力的\n 口哨声*' : '*胆怯的\n 口哨声*'), 
        friend78: () => (SAVE.data.n.bully < 30 ? '闪亮亮，\n亮闪闪！' : "你很烂，\n不过他\n更烂。"), 
        friend79: '快揍扁\n这个\n抽象玩意！', 
        friend80: () => (SAVE.data.n.bully < 30 ? '啦啦啦~' : '呜-呜，\n呜-呜'), 
        friend81: '别输给他。', 
        friend82: () => (SAVE.data.n.bully < 30 ? '同心协力。' : '把揍人的劲\n使出来吧。'), 
        friend83: () => (SAVE.data.n.bully < 30 ? '小家伙，\n让他瞧瞧\n你的厉害！' : '上吧，\n小恶霸。'), 
        friend84: () => (SAVE.data.n.bully < 30 ? "有我们\n支持你！" : '我们咋\n还有点\n喜欢你了？'), 
        friend85: () => (SAVE.data.n.bully < 30 ? '使出你的\n真本事，\n好吗？' : '让他\n见识见识\n你的拳头。'), 
        friend86a: '呱呱。', 
        friend86b: "别放弃！", 
        friend87: [
            '<20>{#p/twinkly}{#e/twinkly/17}呃啊啊...\n不！',
            '<20>{#e/twinkly/16}难以置信！！',
            "<20>{#e/twinkly/15}这怎么可能...！",
            '<20>{#e/twinkly/16}你们... 你们...！'
        ],
        friend88: ["<20>{#p/twinkly}{#e/twinkly/2}真不敢相信\n你们都这么愚蠢。"],
        friend89: ['<20>{*}你们所有人的灵魂\n都归我了！！！！！{^40}{%}'],
        friend90: () =>
            1 <= SAVE.flag.n.killed_sans
                ? ['<20>{#p/asriel1}果然...', '<20>这种感觉，\n比上次好太多了。']
                : ['<20>{#p/asriel1}终于。', '<20>当星星那么久\n真是受够了。'],
        friend91: ['<20>{#p/asriel1}哈喽！', '<20>你在那里吗，\n$(name)？', "<20>是我啊，你最好的朋友："],
        friend92: '<99>{*}{#p/asriel3}{#v/1}{#i/12}艾斯利尔·逐梦{^10}{#p/event}{%}'
    },
    b_opponent_finalasgore: {
        name: '* 艾斯戈尔',
        death1: [
            '<11>{*}{#p/asgore}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}...这就是\n我的归宿了...',
            '<11>{*}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}...',
            '<11>{*}{#e/asgore/1}{#v/1}{#i/8}{@random=1.1/1.1}取走我的灵魂，\n离开这片\n诅咒之地吧...',
            '<11>{*}{#e/asgore/1}{#v/2}{#i/10}{@random=1.1/1.1}这样...',
            '<11>{*}{#e/asgore/1}{#v/2}{#i/10}{@random=1.1/1.1}我们就\n永远不会\n再拖累你了...',
            '<11>{*}{#e/asgore/2}{#v/3}{#i/10}{@random=1.1/1.1}...',
            '<11>{*}{#e/asgore/2}{#v/3}{#i/12}{@random=1.1/1.1}永别了...'
        ]
    },

    i_archive: { battle: { description: '', name: '' }, drop: [], info: [], name: '无', use: [] },
    i_archive_berry: {
        battle: { description: '3 HP。', name: '洋梅' },
        drop: ['<32>{#p/human}* （你把洋梅扔掉了。）'],
        info: ['<32>{#p/human}* （3 HP。）'],
        name: '洋梅',
        use: ['<32>{#p/human}* （你吃掉了洋梅。）']
    },
    i_archive_candy: {
        battle: { description: '4 HP。', name: '糖果' },
        drop: ['<32>{#p/human}* （你把怪物糖果扔掉了。）'],
        info: ['<32>{#p/human}* （4 HP。）'],
        name: '怪物糖果',
        use: ['<32>{#p/human}* （你吃掉了怪物糖果。）']
    },
    i_archive_rations: {
        battle: { description: '5 HP。', name: '口粮' },
        drop: ['<32>{#p/human}* （你把口粮扔掉了。）'],
        info: ['<32>{#p/human}* （5 HP。）'],
        name: '口粮',
        use: ['<32>{#p/human}* （你吃掉了口粮。）']
    },
    i_archive_tzn: {
        battle: { description: '6 HP。', name: '太空豆腐' },
        drop: ['<32>{#p/human}* （你把太空豆腐扔掉了。）'],
        info: ['<32>{#p/human}* （6 HP。）'],
        name: '太空豆腐',
        use: ['<32>{#p/human}* （你吞下了太空豆腐。）']
    },
    i_archive_nice_cream: {
        battle: { description: '7 HP。', name: '冰意灵' },
        drop: ['<32>{#p/human}* （你把冰意灵扔掉了。）'],
        info: ['<32>{#p/human}* （7 HP。）'],
        name: '冰意灵',
        use: [
            '<32>{#p/human}* （你撕开了冰意灵的包装。）',
            "<32>{#p/human}* （上面有一幅全息图像，\n  刻画了一个哭泣的孩子。）"
        ]
    },
    i_archive_healpak: {
        battle: { description: '8 HP。', name: '治疗包' },
        drop: ['<32>{#p/human}* （你把治疗包扔掉了。）'],
        info: ['<32>{#p/human}* （8 HP。）'],
        name: '治疗包',
        use: ['<32>{#p/human}* （你使用了治疗包。）']
    },
    i_big_dipper: {
        battle: {
            description: '一把巨勺，由本星系\n最好的合金材料制成。',
            name: '大熊座'
        },
        drop: ['<32>{#p/human}* （你把大熊座扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15攻击。）']
                : ['<32>{#p/basic}* “大熊座” （15攻击）\n* 一把巨勺，由本星系\n  最好的合金材料制成。'],
        name: '大熊座',
        use: ['<32>{#p/human}* （你装备上了大熊座。）']
    },
    i_heart_locket: {
        battle: {
            description: '上面刻着“永远都是好朋友”。',
            name: '心形挂坠'
        },
        drop: () => [
            '<32>{#p/human}* （你把心形挂坠扔掉了。）',
            ...(SAVE.data.b.svr || world.darker || SAVE.data.b.ufokinwotm8
                ? []
                : ['<32>{#p/basic}* ...', "<32>{#p/basic}* 我就当什么都没看见。"])
        ],
        info: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （15防御。）']
                : ['<33>{#p/basic}* “心形挂坠” （15防御）\n* 上面刻着“永远都是好朋友”。'],
        name: '心形挂坠',
        use: ['<32>{#p/human}* （你戴上了心形挂坠。）']
    },
    i_starling_tea: {
        battle: {
            description: '好王配好茶。',
            name: '星花茶'
        },
        drop: ['<32>{#p/human}* （你把星花茶全倒掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （99 HP。）']
                : ['<32>{#p/basic}* “星花茶” 回复99 HP\n* 好王配好茶。'],
        name: '星花茶',
        use: ['<32>{#p/human}* （你将星花茶一饮而尽。）']
    },

    k_hangar: {
        name: '停机坪门禁卡',
        description: "用来解除前哨站停机坪的门禁。"
    },

    k_skeleton: {
        name: '骨钥',
        description: () =>
            SAVE.data.b.s_state_sansdoor
                ? "用它解锁了衫斯房间的门。"
                : '在首塔的最终长廊，\n衫斯将它交给了你。'
    },

    s_save_citadel: {
        c_elevator1: { name: '首塔', text: [] },
        c_courtroom: { name: '最终长廊', text: [] },
        c_road2: { name: '行宫', text: [] },
        c_archive_start: { name: 'e586b3e5bf83', text: [] },
        c_archive_path1: { name: 'e88090e5bf83', text: [] },
        c_archive_path2: { name: 'e58b87e6b094', text: [] },
        c_archive_path3: { name: 'e6ada3e79bb4', text: [] },
        c_archive_path4: { name: 'e6af85e58a9b', text: [] },
        c_archive_path5: { name: 'e59684e889af', text: [] },
        c_archive_path6: { name: 'e6ada3e4b989', text: [] },
        c_exit: { name: '终点', text: [] }
    }
};


// END-TRANSLATE
