import { asrielinter, epilogueOverride } from '../../../code/common';
import { blookGone, dateready, papreal, roomready, solo, trueSpaghettiState } from '../../../code/starton/extras';
import { game, renderer } from '../../../code/systems/core';
import {
    battler,
    calcHP,
    calcLV,
    choicer,
    fetchCharacters,
    instance,
    pager,
    player,
    postSIGMA,
    roomKills,
    world
} from '../../../code/systems/framework';
import { SAVE } from '../../../code/systems/save';
import { CosmosKeyed, CosmosProvider, CosmosUtils } from '../../../code/systems/storyteller';

// START-TRANSLATE

export default {
    a_starton: {
        telescope1: () => [
            ...(SAVE.data.b.svr ? [] : ['<32>{#p/basic}* 标准规格的长焦望远镜，皇家出品。\n* 251X年前后制成。']),
            choicer.create('* （使用望远镜？）', '使用', '算了')
        ],
        telescopeMeetup1: ['<25>{#p/kidd}{#f/2}* 你在看星星吗？'],
        telescopeMeetup2: [
            '<25>{#p/kidd}{#f/1}* 哟... 我打赌\n  你肯定看到了很酷的东西。',
            '<25>{#f/7}* 上次我用望远镜的时候，\n  我甚至看到了一颗超新星！'
        ],
        telescopeMeetup3: [
            '<25>{#p/kidd}{#f/3}* 给。\n* 拿上这个。',
            '<32>{#s/equip}{#p/human}* （你把高级会员卡\n  挂到了钥匙串上。）',
            '<25>{#p/kidd}{#f/7}* 现在你可以使用\n  任何望远镜了，\n  连“最高级”的都能用！',
            '<25>{#f/1}* 那个矮骷髅之前\n  给了我好多这个。',
            '<25>{#f/2}* 他甚至花了很多钱\n  送了我一些数字藏品...',
            '<25>{#f/1}* 我猜他真的很喜欢我，哈哈。'
        ],
        telescopeMeetup4: [
            '<25>{#p/kidd}{#f/3}* 总之就是，这么多会员卡\n  我留着也没用，就送你一张。',
            '<25>{#f/1}* 用它来看点\n  更酷的东西吧！'
        ],
        telescopeMeetup5: ["<25>{#p/kidd}{#f/1}* 我要回镇上了！"],
        telescope2: () =>
            SAVE.data.b.svr
                ? ['<25>{#p/asriel1}{#f/17}* 看到什么喜欢的东西了吗？']
                : SAVE.data.b.oops || SAVE.data.b.s_state_chargazer
                    ? ['<32>{#p/basic}* 在太空中观星...\n  确实，这也是种打破\n  思维定势的想法。']
                    : ((SAVE.data.b.s_state_chargazer = true),
                        [
                            '<32>{#p/basic}* ...',
                            '<32>* 以前，我和艾斯利尔就有一架\n  这样的望远镜。',
                            "<32>* 我们把镜筒对着\n  天空的各个角落，\n  期待能发现意想不到的惊喜...",
                            '<32>* ...可惜，希望总是落空。',
                            "<32>* 尽管观星收获寥寥，\n  但艾斯利尔并不在意...",
                            '<32>* 我挖空心思从星空寻找宝藏。\n  但对他而言...\n  我的陪伴才是真正的“宝藏”。',
                            '<32>* ...',
                            '<32>{#p/human}* （你听到一声叹息。）',
                            "<32>{#p/basic}* ...唉，别在意。\n  咱们继续干正事吧。"
                        ]),
        notv: ["<32>{#p/basic}* 没什么好看的。"],
        nicecreamScoreReaction1a: ['<32>{#p/basic}* 毕竟第一次玩，\n  这样挺不错了...'],
        nicecreamScoreReaction1b: ['<32>{#p/basic}* 毕竟第一次玩，\n  这样也挺不错。'],
        nicecreamScoreReaction2a: ['<32>{#p/basic}* 加把劲吧...'],
        nicecreamScoreReaction2b: ['<32>{#p/basic}* 可以再加把劲。'],
        nicecreamScoreReaction3a: [
            "<32>{#p/basic}* ...打破纪录了？\n* 以前没见过有人成功..."
        ],
        nicecreamScoreReaction3b: [
            "<32>{#p/basic}* 打破纪录了？\n* 从来没见过你这么厉害的！"
        ],
        nicecreamScoreReaction4a: ['<33>{#p/basic}* 你挺会玩的...'],
        nicecreamScoreReaction4b: ['<32>{#p/basic}* 你挺会玩啊。'],
        nicecreamScoreReaction5a: ['<32>{#p/basic}* 你打破了你的纪录...？'],
        nicecreamScoreReaction5b: ['<32>{#p/basic}* 看，新纪录！'],
        nicecreamScoreReaction6a: ['<32>{#p/basic}* 有那么一瞬间，我以为你打破了记录...'],
        nicecreamScoreReaction6b: [
            "<32>{#p/basic}* 哇哦，你差点就破纪录了！\n* 你能坚持下去吗？"
        ],
        nicecreamScoreReaction7a: ['<32>{#p/basic}* 你可能得多练练...'],
        nicecreamScoreReaction7b: ['<32>{#p/basic}* 多练练就好了。'],
        nicecreamScoreReaction8a: ["<32>{#p/basic}* 比上次好..."],
        nicecreamScoreReaction8b: ["<32>{#p/basic}* 这才像话。"],
        nicecreamScoreReaction9a: [
            '<32>{#p/basic}* ...第一次玩就打破纪录了？\n* 怎么做到的...'
        ],
        nicecreamScoreReaction9b: ["<32>{#p/basic}* 第一次玩就打破纪录了？\n* 你简直是天才！"],
        nicecreamScoreReaction10a: ["<32>{#p/basic}* 毕竟第一次玩，\n  这个分挺高了..."],
        nicecreamScoreReaction10b: ["<32>{#p/basic}* 毕竟第一次玩，\n  这个分挺高的！"],
        nicecreamScoreReaction11a: ['<32>{#p/basic}* 就差一点了...'],
        nicecreamScoreReaction11b: ['<32>{#p/basic}* 天哪，你马上就要破纪录了...\n* 你能做到的！'],
        noteleport: ["<32>{#p/human}* （似乎是没电了。）"],
        evac: ['<32>{#p/human}* （你感觉周围的怪物越来越少了。）'],
        shopclosed: ['<32>{#p/human}* （没必要再踏足了。）'],
        jukebox0: ["<32>{#p/basic}* 不能使用了。"],
        jukebox1: () => [
            SAVE.data.b.svr
                ? '<32>{#p/human}* （你去碰点唱机...）'
                : "<32>{#p/basic}* 点唱机只放你听过的音乐。",
            choicer.create(
                '* （放一首音乐吗？）',
                SAVE.data.b.napsta_performance ? '曲目01' : '？？？',
                2 <= SAVE.data.n.state_foundry_swansong ? '曲目02' : '？？？',
                2 <= SAVE.data.n.state_starton_trashprogress ? '曲目03' : '？？？',
                '取消'
            )
        ],
        jukebox1x1: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，这首曲子你还没听过，\n  无法播放。）"]
                : ["<32>{#p/basic}* 唱片封面上有个幽灵DJ，\n  人们正在听它表演。\n* 你应该没听过这首。"],
        jukebox1x2: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，这首曲子你还没听过，\n  无法播放。）"]
                : ["<33>{#p/basic}* 唱片封面上有个幽灵DJ，\n  它正飘在电脑前。\n* 你应该没听过这首。"],
        jukebox1x3: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （可是，这首曲子你还没听过，\n  无法播放。）"]
                : [
                    "<32>{#p/basic}* 唱片封面上有只小白狗，\n  它被围在一堆垃圾里。\n* 你应该没听过这首。"
                ],
        jukebox1y: ['<32>{*}{#p/human}* （你想听听这首...）{^40}{%}'],
        jukebox2: () => [
            SAVE.data.b.svr
                ? '<32>{#p/human}* （现在放的就是这首。）'
                : [
                    '<32>{#p/basic}* 现在播放的是“曲目01”',
                    '<32>{#p/basic}* 现在播放的是“曲目02”',
                    '<32>{#p/basic}* 现在播放的是“曲目03”'
                ][SAVE.data.n.state_starton_jukebox - 1],
            choicer.create('* （停止播放吗？）', '停止播放', '继续播放')
        ],
        jukebox3a1: ["<32>{#p/basic}{#npc/a}* 这才像样！"],
        jukebox3a2: ['<32>{#p/basic}{#npc/a}* （我们都喜欢这种音乐。）'],
        jukebox3b: ['<32>{#p/basic}{#npc/a}* 这音乐在舞蹈俱乐部里面流行吗？'],
        jukebox3c: [
            '<32>{#p/basic}* ...\n* ...\n* ...',
            "<32>{#npc/a}* 烤尔比说\n  他曾经在哪听过这首歌。"
        ],
        jukebox3d: [
            '<32>{#p/basic}{#npc/a}* 孩子，你肯定很懂即兴音乐...',
            '<32>* 挺有品味。'
        ],
        shockpapyrus0a: [
            '<15>{#p/papyrus}{#e/papyrus/27}这里到底发生啥了？？',
            '<15>{#p/papyrus}{#e/papyrus/21}刚才我在阳台，\n有个电话打过来\n叫我来这...',
            '<15>{#p/papyrus}{#e/papyrus/19}结果就看到你俩！？',
            "<15>{#p/papyrus}{#e/papyrus/14}告诉你们，我可是\n皇家卫队的预备队员！",
            '<15>{#p/papyrus}{#e/papyrus/15}不管你俩\n想干什么...'
        ],
        shockpapyrus0b: [
            '<15>{#p/papyrus}{#e/papyrus/24}...等等，这个声音...',
            '<15>{#p/papyrus}{#e/papyrus/22}原来喊我来这的\n就是你啊！？'
        ],
        shockpapyrus0c: [
            '<15>{#p/papyrus}{#e/papyrus/20}...对！\n这就说得通了！',
            "<15>{#p/papyrus}{#e/papyrus/10}那...\n很高兴认识你。",
            '<15>{#p/papyrus}{#e/papyrus/24}说实话，\n你长得有点像...',
            '<15>{#p/papyrus}{#e/papyrus/20}...嘿，等一下！！',
            '<15>{#p/papyrus}{#e/papyrus/22}你带了个【人类】\n过来吗！？！？',
            '<15>{#p/papyrus}{#e/papyrus/10}哇！！\n今天好事连连啊！！',
            '<15>{#p/papyrus}{#e/papyrus/20}话说回来，\n你喊我来这干嘛呢？'
        ],
        shockpapyrus1: () =>
            [
                [
                    '<32>{#p/asriel2}* 准备好了吗，$(name)？',
                    choicer.create('* （艾斯利尔应该怎么做？）', '仁慈', '行动', '魔法', '战斗')
                ],
                ["<32>{#p/asriel2}* 我们速战速决吧。"]
            ][Math.min(SAVE.flag.n.ga_asrielPapyrus, 1)],
        shockpapyrus2a: [
            '<32>{#p/asriel2}* 仁慈，嗯？',
            '<32>{#p/asriel2}* 仁慈...？\n  这真是个好听的词。',
            '<32>{#p/asriel2}* 那咱们就给他来点“仁慈”吧。'
        ],
        shockpapyrus2b: [
            "<32>{#p/asriel2}* 行动...？\n* 看好了，什么才叫行动。",
            '<32>{#p/asriel2}* 首先，举起手臂...',
            '<32>{#p/asriel2}* 接着...！'
        ],
        shockpapyrus2c: [
            '<32>{#p/asriel2}* 魔法，\n  它可化为纽带，\n  让怪物们团结一心。',
            '<32>{#p/asriel2}* 不过，反过来...',
            '<33>{#p/asriel2}* 它也能成为利刃，\n  刺穿他们的肉体。'
        ],
        shockpapyrus2d: ['<32>{#p/asriel2}* 战斗... 真是不二之选。', '<32>{#p/asriel2}* 嘻嘻嘻...'],
        sansDeath1: ["<15>{#p/papyrus}{#e/papyrus/27}衫斯！\n你受伤了！"],
        sansDeath2: ["<20>{#p/sans}帕派瑞斯，\n我不是让你待在家里吗？", '{*}{#e/papyrus/21}{%}'],
        sansDeath3: ["<20>{#p/sans}...别担心，兄弟。\n这只是我最喜欢的\n雅莫万能酱。", '{*}{#e/papyrus/26}{%}'],
        sansDeath4: ["<15>{#p/papyrus}{#e/papyrus/21}但你真的\n伤得很重..."],
        sansDeath5: [
            "<20>{#p/sans}是啊，因为“不祥的预感”\n就离开家乱跑，\n就是这下场。",
            '<20>{#p/sans}...这样的伤口，\n应该是没办法了。',
            '{*}{#e/papyrus/21}{%}'
        ],
        sansDeath6: [
            '<20>{#p/sans}看样子...',
            "<20>恐怕...\n只能陪你到这了。",
            '<20>...',
            '<20>只是...',
            "<20>答应我，哪怕我不在，\n你也要好好活下去，\n兄弟。",
            "<20>答应我，你还会做\n那个最-{^5}最棒的你。",
            '<20>...',
            '<20>毕竟...'
        ],
        sansDeath7: ["<20>{|}{#p/sans}你可是...\n伟大的帕-{^5}帕派瑞斯。"],
        sansDeath8: ['<15>{#p/papyrus}{#e/papyrus/33}不-不...{^40}{%}'],
        fast_food1: () => [
            SAVE.data.b.fryz
                ? "<32>{#p/human}{#npc}* （你拿走了烈焰烤尔比。）"
                : '<32>{#p/human}{#npc}* （你拿走了三个小汉堡。）'
        ],
        fast_food2: ["<32>{#p/human}{#npc}* （你带的东西太多了。）"],
        aussie: pager.create(
            0,
            () =>
                SAVE.data.n.state_starton_trashprogress < 1
                    ? [
                        '<25>{#p/sans}{#f/0}* 终于。',
                        "<25>{#f/3}* 我一直在想你\n  什么时候会出现呢。",
                        '<25>{#f/0}* 不知道你还记不记得，\n  当我们第一次\n  见面的时候...',
                        '<25>{#f/0}* 我告诉帕派瑞斯遇到困难\n  负“重力”争才能致远。',
                        '<25>{#f/0}* 你问我是什么意思？',
                        '<25>{#f/3}* 嗯。',
                        "<25>{#f/2}* 你马上就{@fill=#003cff}知道{@fill=#fff}了。"
                    ]
                    : ['<25>{#p/sans}{#f/0}* 欢迎回来。', '<25>{#f/2}* 准备好知道等待你的\n  是什么了吗？'],
            () =>
                SAVE.data.n.state_starton_trashprogress < 1
                    ? ['<25>{#p/sans}{#f/0}* 来嘛，过来看看。', "<25>{#f/2}* 就在上面呢，小鬼头。"]
                    : ["<25>{#p/sans}{#f/2}* 就在上面呢，小鬼头。"],
            () =>
                SAVE.data.n.state_starton_trashprogress < 2
                    ? ["<25>{#p/sans}{#f/2}* 别担心，那东西\n  一点也不危险... 虽然\n  看起来让人感觉很危险。"]
                    : ['<25>{#p/sans}{#f/2}* 多谢你的帮助。']
        ),
        trashhunt1: [
            '<25>{#p/sans}{#f/0}* 所-以...\n  你现在是怎么想的？',
            '<25>{#f/3}* 我管这个叫“垃圾星球”。',
            "<25>{#f/0}* ...事实上，这东西的体积\n  已经有段时间在一直\n  变大了。",
            '<25>{#f/0}* 要是再继续大下去，\n  那...',
            "<25>{#f/2}* 我只能说要有\n  {@fill=#ff0}倒悬{@fill=#fff}之急了。",
            "<25>{#f/0}* 但别担心。\n* 有了你的帮助，\n  它很快就会消失的。",
            '<25>{#f/2}* 我还给你找了首音乐，\n  能让你更有动力。'
        ],
        trashhunt2: '* 反复按[Z]，\n  清走所有垃圾！',
        trashhunt3: () => [
            '<25>{#p/sans}{#f/3}* 哇。\n* 一气呵成，是吧？',
            "<25>{#f/2}* ...我真是佩服到绝倒了。",
            '<25>{#f/0}* 感觉我得给你点什么\n  作为回报。',
            '<25>{#f/0}* ...\n* 给。\n* 把这个拿上。',
            '<32>{#p/human}* （衫斯丢给你了一样东西。）',
            ...(SAVE.storage.inventory.size < 8
                ? ['<32>{#s/equip}{#p/human}* （你获得了玉狗圣剑。）', '<25>{#p/sans}{#f/2}* 好好用它。']
                : [
                    "<32>{#p/human}* （你带的东西太多了。）",
                    '<25>{#p/sans}{#f/3}* 没空间了，嗯？',
                    "<25>{#p/sans}{#f/2}* 没关系。\n* 等你有空间了，\n  就来我房间拿。"
                ])
        ],
        gravo1: () =>
            SAVE.data.b.svr
                ? [
                    '<32>{#p/human}* （你好奇地打量\n  这个不知道干什么用的装置。）',
                    ...[["<25>{#p/asriel1}{#f/17}* 真可惜啊，我们没有\n  这东西的遥控器。"], []][
                    Math.min(asrielinter.gravo1++, 1)
                    ]
                ]
                : ['<32>{#p/basic}* 这是个“重力转换器”。', '<32>* 管它什么意思。'],
        gravo3: () => [
            '<32>{#p/human}* （你尝试用遥控器\n  激活重力转换器。）\n* （什么都没发生。）',
            ...(SAVE.data.b.svr
                ? [["<25>{#p/asriel1}{#f/21}* 他们可能正在关掉\n  那些非必要设备。"], []][
                Math.min(asrielinter.gravo3++, 1)
                ]
                : ['<32>{#p/basic}* 它肯定离线了...'])
        ],
        gravo2: ['<32>{#p/human}* （你用遥控器激活了重力转换器。）'],
        sansdoor1: () =>
            SAVE.data.b.svr || world.runaway
                ? ['<32>{#p/human}* （被封死了。）']
                : ["<32>{#p/basic}* 锁住了。"],
        sansdoor2: ['<32>{#p/human}* （你用骨钥打开了房门。）'],
        sanscab1: () => [
            ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 信封里有个奇怪的遥控器。"]),
            '<32>{#s/equip}{#p/human}* （你把重力转换器的遥控器\n  挂到了钥匙串上。）'
        ],
        sanscab2: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （可是，信封里的东西\n  已经被你全拿走了。）']
                : ["<32>{#p/basic}* 只是个空信封。"],
        sanscab3: () => [
            ...(SAVE.data.b.svr ? [] : ["<32>{#p/basic}* 信封里有个奇怪的... 东西。"]),
            SAVE.storage.inventory.size < 8
                ? '<32>{#s/equip}{#p/human}* （你获得了玉狗圣剑。）'
                : "<32>{#p/human}* （你带的东西太多了。）"
        ],
        cream_get: ['<32>{#p/human}* （你得到了冰意灵。）'],
        cream_deny: ['<32>{#p/basic}* 什么都没有。'],
        cream_full: ["<32>{#p/human}* （你带的东西太多了。）"],
        cream_get_archive: [
            '<32>{#p/human}* （你把手伸进了冰淇淋车。）',
            '<32>{#p/human}{#s/equip}* （你得到了冰意灵。）'
        ],
        cream_empty_archive: ['<32>{#p/human}* （你把手伸进了冰淇淋车。）', '<32>{#p/human}* （...）'],
        cream_full_archive: ["<32>{#p/human}* （你带的东西太多，\n  不方便把手伸进去。）"],
        bunbun: pager.create(
            0,
            () =>
                SAVE.data.n.plot === 72
                    ? ["<32>{#p/basic}* 妈妈说我们很快就要去新家园了。", "<32>* ...新家园是什么啊？"]
                    : [
                        '<32>{#p/basic}* 妈妈说，睡觉可以把你的\n  生命值恢复到{@fill=#ff0}HP上限以上{@fill=#fff}。',
                        "<32>* ...HP上限是什么啊？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? ['<32>{#p/basic}* 人类也有家园吗？']
                    : ['<32>{#p/basic}* 怪物有这东西吗？']
        ),
        emptytable1: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （这张桌子让你感到很孤独。）']
                : ["<32>{#p/basic}* 只是张孤零零的桌子。\n* 上面有糖霜的味道。"],
        emptytable2: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （这张桌子让你感到很孤独。）']
                : ["<32>{#p/basic}* 一张孤零零的桌子。\n* 上面有毛发的味道。"],
        balcony0: () => ['<18>{#p/papyrus}景色不错吧？', choicer.create('* （你要怎么回答？）', '景色很美', '没啥好看的')],
        balcony1: [
            "<18>{#p/papyrus}{#f/9}太好了！\n终于遇到知音了！",
            '<18>{#f/7}你可比我兄弟强多了！\n他可从来都不懂得\n欣赏美景！！！'
        ],
        balcony2: [
            "<18>{#p/papyrus}{#f/5}哦...\n好吧，没事...",
            '<18>{#f/4}（唉...）\n起码，你愿意走出房间，\n到阳台看看。',
            "<18>{#f/7}衫斯才不会这么干！！！"
        ],
        bedbook1: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你好像有点看不懂内容。）"]
                : ["<32>{#p/basic}* 一本用古文写成的书。"],
        bedbook3a: ['<32>{#p/basic}* 想让我帮你读一下吗？'],
        bedbook3b: ['<32>{#p/basic}* 再读一遍？'],
        bedbook4: () => [choicer.create('* （让$(name)给你读一下吗？）', '读一下', '算了')],
        bedbook5: [
            '<32>{#p/basic}* 好，我看看...',
            '<32>* “很久很久以前，\n   太阳系由两个种族统治着：\n   人类和怪物。”',
            '<32>* “起初，怪物们只是外来者，\n   本会在不久后\n   回到自己的星系。”',
            '<32>* “但怪物们被人类文明所吸引，\n   想和他们共同生活。”',
            '<32>* “因此，他们和人类分享了他们的科技，\n   并与人类结成了同盟。”',
            '<32>* “接下来数百年间，\n   怪物与人类和平共处。”',
            '<32>* “有一天，人类开始对\n   怪物的某种东西产生恐惧...”',
            '<32>* “一种没有杰出的领导力\n   就会失控的恐惧。”',
            '<32>* “随着时间的推移，\n   两个物种之间爆发了战争。”',
            '<32>* “那时星际间会发生许多战斗和冲突。”',
            '<32>* “但是人类们，\n   充满了恐惧与决心的人类们，\n   很容易占据了上风。”',
            '<32>* “然后，\n   在那对未来有着重大影响的一天，\n   一件强大的武器向怪物的家园发射了。”',
            '<32>* “在怪物们的母星被摧毁之后，\n   人类获得了胜利。”',
            '<32>* “两个物种间签订了和约，然后...”',
            '<32>* “剩下的怪物被驱逐到了\n   一个废弃的前哨站。”',
            '<32>* “接着，人类集结了七位精英。”',
            '<32>* “他们一同制定了一个计划，最后...”',
            '<32>* “一个强大的力场被建立起来，\n   怪物们被困在其中。”',
            "<32>* 嗯，这就是故事的内容了。"
        ],
        bedbook6: ['<32>{#p/basic}* 好吧，如果你想让我读，就告诉我。'],
        beddoor1: ["<32>{#p/basic}{#npc/a}* 如果你想订房间，\n  你得先问我一声。"],
        beddoor2: ["<32>{#p/basic}{#npc/a}* 如果你还想订房间，\n  你得先问我一声。"],
        beddoor3: ['<32>{#p/basic}{#npc/a}* 抱歉，小家伙！\n* 这里已经满人了！'],
        candy1: () =>
            postSIGMA()
                ? ["<32>{#p/basic}* 不能使用了。"]
                : [
                    SAVE.data.b.svr
                        ? '<32>{#p/human}* （你走近了自动售货机。）'
                        : "<32>{#p/basic}* 这是一台专门售卖\n  高档洋梅的自动售货机。",
                    choicer.create('* （花8G买串洋梅吗？）', '买', '不买')
                ],
        candy2: ["<32>{#p/human}* （你的钱不够。）"],
        candy3: ["<32>{#p/human}* （你带的东西太多了。）"],
        candy4: ['<32>{#p/human}* （你买了一小串洋梅。）'],
        candy5: ['<32>{#p/human}* （你决定先不买。）'],
        capstation1: [
            '<32>{#p/human}* （你看了眼哨站后面，\n  并发现了一把钥匙。）',
            '<32>{#s/equip}{#p/human}* （你把生锈的钥匙\n  挂到了钥匙串上。）',
            '<32>* （打开“手机”来查看\n  所有获得的钥匙。）'
        ],
        capstation2: ['<32>{#p/human}* （你看了眼哨站后面。）', '<32>{#p/basic}* 没有新东西。'],
        crossword0: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}* 哦，你来了。',
                    '<25>{#p/sans}{#f/2}* 如果你喜欢上一个谜题的话，\n  估计这个也能合你胃口。'
                ]
                : [
                    '<18>{#p/papyrus}{#f/9}人类！！',
                    '<18>{#f/9}你已经看过\n我的谜题了。',
                    '<18>{#f/4}但你接下来\n将要看到的是...'
                ],
        crossword1: () =>
            world.edgy
                ? [
                    '<26>{#p/sans}* 其实也不需要了。\n* 走过来瞧瞧吧。',
                    "<25>{#p/sans}* 喏，它就在地上呢。"
                ]
                : [
                    "<18>{#p/papyrus}{#f/7}衫斯！！\n谜题在哪！？",
                    "<25>{#p/sans}* 就在你眼皮底下呢。",
                    '<18>{#p/papyrus}{#f/1}啥？\n就地上躺的那块板子？',
                    '<18>{#f/4}行吧...'
                ],
        crossword2: (check: boolean) =>
            world.edgy
                ? [
                    check
                        ? '<25>{#p/sans}* 咋了？\n  谜题让你{@fill=#ff0}郁{@fill=#fff}罢不能吗？'
                        : "<25>{#p/sans}* 看都不愿意看一眼，是吧？",
                    "<25>* 真不该对你期望太高。",
                    '<26>{#f/3}* 好吧。\n* 说不定，数谜更适合你。',
                    '<26>{#f/0}* 跑题了。'
                ]
                : [
                    check
                        ? "<18>{#p/papyrus}{#f/7}衫斯！！！\n那根本没有用啊！"
                        : "<18>{#p/papyrus}{#f/7}衫斯！！！\n那个人类连\n看都没看一眼！",
                    '<25>{#p/sans}* 啊呀。',
                    "<25>{#f/3}* 我就知道我应该用\n  今天的数和谜题代替的。",
                    '<18>{#p/papyrus}{#f/1}啥！？数和！？',
                    "<18>{#f/9}我真不敢相信\n你居然会提到它！！",
                    '<18>{#f/4}在我看来...',
                    '<18>{#f/0}数独无疑才是最难的。',
                    '<25>{#p/sans}* 什么？你认真吗，兄弟？\n* 那个简单到爆的\n  数字排列组合？',
                    "<25>{#f/4}* 那是给骷髅宝宝玩的。",
                    '<18>{#p/papyrus}{#f/4}真。难以置信。',
                    '<18>{#f/9}人类！！！\n你来评评理！',
                    choicer.create('* （哪边更难？）', '数独', '数和')
                ],
        crossword3a: [
            '<18>{#p/papyrus}哈！哈！好！',
            '<18>要是人类也觉得\n数独更难的话！',
            '<18>那他们一定\n非常聪明！',
            '<18>{#f/9}捏！嘿！嘿！嘿！'
        ],
        crossword3b: [
            '<18>{#p/papyrus}{#f/9}你们两个真怪！',
            '<18>{#f/0}数和谜题\n真的太简单了。',
            "<18>每次的解法\n都是一样的。",
            '<18>{#f/4}我只要把每个空格\n都填上字母“Z”\n就好了...',
            '<18>{#f/4}因为我\n每做一道数和...',
            '<18>{#f/9}除了打瞌睡\n我什么都做不了！！！'
        ],
        crossword3c: [
            '<25>{#p/sans}{#f/3}* 顺便提一嘴，\n  我之前看到有两只狗\n  在这边跑来跑去...',
            "<25>{#f/0}* 如果我是你的话，\n  我会小心点的。"
        ],
        crossword4a: pager.create(0, ['<25>{#p/sans}* 嘿，你要去哪，小子？'], ['<25>{#p/sans}* 回来。']),
        crossword4b: pager.create(0, ["<25>{#p/sans}* 你认真？\n* 也没那么难吧。"], ['<25>{#p/sans}* 你认真？']),
        crossword5a: [
            '<25>{#p/sans}* 感谢你为了安抚我兄弟\n  回答说“数独更难”。',
            '<25>{#f/4}* 昨天他还试图“破解”\n  星象图，结果被难住了呢。'
        ],
        crossword5b: [
            '<25>{#p/sans}* 帕派瑞斯...\n* ...他总会在令人\n  意想不到的地方碰壁。',
            '<25>{#f/4}* 昨天他还试图“破解”\n  星象图，结果被难住了呢。'
        ],
        crossword6a: [
            "<25>{#p/sans}{#f/3}* 我早就料到\n  你会直接跳过的。",
            "<25>{#f/0}* 这不就是你碰到谜题时\n  常用的伎俩么？"
        ],
        crossword6b: [
            "<25>{#p/sans}{#f/3}* 挺惊讶的。\n* 我以为你会看都不看一眼\n  直接跳过。",
            "<25>{#f/2}* 也许，你还没有烂到骨子里。"
        ],
        crossword6c: ['<25>{#p/sans}{#f/2}* 嘿嘿，\n  你还是去看了一眼。'],
        crossword6d: [
            "<25>{#p/sans}{#f/3}* 挺惊讶的。\n* 我以为你压根不感兴趣。",
            "<25>{#f/2}* 也许，你还没有烂到骨子里。"
        ],
        doggo1: [
            '<32>{#p/basic}* 好像有啥动了下？\n* 是我的错觉吗？',
            '<32>* 如果确实有什么在动...\n* 比如说，一个人类...',
            "<32>* 我绝不会让他\n  再从我眼皮子底下溜走！"
        ],
        doggo2: [
            [
                "<32>{#p/basic}* 有什么没-没-没在动的东西...\n* 摸-摸-摸了我...！",
                "<32>* 我得吃点狗粮压压惊。"
            ],
            ['<32>{#p/basic}* 啊？不-不-不知道从哪\n  突然冒出来了个扳手！？！？', '<32>{#p/basic}* ...真是奇妙的一天！'],
            [],
            [
                '<32>{#p/basic}* 有-有个人类突-突然过来...\n  揍了我一顿...！',
                "<32>{#p/basic}* 我...\n* 我去休息了。"
            ]
        ],
        doggo3: pager.create(
            0,
            ['<32>{#p/basic}* 你好？\n* 有人在吗...？'],
            ['<32>{#p/basic}* 你俩是在整我吗？\n* 真好笑啊，伙计。'],
            ['<32>{#p/basic}* 大块头？\n* 是你吗？\n* 拜托...'],
            ["<32>{#p/basic}* 嗯，看来并不是那个\n  高个子骷髅...\n* 他太吵了。"],
            ['<32>{#p/basic}* 我不管你是谁，赶紧停下！！！'],
            ['<32>{#p/basic}* ...']
        ),
        doggo3x: ['<32>{#p/basic}* （呼噜... 呼噜...）'],
        drop_chip: [
            '<32>{#p/basic}* 你刚刚是不是...\n  把我给你的芯片给扔了？',
            '<32>* 我真无语了...\n* 给我滚！'
        ],
        drop_cream: ["<32>{#p/basic}* 你真该庆幸我在忙着做宣传。"],
        eat_chip: [
            '<32>{#p/basic}* 你刚刚是不是...\n  把我给你的芯片给吃了？',
            '<32>* 我真无语了...\n* 给我滚！'
        ],
        eat_cream: ['<32>{#p/basic}* 很开心你可以畅享冰意灵！\n* 非常开心！'],
        genotext: {
            asriel1: () =>
                [['<25>{#p/asriel2}{#f/9}* 跟我走就行。'], ['<25>{#p/asriel2}{#f/16}* 走吧。']][
                Math.min(SAVE.flag.n.ga_asriel1++, 1)
                ],
            asriel2: () =>
                [
                    ["<25>{#p/asriel2}{#f/2}* 哎，前面站着的，\n  不是伟大的帕派瑞斯吗？"],
                    ['<25>{#p/asriel2}{#f/3}* 嗯... 再来一次吧。']
                ][Math.min(SAVE.flag.n.killed_sans, 1)],
            asriel3: () =>
                [
                    ["<25>{#p/asriel2}{#f/1}* 咱们去做个“自我介绍”，\n  怎么样？"],
                    ['<25>{#p/asriel2}{#f/4}* 你知道该干什么。']
                ][Math.min(SAVE.flag.n.killed_sans, 1)],
            asriel4: ['<25>{*}{#p/asriel2}{#f/5}* 哈喽！{^5}{%}'],
            asriel5: ['<18>{*}{#p/papyrus}{#f/1}干啥- {%}'],
            asriel6: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/13}* 嘿... $(name)...',
                        '<25>{#f/17}* 要不，从现在开始\n  你来动手吧？',
                        "<25>{#f/15}* 我... 我没事，真没事。",
                        "<25>{#f/16}* 我只是觉得，\n  干这活，你比我更擅长...",
                        "<25>{#f/17}* 对，就是这个原因！\n* 这种事，肯定你来做更合适。"
                    ],
                    ["<25>{#p/asriel2}{#f/16}* 呃，好吧。\n* ...之后你来动手。"],
                    ['<25>{#p/asriel2}{#f/15}* 那么... 前进吧？'],
                    ['<25>{#p/asriel2}{#f/15}* ...']
                ][Math.min(SAVE.flag.n.ga_asriel6++, 3)],
            asriel9: ["<25>{#p/asriel2}{#f/8}* 嘘，等一下，\n  看看他会做些什么。"],
            asriel10: () =>
                [
                    [
                        '<25>{#p/asriel2}{#f/15}* 哇，\n  帕派瑞斯这么颓废的样子...',
                        "<25>{#f/16}* 我真是头一次见到。",
                        '<25>{#f/13}* 嘿，$(name)...',
                        "<25>{#f/1}* 我感觉接下来有好戏看了。"
                    ],
                    ['<25>{#p/asriel2}{#f/16}* 真是可怜。']
                ][Math.min(SAVE.flag.n.ga_asriel10++, 1)],
            asriel17: () =>
                [["<25>{#p/asriel2}{#f/16}* 天呐，$(name)...\n  有些怪物就是听不懂话。"], ['<25>{#p/asriel2}{#f/4}* 切。']][
                Math.min(SAVE.flag.n.ga_asriel17++, 1)
                ],
            asriel24: () =>
                [['<25>{#p/asriel2}{#f/4}* 真是浪费时间。'], ['<25>{#p/asriel2}{#f/3}* 呵呵。']][
                Math.min(SAVE.flag.n.ga_asriel24++, 1)
                ],
            asriel26: () =>
                [
                    [
                        "<26>{#p/asriel2}{#f/3}* 好了，那群蠢狗\n  已经全军覆没了。",
                        '<26>{#p/asriel2}{#f/4}* 再过一座桥，就到小镇了。',
                        '<25>{#f/1}* ...跟我来。'
                    ],
                    ['<25>{#p/asriel2}{#f/3}* 我们去镇上。']
                ][Math.min(SAVE.flag.n.ga_asriel26++, 1)],
            asriel28: () =>
                [
                    [
                        "<25>{#p/asriel2}{#f/6}* 好，$(name)，\n  现在整个镇子都是你的了。",
                        "<25>{#f/7}* 而我要去忙点别的事，\n  之后会派上用场。",
                        "<25>{#f/1}* 别担心，我去去就回。"
                    ],
                    ['<25>{#p/asriel2}{#f/1}* 镇子出口见。']
                ][Math.min(SAVE.flag.n.ga_asriel28++, 1)],
            asriel29: () =>
                [
                    SAVE.data.b.papyrus_secret
                        ? [
                            '<25>{#p/asriel2}{#f/2}* 嘻。\n* 嘻。\n* 嘻....',
                            "<25>{#f/10}* ...等等，帕派瑞斯在哪？",
                            '<25>{#f/10}* ...',
                            "<25>{#f/4}* 天呐，$(name)，\n  没想到你下手这么快。"
                        ]
                        : [
                            '<25>{#p/asriel2}{#f/2}* 嘻。\n* 嘻。\n* 嘻....',
                            "<25>{#f/1}* 天呐，那个蠢骨头\n  那么想原谅你...",
                            '<25>{#f/13}* 最后还是尝到了仁慈的后果。',
                            "<25>{#f/16}* 不过，先别管他了。",
                            "<25>{#f/1}* 一会，咱们还要拉长线，\n  钓大鱼呢。"
                        ],
                    ['<25>{#p/asriel2}{#f/13}* 哎呀，这蠢骷髅\n  又白白送死了。'],
                    [
                        "<25>{#p/asriel2}{#f/13}* 俗话说，好铁要经三回炉。",
                        '<25>{#f/16}* 但很遗憾，他一回就不行了。'
                    ],
                    [
                        "<25>{#p/asriel2}{#f/6}* 你已经杀了他四次了。",
                        "<25>{#f/8}* 看来你很享受这种快感啊..."
                    ],
                    ['<25>{#p/asriel2}{#f/15}* 又来...？']
                ][Math.min(SAVE.flag.n.ga_asriel29++, 4)],
            asriel30: () => [
                '<25>{#p/asgore}{#f/1}* ...',
                '<25>{#f/1}* 哈喽，艾斯利尔。',
                '<25>{#f/2}* ...',
                '<25>{#f/3}* 我们谈一下吧。',
                ...[
                    [
                        '<25>{#p/asriel2}{#f/6}* 谈谈？\n* 跟你有什么好谈的？',
                        '<25>{#f/6}* 还有，你怎么在这？',
                        "<25>{#f/7}* 既然早晚我都要\n  送你下地狱...",
                        '<25>{#f/8}* 那不如... {%15}'
                    ],
                    [
                        "<25>{#p/asriel2}{#f/8}* 你想谈谈？\n* 别来浪费我的时间。",
                        "<25>{#f/6}* 放个全息投影，还想蒙我？",
                        '<25>{|}{#p/asgore}{#f/5}* 你怎么- {%}',
                        '<25>{#p/asriel2}{#f/1}* 少问。'
                    ]
                ][Math.min(SAVE.flag.n.ga_asriel30x, 1)]
            ],
            asriel30a: [
                '<25>{#p/asriel2}{#f/8}* 开玩笑吗？\n* 这只是个全息投影？',
                '<25>{#f/6}* 我知道你是个懦夫，\n  可你竟然还能怂出个新境界。'
            ],
            asriel30b: [
                '<25>{#p/asgore}{#f/1}* 你就没有更重要的事可做吗？',
                '<25>{#p/asriel2}{#f/8}* ...',
                '<25>{|}{#p/asgore}{#f/3}* 听着，儿子，我只是- {%}',
                "<25>{#p/asriel2}{#f/7}* 我不是你儿子。\n* 我早就不是你儿子了。",
                '<25>{#p/asgore}{#f/2}* ...',
                '<25>{#p/asgore}{#f/1}* 好吧，艾斯利尔。\n* 你知不知道自己\n  正变成什么样？',
                "<25>{#f/2}* 铁石心肠，罪不可赦...",
                "<25>{#p/asriel2}{#f/8}* 哼，别装的好像\n  你很在乎我似的，爹。",
                '<25>{#p/asgore}{#f/5}* ...',
                '<25>{#p/asriel2}{#f/9}* 不好意思，\n  刚不该叫你“爹”的，\n  艾斯戈尔。',
                '<25>{#f/1}* 真是抱歉。',
                '<25>{#p/asgore}{#f/3}* ...\n* 开玩笑吧...',
                '<25>{#f/5}* 好好想想你的所作所为，\n  这可不是为了我们...',
                '<25>{#f/6}* 是为了你好！',
                '<25>{#p/asriel2}{#f/8}* ...',
                '<25>{#p/asriel2}{#f/7}* ...让我缓缓。',
                "<26>{#f/6}* 显然你来这只是想气我。",
                '<25>{#p/asgore}{#f/3}* ...',
                '<25>{#p/asriel2}{#f/6}* ...',
                '<25>{#p/asgore}{#f/7}* 你得意识到\n  你的选择是有份量的！',
                "<25>{#p/asriel2}{#f/15}* 不然？\n  没份量不就飘起来了吗？\n  谁还看得到？",
                "<25>{#f/16}* $(name)，我们走。\n  我受够他了。"
            ],
            asriel30c: ['<25>{*}{#p/asgore}{#f/8}* 艾斯利尔，求你别走！\n* 我只是想帮你！{^999}'],
            asriel30d: () =>
                [
                    ['<25>{#p/asriel2}{#f/3}* 做好准备，$(name)。', "<26>{#f/4}* 这儿可是安黛因的地盘。"],
                    ['<25>{#p/asriel2}{#f/4}* 带路吧。']
                ][Math.min(SAVE.flag.n.ga_asriel30d++, 1)],
            papyrusSolo1a: [
                '<18>{#p/papyrus}{#f/31}衫斯？\n那是个人类吗？',
                "<18>{#f/5}应该是的吧？",
                '<18>{#f/32}捏...\n安黛因总算会...',
                "<18>{#p/papyrus}{#f/31}我能加入皇家卫队了...",
                "<18>{#f/5}你会以我为荣的吧？",
                "<25>{#p/asriel2}{#f/3}* 你骗不了自己的，帕派瑞斯。\n* 他已经死了。",
                '<18>{|}{#p/papyrus}{#f/5}可是- {%}',
                "<25>{#p/asriel2}{#f/3}* 够了。\n* 你再怎么使劲呼唤，\n  他也听不见的。", 
                "<18>{#p/papyrus}{#f/6}不会的...\n衫斯他...",
                '<18>{#f/31}他向我承诺过的...',
                "<25>{#p/asriel2}{#f/8}* 那个蠢骨头\n  要能遵守承诺就怪了。",
                "<26>{#f/9}* 虽然我也不比他好到哪儿去。", 
                '<18>{#p/papyrus}{#f/31}...',
                "<18>{#f/3}对不起。\n我得走了..."
            ],
            papyrusSolo2a: [
                '<18>{#p/papyrus}{#f/31}唉，我刚从\n安黛因那回来...',
                '<18>{#f/31}她说国王找你有事。',
                '<25>{#p/asriel2}{#f/6}* ...',
                '<18>{#p/papyrus}{#f/3}他原话是\n“我想见见我儿子”。',
                '<18>{#f/7}...',
                
                "<18>{#f/7}我们的王子竟然\n杀了我兄弟，\n真是难以置信！",
                '<25>{|}{#p/asriel2}{#f/8}* 其实你才是我们原本想- {%}',
                '<18>{#p/papyrus}{#f/7}真是够了！！',
                '<18>{#f/7}你出卖集体，背叛同胞！',
                '<18>{#f/7}为了啥呢！？',
                '<18>{#f/7}就为了取悦自己吗？',
                "<25>{#p/asriel2}{#f/16}* 对啊，帕派瑞斯。\n* 就是因为这么做很爽。",
                '<18>{#p/papyrus}{#f/7}扯淡！！！',
                '<18>{#p/papyrus}{#f/4}还有你，人类...',
                "<18>{#f/7}别以为我不知道\n事态会怎么发展。",
                "<18>{#f/7}显而易见，你才是主谋。",
                '<25>{#p/asriel2}{#f/8}* 你真有眼力。',
                '<25>{#f/7}* 眼下我们是不是该\n  就地投降才好呢？',
                '<18>{#p/papyrus}{#f/31}...',
                '<25>{#p/asriel2}{#f/4}* 先说明了，你这股努力的劲儿\n  确实令我佩服。',
                "<25>{#f/3}* 但我们自有打算。",
                "<18>{#p/papyrus}{#f/4}你要知道，安黛因可能\n正盯着我们呢。",
                '<25>{#p/asriel2}{#f/3}* 你想说什么？',
                "<25>{#f/4}* ...告诉你，帕派瑞斯，\n  你和其他人做什么，\n  跟我们都毫无关系。",
                '<25>{#f/1}* 只要在一起，\n  谁都无法把我们分开。',
                '<18>{#p/papyrus}{#f/7}...我呸！！'
            ],
            papyrusSolo3: ['<25>{#p/asriel2}{#f/3}* 哈喽！'],
            papyrusSolo3a: () => [
                '<18>{#p/papyrus}{#f/31}你知道吗...',
                '<18>{#f/31}我偶然听到艾菲斯博士\n自言自语...',
                '<18>{#f/5}从她的话中我听到个词，\n好像是“时间回溯”？',
                "<18>{|}{#f/32}{#x1}我不确定，但好像你们- {%}",
                '<25>{#p/asriel2}{#f/6}* 没门。',
                '<18>{|}{#p/papyrus}{#f/6}但她说了你们能- {%}',
                ...(SAVE.flag.n.genocide_milestone < 5
                    ? ['<25>{#p/asriel2}{#f/6}* 没门。']
                    : SAVE.flag.n.genocide_milestone < 6
                        ? ["<25>{#p/asriel2}{#f/6}* 没门，不过我要是那么做的话\n  她会很高兴的。"]
                        : ["<25>{#p/asriel2}{#f/6}* 没门，反正她最后\n  也要跟着去见阎王。"]),
                '<18>{#p/papyrus}{#f/31}可是，假如你真能\n回溯时间，抹掉过去...',
                '<18>{#f/5}为什么不去试试呢？',
                "<18>{#f/31}下一条时间线里，\n让-让我代他去死。",
                "<18>{#f/3}那样，他就能活下来了，\n对吧？",
                "<25>{#p/asriel2}{#f/6}* ...\n* 跟你说，我早就看过\n  那条线了。",
                "<25>{#f/7}* 无聊至极。",
                '<18>{#p/papyrus}{#f/3}...',
                '<18>{#f/6}那么，我给你看看\n这个谜题吧？',
                '<18>{#f/32}说不定，\n它能让你不那么无聊...',
                '<25>{#p/asriel2}{#f/15}* ...',
                '<25>{#p/asriel2}{#f/15}* 你要是喜欢这么做的话，\n  那就随你的便。',
                '<18>{#p/papyrus}哦，哦！',
                "<18>{#f/0}太好了！！",
                "<18>{#f/0}你开始改变想法了！",
                '<25>{#p/asriel2}{#f/8}* ...',
                '<18>{#p/papyrus}{#f/6}...',
                '<18>{|}{#f/5}那么，规则是这样的- {%}',
                '<25>{#p/asriel2}{#f/7}* 我们早就知道了，蠢货。',
                '<18>{#p/papyrus}{#f/31}...哦...',
                '<18>{#f/6}呃，好吧！！\n那我就不解释了...',
                "<18>{#f/9}看看我们的\n随机数字是多少吧！！"
            ],
            papyrusSolo4a: [
                '<18>{#p/papyrus}{#f/3}艾斯利尔。',
                '<25>{#p/asriel2}{#f/6}* 帕派瑞斯。',
                '<18>{#p/papyrus}{#f/31}...',
                '<18>{#f/31}为什么？',
                '<18>{#f/31}为什么你要这么做？',
                "<18>{#f/3}一个怪物不应该\n会变成这样啊...",
                "<18>{#f/5}你的爱去哪了？\n你的同情心去哪了？",
                '<18>{#f/31}你的... 仁慈...',
                '<25>{#p/asriel2}{#f/2}* ...\n* 哦，您可真是\n  文曲星下凡啊...',
                '<25>{#f/1}* 在我的灵魂中，\n  这些东西早就化为乌有了。',
                "<18>{#p/papyrus}{#f/31}但...\n我不明白...",
                '<18>{#f/5}一个有着这般\n纯洁心灵的怪物...',
                '<18>{#f/31}...怎么会\n彻底堕入黑暗呢？',
                '<25>{#p/asriel2}{#f/1}* 你真想知道吗？',
                '<18>{#p/papyrus}{#f/3}...',
                '<18>{#f/3}对...',
                '<25>{#p/asriel2}{#f/10}* 你确实是真心想知道吗？',
                '<18>{#p/papyrus}{#f/31}对。',
                '<25>{#p/asriel2}{#f/3}* 说大点声。',
                '<18>{#p/papyrus}{#f/5}对！',
                '<26>{#p/asriel2}{#f/1}* 对我说，{@fill=#ff0}洋{@fill=#fff}求我\n  把{@fill=#ff0}梅{@fill=#fff}说的都告诉你。',
                '<18>{#p/papyrus}{#f/7}好！{@fill=#ff0}洋{@fill=#fff}求你\n把{@fill=#ff0}梅{@fill=#fff}说的都告诉我吧！\n该死！',
                '<25>{#p/asriel2}{#f/1}* 嘻嘻嘻...',
                "<25>{#f/1}* 那好，就让我来告诉你吧。",
                "<25>{#f/15}* 其实答案很简单...",
                '<18>{#p/papyrus}{#f/4}我的天哪，快说吧...'
            ],
            papyrusSolo4b: [
                '<25>{*}{#p/asriel2}{#f/14}{@random=1.1/1.1}{@fill=#f00}* $(name)。{%100}',
                '<18>{#p/papyrus}{#f/32}...！',
                '<25>{#p/asriel2}{#f/5}* 哈！\n* 哈哈哈！\n* 看看你什么表情！'
            ],
            papyrusSolo4c: ['<18>{#p/papyrus}{#f/31}我...', '<18>{#f/3}...不...'],
            papyrusSolo4d: [
                "<18>{#p/papyrus}{#f/7}不，你错了。",
                "<18>{#f/7}一直想方设法把我击垮的，\n是你。",
                "<18>{#f/7}那个满嘴谎话的，还是你。",
                '<18>{#f/9}但是我，帕派瑞斯...',
                '<18>{#f/9}总算认清了{@fill=#f00}真相{@fill=#fff}。',
                "<25>{#p/asriel2}{#f/13}* 哦？\n* 真相是什么呢？"
            ],
            papyrusSolo4e: ["<18>{#p/papyrus}{#f/34}你才不是{@fill=#f00}艾斯利尔{@fill=#fff}。"],
            papyrusSolo4f: [
                '<18>{#f/5}{@fill=#f00}艾斯利尔{@fill=#fff}绝不可能\n干出这种事！',
                '<18>{#f/31}因为，{@fill=#f00}艾斯利尔{@fill=#fff}心地善良，',
                '<18>{#f/5}信赖同胞...',
                '<18>{#f/31}比谁都相信人类！',
                '<18>{#f/4}而你呢...',
                '<18>{#f/7}你不过是个为了\n一己私欲利用人类的\n卑鄙小人！',
                "<18>{#f/4}我告诉你，\n你爱说啥就说啥，\n我不在乎。",
                '<18>{#f/9}但是，我还相信着\n那个人类。',
                "<25>{#p/asriel2}{#f/8}* 哼，你要真这么信任人类...",
                '<25>{#f/7}* 那就证明给我看看。',
                "<25>{#f/3}* 我会离开一会，\n  让你俩单独对峙。",
                "<25>{#f/3}* 要是$(name)饶恕你，\n  那我就认栽。",
                '<25>{#f/4}* 否则，$(name)要是\n  “不小心”杀了你...',
                "<25>{#f/1}* 你就知道你大错特错了。\n  而那个懒骨头死得就\n  一文不值。",
                '<25>{#f/1}* 这主意如何？',
                '<18>{#p/papyrus}{#f/9}...\n我接受。',
                '<25>{#p/asriel2}{#f/3}* 那可太好了。',
                '<25>{#f/4}* 永别了。'
            ]
        },
        houz: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （你把手搭在了划痕累累的门上。）']
                : ['<32>{#p/basic}* 门上布满了猫的抓痕。'],
        gonezo: () =>
            world.bulrun ? ['<32>{#p/basic}* ...但是大家都逃走了。'] : ['<32>{#p/basic}* ...但是谁也没有来。'],
        garbanzo: ['<32>{#p/human}* （但是谁也没坐在这儿。）'],
        doggonopoggo: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （但是谁也不在这儿。）']
                : (game.room === 's_doggo' && SAVE.data.n.state_starton_doggo === 2) || // NO-TRANSLATE

                    (game.room === 's_dogs' && SAVE.data.n.state_starton_dogs === 2) || // NO-TRANSLATE

                    (game.room === 's_pacing' && SAVE.data.n.state_starton_lesserdog === 2) // NO-TRANSLATE

                    ? ['<32>{#p/basic}* ...但是谁也没有来。']
                    : ["<32>{#p/basic}* 没人在家。"],
        housebloc: () =>
            SAVE.data.b.svr ? ["<32>{#p/human}* （你好像没法进去。）"] : ["<32>{#p/basic}* 锁住了。"],
        innkeep1a: pager.create(
            0,
            () => [
                "<32>{#p/basic}{#npc/a}* 欢迎来到星光旅馆！\n* 星港的一流旅馆！",
                '<32>* 每住宿一晚花费60G。',
                choicer.create('* （订一间房吗？）', '订', '不订')
            ],
            () => [
                '<32>{#p/basic}{#npc/a}* 改变主意了吗？',
                '<32>* 记住了，一个晚上60G。',
                choicer.create('* （订一间房吗？）', '订', '不订')
            ]
        ),
        innkeep1b: pager.create(
            0,
            () => [
                '<32>{#p/basic}{#npc/a}* 又回来了吗？\n* 记住，一个晚上60G。',
                choicer.create('* （再订一间房吗？）', '订', '不订')
            ],
            () => ['<32>{#p/basic}{#npc/a}* 改变主意了吗？', choicer.create('* （再订一间房吗？）', '订', '不订')]
        ),
        innkeep1c: pager.create(
            0,
            () => [
                '<33>{#p/basic}{#npc/a}* 又回来了吗？\n* 想待多久都可以的。',
                choicer.create('* （再订一间房吗？）', '订', '不订')
            ],
            () => ['<32>{#p/basic}{#npc/a}* 改变主意了吗？', choicer.create('* （再订一间房吗？）', '订', '不订')]
        ),
        innkeep2a: [
            "<32>{#p/basic}{#npc/a}* ...你连60G都没有吗？",
            "<32>* 噢！你真可怜。\n* 我能想象到您经历了些什么。",
            '<32>* 楼上有一间空房，\n  您可以免费住，好吗？'
        ],
        innkeep2b: ["<32>{#p/basic}{#npc/a}* 这是您的房间钥匙。\n* 小心别着凉！"],
        innkeep2c: ["<32>{#p/basic}{#npc/a}* 抱歉，您的钱不够..."],
        innkeep3a: ['<32>{#p/basic}{#npc/a}* 您好呀！\n* 您看起来睡得很舒服。'],
        innkeep3b: ['<32>* 挺不可思议的...\n* ...因为您在上面\n  只待了几分钟。'],
        innkeep3c: ['<32>* 要是累了请随时回来休息。'],
        innkeep3d: ["<32>* 我把钱退给您。\n* 想过夜的话，可以再付给我哦。"],
        innkeep4: ["<32>{#p/basic}{#npc/a}* 现在还不困？\n* 没关系，只要您需要，\n  我随时为您服务！"],
        innkeep5: [
            '<32>{#p/basic}{#npc/a}* 您好！\n* 抱歉，\n  现在没有时间可供小睡了...',
            '<32>* 星光旅馆已经停业了，\n  我们要离开这里，\n  去寻找新家园了。'
        ],
        innkeep6: [
            "<32>{#p/basic}{#npc/a}* 噢，是你啊。\n* 我一直在担心你呢！",
            '<32>* 你听说了吗？\n  一切都在变得更加顺利。',
            "<32>* 我们很快就会在新家园安顿下来...",
            "<32>* 那里肯定会有\n  属于你的容身之处的！"
        ],
        kidd1: pager.create(
            2,
            ["<25>{#p/kidd}{#f/1}* 怎么了吗？"],
            ['<25>{#p/kidd}{#f/1}* 哟，近来可好？'],
            ['<25>{#p/kidd}{#f/1}* 嘿，嘿！'],
            ['<25>{#p/kidd}{#f/1}* 很高兴见到你，哈哈。'],
            ["<25>{#p/kidd}{#f/1}* 哇，老兄，怎么了吗？"]
        ),
        kidd2: pager.create(
            0,
            () =>
                game.room === 's_town1' // NO-TRANSLATE

                    ? [
                        "<25>{#p/kidd}{#f/1}* 哟，你也是个孩子，\n  对吧？",
                        "<25>{#p/kidd}{#f/1}* 我看得出来，\n  因为你穿着条纹衫。"
                    ]
                    : [
                        '<25>{#p/kidd}{#f/7}* 等下，你也读书的吗！？',
                        '<25>{#p/kidd}{#f/1}* 那个图书倌教会了我所有\n  关于怪物历史的知识！',
                        "<25>{#p/kidd}{#f/3}* 星球生活到底是怎样的呢？\n  想象不出来啊..."
                    ],
            () =>
                game.room === 's_town1' // NO-TRANSLATE

                    ? ['<25>{#p/kidd}{#f/1}* 我寻思着那个矮个子骷髅\n  有没有成年。']
                    : ['<25>{#p/kidd}{#f/3}* 你有在星球上生活过吗？']
        ),
        marriage1: [
            "<32>{#p/basic}* 什么气味？\n* （哪里来的气味？）",
            "<32>* 如果你是这个气味...\n* （...证明你的气味！）"
        ],
        marriage2: [
            "<32>{#p/basic}* 嗯...\n* 这就是那个怪气味。",
            '<32>* 这气味让我想把它消灭掉...',
            '<32>* （...把你消灭掉！）'
        ],
        marriage3a: [
            '<32>{#p/basic}* 狗狗可以摸其它狗狗？？？\n* （一扇新世界的大门\n  向我们敞开了...）',
            '<32>* 谢谢你，怪狗狗！'
        ],
        marriage3b: [
            '<32>{#p/basic}* 怪气味也能带来好东西嘛...\n* （抛接游戏真有趣！）',
            '<32>* 谢谢你，怪气味！\n* （太意外了！\n  真是非同一“扳”得好玩！）'
        ],
        marriage3c: [
            "<32>{#p/basic}* 闻东西越来越费劲了...\n* （感觉自己快瞎了...）",
            "<32>* 咱们快逃吧！"
        ],
        marriage3d: [
            '<32>{#p/basic}* 那只怪狗狗突然窜出来...\n* （差点弄死了我们...）',
            "<32>* 咱们快逃吧！"
        ],
        marriage3e: [
            "<32>{#p/basic}* 狗狗之间竟然可以相互抚摸\n  并一起玩抛接游戏？？？\n* （这简直太犯规了...）",
            '<32>* 谢谢你，怪狗狗！\n* （以后，\n  我们的生活将彻底改变！）'
        ],
        marriage4: [
            "<32>{#p/basic}* 王子在哪？\n* （没走错路吧？）",
            '<32>* 必须阻止那个恶魔...\n* （...还有他的人类帮凶！）'
        ],
        marriage5: ['<32>{#p/basic}* 呃...\n* 他们在这...', "<32>* （抓住他们！）"],
        maze1: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}{#f/0}* 欢迎回来。',
                    "<25>{#p/sans}{#f/3}* 真是太遗憾了...",
                    "<25>{#p/sans}{#f/2}* 这个谜题\n  帕派瑞斯精心准备了好久...\n* 但现在他有事，来不了了。",
                    "<25>{#p/sans}{#f/0}* 不过，没关系。",
                    "<25>{#p/sans}{#f/0}* 我答应过他，会让你解谜的。\n* 那么，开始吧。"
                ]
                : [
                    '<18>{#p/papyrus}哦吼，\n那个人类来了！',
                    '<18>我和我的兄弟\n整了些谜题。',
                    '<18>{#f/9}你准备好接受\n挑战了吗，人类！？',
                    choicer.create('* （你要怎么回答？）', '准备好了', '没准备好'),
                    '<18>{#p/papyrus}回答正确！\n因为你也看到了...'
                ],
        maze2a: [
            '<18>{#x4}{#f/9}从来没有一个工匠\n做的陷阱可以跟我的\n相提并论！',
            "<18>{#f/0}可以让人无法抗拒！",
            "<25>{#x1}{#p/sans}{#f/2}* 也许你才是那个让人\n  无法抗拒的人。",
            '<18>{#p/papyrus}{#f/1}真的吗！？'
        ],
        maze2b: [
            '<18>{#x4}{#f/9}没有人类能解开由\n伟大的帕派瑞斯\n所制作的谜题！',
            '<25>{#x1}{#p/sans}{#f/4}* 也没人有机会去解，兄弟。',
            "<18>{#p/papyrus}{#x3}{#f/7}呃啊，这不是重点！！"
        ],
        maze3: ['<18>{#x1}{#f/0}不论如何，\n我把这个谜题叫做...'],
        maze3a: [
            '<18>“躲避烈火之墙”！！',
            '<25>{#p/sans}* 你直接叫它“防火墙”\n  不就行了吗？\n* 这样多省事。',
            "<18>{#p/papyrus}{#f/4}艾菲斯博士肯定要\n吐槽你瞎用术语了。",
            "<25>{#p/sans}* 这我不清楚，兄弟。\n  不过，博士真的超级喜欢\n  这个谜题。",
            "<30>{#f/2}* 毕竟... 这东西多让人\n  {@fill=#ff0}热{@fill=#fff}血沸腾啊。"
        ],
        maze4: ['<18>{#p/papyrus}{#x3}{#f/7}别说了，衫斯！！'],
        maze5: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}{#f/0}* 这是“火墙”。',
                    "<25>{#p/sans}{#f/2}* 把它联想成\n  电脑的“防火墙”就行。",
                    '<25>{#p/sans}* 到达对面，你就过关了。',
                    '<25>{#p/sans}* 很简单，对吧？',
                    "<25>{#p/sans}{#f/3}* 不过，我之前亲自尝试过\n  这个谜题，只能说...",
                    "<25>{#p/sans}{#f/2}* 它可没你想得那么简单。"
                ]
                : [
                    '<18>{#p/papyrus}...总之，\n这个谜题背后的想法\n其实非常简单。',
                    '<18>因为你应该做的...',
                    '<18>{#f/9}只有成功到达另一边！！',
                    '<18>{#f/0}祝你好运！！\n捏嘿嘿！！'
                ],
        maze6: pager.create(
            0,
            () =>
                world.edgy
                    ? [
                        '<25>{#p/sans}{#f/0}* 嗯？你要回哪去？',
                        '<25>{#p/sans}{#f/3}* 试试嘛，\n  起码配合一下。'
                    ]
                    : ["<18>{#p/papyrus}{#x2}{#f/7}你往哪里走呢！？"],
            () => (world.edgy ? ['<25>{#p/sans}{#f/0}* 真要走？'] : ['<18>{#p/papyrus}{#x2}{#f/7}快回来！！'])
        ),
        maze7: [
            [
                '<18>{#p/papyrus}你是怕火吗？？',
                "<18>{#f/4}不用担心，\n这火其实烧不到你。",
                '<18>{#f/0}用衫斯的话来说，\n那些火“暖暖的，很舒服”。',
                '<25>{#p/sans}* 事实上，这句话是我\n  从一个朋友那学来的。',
                '<18>{#p/papyrus}{#f/4}...哦。'
            ],
            [
                '<18>{#p/papyrus}你在担心解不了谜题吗？？',
                "<18>如果是那样的话，\n那你一定得知道...",
                '<18>{#x4}{#f/9}我，伟大的帕派瑞斯，\n不会因此而评判你！',
                '<18>{#f/0}就像每个明星大厨\n都知道的那样，\n心意是最重要的。',
                '<18>{#x1}所以，来吧，\n尽力就好！'
            ],
            [
                '<18>{#p/papyrus}{#f/4}（衫斯，那个人类\n在干什么啊？？）',
                '<25>{#p/sans}* 可能在研究路线吧。',
                '<18>{#p/papyrus}{#f/4}（哦，确实。）',
                '<18>{#f/9}那样的话，\n准备好了就前进吧！'
            ]
        ],
        maze8: () =>
            world.edgy
                ? ['<25>{#p/sans}{#f/0}* 哎呀，真可惜。\n* 不过别灰心。']
                : [
                    '<18>{#p/papyrus}捏嘿嘿！\n那好吧。',
                    "<18>{#f/9}看来你被\n伟大的帕派瑞斯戏弄了！",
                    '<18>{#f/0}但别担心！',
                    '<18>你也看到了，\n我的陷阱可不差。',
                    "<18>{#f/9}你不能因为轻易失败\n就受到指责！！"
                ],
        maze9: () =>
            world.edgy
                ? ["<25>{#p/sans}{#f/0}* 不错嘛。\n* 没看出来，你还挺机灵的。"]
                : [
                    '<18>{#p/papyrus}{#f/1}啥！？',
                    '<18>{#f/7}你咋做到的！？！？',
                    '<18>这谜题是个人都过不去啊！',
                    '<18>{#f/9}...哎呀，行吧！\n我得快点布置自己的谜题了！'
                ],
        maze10: () =>
            world.edgy
                ? [
                    "<25>{#p/sans}{#f/0}* 好了，谜题结束了。",
                    '<25>{#p/sans}{#f/3}* ...总之，感谢游玩。',
                    "<25>{#p/sans}{#f/0}* 现在，\n  我要去准备下个谜题。",
                    "<25>{#p/sans}{#f/2}* 待会见。"
                ]
                : [
                    '<18>{#f/4}无论如何...',
                    '<18>{#f/0}我很期待\n接下来的发展！',
                    '<18>{#f/4}一个令人\n十分困惑的谜题...',
                    "<18>{#f/1}连特雷莉亚自己\n都解决不了！！",
                    "<25>{#p/sans}* 特雷莉亚？\n* 是那个在世\n  最长寿的怪物吗？",
                    '<18>{|}{#p/papyrus}{#f/1}呃...\n是这样没错，但- {%}',
                    "<25>{#p/sans}* 妈呀，我都不知道\n  原来你对我的评价这么高。",
                    '<18>{#p/papyrus}{#f/4}啥。',
                    "<25>{|}{#p/sans}* 就是说，\n  如果连她都解不了，\n  那- {%}",
                    '<18>{#p/papyrus}{#f/7}{#x3}我懂你的意思了！！'
                ],
        maze11: ['<18>{#p/papyrus}{#f/7}衫斯，\n我们还有谜题要准备呢！！', '<18>快来吧！'],

        nicecreamSc1: [
            "<32>{#p/basic}* 我搞不懂为什么\n  这些东西卖不出去...",
            "<32>* 这可是享受这些东西的\n  绝佳圣地..."
        ],
        nicecreamSc2: () => [
            SAVE.data.n.plot > 20.2
                ? '<32>{#p/basic}* 哦！！！！\n* ...你回来了！'
                : SAVE.data.b.s_state_scorereaction1 || SAVE.data.n.plot === 20.2
                    ? "<32>{#p/basic}* 等一下！！！！\n* 也许你会喜欢这些东西！"
                    : '<32>{#p/basic}* 哦！！！！\n* 一个顾客！！',
            '<32>* 你好！\n* 想来根冰意灵吗？',
            SAVE.data.b.s_state_million
                ? '<32>* 作为榜上的第一名，\n  可以给你打个骨折！\n* 每根冰意灵只要6G！'
                : "<32>* 这可是能点燃你内心的冰冻甜品！\n* 现在只要12G。"
        ],
        nicecreamSc3: () => [
            "<32>{#p/basic}* 冰意灵！\n* 能点燃你内心的冰冻甜品！",
            SAVE.data.b.s_state_million ? '<32>* 你的话，只要6G！' : '<32>* 现在只要12G。'
        ],
        nicecreamPrompt1: () => [choicer.create('* （花$(x)G买根冰意灵吗？）', '买', '不买')],
        nicecreamPrompt2: () => [choicer.create('* （要兑换一根冰意灵吗？）', '兑换', '算了')],
        nicecreamSc4: [
            '<32>{#p/basic}* 那好吧...\n* 告诉你的朋友...',
            "<32>* 在荒郊野外...\n* 有个买冰淇淋的地方..."
        ],
        nicecreamFc1: ['<32>{#p/basic}* 我换了个地方摆摊，\n  可还是没有顾客...'],
        nicecreamFc2: [
            "<32>{#p/basic}* 幸运的是，\n  我想到了一个解决方案！！",
            '<32>* 明信片！',
            '<32>* 你每买一根冰意灵，\n  就可以从箱子里\n  拿一张明信片。',
            '<32>* 如果你有了三张明信片，\n  你就可以换一根\n  免费的冰意灵！',
            "<32>* 这些明信片\n  肯定会给我带来回头客的！",
            '<32>* 哦，嗯，\n  你想来根冰意灵吗？',
            "<32>* 这可是能点燃你内心的冰冻甜品！\n* 现在只要10G。"
        ],
        nicecreamFc3a: [
            "<32>{#p/basic}* 冰意灵！\n* 能点燃你内心的冰冻甜品！",
            "<32>* 你已经有三张明信片了，\n  想要兑换一根冰意灵吗？"
        ],
        nicecreamFc3b: [
            "<32>{#p/basic}* 冰意灵！\n* 能点燃你内心的冰冻甜品！",
            '<32>* 现在只要10G。'
        ],
        nicecreamFc4: [
            '<32>{#p/basic}* 那好吧...\n* 告诉你的朋友...',
            '<32>* 冰意灵买三赠一...'
        ],
        nicecreamFc5: ["<32>{#p/basic}* 别忘了从箱子里\n  拿一张明信片！"],
        nicecreamNoFun1: ["<32>{#p/basic}* 嗯？\n* 你的口袋里没有\n  空地方了..."],
        nicecreamNoFun2: ['<32>{#p/basic}* 我也希望\n  能把冰意灵做得好放点...'],
        nicecreamNoMun1: ["<32>{#p/basic}* 嗯？\n* 你的钱不太够..."],
        nicecreamNoMun2: ['<32>{#p/basic}* 我也希望\n  做冰意灵不用花钱...'],
        nicecreamFree1: ['<32>{#p/basic}* 告诉你一个好消息，\n  这第一根可以免费送你。'],
        nicecreamFree2: ['<32>{#p/basic}* 希望你喜欢...'],
        nicecreamReturnWithGoods: ['<32>{#p/basic}* 没关系，\n  你随时都可以回来买。'],
        nicecreamReturnWithNeeds: ["<32>{#p/basic}* 哦，没关系的。", '<32>* 晚点再来啊，孩子！'],
        nicecreamPurchase: ['<32>{#p/basic}* 拿好了！\n* 愿你有个星光璀璨的夜晚！'],
        nicecreamGet: ['<32>{#s/equip}{#p/human}* （你得到了冰意灵。）'],
        nicecreamK1a: ['<25>{#p/kidd}{#f/1}* 哟，可以给我来一根\n  冰意灵吗？'],
        nicecreamK1b: ["<32>{#p/basic}* 当然没问题，孩子。\n* 只要你有钱的话。"],
        nicecreamK1c: ['<25>{#p/kidd}{#f/2}* （嘘，把这个给他。）'],
        nicecreamK1d: [
            '<25>{#p/kidd}{#f/7}* 哟，这儿有\n  免费的冰意灵吃啊！？',
            '<25>{#p/kidd}{#f/1}* 也给我来一根！'
        ],
        nicecreamK2: ['<32>{#p/basic}* 你... 你是从哪里\n  拿到这个的？'],
        nicecreamK3a: ['<32>* 没-没问题，孩子...\n  给你！'],
        nicecreamK3b: [
            '<32>{#s/equip}{#p/human}* （你把冰意灵递给了怪物小孩。）',
            '<25>{#p/kidd}{#f/7}* 太棒了...'
        ],
        nicecreamE: pager.create(
            0,
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}* 恐怕我又卖光了！\n* 大家都跑来买东西\n  来庆祝重获自由了！",
                        ...(world.population_area('s') < 6 || world.population_area('f') < 6 || world.population < 2 // NO-TRANSLATE

                            ? [
                                "<32>* 就算我没卖光，\n  我也不会卖给你的...",
                                '<32>* 如果我把冰意灵卖给一个恶霸，\n  我的声誉就全毁了！'
                            ]
                            : [
                                "<32>* 最近生意不错，\n  我就开始反思过去，\n  并想起了我的父亲。",
                                "<32>* 如果不是他发明了冰意灵，\n  我现在可能还在卖廉价的气球呢。"
                            ])
                    ]
                    : [
                        "<32>{#p/basic}* 嘿，孩子！\n* 我真的很想给你一根冰意灵，\n  但我已经全卖光了！",
                        '<32>* 生意从来没像今天在这里\n  这么火爆过！',
                        "<32>* 我都要供不应求了！"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? world.population_area('s') < 6 || world.population_area('f') < 6 || world.population < 2 // NO-TRANSLATE

                        ? ['<32>{#p/basic}* 当然，我没有针对你的意思。']
                        : [
                            '<32>{#p/basic}* 据说，\n  他是在星港的全息森林里\n  卖出了他的第一根冰意灵。'
                        ]
                    : ['<32>{#p/basic}* 也许是时候开一家我\n  梦寐以求的“冰意灵”\n  连锁店了...']
        ),
        faunX: () =>
            [
                ['<32>{#p/basic}{#npc/a}* 我看得出来，\n  你对生命毫无敬畏之心。\n* 大赢家，干得真好啊。'],
                ['<32>{#p/basic}{#npc/a}* 大赢家，再接再厉啊。\n* 看看你这样下去\n  最后会怎样。'],
                ['<32>{#p/basic}{#npc/a}* 你还真继续啊？\n  这就是大赢家的风范吗？']
            ][Math.min(roomKills().s_greater++, 2)],
        snowdrakeX: [
            '<32>{#p/basic}{#npc/a}* 咯？\n* 你刚才...',
            "<32>{#p/basic}{#npc/a}* ...\n* 这，呃，可不咋酷。"
        ],
        moonrocksX1: ['<32>{#p/basic}{#npc/a}* 什么-\n* 为什么要那样做？'],
        moonrocksX2: ['<32>{#p/basic}{#npc/b}* 不是~\n* 到底怎么回事？'],
        npcinter: {
            s_snowdrake: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 嘿。\n* 你真的很酷。",
                            '<32>* 总之，不管你是要和神\n  还是其他什么人干架...',
                            "<32>* 都要记得按住[X]\n  可以让移动的速度慢一倍。\n* 这很重要。"
                        ]
                        : roomKills().s_doggo > 0
                            ? ["<32>{#p/basic}{#npc/a}* 你离我远点！\n* 我不喜欢你。"]
                            : SAVE.data.n.plot < 19
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我听说，如果你在战斗中按住[X]，\n  移动的速度会比正常慢一倍！",
                                    '<32>* 我懂... 你觉得没用，是吗？',
                                    "<32>* 但我告诉你一个秘密。\n* 那边那条狗... 他巴不得你\n  移动速度快呢。",
                                    '<32>* 如果你边按住[X]边靠近他，\n  你就不会被他发现！',
                                    '<32>* 咯呵呵... 祝你好运。'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 所以你回来找我聊天了，嗯？',
                                    "<32>* 还挺酷。",
                                    '<32>* 虽然没我酷，但也算很酷了。'
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 很重要。']
                        : roomKills().s_doggo > 0
                            ? ["<32>{#p/basic}{#npc/a}* 你聋吗？\n* 给我滚！"]
                            : SAVE.data.n.plot < 19
                                ? ["<32>{#p/basic}* 你肯定用得到的。"]
                                : ["<32>{#p/basic}* 我很高冷的。"]
            ),
            s_genokid: pager.create(
                0,
                () =>
                    world.genocide
                        ? [
                            '<25>{#p/kidd}{#f/3}{#npc/a}* 刚才，有个小孩走过来\n  往我脑袋里插了什么东西。',
                            '<25>{#f/3}* 之后，他就去铸厂了，\n  说要去“增强信号”。',
                            '<25>{#f/4}* ...有些小孩真是奇怪。'
                        ]
                        : [
                            '<25>{#p/kidd}{#f/3}{#npc/a}* 哟，大家都去逃难了。',
                            '<25>{#f/3}* 我说，成年人有时候\n  就是这么蠢，哈哈...',
                            "<25>{#f/1}* 他们难道不知道\n  安黛因会保护我们吗！？"
                        ],
                () =>
                    world.genocide
                        ? ["<25>{#p/kidd}{#f/7}{#npc/a}* 不过，你可不奇怪，\n  而且长得超酷的！"]
                        : ["<25>{#p/kidd}{#f/1}{#npc/a}* 安黛因就是我们的坚实后盾！"]
            ),
            g_beautifulfish: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            "<32>{#p/basic}{#npc/a}* 孩子，你居然还敢来这儿。\n  胆子还真是不小啊。",
                            '<32>* 我们都看到电视上发生的事了。'
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 真没想到发生上次那事后，\n  衫斯还会回到这里来。",
                                "<32>* ...也许还挺正常的。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 到最后，\n  我的语音信箱里也没有收到\n  任何“女孩”的留言。',
                                    '<32>* 所以啊，孩子，\n  听我一句劝...',
                                    "<32>* 不要妄想能用语音信箱\n  来钓到神奇的太空生物。"
                                ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 衫斯到底上哪儿去了？',
                                        '<32>* 他告诉我他有一张星象图，\n  可以给我用来找女孩...',
                                        '<32>* 我是觉得这多半是个恶作剧，\n  但我想知道这到底\n  是个什么恶作剧！'
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我今天发了条帖子，\n  看看能不能钓到点“女孩”。',
                                        '<32>* 有人告诉我说\n  漫天群星蕴含着无限可能性...',
                                        "<32>* 所以，我很认真地\n  听取了那个建议...",
                                        "<32>* 我真的要和一个太空生物\n  卿卿我我了。"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 要听听我的感想吗？',
                            '<32>* ...只有那个机器人会让我产生\n  想找男朋友而不是女朋友的想法。',
                            "<32>* 看到他走了，我很难过。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 你跟我说话的口气\n  好像你想知道\n  内幕消息似的。",
                                "<32>{#p/basic}{#npc/a}* 抱歉孩子。\n* 看来你只能等下一条新闻了。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 不过啊，我有一个未接来电...',
                                    '<32>* ...是个叫“洋葱桑”的打来的。',
                                    "<32>* 不过这人没有给我留言。"
                                ]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 你知道衫斯在哪儿吗？']
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我觉得我可以问问安黛因。\n* 但她好像已经喜欢别人了。'
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ["<32>{#p/basic}{#npc/a}* 希望以后还能出现\n  像他一样可爱的帅哥..."]
                        : SAVE.data.n.plot === 33
                            ? ["<32>{#p/basic}{#npc/a}* 你该不会没有\n  域外网账号吧..."]
                            : SAVE.data.n.plot === 72
                                ? ["<32>{#p/basic}{#npc/a}* 到底啥是洋葱桑啊？"]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 你看到他的话，告诉我一声...']
                                    : ['<32>{#p/basic}{#npc/a}* 我还能找到真爱吗？']
            ),
            g_bigmouth: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 嗯...',
                            '<32>* 我在想机器人\n  会喜欢吃怎样的食物。',
                            '<32>* 他们会吃东西吗？',
                            "<32>* ...如今我们永远也无法知道了。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* 衫斯从第一天起\n  就是这里的常客了。',
                                ...(papreal()
                                    ? [
                                        '<32>* 他通常会点菜单上最难吃的菜...',
                                        '<32>* 不过今天早些时候...',
                                        '<32>* ...他点了菜单上第二难吃的菜。',
                                        "<32>* 挺稀奇的，对吧？"
                                    ]
                                    : [
                                        '<32>* 他总是点菜单上最难吃的菜，\n  而且从不付账。',
                                        '<32>* 不过看在他吸引了\n  这么多其他顾客的份上...',
                                        '<32>* 烤尔比甚至给他特别\n  安排了点东西。',
                                        '<32>* ...所以“雅莫万用酱”\n  到底是什么东西？'
                                    ])
                            ]
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我在想人类恶霸的味道\n  会是怎样的...',
                                        "<32>* 那人是越坏越好吃吗？\n* 还是反过来？"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 虽然我很想尝尝人类的食物...",
                                        "<32>* 但新世界的食物...\n  肯定要更好吃点。"
                                    ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 嗯，衫斯差不多该来了。',
                                        '<32>* 然后，再过一会儿，\n  他的兄弟也会来。',
                                        '<32>* 对，他的兄弟。\n* 帕派瑞斯。',
                                        '<32>* 他以前总是点牛奶，\n  但现在，\n  他每次都点不同的东西...',
                                        "<32>* 那个复制器真是个神奇的东西，\n  不是吗？",
                                        "<32>* 可惜它只能制造怪物的食物。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 嗯...\n* 人类的食物和怪物的\n  应该是不一样的吧？",
                                        '<32>* 听说会“变质”什么的。',
                                        '<32>* 而且不像怪物的食物一样\n  可以直接转化为能量...',
                                        '<32>* 人类的食物必须\n  要先通过他们的身体。',
                                        '<32>* 就算在低重力的环境\n  也是这样。',
                                        "<32>* 真诡异。\n* 我找时间也想试试。"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 真不幸。']
                        : SAVE.data.n.plot === 33
                            ? papreal()
                                ? world.dead_skeleton
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 仔细想想，\n  今天发生的令人不快的事\n  还不止这一件..."
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 真奇怪。']
                                : ["<32>{#p/basic}{#npc/a}* 我们身边有这样的人，\n  真是太幸运了。"]
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 说不定，\n  要是那人在最后一刻良心发现，\n  会变得究极好吃。'
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 说不定，新世界的食物\n  比人类的食物坏得更快呢。'
                                    ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我希望他今天能来。\n* 他和他的兄弟\n  都很擅长逗我们笑。'
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 我还听说他们有\n  叫做“厕所”的东西。'],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 真不幸。']
                        : SAVE.data.n.plot === 33
                            ? papreal()
                                ? ['<32>{#p/basic}{#npc/a}* 真奇怪。']
                                : ['<32>{#p/basic}{#npc/a}* 真开心。']
                            : SAVE.data.n.plot === 72
                                ? world.population < 4
                                    ? ['<32>{#p/basic}{#npc/a}* 真... 出乎意料。']
                                    : ['<32>{#p/basic}{#npc/a}* 真... 美味。']
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 骷髅真酷。']
                                    : ['<32>{#p/basic}{#npc/a}* 人类真奇怪。']
            ),
            g_bunbun: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 镁-镁塔顿是这里\n  最-最烧的帅哥了...',
                            '<32>* 没有他，\n  前哨站冷清了好多好多！'
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* 衫~衫~\n* 快回来坐我旁边...！',
                                "<32>* 有你在的时候，\n  一切都那么有-有-有趣..."
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 我-我在想，\n  新-新世界那有没有烧男...',
                                    '<32>* 以-以及好喝的东-东...',
                                    "<32>* 噢噢噢噢噢，我已经迫不及待了！"
                                ]
                                : papreal()
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 嘿-嘿，\n  衫衫现在是不是该来晃悠了？",
                                        "<32>* 快来嘛，衫衫！\n* 你可是我们这儿的灵魂人物啊..."
                                    ]
                                    : world.dead_dog
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 这里也太-太-太安静了。",
                                            '<32>* 大家开心点嘛！\n* ...',
                                            "<32>* 我有点开始讨厌这个地方了。"
                                        ]
                                        : [
                                            "<32>{#p/basic}{#npc/a}* 不论我去到哪里，\n  看到的都是一样的菜单，\n  遇到的都是一样的人...",
                                            "<32>* 服务员！\n* 我想再来点喝的，\n  再来点烧-烧-烧-烧男！"
                                        ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 好-好冷清...']
                        : SAVE.data.n.plot === 33
                            ? ['<32>{#p/basic}{#npc/a}* 衫~衫~']
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}{#npc/a}* 超级超级期待！']
                                : papreal() || world.dead_dog
                                    ? ['<32>{#p/basic}{#npc/a}* ...']
                                    : ["<32>{#p/basic}{#npc/a}* 我感觉那个酒保\n  就挺烧-烧-烧-烧的..."]
            ),
            g_dogamy: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        "<32>{#p/basic}{#npc/a}* 关于镁塔顿的事，\n  大家已经吵翻了天，\n* 我的话...",
                        SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                            ? '<32>{#p/basic}{#npc/a}* 我只想知道\n  其他的狗狗都去哪了。'
                            : SAVE.data.n.state_starton_doggo === 2
                                ? '<32>{#p/basic}{#npc/a}* 我还是在想遁狗发生了什么事。'
                                : SAVE.data.n.state_starton_greatdog === 2
                                    ? '<32>{#p/basic}{#npc/a}* 我还是很怀念\n  那个大家伙在我们身边的日子。'
                                    : papreal()
                                        ? '<32>{#p/basic}{#npc/a}* 我还是很怀念\n  衫斯和他的兄弟\n  在我们身边的日子。'
                                        : '<32>{#p/basic}{#npc/a}* 我只希望\n  衫斯能回来再摸摸我们的头。'
                    ]
                    : SAVE.data.n.plot === 33
                        ? ['<32>{#p/basic}{#npc/a}* 嘘，我在期待衫斯\n  能过来摸摸我们的头。']
                        : SAVE.data.n.plot === 72
                            ? world.population < 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我们自由啦！\n* 也许现在，衫斯终于可以来\n  摸摸我们的头了。",
                                    "<32>* 这比担忧着\n  在镇上肆意横行的恶霸\n  要好得多了。"
                                ]
                                : [
                                    "<32>{#p/basic}{#npc/a}* 我们自由啦！\n* 也许现在，衫斯终于可以来\n  摸摸我们的头了。",
                                    "<32>* 或许我们新公司的客户\n  可以代为摸头。"
                                ]
                            : SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? ['<32>{#p/basic}{#npc/a}* 闻起来有些... 安静。']
                                : SAVE.data.n.state_starton_doggo === 2
                                    ? ["<32>{#p/basic}{#npc/a}* 我不敢相信遁狗居然失踪了..."]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? ["<32>{#p/basic}{#npc/a}* 那个大家伙去哪了？\n* 它不来我们没法开始玩啊。"]
                                        : papreal()
                                            ? ["<32>{#p/basic}{#npc/a}* 衫斯去哪了...\n* 他本应该来摸我的头的..."]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 你最好盯紧了你坐的地方，\n  孩子。',
                                                '<32>* 那个大家伙随时都会\n  跳到你的大腿上，\n  给你满满的爱和关注。'
                                            ],
            g_dogaressa: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}{#npc/a}* （我和我老公\n  只想让大家冷静下来。）',
                        "<32>{#p/basic}{#npc/a}* （镁塔顿的死是个悲剧，\n  但他只是个电视人物而已！）"
                    ]
                    : SAVE.data.n.plot === 33
                        ? ['<32>{#p/basic}{#npc/a}* （我喜欢衫斯。）\n* （有的时候他会在桌子底下\n  喂我们一些残羹剩饭。）']
                        : SAVE.data.n.plot === 72
                            ? world.population < 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* （既然我们自由了，\n  我们打算开一家婚姻咨询公司。）",
                                    '<32>* （我们的第一个课程将会叫做\n  “处于虐待关系中\n   意味着什么”。）'
                                ]
                                : [
                                    "<32>{#p/basic}{#npc/a}* （既然我们自由了，\n  我们打算开一家婚姻咨询公司。）",
                                    '<32>* （我们的第一个课程将会叫做\n  “和你的母亲结婚的\n   注意事项”。）'
                                ]
                            : SAVE.data.n.state_starton_doggo === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* （今天这里好冷清啊。）\n* （如果我们的朋友不来，\n  你愿意和我们一起玩吗？）"
                                ]
                                : SAVE.data.n.state_starton_doggo === 2
                                    ? ["<32>{#p/basic}{#npc/a}* （遁狗去哪了？）\n* （希望他这回没有迷路。）"]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? ["<32>{#p/basic}{#npc/a}* （大犬座去哪了？）\n* （他本应该在这里\n  和我们一起玩游戏的。）"]
                                        : papreal()
                                            ? ['<32>{#p/basic}{#npc/a}* （那些骷髅去哪了？）\n* （我想从他们那儿弄根骨头...）']
                                            : [
                                                "<32>{#p/basic}{#npc/a}* （我们是哨兵，\n  但我们从来没得到\n  一点尊重。）",
                                                '<32>* （真希望那几个骷髅可以\n  丢几根骨头给我们。）',
                                                '<32>* （我们最喜欢骨头了。）'
                                            ],
            g_doggo: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}{#npc/a}* 失去镁塔顿真是太糟糕了，\n  你能懂吗？',
                        '<33>* 整个前哨站里，\n  就他最震天动地了！',
                        "<32>* 没有他，电视上可能就\n  只会出现那些动都不动的人了。"
                    ]
                    : SAVE.data.n.plot === 33
                        ? [
                            '<32>{#p/basic}{#npc/a}* 嗯？\n* 你和衫斯什么时候\n  成为朋友了？',
                            "<32>* 我不太喜欢那家伙...",
                            '<32>* 他喜欢一动不动地出现。'
                        ]
                        : SAVE.data.n.plot === 72
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我已经很久没有被抱过了，\n  但终于有人向我张开了怀抱。",
                                '<32>* 冰狼现在是我的新狼了。'
                            ]
                            : SAVE.data.n.state_starton_dogs === 2 && SAVE.data.n.state_starton_greatdog === 2
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 有时候大伙喜欢捉弄我。\n  他们一动不动地坐着，\n  让我察觉不到。",
                                    '<32>* 他们肯定就在这附近，\n  拿我开涮呢。',
                                    "<32>* 我就等着他们中的谁承认吧..."
                                ]
                                : SAVE.data.n.state_starton_dogs === 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 另外那俩去哪了？\n* 就我一个可没法和这个大家伙玩...",
                                        "<32>* 那样可太困难了！"
                                    ]
                                    : SAVE.data.n.state_starton_greatdog === 2
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 那个大家伙去哪了？\n* 就我一个可没法和这俩玩...",
                                            "<32>* 那样可太简单了！"
                                        ]
                                        : papreal()
                                            ? ['<32>{#p/basic}{#npc/a}* 帕派瑞斯？\n* 是你吗？\n* 快过来...']
                                            : [
                                                "<32>{#p/basic}{#npc/a}* 我在考虑把头发留长一点，\n  来彰显我的个性。",
                                                '<32>* 它代表着：“请给我一个\n  大大的、温柔的拥抱，\n  搂搂我。”'
                                            ],
            g_grillby: () =>
                SAVE.data.b.killed_mettaton
                    ? [
                        '<32>{#p/basic}* ...\n* ...\n* ...',
                        '<32>{#npc/a}* 烤尔比说压轴好戏\n  对生意有好处。',
                        "<32>* 不过，我不确定他\n  是不是真的喜欢这样。"
                    ]
                    : SAVE.data.n.plot === 33
                        ? SAVE.data.b.item_fast_food
                            ? [
                                '<32>{#p/basic}* ...\n* ...\n* ...',
                                '<32>{#npc/a}* 烤尔比说他只让衫斯\n  免费吃饭，因为他帮着吸引了\n  其他顾客。',
                                "<32>* 我感觉硬说的话\n  好像还真是这么回事..."
                            ]
                            : [
                                '<32>{#p/basic}* ...\n* ...\n* ...',
                                '<32>{#npc/a}* 烤尔比建议你\n  在他把食物扔掉之前\n  把它们带走。'
                            ]
                        : SAVE.data.n.plot === 72
                            ? world.population < 4
                                ? ['<32>{#p/basic}* ...\n* ...\n* ...好吧。']
                                : ['<32>{#p/basic}* ...\n* ...\n* ...好样的。']
                            : postSIGMA()
                                ? [
                                    '<32>{#p/basic}* ...\n* ...\n* ...',
                                    '<32>{#npc/a}* 烤尔比说酒吧的一些设备\n  最近坏掉了。',
                                    "<32>* 我们本来想花钱找人修的，\n  但自从镁塔顿取消了\n  他的表演什么的...",
                                    "<32>* 我们的利润每分钟都在减少。"
                                ]
                                : world.population < 4
                                    ? [
                                        '<32>{#p/basic}* ...\n* ...\n* ...',
                                        '<32>{#npc/a}* 今天店里这么冷清，\n  烤尔比实在很对不起。',
                                        "<32>* 我看，那些老主顾可能就是怕了...",
                                        '<32>* 怕那个恶霸。\n* 当然喽。'
                                    ]
                                    : [
                                        '<32>{#p/basic}* ...\n* ...\n* ...',
                                        '<32>{#npc/a}* 烤尔比说他是在一本\n  电子杂志上找到他的\n  新颜色的。',
                                        "<32>* 我个人还是更喜欢烤尔比\n  原始的那个橘色。\n* 仅个人观点。"
                                    ],
            g_punkhamster: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            "<32>{#p/basic}{#npc/a}* 你真把那个大人物机器人\n  给教训了一顿，是不是？",
                            "<32>* ...可是，他让我有点同情他。"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                '<32>{#p/basic}{#npc/a}* 衫斯当然知道该怎么逗你笑，\n  对吧？',
                                '<32>* 那是肯定的。\n* 这里的账单几乎都是\n  那个骷髅付的。'
                            ]
                            : SAVE.data.n.plot === 72
                                ? world.population < 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 你知道吗，孩子，\n  我喜欢你的斗志。",
                                        "<32>* 本来以为我们都回到了镇上，\n  可以成为很好的朋友。",
                                        "<32>* ...但是我们又要搬走了，对吧？",
                                        "<32>* 也是。\n* 毕竟这里终究成不了\n  强者的天堂啊。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 如果我们自由了，\n  人们就不用\n  从首塔搬到这里来了！",
                                        "<32>* 看来不用担心\n  我们的地方文化会消失了。",
                                        "<32>* ...只是我们都要搬走了，对吧？",
                                        "<32>* 也是。\n* 毕竟“世间安得两全法，\n  不负自由不负卿”嘛。"
                                    ]
                                : papreal() || world.dead_canine || world.population < 6
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 首塔的人口越来越多了，\n  所以我听说他们打算\n  搬到这里来。",
                                        "<32>* ...谁知道呢？\n* 也许我们有地方容纳他们。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 首塔的人口越来越多了，\n  所以我听说他们打算\n  搬到这里来。",
                                        "<32>* 嗯...\n* 我不想看到我们的\n  地方文化被抹去。",
                                        "<32>* 但是教那些城里人\n  我们的生活方式\n  肯定很有趣！"
                                    ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ["<33>{#p/basic}{#npc/a}* 我在这件事上有点矛盾。"]
                        : SAVE.data.n.plot === 33
                            ? ["<32>{#p/basic}{#npc/a}* 常客？\n* 你说谁，我吗？\n* 不至于，我只能算半个常客。"]
                            : SAVE.data.n.plot === 72
                                ? world.population < 2
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 我想起来了，孩子，\n  你给了我灵感。\n* 我要成立一个搏杀俱乐部。"
                                    ]
                                    : ["<32>{#p/basic}{#npc/a}* 我们只需要\n  再想出点新东西就好了，\n  对吧？"]
                                : ["<32>{#p/basic}{#npc/a}* 哈，尽管来吧！"]
            ),
            g_redbird: pager.create(
                0,
                () =>
                    SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 呼呼呼！\n* 那可真是太精彩了！',
                            "<32>{#p/basic}{#npc/a}* ...呃，难道只有我觉得\n  这一切都只是个骗局吗？"
                        ]
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 衫斯是皇家哨兵，\n  但别被他的头衔骗了。",
                                '<32>* 大家都知道他\n  坐在全息森林边上\n  读着悬浮车手册。'
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 哇，是崭新的世界啊...',
                                    '<32>* 我以后可能没机会\n  再给烤尔比做翻译了...',
                                    "<32>* ...但或许还有机会！\n* 烤尔比，\n  你打算把这家店搬到那里去吗？",
                                    '<32>{#npc}* ...\n* ...\n* ...',
                                    ...(world.population < 4
                                        ? [
                                            "<32>{#npc/a}* 烤尔比说他相当乐意。",
                                            '<33>* 他肯定还在怕你呢。'
                                        ]
                                        : ["<32>{#npc/a}* 烤尔比说他会考虑的。"])
                                ]
                                : papreal()
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 烤尔比越来越紧张了。',
                                        "<32>* 衫斯是他的头号常客，\n  今天却一直没出现..."
                                    ]
                                    : world.dead_dog
                                        ? [
                                            '<32>{#p/basic}{#npc/a}* 那些狗是皇家卫队的成员，\n  是由...',
                                            '<32>* 欸？\n* 他们去哪了？\n* 奇怪...'
                                        ]
                                        : world.population < 4
                                            ? [
                                                "<32>{#p/basic}{#npc/a}* 听传言说，有个瞎晃悠的恶霸，\n  路上的人全都被他揍了。",
                                                '<32>* 不过我和烤尔比可不打算关店跑路。',
                                                "<32>* 区区恶霸，怎能逼得走咱们！"
                                            ]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 那些狗是皇家卫队的成员，\n  是由安黛因领导的\n  军事集团。',
                                                "<32>* 她粗鲁，吵闹，\n  谁不尊重她，她就揍谁...",
                                                "<32>* 难怪所有小孩子都希望\n  长大要像她那样呢！"
                                            ],
                () =>
                    SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 鬼知道那些\n  又粗鲁又吵闹的电视主持人\n  葫芦里卖的什么药。']
                        : SAVE.data.n.plot === 33
                            ? [
                                "<32>{#p/basic}{#npc/a}* 别问我他为什么\n  那么做。",
                                "<32>* 不过如果一定要我猜的话，\n  我觉得这和帕派瑞斯有关。"
                            ]
                            : SAVE.data.n.plot === 72
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 如果他真的在新家园\n  开了一家烤尔比...",
                                    ...(world.population < 4
                                        ? ['<32>* 我们只能祈祷\n  那里的旅客会更友善一些。', "<32>* ...我不好说你。"]
                                        : [
                                            "<32>* 我们只能祈祷那里的水不多。",
                                            "<32>* ...水多了会很危险。"
                                        ])
                                ]
                                : papreal() || world.dead_dog
                                    ? ['<32>{#p/basic}{#npc/a}* 感觉有点不对劲。']
                                    : world.population < 4
                                        ? ["<32>{#p/basic}{#npc/a}* 至少那人没在外头搞屠杀。"]
                                        : ['<32>{#p/basic}{#npc/a}* 我长大了也要像安黛因那样！\n* 吼吼吼！']
            ),
            l_cupjake: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 既然我们现在自由了，\n  那位可爱的女士\n  也总该离开了吧。",
                            '<32>* 然后，我就能亲自了解\n  那本{@fill=#f00}奇怪的书{@fill=#fff}里的内容了...'
                        ]
                        : [
                            "<32>{#p/basic}{#npc/a}* 这里有一本{@fill=#f00}奇怪的书{@fill=#fff}，\n  它会随机出现和消失...",
                            '<32>* 但那位可爱的女士\n  似乎总是妨碍我去拿！',
                            '<32>* 你知道该怎么样\n  才能把她吓跑吗？'
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 跟你讲，\n  我很快就能拿到那本书了。', '<32>* 很快就能了。']
                        : ["<32>{#p/basic}{#npc/a}* 我知道你在想什么。", "<32>* 你别试。"]
            ),
            l_kakurolady: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<32>* 这将是我们的最后一期新闻了...",
                            '<32>* 不如我们直接在封面上\n  写个大大的“剧终”，\n  然后收工算了？'
                        ]
                        : [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            '<33>* 我上学的时候，如果我们没有作业，\n  老师会给我们布置一些\n  “找不同”的谜题。',
                            '<32>* 我那时候觉得那是在浪费时间。\n* 但看看现在的我...',
                            "<33>* 我现在是前哨站第一的\n  “找不同”谜题设计师了！"
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<32>* 哎呀，干脆我们现在\n  就辞职不干了吧？"
                        ]
                        : [
                            '<32>{#p/basic}{#npc/a}* （咳，咳。）',
                            "<33>* 相信我，孩子。\n* 你不会想来干这行的。"
                        ]
            ),
            l_librarian: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 欢迎来到图书倌。',
                            ...(world.population === 0
                                ? ["<32>* 如果你再敢打人，\n  你会后悔的。"]
                                : ["<32>* 今天是我们最后一天营业，\n  所以你想怎么吵就怎么吵吧。"])
                        ]
                        : postSIGMA()
                            ? [
                                "<32>{#p/basic}{#npc/a}* 欢迎来到图书倌。\n* 这里是镇上唯一用不着电的地方。",
                                '<32>* 考虑到最近停电了，\n  这还是蛮重要的。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 欢迎来到图书倌。\n* 老实说，这名字\n  来源于一次拼写错误。',
                                '<32>* 久而久之，\n  所有人都这么叫了...'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population === 0
                            ? ["<32>{#p/basic}{#npc/a}* 你也是有感情的吧？"]
                            : ["<32>{#p/basic}{#npc/a}* 也不是说以前有人不让你吵..."]
                        : ["<32>{#p/basic}{#npc/a}* 如果你懒得去修正一些细小的问题，\n  就会发展成现在这样的状况。"]
            ),
            l_sweetie: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 噢我的天哪，\n  有好多新闻要报道，\n  我都不知道该从何说起了！",
                            '<32>* 标题要不就写...\n* “怪物终于逃离了前哨站”。',
                            "<32>* 嗯，\n  感觉这个标题还是不够吸引人...",
                            '<32>* “你绝对想不到\n   是谁帮我们逃离了前哨站”，\n  这个怎么样！'
                        ]
                        : postSIGMA()
                            ? [
                                '<32>{#p/basic}{#npc/a}* 最近，\n  新闻推送的工作\n  变得越来越麻烦了。',
                                "<32>{#p/basic}{#npc/a}* 很多时候，\n  我甚至无法登录\n  我自己的账户！",
                                '<32>{#p/basic}{#npc/a}* 为了解决这个问题，\n  我可能得亲自去\n  休闲回廊的服务器那边看看了...'
                            ]
                            : world.dead_dog || world.population < 6
                                ? SAVE.data.b.killed_mettaton
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 新闻推送的工作\n  变得越来越没意思了。',
                                        '<32>* 先是之前的可怕新闻，\n  现在又是那个名流的事...',
                                        "<32>* 我在考虑要不要辞职了。"
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我喜欢做新闻推送的工作。',
                                        "<32>* 不过，我最近不得不\n  报道一些可怕的事...",
                                        "<32>* 我开始怀疑我的人生选择了。"
                                    ]
                                : SAVE.data.b.killed_mettaton
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 我喜欢做新闻推送的工作。',
                                        '<32>* 唯一的问题是，\n  如果有什么名流去世了...',
                                        "<32>* 接下来一段时间里，\n  大家就只会想让我\n  报道这相关的事了。"
                                    ]
                                    : [
                                        '<32>{#p/basic}{#npc/a}* 我喜欢做新闻推送的工作。',
                                        "<32>* 因为没有什么可报道的，\n  所以我们就用漫画和游戏\n  来填充版面。",
                                        '<32>* 真希望大家不会看腻。'
                                    ],
                () =>
                    world.dead_dog || world.population < 6 || SAVE.data.b.killed_mettaton
                        ? ['<32>{#p/basic}{#npc/a}* 你有没有觉得\n  你的人生就像是在原地打转？']
                        : ["<32>{#p/basic}{#npc/a}* 你有没有觉得\n  好像缺了点什么？"]
            ),
            s_faun: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我们都自由了？",
                                "<32>* 好好好...\n* 我还以为我们会遍体鳞伤呢。",
                                "<33>* 真是没想到啊。\n* 相信那只狗狗不会介意\n  你以前干了什么了。"
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 我们都自由了？",
                                "<32>* 好好好...\n* 我就不再闲逛了。\n* 那只狗狗知道吗？",
                                "<33>* 嗯，我会去告诉它的。"
                            ]
                        : roomKills().s_greater > 0
                            ? ["<32>{#p/basic}{#npc/a}* 抱歉，孩子。\n* 现在可不是聊天的时候。"]
                            : 30 <= SAVE.data.n.plot
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 听说那只狗狗\n  玩4D扑克牌...',
                                    '<32>* 不知道它赢过没？\n* 我挺想知道的。'
                                ]
                                : [
                                    [
                                        '<32>{#p/basic}{#npc/a}* 就在刚刚，\n  一只灵感爆发的狗冲了进来。',
                                        '<32>* 它一直试图创作一幅全息影像\n  来表达自己的情感...',
                                        '<32>* 但是，他越是创作，\n  就越是兴奋...',
                                        '<32>* 它的脖子变得越来越长，\n  作品也越来越亮，\n  直到...',
                                        "<32>* 看得我很伤心，\n  但我无法移开视线。"
                                    ],
                                    [
                                        "<32>{#p/basic}{#npc/a}* 你说之前那只狗狗...？\n* 它大概在烤尔比。\n* 我觉得。",
                                        '<32>* 下班后，\n  那帮狗狗都会去那一起打牌。',
                                        "<32>* 但那只狗狗\n  不太懂得表达自己。",
                                        '<32>* 所以，它最后只能一个人玩，\n  没有去融入其他的狗狗...'
                                    ],
                                    [
                                        "<32>{#p/basic}{#npc/a}* 那只狗狗去哪了？",
                                        '<32>* 它每天下班后\n  通常都会从这里经过的...'
                                    ],
                                    [
                                        '<32>{#p/basic}{#npc/a}* 刚有只狗狗经过这儿，\n  身上全是伤...',
                                        '<32>* 到底是有多没良心，\n  才能对小可爱下毒手啊？'
                                    ]
                                ][SAVE.data.n.state_starton_lesserdog],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ["<32>{#p/basic}{#npc/a}* 别担心，孩子。\n* 现在大部分狗狗\n  估计已经原谅你了。"]
                            : ["<32>{#p/basic}{#npc/a}* 别担心，孩子。\n* 我会帮你搞定的。"]
                        : roomKills().s_greater > 0
                            ? ['<32>{#p/basic}{#npc/a}* ...']
                            : 30 <= SAVE.data.n.plot
                                ? ["<32>{#p/basic}{#npc/a}* 等那只狗狗\n  赢下一把4D扑克牌，\n  估计我们都早归西了。"]
                                : [
                                    ['<32>{#p/basic}{#npc/a}* 对那狗狗来说挺糟糕吧，嗯？'],
                                    ['<32>{#p/basic}{#npc/a}* 对那狗狗来说很糟糕吧，嗯？'],
                                    ['<32>{#p/basic}{#npc/a}* 你见过它吗？'],
                                    ['<32>{#p/basic}{#npc/a}* 恶劣，真恶劣。']
                                ][SAVE.data.n.state_starton_lesserdog]
            ),
            s_moonrocks1: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                '<32>{#p/basic}{#npc/a}* 哈-\n* 不可思议-',
                                '<32>* 我确实知道\n  我的月岩是真货-',
                                "<32>* 但就连我自己都没想到，\n  居然是你的残忍行径\n  导致我获得了承认-"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 切-\n* 难以置信-',
                                "<32>* 我居然要和那家伙共事-",
                                '<32>* 至少我们的销售业绩\n  应该能大幅增长-'
                            ]
                        : roomKills().s_pacing > 0
                            ? ["<32>{#p/basic}{#npc/a}* 切-\n* 对不起，我不跟你这种人做生意-"]
                            : SAVE.data.b.killed_mettaton
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 伙计-\n* 镁塔顿发生了那样的事，\n  真是太糟糕了-",
                                    "<32>* 但我愿意为了这件事\n  出售我的特别版月岩-",
                                    '<32>* 不像那家伙，\n  只会给他的普通月岩降价-'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 切-\n* 难以置信-',
                                    '<32>* 我从月亮上弄到了真正的月岩，\n  长得可比那家伙在电话里说的垃圾\n  强多了-',
                                    "<32>* 那家伙的石头，\n  一点都不像月亮-"
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ['<32>{#p/basic}{#npc/a}* 是啊，我还得谢谢你呢-']
                            : ["<32>{#p/basic}{#npc/a}* 这对生意有所好处-"]
                        : roomKills().s_pacing > 0
                            ? ["<32>{#p/basic}{#npc/a}* 切-\n* 对不起，我不跟你这种人做生意-"]
                            : ['<32>{#p/basic}{#npc/a}* 那家伙真挺有种啊-']
            ),
            s_moonrocks2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? [
                                "<32>{#p/basic}{#npc/a}* 呃啊啊~ \n* 伙计，我实在受不了了~",
                                "<32>* 又被他纠缠，\n  又被你欺负，\n  我真是受够了~",
                                "<32>* 也许他的月岩并不真，\n  但认了他能让我清静点~"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 噗~\n* 啊对对~',
                                "<32>* 我们终于可以一同工作啦~",
                                "<32>* 现在我们都卖的是\n  我的正品月岩了呢~"
                            ]
                        : roomKills().s_pacing > 0
                            ? ['<32>{#p/basic}{#npc/a}* 噗~\n* 别想从我这买月岩~']
                            : SAVE.data.b.killed_mettaton
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 那个前哨站明星\n  也真是够惨的~',
                                    "<32>* 不过别担心~\n* 我不像左边的那哥们，\n  我可不会涨价~",
                                    '<32>* 我的月岩反而在搞促销呢~'
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 噗~\n* 啊对对~',
                                    "<32>* 我左边的那哥们\n  在卖假到不行的月岩呢，\n  笑死~",
                                    "<32>* 他说的话你一句也别信~"
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 6
                            ? ['<32>{#p/basic}{#npc/a}* 啊对对~\n* 事情发展到了这个地步，\n  真是抱歉啦~']
                            : ['<32>{#p/basic}{#npc/a}* 是啊，他的才是假月岩~']
                        : roomKills().s_pacing > 0
                            ? ['<32>{#p/basic}{#npc/a}* 噗~\n* 别想从我这买月岩~']
                            : ["<32>{#p/basic}{#npc/a}* 那哥们真挺有胆啊~"]
            ),
            t_bunny: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我的小肉桂总有一天会长大的...",
                            "<32>* 因为他是我弟弟，\n  我只能希望他一切都好。",
                            '<32>* 我真希望他\n  能在我们的新家园快乐成长。'
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 啊，这日子真是安静祥和呀...",
                                '<32>* 那些平时烦我的人\n  现在都忙着在电视机前\n  哭哭啼啼呢！'
                            ]
                            : papreal()
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 啊，这日子真是安静祥和呀...",
                                    '<32>* 平时本都有一个骷髅\n  追着我的小肉桂跑来跑去的。'
                                ]
                                : world.dead_canine
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 啊，这日子真是安静祥和呀...",
                                        '<32>* 平时本都有一只狗狗\n  追着我的小肉桂跑来跑去的。'
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 我的小肉桂是最可爱的！",
                                        '<32>* 小兔兔真的太可爱了...\n* 嘻嘻！'
                                    ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}{#npc/a}* 时间过得真快啊，小兔兔..."]
                        : SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 我想知道发生了什么事...']
                            : papreal() || world.dead_canine
                                ? ['<32>{#p/basic}{#npc/a}* 我想知道他们去哪了...']
                                : ['<32>{#p/basic}{#npc/a}* 兔-兔-兔-兔-兔...']
            ),
            t_icewolf: () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#npc/a}* 冰狼今天很开心。\n* 可爱的遁狗终于\n  被冰狼抱在怀里了。",
                        '<32>* 冰狼如今是他的新狼了。'
                    ]
                    : SAVE.data.b.killed_mettaton
                        ? [
                            '<32>{#p/basic}{#npc/a}* 冰狼注意到小镇的士气正在下降。',
                            '<32>* 冰狼只希望大家都能开心。'
                        ]
                        : world.dead_canine
                            ? [
                                "<32>{#p/basic}{#npc/a}* 冰狼今天没有见到\n  冰狼的狗狗朋友们。",
                                '<32>* 冰狼很伤心。'
                            ]
                            : SAVE.data.n.state_starton_doggo === 2
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 冰狼今天没有见到\n  可爱的遁狗。',
                                    '<32>* 冰狼很孤单。'
                                ]
                                : papreal()
                                    ? ['<32>{#p/basic}{#npc/a}* 冰狼今天\n  一个骷髅也没有见到。', '<32>* 冰狼很担忧。']
                                    : SAVE.data.n.state_starton_doggo === 1 &&
                                        SAVE.data.n.state_starton_dogs === 1 &&
                                        SAVE.data.n.state_starton_greatdog === 1 &&
                                        SAVE.data.n.state_starton_lesserdog === 1
                                        ? [
                                            "<32>{#p/basic}{#npc/a}* 冰狼要和冰狼的狗狗朋友们\n  玩抛接游戏了。",
                                            '<32>* 冰狼很激动。'
                                        ]
                                        : world.population < 6
                                            ? [
                                                world.bullied
                                                    ? '<32>{#p/basic}{#npc/a}* 冰狼想知道\n  为什么这么多怪物受伤了。'
                                                    : '<32>{#p/basic}{#npc/a}* 冰狼想知道\n  为什么这么多怪物不见了。',
                                                '<32>* 冰狼很担忧。'
                                            ]
                                            : [
                                                '<32>{#p/basic}{#npc/a}* 冰狼在思考为什么\n  自己没有冰可扔的时候，\n  冰狼还叫冰狼。',
                                                '<32>* 冰狼很疑惑。'
                                            ],
            t_imafraidjumitebeinagang: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我去找了找帕派瑞斯，\n  想问问他的棉丝收藏是哪来的，\n  结果他说他会帮我也弄一些！",
                            "<32>* 他真是棒极了不是吗？"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 我的镁塔牌牙刷又坏了，\n  这次我还修不好一点。",
                                "<32>* ...结果他们现在还不再生产了。"
                            ]
                            : papreal()
                                ? [
                                    "<32>{#p/basic}{#npc/a}* 我去找了找帕派瑞斯，\n  想问问他的棉丝收藏是哪来的，\n  结果他压根不在。",
                                    '<32>* 你知道是怎么回事吗？'
                                ]
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        "<32>{#p/basic}{#npc/a}* 我可以借你我的镁塔牌牙刷...",
                                        "<32>* ...不过我感觉\n  你会把它弄得粉碎。"
                                    ]
                                    : [
                                        "<32>{#p/basic}{#npc/a}* 镁塔牌牙刷的质量\n  也太他娘的差了。",
                                        '<32>* 我还没拿它刷牙呢，\n  只是轻轻一咬，就碎了！'
                                    ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            "<32>{#p/basic}{#npc/a}* 我去找了找帕派瑞斯，\n  想问问他的棉丝收藏是哪来的，\n  结果他说他会帮我也弄一些！",
                            "<32>* 他真是棒极了不是吗？"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 看来我以后只能\n  用质量好点的牙刷了。"]
                            : papreal()
                                ? ['<32>{#p/basic}{#npc/a}* 嗯...\n* 我想知道骷髅是怎么刷牙的。']
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 在酒吧附近晃悠晃悠，\n  你就能摸清这地方的底细了...\n* 好坏两方面都能了解清楚。'
                                    ]
                                    : ['<32>{#p/basic}{#npc/a}* 不过话说回来，\n  这是最便宜的选择了...']
            ),
            t_kabakk: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                "<32>* ...你真怪。",
                                '<32>* 你让我们受罪，\n  然后自己又为了\n  拯救我们大家而受罪。',
                                "<32>* 我不明白。",
                                '<32>* ...',
                                '<32>* ...',
                                "<32>* 哎呀我压根不知道\n  该怎么处理这种情况！\n* 耶！"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                "<32>* ...你真酷。",
                                '<32>* 你为了拯救我们大家而受罪了，\n  感谢你。',
                                '<32>* 你真是太牛了。',
                                '<32>* ...',
                                '<32>* ...',
                                '<32>* 新领袖万岁！\n* 耶！'
                            ]
                        : world.meanie
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                '<32>* 欸孩子，你最近都在干啥？',
                                "<32>* 你咋这副凶相...",
                                '<32>* ...',
                                '<32>* ...',
                                '<32>* 尊重我的权威！\n* 耶！'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿！',
                                '<32>* 你以为你能站在那\n  盯着我看吗？',
                                "<32>* 行吧，我告诉你个坏消息，\n  伙计。",
                                "<32>* 我是个执法人员。",
                                '<32>* 所以，呃...',
                                '<32>* 尊重我的权威！\n* 耶！'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? ['<32>{#p/basic}{#npc/a}* ...']
                            : ['<32>{#p/basic}{#npc/a}* 为新领袖欢呼吧，伙计。']
                        : ['<32>{#p/basic}{#npc/a}* 尊重下吧，伙计。']
            ),
            t_loverboy: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                '<32>{#p/basic}{#npc/a}* 嘿嘿...',
                                "<32>* ...尽管你做了那些事，\n  你仍然选择了...",
                                "<32>* 噢... 噢天呀...\n* 我感觉我快要哭了，\n  但我不想让你看到...",
                                "<32>* ...等等，别伤害我！"
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 嘿嘿...',
                                "<32>* ...多亏了你，我们都...",
                                "<32>* 噢... 噢天呀...\n* 我感觉我快要哭了，\n  但我不想让你看到...",
                                '<32>* ...呃，我可以哭吗？'
                            ]
                        : papreal() || world.dead_canine || SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 嘿嘿，\n  为什么镇上的人都这么难过？",
                                '<32>* 发生了什么事吗？'
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 嘿嘿，什么东西都无法改变\n  我的生活！",
                                '<32>* 哈... 哈...'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ["<32>{#p/basic}{#npc/a}* 我仍然觉得你很酷...！\n* 求求你别伤害我。"]
                            : ['<32>{#p/basic}{#npc/a}* 我爱你...！']
                        : papreal() || world.dead_canine || SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 也许只是我的错觉吧。"]
                            : ["<32>{#p/basic}{#npc/a}* 也许我是疯了吧。"]
            ),
            t_politics: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 我听说国王揭露了\n  他“杀害”人类们的真相。',
                            "<32>* 大家都为自己以前不清楚\n  而感到难过。\n* 他们都给了国王一个大大的拥抱。",
                            '<32>* 然后他们就把人类带走了，\n  并亲自收养了他们。',
                            '<32>* 现在，那些人类将会\n  和我们一起生活。',
                            "<32>* 这-就-是-政治啊！"
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                "<32>{#p/basic}{#npc/a}* 嗯，\n  最近大家都在谈论电视，\n  真是奇怪。",
                                "<32>* 发生什么事了...？\n* 我希望这不会影响到\n  我们的政治体系..."
                            ]
                            : papreal()
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 嗯，\n  帕派瑞斯通常会在这个时候\n  去见安黛因的。',
                                    '<32>* 他去哪了...？\n* 我能感觉到\n  我们的政治体系正在崩溃...'
                                ]
                                : world.popmax(0) - world.population > 4
                                    ? [
                                        '<32>{#p/basic}{#npc/a}* 这个镇上没有真正的警察。\n* 但也许那些假警察能吓跑恶霸们。',
                                        '<32>* 政治还在继续...'
                                    ]
                                    : world.trueKills > 0 || SAVE.data.n.bully > 0
                                        ? [
                                            '<32>{#p/basic}{#npc/a}* 这个镇上没有镇长。',
                                            '<32>* 但是，\n  如果发生什么事，\n  有个骷髅会告诉一位鱼女士。',
                                            "<32>* 这-就-是-政治啊！"
                                        ]
                                        : [
                                            '<32>{#p/basic}{#npc/a}* 这个小镇总是那么沉闷。',
                                            "<32>* 但是，如果事情\n  继续这样发展下去的话，\n  也许这种情况会改变。",
                                            '<32>* 这就是政治吧？'
                                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}{#npc/a}* 看到了吧？\n* 政治也能带来好事..."]
                        : SAVE.data.b.killed_mettaton || papreal() || world.popmax(0) - world.population > 4
                            ? ['<32>{#p/basic}{#npc/a}* 政治...']
                            : world.trueKills > 0 || SAVE.data.n.bully > 0
                                ? ['<32>{#p/basic}{#npc/a}* 政治。']
                                : ['<32>{#p/basic}{#npc/a}* 政治？']
            ),
            t_rabbit: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/basic}{#npc/a}* 很久以前，\n  我听说他们没有“力场”\n  这种高级玩意。',
                            '<32>* 我只想说...\n  能够回到从前那样\n  真是太好了。'
                        ]
                        : SAVE.data.b.killed_mettaton
                            ? [
                                '<32>{#p/basic}{#npc/a}* 很久以前，\n  我听说电视名人到处都是。',
                                "<32>* 现在，\n  他们似乎要成为过去了。"
                            ]
                            : papreal()
                                ? [
                                    '<32>{#p/basic}{#npc/a}* 很久以前，\n  我听说这个前哨站\n  是一个沉闷的地方。',
                                    "<32>* 照这样下去...\n  我们又会遇到同样的问题。"
                                ]
                                : [
                                    '<32>{#p/basic}{#npc/a}* 很久以前，\n  我听说他们把小镇\n  一分为二了。',
                                    '<32>* 我想知道这里原来\n  是什么样子的...？'
                                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}{#npc/a}* 谢谢你带我们回到了从前那样。']
                        : SAVE.data.b.killed_mettaton
                            ? ["<32>{#p/basic}{#npc/a}* 可惜我们不能用魔法\n  把他们变回来。"]
                            : papreal()
                                ? ["<32>{#p/basic}{#npc/a}* 可惜我们不能用魔法\n  解决这些问题。"]
                                : ['<32>{#p/basic}{#npc/a}* 我们可能永远都\n  无从得知了。']
            ),
            t_smileguy: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                "<32>{#p/basic}{#npc/a}* 所以我们自由了，嗯？",
                                "<32>* 我想我不必再一直微笑了...",
                                "<32>* ...奇怪。\n* 我不想不笑，\n  但笑起来又感觉不对劲。",
                                "<32>* 这太难理解了。\n* 我还是坚持做我熟悉的事吧。"
                            ]
                            : [
                                "<32>{#p/basic}{#npc/a}* 所以我们自由了，嗯？",
                                "<32>* 我想我不必再一直微笑了...",
                                "<32>* ...嗯。\n* 那我为什么停不下来？",
                                "<32>* 不知道为什么，\n  我现在不想停止微笑了！"
                            ]
                        : papreal() || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 就在刚才，\n  我感觉我的笑容消失了片刻。', "<32>* 怎么回事？"]
                            : [
                                "<32>{#p/basic}{#npc/a}* 我们都知道事情不尽人意，\n  但我们仍旧保持微笑。",
                                '<32>* 你问为什么？',
                                '<32>* 我们面对着的是现实，\n  所以何必郁郁寡欢呢？'
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ['<32>{#p/basic}{#npc/a}* 笑一笑吧。']
                            : ['<32>{#p/basic}{#npc/a}* 笑一笑吧！']
                        : papreal() || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 笑一笑吧？']
                            : ['<32>{#p/basic}{#npc/a}* 笑一笑吧。']
            ),
            t_wisconsin: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? [
                                '<32>{#p/basic}{#npc/a}* 自由...',
                                "<32>* 这意味着我不必再担心挨揍了。",
                                '<32>* 哈哈。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 自由...',
                                "<32>* 这意味着我不必再费心讲笑话了。",
                                '<32>* ...',
                                '<32>* 当一只老鼠终于得到奶酪后，\n  它会做什么？',
                                '<32>* ...',
                                '<32>* 嗯...',
                                "<32>* 它肯定不会费心讲笑话，\n  肯定不会。",
                                '<32>* 哈哈。'
                            ]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? [
                                '<32>{#p/basic}{#npc/a}* 感觉就像...',
                                '<32>* 就像一切都在变得越来越糟...\n* 越来越糟。'
                            ]
                            : [
                                '<32>{#p/basic}{#npc/a}* 每个人都在欢笑、讲笑话，\n  试图忘记我们的现代危机...',
                                '<32>* 死气沉沉。\n* 人口过剩。\n* 无家可归。',
                                "<32>* 我也想加入他们，\n  但我并不有趣。"
                            ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ["<32>{#p/basic}{#npc/a}* 抱歉。\n* 那并不好笑。"]
                            : [
                                '<32>{#p/basic}{#npc/a}* 抱歉。\n* 我猜你可以说...',
                                '<32>* 那个笑话有点太“酪”套了。'
                            ]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 越来越糟...']
                            : ["<32>{#p/basic}{#npc/a}* 至少，我不讲双关笑话。"],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 2
                            ? ['<32>{#p/basic}{#npc/a}* 你最好在我对你失去耐心前离开。']
                            : ["<32>{#p/basic}{#npc/a}* 对。\n* 那是个双关。\n* 我现在是一只双关酪鼠了。"]
                        : world.dead_dog || world.dead_skeleton || world.population < 6 || SAVE.data.b.killed_mettaton
                            ? ['<32>{#p/basic}{#npc/a}* 永无止境...']
                            : ['<32>{#p/basic}{#npc/a}* 暂时吧。']
            ),
            t_zorren: pager.create(
                0,
                () => [
                    "<32>{#p/basic}{#npc/a}* （哦，嘿，是我，佐伦。）",
                    ...(SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? [
                                "<32>* （我们，呃，对你所做的一切\n  感激不尽。）",
                                "<32>* （但是...）\n* （你，呃，不完全算是\n  模范公民。）",
                                "<32>* (你为什么非要\n  把事情弄得这么麻烦呢？）"
                            ]
                            : [
                                "<32>* （我们，呃，对你所做的一切\n  感激不尽。）",
                                "<32>* （但是...）\n* （你，呃，大概已经听够\n  感谢的话了。）",
                                "<32>* （那我就不打扰你了，\n  继续做你的事吧。）"
                            ]
                        : world.meanie
                            ? SAVE.data.b.s_state_capstation
                                ? [
                                    "<32>* （你现在，好像有点变了。）",
                                    '<32>* （...）',
                                    "<32>* （是啊，你知道，呃，\n  我现在不大喜欢你了。）",
                                    "<32>* （要是我能把给你的钥匙收回\n  就好了。）"
                                ]
                                : [
                                    '<32>* （你是，呃，对我们的警察，\n  呃，有意见，还是...？）',
                                    '<32>* （...）',
                                    "<32>* （是啊，你知道，呃，\n  我其实不大喜欢你。）",
                                    "<32>* （只是，感觉，\n  你哪里有些不对劲。）"
                                ]
                            : [
                                ...(SAVE.data.b.oops
                                    ? [
                                        '<32>* （你是，呃，对我们的警察，\n  呃，有意见，还是...？）',
                                        '<32>* （没有吗？）\n* （嘿，还好你呃，没有。）'
                                    ]
                                    : [
                                        "<32>* （知道吗，\n  你看起来很会尊重他人。）",
                                        '<32>* （所以，谢谢你，呃，那样做。）'
                                    ]),
                                ...(SAVE.data.b.s_state_capstation
                                    ? []
                                    : ((SAVE.data.b.s_state_capstation = true),
                                        [
                                            '<32>* （实际上...）',
                                            '<32>* （给你，孩子。）\n* （我们手里，有个钥匙。）',
                                            '<32>{#s/equip}{#p/human}* （你把生锈的钥匙\n  挂到了钥匙串上。）',
                                            '<32>* （打开“手机”来查看\n  所有获得的钥匙。）',
                                            "<32>{#p/basic}{#npc/a}* （我想，呃，我们应该\n  在什么地方有个军火库。）"
                                        ])),
                                ...(SAVE.data.b.oops
                                    ? [
                                        '<32>* （嘘...）\n* （就是，这个警察岗是我和\n  卡巴克两个人自己建的。）',
                                        '<32>* （很酷，是吧？）'
                                    ]
                                    : [
                                        '<32>* （嘘...）\n* （就是，这个警察岗是我和\n  卡巴克两个人自己建的。）',
                                        '<32>* （很酷，是吧？）'
                                    ])
                            ])
                ],
                () =>
                    SAVE.data.n.plot === 72
                        ? world.population < 4
                            ? ['<32>{#p/basic}{#npc/a}* （做得更好些吧，我的朋友。）\n* （做得更好些吧。）']
                            : ['<32>{#p/basic}{#npc/a}* （继续前进吧，我的朋友。）\n* （继续前进吧。）']
                        : world.meanie
                            ? ['<32>{#p/basic}{#npc/a}* （离开这里。）']
                            : SAVE.data.b.oops
                                ? ["<32>{#p/basic}{#npc/a}* （没错，我们不是真警察。）"]
                                : [
                                    '<32>{#p/basic}{#npc/a}* （也许我们不是真正的警察，\n  但像你这样的人\n  值得我们的保护和服务。）'
                                ]
            )
        },
        objinter: {
            ctower0: () => [
                '<32>{#p/human}* （你激活了终端。）',
                ...(SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （说明上写着\n  通过加减十的幂将总数减至零。）'
                    ]
                    : [
                        '<32>{#p/basic}* 显示器侧面钉着一份说明...',
                        '<33>* 上面的字迹全是狂草，你根本\n  看不清楚。\n* 除了一个字，“零”。'
                    ])
            ],
            ctower1: () =>
                SAVE.data.b.s_state_mathpass
                    ? SAVE.data.b.svr
                        ? ['<32>{#p/human}* （可是，你之前已经解开\n  这个谜题了。）']
                        : ['<32>{#p/basic}* 终端已解锁。']
                    : ["<32>{#p/basic}* 不能使用了。"],
            microwave0: ['<32>{#p/human}* （你看了看微波炉的后面...）', '<32>{#p/basic}* 没什么有用的东西。'],
            microwave1: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你看了看微波炉的后面...）',
                        '<32>{#s/equip}{#p/human}* （你按下了开关。）'
                    ]
                    : [
                        '<32>{#p/human}* （你看了看微波炉的后面...）',
                        "<32>{#p/basic}* 这里有个开关...",
                        '<32>{#s/equip}{#p/human}* （你按下了开关。）'
                    ],
            microwave2: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （你看了看微波炉的后面...）',
                        '<32>{#p/human}* （可是，你之前已经按下\n  这个开关了。）'
                    ]
                    : ['<32>{#p/human}* （你看了看微波炉的后面...）', '<32>{#p/basic}* 没有新东西。'],
            microwave3: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （可是，你没发现这个电器\n  有什么特别之处。）"]
                    : [
                        '<32>{#p/basic}* 标准规格的电介质加热器，\n  首塔制造。\n* 260X年前后制成。',
                        "<32>* 这就是台微波炉。\n  顶多用了十年。"
                    ],
            microwave4: () => [
                '<32>{#p/basic}* 它似乎在投射某种重力场。',
                ...(SAVE.data.b.oops ? [] : ["<32>{#p/basic}* 我有点好奇...\n  这附近有没有开关什么的..."])
            ],
            papmail1: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （可是，你没有信要寄。）"]
                    : [
                        '<32>{#p/basic}* 邮箱上标注着“帕派瑞斯”。',
                        choicer.create('* （看一眼里边吗？）', '看一眼', '算了')
                    ],
            papmail2: pager.create(
                0,
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你往里看了一眼...）',
                            world.runaway
                                ? "<32>{#p/basic}* 比以前还空。"
                                : "<32>{#p/basic}* 不是空的？"
                        ]
                        : [
                            '<32>{#p/human}* （你往里看了一眼...）',
                            "<32>{#p/basic}* 空的。",
                            ...(31 <= SAVE.data.n.plot &&
                                SAVE.data.n.plot_date < 0.1 &&
                                SAVE.data.n.state_starton_papyrus !== 1
                                ? [
                                    '<18>{#p/papyrus}{#f/0}谢谢你帮忙\n检查了我的邮件！',
                                    "<18>{#p/papyrus}{#f/4}谢天谢地，\n我已经全都整理好了。"
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你往里看了一眼...）',
                            world.runaway
                                ? "<32>{#p/basic}* 比以前还空。"
                                : "<32>{#p/basic}* 不是空的？"
                        ]
                        : ['<32>{#p/human}* （你往里看了一眼...）', "<32>{#p/basic}* 空的。"]
            ),
            papmail3: ['<32>{#p/human}* （你决定先不看了。）'],
            puzzlechip: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （可是，你之前已经解开\n  这个谜题了。）']
                    : ['<32>{#p/basic}* 终端已解锁。'],
            spagtable0: ["<32>{#p/basic}* 一个没用过的盘子。"],
            spagtable1: [
                '<32>{#p/human}* （你凝视着令人垂涎的\n  意大利面。）',
                '<32>{#p/human}* （似乎是够不到它了。）'
            ],
            spagtable2: ['<32>{#p/human}* （你得到了意大利面。）'],
            spagtable2b: ["<32>{#p/human}* （你带的东西太多，装不下它了。）"],
            spagtable3: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你对这个曾经盛放过食物的盘子\n  心怀感激。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 咋了。\n* 就一普通盘子。"]
                        : ['<32>{#p/basic}* 曾经承载过\n  一份人间难得的佳肴呢。'],
            xtower1: () => [
                ...(postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （终端似乎已经停机了。）',
                            ...[
                                [
                                    "<25>{#p/asriel1}{#f/13}* 没电了。\n* 不过想想也正常，\n  肯定得把这玩意关掉。",
                                    "<25>{#f/17}* 要是有人玩游戏玩过头，\n  错过了运输船，\n  可就完蛋了。"
                                ],
                                [
                                    "<25>{#p/asriel1}{#f/13}* 不过说真的，\n  我觉得他们\n  肯定不会让人错过的。",
                                    '<25>{#f/13}* 艾菲斯博士应该有\n  类似能扫描灵魂的装置，\n  所以...',
                                    "<25>{#f/17}* 他们会知道\n  有没有人落下的。",
                                    '<25>{#f/15}* 真想知道他们现在\n  能不能看到我们...'
                                ],
                                ["<25>{#p/asriel1}{#f/17}* 别担心，弗里斯克。\n* 新家园肯定\n  会有很多游戏的。"]
                            ][Math.min(asrielinter.xtower1++, 2)]
                        ]
                        : [
                            '<32>{#p/human}* （你激活了终端。）',
                            "<32>{#p/basic}* 这是个游戏终端...",
                            ...(SAVE.data.n.plot === 72 || world.postnoot
                                ? ['<32>{#p/basic}* 电源被切断了。']
                                : ['<32>{#p/basic}* “尽可能快速射击目标！\n   用[Z]来射击。”'])
                        ])
            ]
        },
        papbooks1: pager.create(
            0,
            () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （书架上放着谜题指引书，\n  以及儿童故事书。）"]
                    : [
                        '<32>{#p/basic}* 书架上摆满了关于\n  谜题创作的复杂书籍。',
                        "<32>* 还有儿童读物。",
                        ...(roomready()
                            ? [
                                '<18>{#p/papyrus}我把一部分\n我最喜欢的书\n都放在那个书架上。',
                                '<18>{#f/4}比如《为聪明人\n设计的高级\n谜题结构》。',
                                '<18>{#f/0}我另一本最爱呢？',
                                '<18>{#f/4}是《和毛茸茸的兔兔\n捉迷藏》。',
                                '<18>{#f/8}结局每次都会\n打动到我！'
                            ]
                            : [])
                    ],
            () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （书架上放着谜题指引书，\n  以及儿童故事书。）"]
                    : ["<32>{#p/basic}* 复杂的手册和儿童读物。"]
        ),
        papbooks2: pager.create(
            1,
            [
                '<32>{#p/human}* （你取下了一本书...）',
                '<32>{#p/basic}* “奠定谜题互动价值的，\n   是玩家的配合程度。”',
                '<32>* “每个玩家都有探索、前进\n   和完成既定任务的\n   内在动力。”',
                '<32>* “那些具有挑战性、能够\n   吸引这些动力的谜题...”',
                '<32>* “能够确保玩家始终\n   专注于任务，直到最后一刻。”',
                '<32>{#p/human}* （你把书放回了书架。）'
            ],
            [
                '<32>{#p/human}* （你取下了一本书...）',
                '<32>{#p/basic}* “‘来玩躲猫猫吧！’\n   人类从墙后出现，\n   对小兔兔说道。”',
                '<32>* “毛茸茸的兔兔又惊又喜，\n   兴奋地看着眼前的人类。”',
                '<32>* “然后，人类离开了...\n   毛茸茸的兔兔看不到人类了，\n   它非常地伤心。”',
                '<32>* “它的身体颤抖着，\n   思考着自己是多么孤单。”',
                '<32>* “它很想哭，\n   觉得自己被永远抛弃了...”',
                '<32>* “但后来，人类又出现了，\n   世界又恢复了正常。”',
                '<32>* “人类和兔兔给了彼此\n   一个大大的、毛茸茸的拥抱。”',
                '<32>{#p/human}* （你把书放回了书架。）'
            ],
            () =>
                world.runaway
                    ? [
                        '<32>{#p/human}* （你取下了一本书...）',
                        '<23>{#p/papyrusnt}“亲爱的日计：\n 力场已经被摧毁了。”',
                        '<23>“弗里斯克，那个几天前\n刚到前哨站的人类...”',
                        '<23>“现在成了前哨站所有人\n所恐惧的对象。”',
                        '<23>“趁那人还没醒来，\n我们都得马上离开。”',
                        '<23>“其他人好像都乐意\n让那人自生自灭。”',
                        '<23>“但我内心深处还是希望\n那人也能逃出前哨站，\n找到一条生路。”',
                        '<32>{#p/human}* （你把书放回了书架。）'
                    ]
                    : SAVE.data.n.plot === 72
                        ? [
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<23>{#p/papyrusnt}“亲爱的日计：\n 力场已经被摧毁了。”',
                            '<23>“弗里斯克，那个几天前\n刚到前哨站的人类...”',
                            '<23>“克服了重重困难，\n把处于毁灭边缘的我们\n给救了回来。”',
                            '<23>“说不定这件事\n能让衫斯也振作起来。”',
                            '<23>“我之所以会提到这个，\n是因为我从来不知道\n他所谓的哨兵工作...”',
                            '<23>“居然那么轻松。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
                        : [
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<23>{#p/papyrusnt}“亲爱的日计：\n 衫斯刚刚被任命为\n 正式的皇家哨兵。”',
                            '<23>“最开始，\n 我对他非常地不解...”',
                            '<23>“毕竟，为什么一个\n 这么懒的人会想\n 承担这个工作？”',
                            '<23>“算了，\n 我就不去追问什么了。”',
                            '<23>“事实上，我为他感到\n 非常骄傲！！！”',
                            '<23>“只有时间才能证明\n 这会带来什么\n 伟大的事情。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
        ),
        papcomputer1: pager.create(
            0,
            () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : [
                        ...(roomready()
                            ? [
                                "<18>{#p/papyrus}域外网！\n我在那上面\n超有人气的。",
                                "<18>{#f/4}再有12个关注...",
                                '<18>{#f/0}我的粉丝数\n就到两位数了！'
                            ]
                            : []),
                        SAVE.data.b.svr
                            ? '<32>{#p/human}* （你走向了电脑...）'
                            : "<32>{#p/basic}* 电脑的浏览器\n  打开了一个\n  社交媒体网站。",
                        choicer.create("* （登录帕派瑞斯的账号吗？）", '登录', '算了')
                    ],
            () =>
                postSIGMA()
                    ? ["<32>{#p/basic}* 不能使用了。"]
                    : [
                        SAVE.data.b.svr
                            ? '<32>{#p/human}* （你走向了电脑...）'
                            : "<32>{#p/basic}* 电脑的浏览器\n  打开了一个\n  社交媒体网站。",
                        choicer.create("* （登录帕派瑞斯的账号吗？）", '登录', '算了')
                    ]
        ),
        papcomputer2: ['<32>{#p/human}* （你决定先不登录。）'],
        papcomputer3: {
            a: '酷炫骷髅95',
            b: '粉丝数 -2',
            c: '这个账号属于\n伟大的\n帕派瑞斯。\n只发高质量\n帖子！',
            d: '- 新闻 -',
            e: () =>
                world.runaway
                    ? '突发新闻：\n..\n..\n..\n..我们得走了。'
                    : SAVE.data.n.plot === 72
                        ? '突发新闻：\n我们能走了。\n...真正意义上的。\n新闻来源：\n看看外头吧，\n各位！'
                        : "突发新闻：\n《喵喵星火》\n评分..\n一塌糊涂。\n新闻来源：\n就，这是真的吗？"
        },
        papcomputer4: [
            () =>
                world.runaway
                    ? {
                        a: '哈喽！',
                        b: '自求多福吧...',
                        c: ''
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '哈喽！',
                            b: '网络连接失败...',
                            c: ''
                        }
                        : {
                            a: '哈喽！',
                            b: '分享你的想法...',
                            c: ''
                        },
            () =>
                world.runaway
                    ? {
                        a: '艾菲斯',
                        b: '今天',
                        c: '< 消息已删除 >'
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '系统消息',
                            b: '今天',
                            c: '域外网于今日关停。'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: '纳普斯特22',
                                b: '今天',
                                c: '再也不上网了...\n太没劲了...'
                            }
                            : world.genocide
                                ? {
                                    a: '纳普斯特22',
                                    b: '今天',
                                    c: "没关系的...\n我是幽灵..."
                                }
                                : world.dead_skeleton
                                    ? {
                                        a: '纳普斯特22',
                                        b: '今天',
                                        c: "嗯...\n我还是去忙这首曲子的\n混音吧..."
                                    }
                                    : {
                                        a: '懒骨。',
                                        b: '今天',
                                        c: "咱们快祈祷他别把\n我们的灵~魂\u4dc1\n也抓走咯~ \u4dc3\u4dc3",
                                        d: true
                                    },
            () =>
                world.runaway
                    ? {
                        a: '懒骨。',
                        b: '今天',
                        c: '< 消息已删除 >',
                        d: true
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '艾菲斯',
                            b: '今天',
                            c: '哎呀，\n我忘了关服务器了'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: '壮鱼91',
                                b: '昨天',
                                c: '嗯... 你不是每天都这么说吗，\n帕派瑞斯？'
                            }
                            : world.genocide
                                ? {
                                    a: '壮鱼91',
                                    b: '今天',
                                    c: '小幽，快点离开这。\n我不想看到你也跟着受伤。'
                                }
                                : world.dead_skeleton
                                    ? {
                                        a: '壮鱼91',
                                        b: '今天',
                                        c: '小幽，帕派瑞斯不在了。\n我会让那人类血债血偿。'
                                    }
                                    : {
                                        a: '壮鱼91',
                                        b: '今天',
                                        c: '呃，没抓到...\n不过，他成功俘获了我们\n每个人的心！呋呼呼！！'
                                    },
            () =>
                world.runaway
                    ? {
                        a: '酷炫骷髅95',
                        b: '今天',
                        c: '< 消息已删除 >'
                    }
                    : SAVE.data.n.plot === 72
                        ? {
                            a: '_舟亢忝行_',
                            b: '今天',
                            c: '< 用户名更新 >\n原名：_杀手亾耦_\n现在：_舟亢忝行_'
                        }
                        : SAVE.data.n.plot < 34
                            ? {
                                a: '酷炫骷髅95',
                                b: '昨天',
                                c: "今天，\n就是我要抓到人类的日子！\n我能从骨子里感觉到！"
                            }
                            : world.genocide
                                ? {
                                    a: '纳普斯特22',
                                    b: '今天',
                                    c: '呃...\n我有什么能帮忙的吗？\n事情变得更糟了...'
                                }
                                : {
                                    a: '纳普斯特22',
                                    b: '今天',
                                    c: '所以... 帕派瑞斯\n抓到人类了吗？还是...'
                                }
        ] as (() => { a: string; b: string; c: string; d?: boolean })[],
        papcomputer5: () =>
            world.runaway
                ? ['弗里斯克', "你敢", '跟过来', '试试']
                : SAVE.data.n.plot === 72
                    ? ['对不起', "但我们", '停服啦', '笑死']
                    : ['刷新页面', '查看消息', '聊天设置', '退出登录'],
        papcouch0: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你在沙发里什么都找不到。）"]
                : ["<32>{#p/basic}* 已经被清理干净了。"],
        papcouch1: pager.create(
            0,
            () => [
                '<32>{#p/human}* （你听到沙发里\n  有叮当的声音。）',
                SAVE.data.b.svr
                    ? '<32>{#p/human}* （好像这里留了一堆硬币...）'
                    : '<32>{#p/basic}* 里面有一堆硬币...',
                choicer.create('* （拿走这些硬币吗？）', '拿走', '算了')
            ],
            () => [
                SAVE.data.b.svr
                    ? "<32>{#p/human}* （硬币并没有长出腿跑了。）"
                    : '<32>{#p/basic}* 硬币还在。',
                choicer.create('* （拿走这些硬币吗？）', '拿走', '算了')
            ]
        ),
        papcouch2: ['<32>{#p/human}* （你决定什么也不拿。）'],
        papcouch3: ['<32>{#p/human}* （你找到了10G。）'],
        papcouch3a: [
            "<18>{#p/papyrus}{#f/1}你在帮我们\n清理沙发！？",
            '<18>{#p/papyrus}{#f/5}...还不求回报，\n你真是个大善人...',
            '<18>{#p/papyrus}{#f/6}多么慷慨！！！'
        ],
        paproom1: [
            '<18>{#p/papyrus}{#f/6}啊！？\n你怎么...',
            '<18>{#p/papyrus}{#f/5}突然出现在\n我面前的！'
        ],
        paproom2: ['<18>{#p/papyrus}{#f/4}衫斯是不是教了你\n走什么捷径...？'],
        paproom3: ['<18>{#p/papyrus}{#f/7}...呃！\n别再这样了！！'],
        paproom4: ["<18>{#p/papyrus}{#f/0}你这是在自找麻烦，\n人类。"],
        paproom5: ['<18>{#p/papyrus}{#f/4}（唉...）'],
        papdate0: () => [
            SAVE.data.b.flirt_papyrus
                ? "<18>{#p/papyrus}{#f/5}哇，你真的\n好渴望约会啊..."
                : "<18>{#p/papyrus}{#f/5}哇，你真的\n好渴望找我玩啊...",
            "<18>{#f/5}甚至要抢在\n我前面进我家！",
            "<18>{#f/6}你真的\n很重视啊！"
        ],
        papdate1x: pager.create(
            0,
            [
                '<18>{#p/papyrus}{#f/0}你好，人类！',
                '<18>{#f/5}希望你过得愉快。',
                '<18>{#f/6}到镇上随便走走...',
                '<18>{#f/0}...或者来我家看看\n都行！'
            ],
            ["<18>{#p/papyrus}{#f/4}不过，离衫斯的房间\n远一点。"]
        ),
        papdate1: () => [
            SAVE.data.b.flirt_papyrus
                ? '<18>{#p/papyrus}所以你回来\n跟我约会了！'
                : '<18>{#p/papyrus}所以你回来\n看我了！',
            ...(world.dead_dog || world.population < 6
                ? [
                    "<18>{#f/0}太好了！！",
                    "<18>{#f/5}说实话，\n今天感觉有点孤单...",
                    '<18>{#f/5}今天，好多居民\n离奇失踪了...',
                    "<18>{#f/0}不过，你还在这！！",
                    '<18>{#f/0}你肯定不同于常人，\n对吧？？'
                ]
                : ['<18>{#f/4}你肯定非常\n看重这件事...']),
            "<18>{#f/5}我会带你去一个\n很特别的地方...",
            '<18>{#f/0}一个我愿意花大把\n时间流连忘返的\n地方！！！'
        ],
        papdate2: ['<18>{#p/papyrus}我家！！！'],
        papdate3: pager.create(
            0,
            ['<18>{#p/papyrus}欢迎来我豪华的\n家里做客！', '<18>好好享受，\n慢慢参观！！！'],
            ["<18>{#p/papyrus}如果你看完了，\n就上楼来我的房间！"]
        ),
        papdate3a: ['<18>{#p/papyrus}{#f/6}哇！当个好主人\n可真是个体力活！'],
        papdate3b: [
            "<18>{#p/papyrus}{#f/5}哎呀，我腿都麻了...",
            "<18>{#f/0}那肯定证明了\n我是个好主人！！！"
        ],
        papdate4: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}那是我的房间！",
                "<18>{#f/4}如果这里的东西\n你都看完了，\n那我们就进去...",
                '<18>{#f/4}然后...',
                SAVE.data.b.flirt_papyrus
                    ? '<18>{#f/9}做大家会在\n约会的时候\n做的事！'
                    : '<18>{#f/9}像一对酷酷的朋友\n一样“消遣”吧！',
                choicer.create('* （你要怎么回答？）', '开始吧', '再等等')
            ],
            () => ['<18>{#p/papyrus}准备好了吗？', choicer.create('* （你要怎么回答？）', '开始吧', '再等等')]
        ),
        papdate4a: ["<18>{#p/papyrus}好，我们进去吧！"],
        papdate4b: ["<18>{#p/papyrus}那我就继续\n在这儿等着啦！"],
        papdate5: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}所以，呃...',
                "<18>{#f/5}如果你看完了\n所有东西...",
                SAVE.data.b.flirt_papyrus
                    ? '<18>{#f/6}那你想开始\n约会吗？'
                    : '<18>{#f/6}那你想开始\n消遣吗？',
                choicer.create('* （你要怎么回答？）', "开始吧", "再等等")
            ],
            () => ['<18>{#p/papyrus}{#f/6}准备开始了吗？', choicer.create('* （你要怎么回答？）', '开始吧', '再等等')]
        ),
        papdate5a: () => [
            SAVE.data.b.flirt_papyrus
                ? '<18>{#p/papyrus}好！！！\n约会开始！！！'
                : "<18>{#p/papyrus}好！！！\n我们开始消遣叭！！！"
        ],
        papdate5b: ["<18>{#p/papyrus}慢慢看，不着急。\n我会等你的。"],
        papdate6: () => [
            SAVE.data.b.flirt_papyrus
                ? '<#32>{#p/story}           约会    开始！'
                : '<#32>{#p/story}           消遣    开始！'
        ],
        papdate7: () => [
            '<15>{#p/papyrus}{#f/10}我们！！',
            SAVE.data.b.flirt_papyrus ? '<15>{#f/20}开始约会了！！' : '<15>{#f/20}开始消遣了！！',
            "<15>{#f/24}我实际上之前\n从来没做过\n这种事。",
            "<15>{#f/10}但别担心！！！",
            '<15>{#f/20}我的（个人）词典里\n可是有“准备”\n这个词的！'
        ],
        papdate8: () => [
            '<15>{#f/20}你问我手里\n拿的是什么？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#p/papyrus}{#f/10}这是本官方的\n约会指南，我直接\n从图书倌借来的！'
                : '<15>{#p/papyrus}{#f/10}这是本官方的\n消遣指南，我直接\n从图书倌借来的！',
            "<15>{#f/20}有了这个，\n我们一定会玩得\n很开心！"
        ],
        papdate9: () => [
            "<15>{#p/papyrus}{#f/25}让我看看...",
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/25}第一步：\n按下C或CTRL键\n打开{@fill=#f00}约会面板{@fill=#000}。'
                : '<15>{#f/25}第一步：\n按下C或CTRL键\n打开{@fill=#f00}消遣面板{@fill=#000}。'
        ],
        papdate10: () => [
            '<15>{#p/papyrus}{#f/24}...等下。',
            '<15>{#f/22}你早就\n按好了！？！？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/11}哇，你肯定\n很爱我吧！'
                : '<15>{#f/11}哇，你肯定\n很喜欢我吧！',
            "<15>{#f/10}那么，\n开始第二步！"
        ],
        papdate11: [
            '<15>{#p/papyrus}{#f/24}...',
            "<15>{#f/24}呃，反正\n我们也不需要。",
            '<15>{#f/20}来看第二步！'
        ],
        papdate12: [
            '<15>{#p/papyrus}{#f/11}哇，我感觉\n充满了信息！',
            "<15>{#f/24}事实上，我认为\n我们已经可以\n进入第二步了..."
        ],
        papdate13: () => [
            SAVE.data.b.flirt_papyrus
                ? '<15>{#p/papyrus}{#f/25}第二步：\n邀请约会对象。'
                : '<15>{#p/papyrus}{#f/25}第二步：\n邀请消遣对象。'
        ],
        papdate13a: () => [
            '<15>{#f/24}“咳咳。”',
            '<15>{#f/20}人类！\n我，伟大的\n帕派瑞斯...',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/10}想和你一起\n约会！'
                : '<15>{#f/10}想和你一起\n消遣！'
        ],
        papdate14: () => [choicer.create('* （你要怎么回答？）', '嗯嗯！', '不！')],
        papdate15a: ['<15>{#p/papyrus}{#f/12}真-真的？？？', '<15>{#f/11}哇！！！'],
        papdate15a1: ["<15>{#f/24}我想，这意味着\n是时候开始\n第三步了..."],
        papdate15b: ['<15>{#p/papyrus}{#f/21}哦...', '<15>{#f/27}还-还好，\n上面只说了\n要邀请。'],
        papdate15c: ["<15>{#f/24}那无论如何，\n是时候开始\n第三步了..."],
        papdate16: ['<15>{#p/papyrus}{#f/25}第三步：\n穿上漂亮的衣服\n表示你在乎。'],
        papdate16a: ['<15>{#p/papyrus}{#f/24}...', '<15>{#f/24}等一下。'],
        papdate17: () => [
            '<15>{#f/24}漂亮的衣服...',
            (
                {
                    spacesuit: "<15>{#f/26}你正穿着件\n旧宇航服呢...",
                    halo: '<15>{#f/26}你正顶着个\n漂亮的光环呢...',
                    eye: '<15>{#f/26}你正开着一道\n力场护盾呢...',
                    eye_x: '<15>{#f/26}你正开着一道\n力场护盾呢...',
                    temyarmor: "<15>{#f/26}你正披着\n一件盔甲呢...",
                    goggles: '<15>{#f/26}你正戴着台\nAR设备呢...',
                    goggles_x: '<15>{#f/26}你正戴着台\nAR设备呢...',
                    visor: '<15>{#f/26}你正戴着\n一个护目镜呢...',
                    visor_x: '<15>{#f/26}你正戴着\n一个护目镜呢...',
                    sonic: "<15>{#f/26}你正扛着个\n奇怪的装置呢...",
                    heart_locket: '<15>{#f/26}你正戴着个吊坠呢...'
                } as Partial<CosmosKeyed<string>>
            )[SAVE.data.s.armor] || '<15>{#f/26}你身上的\n那个东西...',
            "<15>{#f/20}你现在就\n穿着衣服呢！！！",
            '<15>{#f/24}不仅如此...',
            '<15>{#f/20}今天早些时候，\n你也穿着衣服呢！'
        ],
        papdate17a: () => [
            '<15>{#f/12}不会吧...！\n这是不是说？？？',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/13}你打从一开始\n就打算和我\n约会了？？？'
                : '<15>{#f/13}你打从一开始\n就打算和我\n做朋友了？？？'
        ],
        papdate18a: () => [
            '<15>{#p/papyrus}{#f/22}不！！',
            '<15>{#f/22}这一切都在你\n计划之内！！！',
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/22}你可能都比我更\n擅长约会！！！',
                    '<15>不-不！！！你的\n{@fill=#003cff}约会能量{@fill=#000}...！！！'
                ]
                : [
                    '<15>{#f/22}你可能都比我更\n擅长消遣！！！',
                    '<15>不-不！！！你的\n{@fill=#003cff}友谊能量{@fill=#000}...！！！'
                ])
        ],
        papdate18b: () => [
            '<15>{#p/papyrus}{#f/24}哦...',
            '<15>{#f/21}不过，你嘴上那么说...',
            '<15>{#f/21}...但这一整天，\n你还是好好穿了衣服？',
            "<15>{#f/24}也就是说...",
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/13}你对我的爱\n是命中注定的~',
                    '<15>{#f/22}不‐不！！！你的\n{@fill=#003cff}约会能量{@fill=#000}...！！！'
                ]
                : [
                    '<15>{#f/13}你对我的友情\n是命中注定的~',
                    '<15>{#f/22}不—不！！！你的\n{@fill=#003cff}友谊能量{@fill=#000}...！！！'
                ])
        ],
        papdate19: ['<15>{#p/papyrus}{#f/15}捏！', '<15>{#f/15}捏嘿嘿！！！'],
        papdate20: () => [
            "<15>{#p/papyrus}{#f/15}别以为你已经\n打败我了！",
            '<15>{#f/20}我，伟大的\n帕派瑞斯...',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/20}之前从来没有\n在约会上输过...'
                : '<15>{#f/20}之前从来没有\n在消遣上输过...',
            '<15>{#f/15}以后也不会！！',
            '<15>{#f/10}我很容易就\n可以跟上你的\n节奏！！！',
            '<15>{#f/24}实际上...',
            '<15>{#f/20}我在平常的\n衣服下面...',
            '<15>{#f/20}一直穿着我的\n“特别”服装！！',
            '<15>{#f/15}你等着！！'
        ],
        papdate21: ['<15>{#p/papyrus}{#f/15}你觉得我的\n秘密穿搭\n怎么样？'],
        papdate22: () => [choicer.create('* （你要怎么回答？）', '很棒', '很差劲')],
        papdate23a: ['<15>{#p/papyrus}{#f/13}不！！！', '<15>{#f/13}发自内心的\n赞美...！'],
        papdate23b: ['<15>{#p/papyrus}{#f/13}不！！！', '<15>{#f/13}你在批评我...\n你果然真心为我好！'],
        papdate24: [
            '<15>{#p/papyrus}{#f/24}然而...',
            "<15>{#f/20}你根本不明白\n这身衣服背后\n{@fill=#f00}隐藏的力量{@fill=#000}！",
            '<15>{#f/26}因此...'
        ],
        papdate24a: () => [
            '<15>{#f/15}你刚才的回答\n无效！！',
            SAVE.data.b.flirt_papyrus
                ? "<15>{#f/15}这场约会不会\n再有更多\n进展了！"
                : "<15>{#f/15}这场消遣不会\n再有更多\n进展了！",
            '<15>{#f/24}除非...',
            '<15>{#f/20}你能找到我的\n{@fill=#f00}秘密{@fill=#000}。',
            "<15>{#f/15}但那是不会\n发生的！！"
        ],
        papdate24b: '* 移动并用[Z]交互。',
        papdate25: [
            
            '<15>{#p/papyrus}{#f/21}我头上的\n假发...？',
            '<15>{#f/16}我头上的假发。',
            '<15>{#f/10}我头上的...\n假发！！！',
            "<15>{#f/10}捏嘿嘿！\n看来真的\n很明显！"
        ],
        papdate25a: [
            '<15>{#p/papyrus}{#f/21}被我的闪亮的\n“星”服装惊呆了吗？',
            '<15>{#f/24}不‐不，我理解。',
            "<15>{#f/20}但是你\n不能退缩！！！"
        ],
        papdate25b: [
            '<15>{#p/papyrus}{#f/26}这件衬衫上\n本来没有写着\n“闪亮”的...',
            '<15>{#f/20}但是我\n改良了一下！',
            '<15>{#f/10}专家提示：\n所有的衣服都\n可以通过这种\n方式改良。',
            "<15>{#f/20}...但这里可\n没藏什么秘密！\n再试试吧！"
        ],
        papdate25c: [
            '<15>{#p/papyrus}{#f/24}我懂，我懂。',
            '<15>{#f/24}你喜欢用一颗\n漂浮的心\n感受我的\n手臂靠枕。',
            "<15>{#f/20}但是谁又\n不喜欢呢！？\n再试试吧！"
        ],
        papdate25d: [
            "<15>{#p/papyrus}{#f/13}你握住我的手，\n想让我把答案\n告诉你...？",
            '<15>{#f/14}我-我不，\n我必须忍住！！',
            '<15>{#f/20}再试试吧！'
        ],
        papdate25e: [
            "<15>{#p/papyrus}{#f/26}不管有没有靠枕，\n我的腿\n都没有秘密。",
            '<15>{#f/10}只有勤奋和毅力！',
            '<15>{#f/20}再试试吧！'
        ],
        papdate25f: [
            '<15>{#p/papyrus}{#f/24}这里的“潮流”\n或许确实\n无人能敌...',
            '<15>{#f/20}但要是期待这里\n有什么秘密是\n完全不可能的！',
            '<15>{#f/20}再试试吧！'
        ],
        papdate25g: [
            '<15>{#p/papyrus}{#f/20}啊这个！\n这是我的\n顶级运动服！',
            "<15>{#f/24}你在这里可\n找不到任何\n秘密，因为...",
            "<15>{#f/20}我就没有口袋\n可以装！！！",
            '<15>{#f/20}再试试吧！'
        ],
        papdate25h: () => [
            '<15>{#p/papyrus}{#f/24}我的肩膀...',
            '<15>{#f/10}你是想让我\n把你背到\n肩上吗？？',
            SAVE.data.b.flirt_papyrus
                ? "<15>{#f/24}如果我们没在\n忙着约会的话，\n我肯定会同意的。"
                : "<15>{#f/24}如果我们没在\n忙着消遣的话，\n我肯定会同意的。",
            '<15>{#f/20}所以现在不行！\n再试试吧！'
        ],
        papdate25i: [
            '<15>{#p/papyrus}{#f/14}你认真吗？？',
            "<15>{#f/19}我没想就这么\n【告诉】你\n秘密的...",
            "<15>{#f/20}你还必须得\n再加把劲！"
        ],
        papdate25j: () =>
            calcLV() > 2
                ? [
                    '<15>{#p/papyrus}{#f/24}既然你的{@fill=#f00}LV{@fill=#000}这么高，\n那就表示...',
                    SAVE.data.b.flirt_papyrus
                        ? '<15>{#f/28}你对我的@fill=#f00}爱{@fill=#000}\n一定情深意重！'
                        : "<15>{#f/28}你的{@fill=#f00}恋爱{@fill=#000}经验\n一定身经百战！",
                    "<15>{#f/24}但是！\n这是你\n自己的秘密！",
                    '<15>{#f/20}再试试吧！'
                ]
                : calcLV() === 2
                    ? [
                        '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}2？',
                        '<15>{#f/27}这是不是代表...',
                        ...(SAVE.data.b.flirt_papyrus
                            ? [
                                '<15>{#f/28}你有一个秘密的\n第二{@fill=#f00}爱好{@fill=#000}...？',
                                '<15>{#f/20}然而，\n你还是没有\n找到我的秘密！！'
                            ]
                            : [
                                '<15>{#f/28}你对我的爱\n深入骨髓？',
                                '<15>{#f/28}原来在你的内心\n深处，你对我{@fill=#f00}爱意绵绵{@fill=#000}吗？',
                                '<15>{#f/14}不‐不...！\n我不能向\n你的诡计屈服！'
                            ]),
                        '<15>{#f/20}再试试吧！'
                    ]
                    : SAVE.data.b.oops
                        ? [
                            '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}1？',
                            '<15>{#f/26}这是不是\n代表着...',
                            "<15>{#f/28}我是你的\n一生{@fill=#f00}挚爱{@fill=#000}...？",
                            ...(SAVE.data.b.flirt_papyrus
                                ? ['<15>{#f/14}不‐不...！\n我不能向\n你的诡计屈服！']
                                : [
                                    "<15>{#f/24}好吧，如果我们\n只是朋友关系，\n那就说不通了。",
                                    '<15>{#f/14}但‐但是不！\n我不能向\n你的诡计屈服！'
                                ]),
                            '<15>{#f/20}再试试吧！'
                        ]
                        : [
                            '<15>{#p/papyrus}{#f/24}{@fill=#f00}LV{@fill=#000}0？',
                            "<15>{#f/26}好吧，那就怪了。",
                            "<15>{#f/21}衫斯告诉我\n人类的{@fill=#f00}LOVE{@fill=#000}\n是从1开始的。",
                            '<15>{#f/24}额...',
                            '<15>{#f/24}这是你的秘密吗？',
                            '<15>{#f/20}然而，\n你还是没有\n找到我的秘密！',
                            '<15>{#f/20}再试试吧！'
                        ],
        papdate25k: () => [
            ...(SAVE.data.n.hp > calcHP()
                ? [
                    '<15>{#p/papyrus}{#f/22}啥？\n你的HP咋【爆表】了？！',
                    '<15>{#f/10}你可真是\n有备而来啊！',
                    '<15>{#f/24}但是这和\n我的秘密\n有什么关系呢？'
                ]
                : [
                    '<15>{#p/papyrus}{#f/24}尽管你的HP\n也许是满的，\n但这并非与秘密\n有任何联系，\n所以...\n',
                    "<15>{#f/20}你仍然一无所获！"
                ]),
            '<15>{#f/20}再试试吧！'
        ],
        papdate25l: [
            "<15>{#p/papyrus}{#f/20}原来是这样...",
            '<15>{#f/24}你想\n抓挠我的脖子...',
            '<15>{#f/21}然后叫我\n“好孩子...”',
            "<15>{#f/24}我会像狗那样\n对你兴奋叫唤。",
            '<15>{#f/20}最后强调一次，\n我是一个骷髅！\n所以再试试吧！'
        ],
        papdate26: () => [
            '<15>{#p/papyrus}{#f/27}那-那好吧...',
            '<15>{#f/27}你找到我的\n秘密了！',
            '<15>{#f/24}我觉得我没有\n什么别的选择，\n只能承认\n事实了。',
            "<15>{#f/24}这是个...",
            ['<15>{#f/27}只-只送给你的\n礼物！！！', '<15>{#f/27}给我们两个\n分享的礼物！！！'][
            (SAVE.data.n.state_papyrus_spaghet + 1) % 2
            ],
            '<15>{#f/10}快！\n快打开！'
        ],
        papdate27: () => [choicer.create('* （你该怎么办？）', '打开', '不要')],
        papdate28: [
            "<15>{#p/papyrus}{#f/21}你甚至都\n舍不得拆开\n我精致的包装？",
            '<15>{#f/27}不-不...\n居然来这招...',
            "<15>{#f/13}真的好厉害！",
            '<15>{#f/14}但-但是...\n啊哈！\n看我的反击！',
            "<15>{#f/15}我自己拆\n不就好了！！"
        ],
        papdate29: ['<15>{#p/papyrus}{#f/20}你知道【这】是\n什么吗？'],
        papdate30: () => [choicer.create('* （你知道这是什么吗？）', '知道', '不知道')],
        papdate31a: [
            '<15>{#p/papyrus}{#f/26}意大利面。',
            "<15>{#f/24}这是你现在\n脑子里的想法，\n没错吧？",
            '<15>{#f/20}对了！',
            '<15>{#f/15}但是也-\n错了！'
        ],
        papdate31b: [
            "<15>{#p/papyrus}{#f/20}捏嘿嘿！\n这才对嘛。",
            '<15>{#p/papyrus}{#f/15}你根本想不到！',
            '<15>{#f/24}虽然这看起来\n是意大利面...'
        ],
        papdate32: () => [
            "<15>{#p/papyrus}{#f/20}这可不是什么\n普通的意面！",
            "<15>{#f/20}这是一个\n大师的杰作！",
            '<15>{#f/24}丝般柔滑的意面，\n在时间膨胀\n单元之中\n精细陈化。',
            '<15>{#f/20}然后再由我，\n主厨帕派瑞斯\n来加工！',
            "<15>{#f/15}人类！！！\n是时候结束这\n一切了！！",
            "<15>我们不能再这样\n僵持下去了！",
            ...[["<15>{#f/20}我们一起来吃\n这盘意大利面\n吧！！！"], ['<15>{#f/20}尽情享受我的\n终极厨艺吧！！']][
            (SAVE.data.n.state_papyrus_spaghet + 1) % 2
            ]
        ],
        papdate33: () => [choicer.create('* （你该怎么办？）', '吃掉', '留着')],
        papdate33a: () => [
            '<32>{#p/human}* （你咬了一小口。）\n* （味道让你脸红了。）',
            "<32>{#p/basic}* 真的好好吃...！",
            ...(SAVE.data.n.state_papyrus_spaghet === 1
                ? ['<32>{#p/basic}* 帕派瑞斯看起来也吃得很开心。']
                : [])
        ],
        papdate34a: () => [
            '<15>{#p/papyrus}{#f/10}多么充满激情的\n表达！！',
            SAVE.data.b.flirt_papyrus
                ? '<15>{#f/12}你肯定真心爱着\n我的厨艺！'
                : '<15>{#f/12}你肯定真心喜欢\n我的厨艺！',
            ...[
                [
                    '<15>{#f/24}那个，虽然\n我也这样...',
                    SAVE.data.b.flirt_papyrus
                        ? '<15>{#f/20}但我觉得你甚至\n比我更爱我的\n厨艺！！！'
                        : '<15>{#f/20}但我觉得你甚至\n比我更喜欢我的\n厨艺！！！'
                ],
                ['<15>{#f/10}甚至\n因而爱上了我！', '<15>{#f/20}搞不好\n你比我自己\n还要爱我！！！']
            ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2],
            "<15>{#f/27}但... 那是\n不可能的...！",
            '<15>{#f/12}你是怎么\n做到的！？！？'
        ],
        papdate34b: () => [
            '<15>{#p/papyrus}{#f/21}你的意思是...',
            "<15>{#f/18}你要留给我吃？",
            ...[
                [
                    '<15>{#f/24}我以为你之前\n说要分享...',
                    '<15>{#f/20}你会至少想自己\n尝一小口。',
                    '<15>{#f/27}但你不是\n这样的，\n你都留给我了...',
                    '<15>{#f/12}你想让我，\n让【我】来，\n全都吃掉！！！'
                ],
                [
                    '<15>{#f/21}即使你之前\n说过...',
                    '<15>{#f/21}你想自己品尝\n我的意大利面...',
                    '<15>{#f/27}就在你马上要\n实现的时候，\n你...',
                    '<15>{#f/12}你要放弃\n全留给我？？？'
                ]
            ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2]
        ],
        papdate35: ['<15>{*}{#p/papyrus}{#f/22}啊！！！{%15}'],
        papdate36: ['<15>{*}{#p/papyrus}{#f/22}呃！！！{%15}'],
        papdate37: ['<15>{*}{#p/papyrus}{#f/22}不啊啊啊！！！{%15}'],
        papdate38: () => [
            "<18>{#p/papyrus}{@random=1.1/1.1}人类。\n一切都清晰明了了。",
            SAVE.data.b.flirt_papyrus
                ? "<18>{@random=1.1/1.1}你已经痴狂地\n爱上了我。"
                : "<18>{@random=1.1/1.1}你已经完全\n被我迷住了。",
            '<99>{@random=1.1/1.1}你做的每一件事。\n你说的每一个字。',
            "<18>{@random=1.1/1.1}一切的一切\n都是为了我。",
            '<18>{@random=1.1/1.1}人类。\n我也想让你，\n感到快乐。',
            "<18>{@random=1.1/1.1}现在轮到我\n来表达我的\n感情了...",
            "<18>{@random=1.1/1.1}轮到我来告诉你\n我的真心话了。"
        ],
        papdate39: () =>
            SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/21}人类，我的\n真心话是...',
                    "<15>{#f/21}我就是不\n像你那样\n喜欢我。",
                    '<15>{#f/24}我是说，\n浪漫的那种。',
                    '<15>{#f/27}我是说，我已经\n很努力了！',
                    '<15>{#f/27}我觉得因为你\n跟我调情过了...',
                    '<15>{#f/27}我就该跟你\n约一次会。',
                    '<15>{#f/10}然后，在我们\n约会的过程中，\n感情就会开花\n结果！！！',
                    '<15>{#f/20}我就能配得上\n你对我的热情！',
                    '<15>{#f/21}但是...\n我，伟大的\n帕派瑞斯...',
                    '<15>{#f/21}失败了。',
                    '<15>{#f/21}我跟之前相比\n没什么两样。',
                    '<15>{#f/27}最坏的部分是，\n跟你约会之后...',
                    '<15>{#f/22}我只会把你拉进\n更深的爱里！',
                    '<15>{#f/21}那是激情的\n黑暗牢笼，\n无处可逃。',
                    '<15>{#f/27}我怎么能这样\n对我亲爱的\n朋友呢...？',
                    '<15>{#f/27}...',
                    '<15>{#f/27}...不...'
                ]
                : ['<15>{#f/24}人类，实际上...'],
        papdate39a: () => [
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    "<15>{#f/20}不！\n不是这样的！",
                    "<15>{#f/17}我不会在任何\n事情上失败！！！",
                    "<15>{#f/20}人类！！！\n我会帮助你度过\n这段艰难的\n时光！！！",
                    "<15>{#f/24}我可以继续当你\n酷酷的朋友...",
                    '<15>{#f/20}然后把发生的\n这一切忘掉。',
                    '<15>{#f/10}毕竟，你也，\n很伟大。',
                    '<15>{#f/20}失去你的友谊\n会是一场悲剧！',
                    '<15>{#f/21}所以，拜托...',
                    "<15>{#f/21}不要因为我不能\n亲吻你而哭泣...",
                    "<15>{#f/19}因为，我根本\n没有嘴唇！！！",
                    ...(SAVE.data.n.plot < 48
                        ? [
                            "<15>{#f/10}嘿，总有一天，\n你会找到和我\n一样好的人。",
                            "<15>{#f/24}呃，不。\n那是不可能的。",
                            "<15>{#f/20}但我也会接受\n你找个第二好的\n人！！！"
                        ]
                        : ["<15>{#f/10}对了，\n安黛因的家\n离这不远。", '<15>{#f/20}我们可以约她\n一起消遣！'])
                ]
                : [
                    '<15>{#f/10}我也喜欢你！',
                    '<15>{#f/10}毕竟你是个\n超级大好人。',
                    '<15>{#f/21}但也许...',
                    "<15>{#f/21}如果你多为\n自己而活的话，\n你会过得更好的。",
                    '<15>{#f/21}不能只为了\n我而活。',
                    '<15>{#f/10}很幸运的是，\n我知道解决\n方案！！！',
                    '<15>{#f/20}那就是跟我的上司，\n安黛因一起消遣！！！',
                    '<15>{#f/24}我觉得如果你\n可以把你的友谊能量\n分散一点...',
                    "<15>{#f/10}你的生活方式\n就会更健康。",
                    ...(SAVE.data.n.plot < 48
                        ? ["<15>{#f/20}等准备好了\n我就告诉你！"]
                        : ["<15>{#f/20}所以让我们！\n一起加油吧！！"])
                ]),
            '<15>{#f/20}捏嘿嘿\n嘿嘿！！！'
        ],
        papdate40: () => [
            '<15>{#f/24}哦，如果你还想\n找我的话...',
            "<15>{#f/10}这是我的\n{@fill=#f00}电话号码{@fill=#000}。",
            '<15>{#f/11}欢迎你随时\n打给我！',
            ...(SAVE.data.b.flirt_papyrus
                ? [
                    '<15>{#f/24}当然，\n是柏拉图式的。',
                    ...(SAVE.data.n.plot < 48
                        ? ['<15>{#f/10}那么，\n我先走啦！']
                        : ["<15>{#f/10}那么，我们\n在安黛因的房子那里\n见面吧！"])
                ]
                : SAVE.data.n.plot < 48
                    ? ['<15>{#f/10}那么，\n我先走啦！']
                    : ["<15>{#f/20}那么，我们\n在安黛因的房子那里\n见面吧！"]),
            '<15>{#f/20}捏嘿嘿！'
        ],
        papdate41: {
            a: () => (SAVE.data.b.flirt_papyrus ? '浪漫' : '友谊'),
            b: '功率\n水平',
            c: '日期：克历615年9月',
            d: '速度',
            e: '星系\n地图',
            f: '紧张感'
        },
        pappuzzle1: [
            '<18>{#p/papyrus}{#f/0}人类！',
            '<18>{#f/0}下一个谜题\n是我最喜欢的\n谜题之一。',
            "<18>{#f/4}这就像我兄弟的\n棉球收藏一样...",
            '<18>{#f/0}不论哪个地方\n都让人满意！',
            "<18>{#f/9}我【尽量】不告诉你\n解决方法。"
        ],
        pappuzzle1a: ['<18>{#p/papyrus}{#f/0}试试吧！'],
        pappuzzle1b: [
            
            '<18>{#p/papyrus}{#f/4}看起来这个谜题...\n有谁趁我不注意时\n把它解开了。',
            '<18>{#p/papyrus}{#f/4}而且他\n还没经过我同意。',
            "<18>{#p/papyrus}{#f/0}好吧，今天\n某个人要倒霉了。",
            '<18>{#p/papyrus}{#f/5}...',
            '<18>{#p/papyrus}{#f/5}运气好的话，\n下个谜题就\n不会有人来破坏了。',
            "<18>{#p/papyrus}{#f/6}...我在\n下个区域等你。"
        ],
        pappuzzle2: ['<18>{#p/papyrus}哇！\n你解开了啊！！'],
        pappuzzle2a: ['<18>而且不用我的帮忙\n你就解开了！！！'],
        pappuzzle2b: ["<18>而且根本没用我\n帮你太多\n你就解开了！"],
        pappuzzle2c: ['<18>虽然需要一点鼓励，\n但你真的做到了！'],
        pappuzzle2d: [
            '<18>你一定跟我一样\n很在意谜题吧！',
            "<18>那么，我觉得你肯定\n会爱上下个谜题的！",
            '<18>可能对你而言\n都算太简单了！！',
            '<18>捏！\n嘿嘿！\n嘿嘿嘿！！！'
        ],
        papsink0: () =>
            SAVE.data.b.svr
                ? [
                    '<32>{#p/human}* （这个水槽内的狗剩\n  看起来像一颗爱心。）',
                    '<32>* （不知为何，\n  这让你感到放松。）'
                ]
                : SAVE.data.n.plot < 72
                    ? ["<32>{#p/basic}* 水槽太高了，\n  你都没办法洗手..."]
                    : ["<32>{#p/basic}* 水槽内有一堆狗剩。"],
        papsink1: [
            '<18>{#p/papyrus}{#f/9}厉害吧？\n我增加了水槽的高度。',
            '<18>{#f/0}现在我可以在下边\n放更多骨头了！\n你快看看！'
        ],
        papsink2: ['<18>{#p/papyrus}{#f/8}不！是那条狗！'],
        papsink3: ['<18>{#p/papyrus}{#f/31}哦，好可怜\n好可怜的小狗狗...', '<18>{#f/9}给你，尝尝我的\n特殊攻击！'],
        papsink4: ['<18>{#p/papyrus}哇！！！\n它喜欢诶！！！'],
        papsink5: ['<18>{#p/papyrus}{#f/7}衫斯！', '<18>别再用配乐\n打扰我的生活了！！'],
        papsink6: ['<18>{#p/papyrus}{#f/4}现在那条狗\n在我的攻击下\n消失了。', '<18>哦好吧...'],
        papsolu1: [
            '<18>{#p/papyrus}看起来你需要\n一个提示。',
            '<18>{#f/4}嗯...',
            "<18>{#f/0}喏，我会注意\n这几条电路的。",
            "<18>{#f/0}但这只是\n我自己的见解哦。"
        ],
        papsolu2: [
            '<18>{#p/papyrus}{#f/5}还是困惑吗？',
            '<18>{#f/5}呃... 或许...',
            '<18>{#f/6}你用电路一点点\n推出答案呢？？？',
            "<18>{#f/5}我在尽量不给你\n把答案透露出来了..."
        ],
        papsolu3: [
            '<18>{#p/papyrus}{#f/6}还来？？？',
            '<18>{#f/0}我觉得，\n我应该完全可以\n告诉你解法了。',
            "<18>{#f/4}虽然我其实\n不想扫兴..."
        ],
        papsolu3a: () => [
            '<18>{#p/papyrus}{#f/9}你真的，真的想要\n谜题的解法吗？？？',
            choicer.create('* （你要怎么回答？）', "告诉我", "再想想")
        ],
        papsolu3a1: () => [
            '<18>{#p/papyrus}解！法！就是！',
            '<18>{#f/4}（请脑补一段\n敲鼓声...）',
            SAVE.data.b.s_state_pretrick
                ? '<18>{#f/0}...在这个区域\n左下角的那个终端！'
                : '<18>{#f/0}...在你右侧那盏灯\n旁边的那棵\n全息投影树！',
            '<18>快去看看叭！！！'
        ],
        papsolu3a2: [
            "<18>{#p/papyrus}哇... 你真是个\n谜题爱好者！",
            "<18>我被你的热情\n给打动了！",
            '<18>你做得到的，\n人类！！！'
        ],
        papsolu4: ["<18>{#p/papyrus}{#f/4}你忘记我给你的\n解法了吗...？"],
        papsolu5: ['<18>{#f/0}{#p/papyrus}就快完成了！\n只剩下一条电路\n就要激活了！'],
        papspaghet1: (take: boolean) => [
            '<18>{#p/papyrus}{#f/1}什么！？\n你是怎么避开\n我的陷阱的？',
            '<18>{#f/4}还有，比起这个...',
            '<18>{#f/0}有给我留点吗？？？',
            choicer.create('* （你要怎么跟帕派瑞斯说\n  关于他做的意大利面的事？）', take ? '拿走了' : '留在那了', '吃掉了'),
            '<18>{#p/papyrus}真的！？'
        ],
        papspaghet1a: () => [
            '<18>{#p/papyrus}{#f/1}什么！？\n你是怎么避开\n我的陷阱的？',
            '<18>{#f/4}还有，比起这个...',
            '<18>{#f/0}有给我剩...',
            '<18>{#f/4}...等下。',
            "<18>{#f/0}你带着它呢！！",
            '<18>{#f/9}人类，你怎么打算的？',
            choicer.create("* （你要拿帕派瑞斯的意面怎么办呢？）", '一起吃', '自己独享'),
            '<18>{#p/papyrus}真的！？'
        ],
        papspaghet2a: [
            "<18>{#f/5}你忍着没吃\n我做的意大利面...",
            '<18>{#f/6}就是因为想跟我\n一起吃吗？？？',
            '<18>{#f/9}那好吧！！',
            '<18>别担心！这盘意面\n你先留着吧！',
'<18>因为我，\n伟大的帕派瑞斯...',
            '<18>会为你和我二人\n做各种我们想吃的\n意大利面的！',
            '<18>{#f/0}嘿嘿嘿嘿嘿嘿捏！'
        ],
        papspaghet2b: [
            '<18>{#f/5}哇...',
            '<19>{#f/6}之前几乎从来没有人\n欣赏过我的厨艺...',
            '<18>{#f/9}那好吧！！',
            '<18>别担心！这盘意面\n你先留着吧！',
'<18>因为我，\n伟大的帕派瑞斯...',
            '<18>会为你做你想吃的\n各种意大利面的！',
            '<18>{#f/0}嘿嘿嘿嘿嘿嘿捏！'
        ],
        paptv: pager.create(
            0,
            () => [
                ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                    ? ["<18>{#p/papyrus}哦，这是我\n最喜欢的电视节目！"]
                    : []),
                ...(SAVE.data.n.plot < 67.1
                    ? ['<33>{#p/mettaton}* “敬请期待新节目！”']
                    : SAVE.data.b.killed_mettaton
                        ? ['<33>{#p/mettaton}* “网络连接错误。”']
                        : world.bad_robot
                            ? ['<33>{#p/mettaton}* “抱歉，各位！”\n* “节目取消了！”']
                            : ['<32>{#p/mettaton}* “希望各位喜欢这个节目！”']),
                ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                    ? [
                        "<18>{#p/papyrus}{#f/7}什么！！！\n平常都比这个\n精彩的！",
                        '<18>{#f/4}单纯就是这一期\n质量不好。',
                        "<18>{#f/7}你不许喷我！！！"
                    ]
                    : [])
            ],
            ['<33>{#p/mettaton}* “敬请期待新节目！”']
        ),
        papyrus1: ['<18>{#p/papyrus}所以，在我说到\n安黛因的时候...'],
        papyrus2: [
            '<18>{#p/papyrus}衫斯！！\n我的天啊！！\n那是个...',
            '<18>人类吗！？！？',
            "<25>{#p/sans}{#f/2}* 才不是咧，那就是个\n  长得像人的全息投影。"
        ],
        papyrus3: [
            '<18>{#p/papyrus}{#f/4}哦。',
            '<18>{#f/4}...',
            '<18>{#f/4}等一下...',
            "<18>{#f/7}你骗我！！",
            '<25>{#p/sans}{#f/2}* 哎呀，嘴滑了，那其实是个\n  “长得像全息投影的人”。',
            '<18>{#p/papyrus}{#f/0}...衫斯，我们\n终于做到了！',
            '<18>{#f/9}安黛因现在【肯定】会让我\n加入皇家卫队了！！！',
            '<18>{#f/6}我们只需要...',
            '<18>{#f/5}去...',
            '<18>{#f/4}...',
            "<18>{#f/4}我好像忘了些啥。",
            '<25>{#p/sans}{#f/2}* 演讲，还记得吗？',
            '<18>{#p/papyrus}{#f/4}哦，对对对。\n...“咳咳”。',
            "<18>{#f/9}人类！你可能以为\n你来到这里就安全了。",
            '<18>{#f/9}但我，\n伟大的帕派瑞斯，\n打算扭转你的想法！',
            "<18>{#f/4}首先，我要用\n艾菲斯博士的谜题\n让你眼花缭乱...",
            '<18>{#f/4}然后，\n在你最意想不到的时候...',
            '<19>{#f/9}哇呜！\n抓到你了！\n押去首塔！',
            '<18>{#f/9}我们的战斗\n将一如既往地传奇！',
            '<18>{#f/4}无论如何...',
            '<18>{#f/9}来吧...\n只要你够胆！'
        ],
        papyrus4: ['<18>{#f/0}捏嘿嘿嘿嘿\n嘿嘿嘿！！！'],
        papyrus5: [
            '<25>{#p/sans}* 不错，进展很顺利。',
            "<25>* 别担心，伙计。",
            "<25>{#f/2}* 我会用眼窝\n  替你盯着的。"
        ],
        papyrus6x1: ['<18>{#p/papyrus}{#f/5}人-人类？\n你就是那个人类吗...？'],
        papyrus6x2: [
            "<15>{#p/papyrus}{#e/papyrus/20}我的天哪！\n我终于见到你啦！",
            "<18>{#p/papyrus}{#f/0}自打听说你来了星港，\n我就梦想着能见你一面！",
            "<18>{#p/papyrus}{#f/4}...你问，\n为啥衫斯没跟我\n在一起？",
            '<18>{#p/papyrus}{#f/6}唉，我有理由怀疑...',
            '<18>{#p/papyrus}{#f/5}...他好像\n刻意想让我躲着你。',
            '<18>{#p/papyrus}{#f/7}真不愧是他！！！',
            '<18>{#p/papyrus}{#f/0}但是，\n只要你不说，我不说~',
            "<18>{#p/papyrus}{#f/9}那懒骨头\n就甭想知道【一丁点】\n咱们的“地下情谊”！"
        ],
        papyrus6x3: [
            "<18>{#p/papyrus}{#f/5}不过，我现在得走了。\n绝不能让他发现\n我偷偷溜出来了。",
            "<18>{|}{#p/papyrus}{#f/9}待会见，人-{%}"
        ],
        papyrus6x4: ['<32>{#p/without}* ...帕派瑞斯？'],
        papyrus6: () => [
            '<18>{#p/papyrus}{#f/9}人类！！',
            world.nootflags.has('s_puzzle2') // NO-TRANSLATE

                ? '<18>{#f/4}你之前的谜题兴许过\n得很轻松。'
                : '<18>{#f/4}你可能已经过了\n我很多别的挑战。',
            "<18>{#f/9}但现在，你就\n绝对要束手无策了！",
            '<18>你也看到了，\n出这个谜题的\n不是别人...',
            '<18>{#f/0}正是那个大名鼎鼎的\n艾菲斯博士！',
            '<18>实际上，\n规则很简单。',
            '<18>这个显示器会\n随机读出一个数字。',
            '<18>{#f/9}...这数字就是\n你度过这里\n所需要的秒数！',
            '<18>{#f/0}如果数字是奇数，\n你就必须躲避子弹。',
            '<18>以1结尾的数\n是星形的子弹...',
            '<18>以3结尾的数\n是月亮形状的子弹...',
            '<18>{#f/4}5是彗星的，\n7是类星体的...',
            "<18>{#f/9}如果是9结尾的，\n就是完全随机！",
            '<18>{#f/0}如果数字是质数，\n重力就会翻转。',
            "<18>{#f/4}（不过，\n小于10的质数\n一般不会触发。）",
            '<18>{#f/0}如果数字是偶数，\n你一开始会\n平安无事...',
            '<18>{#f/9}但你接下来就要\n遭遇到随机的怪物！',
            '<18>并且，如果是\n2的整数幂，会使\n怪物数量翻倍！！',
            '<18>{#f/0}如果某个数字\n重复了两次...',
            '<18>{#f/0}等待的时间\n就会乘以这个数字！',
            '<18>{#f/0}如果数字是\n按顺序排列的，\n譬如1-2-3...',
            '<18>{#f/0}房间就会摇摇晃晃，\n让你连走都走不动！',
            '<18>{#f/0}然后，如果\n包含一个数字4...',
            '<18>{#f/9}衫斯就会随机用\n蓝色魔法\n让你浮起来！',
            "<25>{#p/sans}{#f/6}* 你看吧，\n  这就是我特殊的黄色眼睛。",
            '<18>{#p/papyrus}{#f/7}现在不行，衫斯！！',
            '<25>{#p/sans}* 哦，嘿嘿。\n* 看来我有些{@fill=#ff0}浮{@fill=#fff}躁了，嗯？',
            '<18>{#p/papyrus}{#f/4}好好好...',
            '<18>{#f/9}总之！\n你理解我的\n解释了吗？',
            choicer.create('* （你要怎么回答？）', "听懂了", "没听懂")
        ],
        papyrus7: () => [
            "<18>{#p/papyrus}{#f/9}好，\n那我们回顾一遍！",
            '<18>{#f/0}这个显示器会随机\n生成一个秒数。',
            '<18>也就是，\n你要等多少秒\n才能通过的时间。',
            '<18>奇数要躲子弹。',
            "<18>尾数决定\n子弹的种类。",
            '<18>1是星星，3是月亮，\n5是类星体，\n7是...',
            '<18>{#f/5}等等，\n哪个数字是\n类星体来着？',
            '<18>{#f/9}呃，然后，\n如果尾数是9，\n就是完全随机！',
            '<18>{#f/0}质数会改变重力...',
            '<18>{#f/0}偶数会\n遭遇随机战斗...',
            '<18>{#f/5}等等，\n我刚才是说\n重力会改变吗！？，',
            '<18>{#f/7}呃，我是说颠倒！！',
            '<18>{#f/0}但是2的整数幂\n会使遭遇数翻倍。',
            '<18>数字按顺序排列的\n会让房间摇晃，\n然后4是...',
            '<18>{#f/6}呃，我忘记\n4会发生什么了。',
            "<25>{#p/sans}* 你这不是在暗示我吗？",
            '<18>{#p/papyrus}{#f/6}可能吧？？？',
            '<18>{#f/7}管他呢！！\n你现在理解了吗！？',
            choicer.create('* （你要怎么回答？）', '当然', '更糊涂了')
        ],
        papyrus8: [
            '<18>{#p/papyrus}{#f/9}那... 好吧...',
            "<18>{#f/9}这样吧，\n我把规则放在这！",
            '<18>{#f/0}这样，你就可以\n按自己的节奏\n自己读了。',
            '<18>祝你好运，人类！！',
            '<18>{#f/5}捏... 嘿嘿...'
        ],
        papyrus9: [
            '<18>{#p/papyrus}{#f/9}太奈斯了！',
            '<18>{#f/9}好，废话少说...',
            "<18>让我们看看\n会是什么随机数！！"
        ],
        papyrus10: [
            '<18>{#p/papyrus}{#f/9}人类！',
            '<18>{#f/9}准备好面对你\n最严峻的挑战了吗？',
            '<18>{#f/9}特此介绍...\n致命恐怖大挑战！'
        ],
        papyrus11: [
            '<18>{#p/papyrus}{#f/9}一旦我下达命令，\n一切都会动起来！',
            '<18>激光扫射！\n线圈发电！\n刀剑挥舞！',
            '<18>一切都会以精确的、\n战术性的方式进行！',
            '<18>{#f/4}不精确的一点是，\n你肯定会失败。',
            '<18>{#f/9}那么！！！\n你准备好了吗！？！？',
            '<18>因为！',
            '<18>我！',
            '<18>就！',
            '<18>要！',
            '<18>启动了！'
        ],
        papyrus12: [
            '<25>{#p/sans}* 怎么了？\n* 我们到底还进不进行了？',
            '<18>{#p/papyrus}{#f/7}...',
            "<25>{#p/sans}{#f/3}* 那条烦人的狗\n  在上面会不耐烦的。",
            '<18>{#p/papyrus}{#f/7}随时都会进行的！'
        ],
        papyrus13: [
            '<25>{#p/sans}* 准备好了就开始吧。',
            '<18>{#p/papyrus}{#f/6}我...',
            "<18>{#f/6}我现在在想...",
            '<18>{#f/6}这个挑战...',
            '<18>{#f/6}可能...',
            '<18>{#f/6}...',
            '<18>{#f/4}...有点不算个\n好主意了。',
            '<18>{#f/5}一想到\n我设计的这个挑战\n可以这么...',
            '<18>{#f/9}但是，不用害怕！',
            '<18>{#f/9}我是个\n有原则的骷髅！',
            '<18>{#f/4}就是，坦白来说，\n一个你根本不可能\n活着通过的挑战...',
            '<18>{#f/7}就实在是太做作了！',
            '<18>走你！！'
        ],
        papyrus14: [
            '<18>{#p/papyrus}{#f/7}你看什么看！？',
            '<18>{#f/9}这只是帕派瑞斯的\n又一次决定性的\n胜利罢了！！',
            '<18>捏！',
            '<18>嘿！',
            '<18>{#f/4}...',
            '<18>...嘿？'
        ],
        papyrusFinal1: [
            '<23>{#p/papyrus}{#f/30}人类。',
            '<23>请允许我倾诉\n一些复杂的情感。',
            '<23>就像...'
        ],
        papyrusFinal2: () =>
            world.genocide
                ? [
                    '<23>失去至亲的悲痛。',
                    '<23>无能为力的自责。',
                    '<23>阴阳两隔的怀念。',
                    '<23>这些情感...'
                ]
                : papreal()
                    ? [
                        '<23>众生罹难的心痛。',
                        "<23>无能为力的绝望。",
                        '<23>改过自新的理想。',
                        '<23>这些情感...'
                    ]
                    : [
                        '<23>找到另一个\n意面爱好者的喜悦。',
                        "<23>对另一个人\n解谜技巧的钦佩。",
                        '<23>想有一个很酷、\n很聪明的人认为你\n也同样很酷的渴望。',
                        '<23>这些情感...'
                    ],
        papyrusFinal3: () =>
            world.genocide || papreal()
                ? [
                    '<18>{#f/31}肯定正萦绕在你心头。',
                    '<18>{#f/32}很难想象这些情感\n究竟是怎样的...',
                    '<18>{#f/6}毕竟，我很... 伟大...',
                    '<18>{#f/32}{#x1}...',
                    '<18>{#f/31}人类，尽管你做了\n很多错事...\n我...',
                    '<18>{#f/5}我仍然相信你！',
                    '<18>{#f/31}我知道，\n你可以浪子回头。',
                    '<18>{#f/31}我知道，\n你愿意变得更好。',
                    ...(world.genocide
                        ? ["<18>{#f/4}不管那个“艾斯利尔”\n说了什么荒唐的话，"]
                        : ['<18>{#f/5}不管你觉得自己\n多么不可救药，']),
                    "<18>{#f/6}{#x2}但我知道，在内心深处，\n你还是个好人！",
                    '<18>{#f/0}我会让你的善良重见天日！',
                    '<18>{#f/0}我会让你的潜能尽数释放！',
                    '<18>{#f/4}最终...',
                    '<18>{#f/9}我会让你知道，\n你仍然是最棒的！！！',
                    '<18>{#f/0}我，帕派瑞斯，\n敞开双臂欢迎你！'
                ]
                : [
                    '<18>{#f/0}一定就是你\n现在的情感！！',
                    '<18>{#f/4}我很难想象这些情感\n究竟是怎样的...',
                    '<18>{#f/4}毕竟，我十分伟大。',
                    '<18>我从来不好奇\n有很多朋友的感觉\n是怎样的。',
                    '<18>{#f/5}我很同情你，\n孤单的人类...',
                    '<18>{#f/0}但不要担心！！！\n你再也不会孤单了！',
                    '<18>{#f/9}因为我，\n伟大的帕派瑞斯，\n会成为你的...',
                    '<18>{#f/5}{#x1}...',
                    '<18>不...',
                    '<18>{#f/7}{#x2}不，不该是这样的！',
                    '<18>我不能成为\n你的“朋友”...',
                    '<18>你是个人类！\n我必须逮捕你！！！',
                    '<18>{#f/9}然后，我就可以实现\n我毕生的梦想！！！',
                    '<18>力量强大！\n受人爱戴！\n声名远扬！！！',
                    "<18>那就是帕派瑞斯！！！",
                    '<18>{#f/4}皇家守卫中...',
                    '<18>{#f/9}最闪亮的新星！！！'
                ],
        papyrusFinal4: (b: boolean) =>
            world.edgy || world.killed0
                ? [
                    '<18>{#p/papyrus}{#f/0}哇！\n你做到了！',
                    "<18>{#p/papyrus}{#f/5}没有动用任何暴力！",
                    '<18>{#p/papyrus}{#f/6}其实，\n刚才我有点害怕...',
                    "<18>{#p/papyrus}{#f/0}不过没关系！\n你已经重回正轨啦！",
                    "<18>{#p/papyrus}{#f/8}我为你骄傲，人类！",
                    "<18>{#p/papyrus}{#f/4}...等等，我是不是\n该抓你来着？",
                    "<18>{#p/papyrus}{#f/0}嗨，随它去吧。",
                    '<18>{#p/papyrus}{#f/0}只要你能成为最棒的自己，\n我就满足啦。',
                    "<18>{#p/papyrus}{#f/5}过去的事，\n就让它成为{@fill=#ff0}骨{@fill=#fff}事吧，\n好吗？",
                    "<18>{#p/papyrus}{#f/9}我还要告诉你\n怎么离开这里！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/5}扭呜呼呼...',
                    ...(b
                        ? ["<18>我没有足够的力量\n阻止你..."]
                        : ["<18>连像你这样\n弱小的人\n我都阻止不了..."]),
                    "<18>{#f/7}安黛因一定会\n对我非常失望的！",
                    "<18>{#f/5}我也永远不能\n加入皇家卫队了...",
                    '<18>{#f/7}而且...\n我的粉丝数也会\n就这样停滞不前！',
                    choicer.create('* （你要怎么回答？）', "我们做\n朋友吧", '真是个\n废柴')
                ],
        papyrusFinal4a1: (b: boolean) =>
            b
                ? [
                    '<18>{#p/papyrus}{#f/5}真-真的吗？\n你想跟我做朋友？',
                    '<18>{#f/6}即使发生了\n那样的事情？？？',
                    "<18>{#f/0}那，好吧！！\n我们做朋友吧！！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/1}真的吗！？\n你想跟我做朋友？？？',
                    '<18>{#f/6}那...\n我觉得...',
                    '<18>{#f/0}我可以给你\n一个照应了！'
                ],
        papyrusFinal4a2: (b: boolean) =>
            b
                ? [
                    '<18>{#p/papyrus}{#f/5}嗯？你是...\n想责备我吗？？？',
                    "<18>{#f/6}是因为我不够强大，\n不配做你的朋友吗？",
                    '<18>{#f/5}...不...',
                    '<18>{#f/7}哦，我在说什么啊！！\n我当然很强大！',
                    "<18>{#f/9}我会通过跟你交朋友\n证明给你看！"
                ]
                : [
                    '<18>{#p/papyrus}{#f/1}啊？为啥你要那么大声地\n骂自己呢？？？',
                    '<18>{#f/4}是不是因为...',
                    "<18>{#f/7}你感觉自己不够优秀，\n不配做我的朋友？",
                    "<18>{#f/9}错啦，你其实很棒！\n我会成为你的朋友的！！！"
                ],
        papyrusFinal4b1: [
            '<18>{#f/0}好耶！！',
            '<18>我交到一个新朋友啦！！',
            '<18>{#f/4}谁能想到，成为好朋友...'
        ],
        papyrusFinal4b2: [
            '<18>{#f/0}好耶！！',
            "<18>{#f/0}我们还没有进行\n第一次约会...",
            "<18>{#f/0}就已经成为\n好朋友了！！！",
            '<18>{#f/4}谁能想到，成为好朋友...'
        ],
        papyrusFinal4c1: [
            '<18>{#f/0}只需要先出几个\n抽象的谜题，\n再来打一架呢？',
            '<18>你教会了我很多，\n人类。',
            '<18>{#f/9}我特此\n允许你通过！',
            "<18>{#f/0}我会引导你\n离开这里。"
        ],
        papyrusFinal4c2: [
            '<18>继续前进。',
            '<18>等你到首塔的时候，\n跳进一艘飞船，穿过{@fill=#ff0}力场{@fill=#fff}。',
            "<18>{#f/4}那就是把我们\n困在前哨站的东西。",
            '<18>力场谁都进得来，\n但都出不去...',
            '<18>{#f/9}...除非，那个人拥有\n强大的灵魂。',
            '<18>{#f/0}就比如你！！！'
        ],
        papyrusFinal4d: [
            '<18>{#f/4}哦，我差点忘了说...',
            '<18>你要到达出口，\n就必须要通过...',
            '<18>{#f/7}{@fill=#ff0}国王{@fill=#fff}那关。',
            '<18>{@fill=#ff0}所有怪物的王...',
            '<18>{@fill=#ff0}他是...',
            '<18>{@fill=#ff0}{#f/6}...呃...'
        ],
        papyrusFinal4e: [
            "<18>{#f/0}他是个毛茸茸的\n好好先生！！！",
            '<18>大家都很喜欢他。',
            '<18>{#f/4}我很相信，\n只要你跟他说...',
            '<18>“不好意思，\n逐梦先生...\n我可以回家吗？”',
            "<18>{#f/0}他就会亲自带你\n去发射舱的！",
            "<18>{#f/9}总之！！！\n废话少说！！！",
            "<18>{#f/0}我会在家里\n做你酷酷的朋友。"
        ],
        papyrusFinal4f1: ['<18>{#f/9}欢迎过来\n跟我一起玩！！！'],
        papyrusFinal4f2: ['<18>{#f/9}欢迎过来\n跟我约会！！！'],
        papyrusFinal4f3: ['<18>{#f/9}欢迎过来\n跟我打个招呼！！！'],
        papyrusFinal4g: ['<18>捏嘿嘿嘿\n嘿嘿嘿！！！'],
        papyrusFinal5: [
            '<18>{#p/papyrus}{#f/5}哦，那个人类\n到哪里去了呢...',
            '<18>{#f/4}...\n等等。',
            "<18>{#f/1}就在我面前！！！",
            '<18>{#f/0}你好啊！\n我还在担心你\n是不是迷路了呢！',
            "<18>看到你了，我就\n可以松口气了...",
            '<18>{#f/7}...\n等一下！！！',
            "<18>你不应该逃走的！！！",
            '<18>快回来！！！'
        ],
        papyrusFinal6: [
            '<18>{#p/papyrus}{#f/4}又回来了，嗯？',
            "<18>{#f/5}我觉得应该是\n我的问题...",
            '<18>我之前答应过你，\n我会给你做意面。',
            "<18>不用猜，\n你想见我的原因...",
            '<18>肯定是想让我给你\n做点意面。',
            '<18>{#f/0}好... 我懂了。',
            '<18>{#f/0}帕派瑞斯也很饥渴！',
            '<18>{#f/7}对正义的\n如饥似渴！'
        ],
        papyrusFinal7: () => [
            "<18>{#p/papyrus}{#f/1}你又回来了！？！？",
            '<18>{#f/4}我终于知道\n为什么了。',
            '<18>{#f/5}你...',
            '<18>你就是太想\n看到我的脸了...',
            '<18>{#f/6}我...',
            "<18>{#f/31}我不太确定自己\n能不能和抱有这种\n感受的人战斗。",
            "<18>{#f/4}更何况，我已经\n不太想抓你了。",
            '<18>{#f/5}要不然，\n我们就不战斗了...',
            '<18>{#f/5}...我直接放你走。\n怎么样？',
            choicer.create('* （你要怎么回答？）', "放我走吧", "接着打")
        ],
        papyrusFinal7a: ['<18>{#p/papyrus}{#f/31}...\n好...', "<18>{#f/3}我想，我会接受\n我的失败的。"],
        papyrusFinal7b: ['<18>{#p/papyrus}{#f/4}嗯，既然你都\n这样说了，那...', '<18>{#f/9}我就\n奉陪到底！！！'],
        papyrusFinal8: () => [
            '<18>{#p/papyrus}{#f/1}还来？？？',
            '<18>{#f/4}...那，好吧...',
            '<18>{#f/9}你这次要\n放弃战斗吗？？',
            choicer.create('* （你要怎么回答？）', "放我走吧", "接着打")
        ],
        papyrusFinal8a: ['<18>{#p/papyrus}{#f/0}那么，\n咱们开始吧！'],
        puzzle3: () => [
            '<32>{#p/human}* （你激活了终端。）',
            '<32>{#p/basic}* 屏幕上显示着一条历史修改记录。',
            world.edgy
                ? '<32>* “最新图案修改者：艾菲斯”'
                : '<32>* “最新图案修改者：\n   酷炫骷髅95”',
            ...(!world.goatbro || SAVE.flag.n.genocide_milestone < 5 || SAVE.flag.n.ga_asrielAlphysCom1++ > 0
                ? []
                : ["<25>{#p/asriel2}{#f/13}* 她真是没完没了地为难我们..."]),
            '<32>{#p/basic}* “要看一眼图案吗？”',
            choicer.create('* （看一眼图案吗？）', '看一眼', '算了')
        ],
        robotx: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （机器人看起来已经睡着了。）']
                : ["<32>{#p/basic}* 它进入了“休眠”模式。"],
        robot1: pager.create(
            0,
            () => [
                '<32>{#p/basic}* 你好，心地善良的旅行者。\n* 我是一个建筑机器人。',
                '<32>* 我想去看看整个星系...\n* 但是我动弹不得。',
                '<32>* 如果你愿意帮助我的话...',
                '<32>* 就带上我的一块芯片吧，\n  带它去一个很远很远的地方。',
                choicer.create('* （拿走一块芯片？）', '拿走', '算了')
            ],
            () => [
                '<32>{#p/basic}* 心地善良的旅行者，\n  如果你愿意帮助我的话...',
                '<32>* 就带上我的一块芯片吧，\n  带它去一个很远很远的地方。',
                choicer.create('* （拿走一块芯片？）', '拿走', '算了')
            ]
        ),
        robot2: () => [
            '<32>{#p/basic}* 谢谢你... 祝你好运！',
            '<32>{#s/equip}{#p/human}* （你得到了“芯”型薯片。）',
            ...(world.goatbro && SAVE.flag.n.ga_asriel98++ < 1
                ? [
                    "<25>{#p/asriel2}{#f/9}* 嘿，真是个\n  可爱又天真的小东西。",
                    "<25>{#p/asriel2}{#f/13}* 天真到对自己的命运\n  一无所知。"
                ]
                : [])
        ],
        robot3: ['<32>{#p/basic}* 看起来你还没有给我预留足够的空间。'],
        robot4: () => [
            '<32>{#p/basic}* 好吧。\n* 那么，祝你旅途愉快。',
            ...(world.goatbro && SAVE.flag.n.ga_asriel98++ < 1
                ? [
                    "<25>{#p/asriel2}{#f/9}* 嘿，真是个\n  可爱又天真的小东西。",
                    "<25>{#p/asriel2}{#f/13}* 天真到对自己的命运\n  一无所知。"
                ]
                : [])
        ],
        robot5: () => [
            '<32>{#p/basic}* 谢谢你照顾我。',
            ...(world.goatbro && SAVE.flag.n.ga_asriel99++ < 1
                ? ["<25>{#p/asriel2}{#f/4}* 行了，这些芯片应该够用了。"]
                : [])
        ],
        robot6: () => [
            '<32>{#p/basic}* 近况如何？\n* 我是说，我那块芯片近况如何...',
            '<32>* 啊？你把它弄丢了...？\n* ...那我再给你一块吧...',
            choicer.create('* （再拿走一块芯片？）', '拿走', '算了')
        ],
        robot7: [
            '<32>{#p/basic}* 这次小心点。别弄丢了。',
            '<32>{#p/human}{#s/equip}* （你得到了“芯”型薯片。）'
        ],
        robot8: ['<32>{#p/basic}* 我理解的。\n* 祝你旅途愉快...'],
        robot9: () => [
            '<32>{#p/basic}* 谢谢你... 照顾我...',
            ...(world.goatbro && SAVE.flag.n.ga_asriel99++ < 1
                ? ["<25>{#p/asriel2}{#f/4}* 行了，这些芯片应该够用了。"]
                : [])
        ],
        robot10: [
            '<32>{#p/basic}* 芯片还好吗？',
            '<32>* 啊？又弄丢了...？',
            "<32>* 对不起...\n* 我要是再给你芯片的话，\n  就什么都不剩了。",
            '<32>* 看来我只能认命。\n* 想到去不了的地方，\n  终究只是幻想。',
            "<32>* 对所有怪物都一样。",
            '<32>* 怪物们注定要永远困在这里，\n  度过余生...'
        ],
        robot11: ['<32>{#p/basic}* 我真傻，为啥之前那么轻易\n  就把心掏给你呢？'],
        robot12: ['<32>{#p/basic}* 滚！'],
        sans1: [
            '<99>{#p/darksans}{#i/8}* {@spacing=4/0}{#i/x2}人类。',
            "<99>* {@spacing=4/0}难道你不知道{@spacing=}\n  {@spacing=4/0}怎么和新朋友{@spacing=}\n  {@spacing=4/0}打招呼吗？",
            '<99>* {@spacing=4/0}转过身来{@spacing=}\n  {@spacing=4/0}和我握手。'
        ],
        sans2: () => [
            ...(world.edgy
                ? [
                    "<25>{#p/sans}{#f/0}* 嘿，干嘛露出这种表情？",
                    "<25>{#p/sans}{#f/2}* ...不喜欢放屁垫的把戏吗？",
                    '<25>{#f/0}* ...没关系，人各有志嘛。'
                ]
                : ["<25>{#p/sans}{#f/4}* 嘿嘿...\n  放屁垫把戏真是\n  咋玩都不腻。"]),
            "<25>{#f/0}* 总之，你是个人类，对吧？",
            "<25>{#f/5}* 真酷。",
            "<25>{#f/0}* 我是衫斯。\n* 骷髅衫斯。",
            '<25>{#f/3}* 作为一名皇家哨兵，\n  现在我本该抓捕人类的。',
            "<25>{#f/4}* 不过呢...",
            ...(world.edgy
                ? [
                    "<25>{#f/3}* 今天，我没心思干这事。",
                    '<25>{#f/0}* 但我有个兄弟...',
                    "<25>{#f/5}* 他对抓人类这事\n  可是热情满满。",
                    '<25>{#f/0}* 所以，为了能让他\n  安心在家待着...\n  我整整费了三辈子工夫。'
                ]
                : [
                    "<25>{#f/2}* 我有别的事要去忙。",
                    '<25>{#f/0}* 但我有个兄弟...',
                    '<25>{#f/5}* 虽然他还只是个预备哨兵，\n  但他的举止已经超像一个\n  正式哨兵了。',
                    "<25>{#f/0}* 前面站着的，\n  应该就是他了。"
                ]),
            '<25>* 我有个主意。\n* 跳过那个空隙。',
            '<26>{#f/4}* 别怕，直接跳过去就行。\n* 我兄弟把重力设得很小，\n  肯定掉不下去。'
        ],
        sans3: () =>
            world.edgy
                ? [
                    '<25>{#p/sans}* 到了。',
                    "<25>{#f/3}* 不过...\n  现在我没啥想给你看的。",
                    "<25>{#f/2}* 我先在这待一会。",
                    "<25>{#f/0}* 等你再往前走走，\n  说不定我就有灵感了。"
                ]
                : ['<25>{#p/sans}* 快，到重力转换器\n  那里去。'],
        sans4: ["<25>{#p/sans}* 咋的了，哥们？"],
        sans5: [
            '<18>{#p/papyrus}{#x2}{#f/7}你说“咋的了”，\n兄弟！',
            '<18>你还有谜题要准备！',
            "<18>我明明给了你\n很多余地，但...",
            '<18>你还是整天无所事事！',
            "<18>即使是现在，你还是在！",
            '<18>无所事事！',
            "<25>{#p/sans}* 实际上，我在摆弄这个\n  重力的玩意呢。",
            "<25>* 这个东西真的很酷的。",
            '<25>{#f/4}* 你要来看看吗？',
            "<18>{#p/papyrus}{#x3}{#f/7}不！！\n我才没时间看呢！！",
            '<18>{#x2}要是有人类从这经过，\n我得做好准备！',
            '<18>我必须会！\n我一定会！',
            '<18>{#x1}{#f/9}最终抓到一个人类！',
            '<18>{#x4}{#f/0}那时候，我，\n伟大的帕派瑞斯...',
            '<18>会得到我应得的一切！',
            '<18>尊重...\n认可...',
            '<18>{#f/9}我就终于可以加入\n皇家卫队了！',
            '<25>{#p/sans}* 嗯...',
            '<25>{#f/2}* 没准这个玩意可以\n  帮到你呢。',
            "<18>{#p/papyrus}{#x3}{#f/7}衫斯，那根本没用！\n你这个懒骨头！",
            '<18>{#x1}{#f/5}你明明知道，\n你能做的远不止这些，\n但是...',
            '<18>{#x2}{#f/7}你还是选择\n整天无所事事！',
            "<18>{#x1}{#f/5}难道你不想让生活...\n更充实点吗？",
            "<25>{#p/sans}* 嘿，放轻松点。\n* 我虽然懒得活动筋骨，\n  但脑袋里可充实得很呢。",
            "<25>{#f/4}* 你甚至可以说我...",
            '<25>{#f/2}* 早已{@fill=#ff0}星{@fill=#fff}怀远志了？'
        ],
        sans6: [
            '<18>{#p/papyrus}{#x3}{#f/7}衫斯！！',
            "<25>{#p/sans}{#f/5}* 拜托。\n* 你明明笑了。",
            '<18>{#p/papyrus}{#x2}{#f/7}我确实笑了，\n但我讨厌这样！',
            '<18>{#x1}{#f/4}（唉...）',
            '<18>{#f/5}为什么像我这样\n伟大的人...',
            '<18>为了得到认可\n需要做这么多破事？？',
            '<25>{#p/sans}* 嘿，别伤心嘛...',
            '<25>* 遇到困难，\n  负{@fill=#ff0}重力{@fill=#fff}争才能致远嘛。'
        ],
        sans7: [
            '<18>{#p/papyrus}{#x2}{#f/7}呃！！',
            '<18>{#x1}{#f/4}我去专心准备谜题了...',
            '<18>{#f/7}至于你的工作？',
            '<18>{#f/4}我希望你\n从现在起...',
            '<18>{#f/9}专注于你的\n{@fill=#ff0}星{@fill=#fff}工作上！！！',
            '<18>{#f/0}捏嘿嘿嘿嘿嘿\n嘿嘿嘿嘿嘿嘿！！'
        ],
        sans8: ['<18>{#p/papyrus}嘿！'],
        sans9: ['<25>{#p/sans}* 好了，是时候把你\n  弄下来了。'],
        sans10: [
            '<25>{#p/sans}{#f/0}* 嘿，对了...\n* 走之前，我得跟你说...',
            "<25>{#f/3}* 皇家卫队正在找你呢。",
            "<25>{#f/0}* 不过你别担心。\n* 他们拿得出手的只有狗狗。",
            "<25>{#f/0}* 你既然是人类，\n  那肯定知道狗狗\n  喜欢什么，对吧？",
            "<25>{#f/2}* 它们和帕派瑞斯差不多，\n  人畜无害。"
        ],
        sansbook0: ['<32>{#p/human}* （看来这本笑话书\n  不会有明确的结局了。）'],
        sansbook1: ['<32>{#p/basic}* 这是本关于非欧几何的书。\n* 写着“艾菲斯”的名字。'],
        sansbook2: () => [choicer.create('* （要看一眼里面吗？）', '看一眼', '算了')],
        sansbook3: ['<32>{#p/human}* （你往书里面看...）'],
        sansbook4: ['<32>{#p/basic}* 几何学书里面夹着一本\n  笑话书。'],
        sansbook5: ['<32>{#p/basic}* 笑话书里面夹着\n  另一本几何学书。'],
        sansbook6: ['<32>{#p/basic}* 几何学书里面夹着\n  另一本笑话书。'],
        sansbook7: ["<32>{#p/basic}* 是另一本几何学书。"],
        sansbook8: ["<32>{#p/basic}* 是另一本笑话书。"],
        sansbook9: ['<32>{#p/human}* （你决定先不看了。）'],
        sansbook10: () => [
            "<32>{#p/basic}* 这是衫斯留的字条。",
            '<32>{#p/without}* “这么认真干什么？”\n* “这就只是个烂笑话。”',
            '<33>{#p/without}* “呵...”',
            '<33>{#p/without}* “别看得太入迷了。”',
            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...这是我见识过的\n  最烂的笑话。'])
        ],
        sansinter: {
            s_sans: pager.create(
                0,
                () =>
                    world.edgy
                        ? ["<25>{#p/sans}* 咋了？"]
                        : [
                            "<25>{#p/sans}* 你想过没，要不了多久，\n  帕派瑞斯就回来了。",
                            "<25>{#f/4}* 我要是你，\n  就直接开溜了...",
                            "<25>{#f/2}* 不然，我就要跟你\n  来场“站逗”了。"
                        ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/3}* 真是太遗憾了...',
                            '<25>{#p/sans}{#f/2}* 这会儿，我兄弟正忙着做\n  我布置的数独习题集呢。',
                            "<25>{#p/sans}* 要是他在这，\n  就有一篓子事情等着咱们了。"
                        ]
                        : [
                            "<25>{#p/sans}* 你瞧，\n  没什么好害怕的。",
                            "<25>{#f/2}* 帕派瑞斯看起来吓人，\n  但他会是你见过的\n  最好的家伙的。"
                        ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}* 咋的？\n* 想让我把他带过来？',
                            "<25>{#f/3}* 呵，小子。\n* 你是不是没明白\n  我刚说的是啥意思？",
                            "<25>{#p/sans}{#f/2}* 听我句劝：\n  最好别得寸进尺，\n  对你我都好。"
                        ]
                        : ['<25>{#p/sans}* 信我的。'],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 别给脸不要脸。",
                            '{*}{#s.resume}{%}'
                        ]
                        : ['<25>{#p/sans}* 信我的。'],
                () => (world.edgy ? [] : ['<25>{#p/sans}* 信我的。'])
            ),
            s_papyrus: pager.create(
                0,
                [
                    "<25>{#p/sans}* 嘿，有件事你得记一下。\n  挺重要的。",
                    '<25>* 我兄弟会一种很\n  {@fill=#00a2e8}特殊的攻击{@fill=#fff}。',
                    "<25>* 如果看到了{@fill=#ff993d}橙色攻击{@fill=#fff}，\n  你如果不动，就会受伤。",
                    "<25>{#f/3}* 有种简单的方式\n  可以帮助你记住。",
                    "<25>{#f/0}* 想象一下烧红的煤炭。\n* 你肯定不会站在\n  那种东西上吧？",
                    '<25>* 煤炭质地比较坚硬。\n* 所以不妨换成骨质煤炭来想。',
                    '<25>{#f/2}* 非常简单，对吧？\n* 记得战斗的时候想想\n  烧红的骨质煤炭吧。'
                ],
                [
                    "<25>{#p/sans}{#f/0}* 当然，你如果缓慢移动\n  是不会受伤的。",
                    '<25>{#f/0}* 只要保持移动就可以。',
                    "<25>{#f/2}* 肯定会有人\n  比我解释得更好的。"
                ],
                ['<25>{#p/sans}{#f/2}* 记住...\n* 烧红的骨质煤炭。']
            ),
            s_dogs: pager.create(
                0,
                [
                    "<25>{#p/sans}* 鉴于你是人类，\n  你应该从来没有听说过\n  T.M.D.这个东西吧。",
                    '<25>{#f/2}* 那是“突变·脉冲·对流层”\n  技术的缩写。'
                ],
                [
                    '<25>{#p/sans}* 如果T.M.D.出现问题，\n  我们周围的空气\n  就会消失不见。',
                    "<25>{#f/3}* 不过别担心。\n* 我刚才说的那些，\n  从来就不曾{@fill=#ff0}粗{@fill=#fff}现过。"
                ],
                ['<25>{#p/sans}{#f/2}* 突变脉冲对流层技术。']
            ),
            s_jenga: pager.create(
                0,
                [
                    '<25>{#p/sans}* 实际上，\n  早些时候的那份意面...',
                    "<25>{#f/3}* 对我兄弟来说\n  还算好的。",
                    "<25>{#f/0}* 自从他开始上烹饪课，\n  他已经进步很多了。",
                    "<25>{#f/4}* 我敢说如果他坚持下去，\n  他甚至会惊艳到国王。"
                ],
                () =>
                    world.edgy || world.killed5
                        ? ['<25>{#p/sans}{#f/2}* 这绝对是让他远离\n  你的好方法。']
                        : ["<25>{#p/sans}{#f/2}* ...那个对意面\n  异常痴迷的男人。"]
            ),
            s_bridge: pager.create(
                0,
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/0}* 希望你喜欢\n  我最后布置的谜题。',
                            '<25>{#f/3}* 时间比较紧，但帕派瑞斯\n  坚持让我设计好谜题，\n  我还是照做了。'
                        ]
                        : world.killed5
                            ? [
                                "<25>{#p/sans}{#f/3}* 我听说，\n  这里的怪物都四散而逃了...",
                                "<25>{#f/0}* 奉劝你最好小心点，\n  别把小命丢了。"
                            ]
                            : [
                                "<25>{#p/sans}{#f/3}* 不知道我兄弟\n  现在又要去干啥。",
                                '<25>{#f/0}* 我觉得，你可以趁这会\n  复习一下{@fill=#ff993d}橙色攻击{@fill=#fff}。'
                            ],
                () =>
                    world.edgy
                        ? [
                            '<25>{#p/sans}{#f/0}* 怎么？\n* 怪我不好好设计谜题？',
                            "<25>{#f/3}* 我还得一边应付你，\n  一边花时间准备谜题。\n* 能弄好就怪了。"
                        ]
                        : world.killed5
                            ? [
                                '<25>{#p/sans}{#f/0}* 我好歹有亲兄弟\n  愿意无条件关心我，支持我。',
                                "<25>{#f/2}* 而你..."
                            ]
                            : ['<25>{#p/sans}{#f/2}* 哦，顺带再复习下{@fill=#00a2e8}蓝色攻击{@fill=#fff}。'],
                () =>
                    world.edgy
                        ? ['<25>{#p/sans}{#f/3}* 就是这样。']
                        : world.killed5
                            ? ['<25>{#p/sans}{#f/0}* 我说错了？']
                            : ['<26>{#p/sans}{#f/0}* 还有其他攻击。']
            )
        },
        sansbredgey: () =>
            world.edgy
                ? 6 <= world.population
                    ? [
                        '<25>{#p/sans}* 对了...',
                        "<25>* 我知道，\n  之前待你有些不周...",
                        '<25>{#f/3}* 很高兴你愿意\n  做个更善良的人。',
                        '<25>{#f/2}* 坚持下去，好吗？'
                    ]
                    : world.bullied
                        ? [
                            '<25>{#p/sans}* 对了...',
                            "<25>* 我知道，你还在继续\n  伤害怪物，威胁他们的生命...",
                            '<25>{#f/3}* 但至少，你没有\n  放任自流，屠杀殆尽。',
                            "<25>{#f/2}* 挺好的，是吧？"
                        ]
                        : [
                            '<25>{#p/sans}* 对了...',
                            '<25>* 你要是不小心\n  遇到了我的兄弟...',
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 敢动他一下试试。",
                            '{*}{#s.resume}{%}'
                        ]
                : 6 <= world.population
                    ? [
                        '<25>{#p/sans}* 对了...',
                        "<25>* 我知道我兄弟\n  有时候蠢蠢的...",
                        "<25>{#f/3}* 谢谢你愿意配合\n  他那些疯狂的计划。",
                        "<25>{#f/2}* 你真的很棒。"
                    ]
                    : world.bullied
                        ? [
                            '<25>{#p/sans}* 对了...',
                            "<25>* 我知道，你在伤害怪物，\n  威胁他们的生命...",
                            '<25>{#f/3}* 但至少，你没有\n  放任自流，屠杀殆尽。',
                            "<25>{#f/2}* 挺好的，是吧？"
                        ]
                        : [
                            '<25>{#p/sans}* 对了...',
                            '<25>* 你要是不小心\n  遇到了我的兄弟...',
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 敢动他一下试试。",
                            '{*}{#s.resume}{%}'
                        ],
        sentryPapyrus1: pager.create(
            0,
            () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这个哨站上的文字预示着\n  它的创造者将来的名声。）']
                    : [
                        "<32>{#p/basic}* 纸壳箱上写着几句话。",
                        ...(world.genocide || world.runaway
                            ? [
                                '<23>{#p/papyrus}{#f/30}“求你不要毁掉我的哨站。”',
                                '<23>“我费了好大功夫才搭好它，\n要是它垮了，我会很伤心的。”',
                                '<23>“...此致，\n帕派瑞斯。”',
                                '<23>（“注：我还想再写点，\n但是没地方了。”）'
                            ]
                            : [
                                '<23>{#p/papyrus}{#f/30}“你仔细打量眼前这个\n精心制作的哨站，心想...”',
                                '<23>“是哪位能工巧匠，\n才能做出这样的哨站呢？”',
                                '<23>“我敢说，肯定是出自那个\n超-有名的皇家守卫之手！”',
                                SAVE.data.n.plot === 72
                                    ? '<32>{#p/basic}* 最后一行被划掉了。'
                                    : '<23>（“注：现在还暂时没当上\n  超有名的皇家守卫。”）',
                                ...(SAVE.data.n.plot < 19 && !(world.edgy || world.killed5 || world.population < 6)
                                    ? [
                                        "<25>{#p/sans}{#f/0}* 在欣赏我兄弟的手工成果，\n  是吗？",
                                        "<25>{#p/sans}{#f/2}* 我知道的。\n* 真的很酷。"
                                    ]
                                    : [])
                            ])
                    ],
            () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这个哨站上的文字预示着\n  它的创造者将来的名声。）']
                    : [
                        "<32>{#p/basic}* 纸壳箱上写着几句话。",
                        ...(world.genocide || world.runaway
                            ? [
                                '<23>{#p/papyrus}{#f/30}“求你不要毁掉我的哨站。”',
                                '<23>“我费了好大功夫才搭好它，\n要是它垮了，我会很伤心的。”',
                                '<23>“...此致，\n帕派瑞斯。”',
                                '<23>（“注：我还想再写点，\n但是没地方了。”）'
                            ]
                            : [
                                '<23>{#p/papyrus}{#f/30}“你仔细打量眼前这个\n精心制作的哨站，心想...”',
                                '<23>“是哪位能工巧匠，\n才能做出这样的哨站呢？”',
                                '<23>“我敢说，肯定是出自那个\n超-有名的皇家守卫之手！”',
                                SAVE.data.n.plot === 72
                                    ? '<32>{#p/basic}* 最后一行被划掉了。\n* 正该如此。'
                                    : '<23>（“注：现在还暂时没当上\n  超有名的皇家守卫。”）'
                            ])
                    ]
        ),
        sentryPapyrus2: pager.create(0, () => [
            '<32>{#p/human}* （你往桌板下面看了一眼...）',
            ...(SAVE.data.b.svr
                ? [
                    [
                        "<25>{#p/asriel1}{#f/17}* 那是帕派瑞斯\n  存放他所有古怪东西的地方。",
                        '<25>{#f/20}* 晚上是战士，\n  ...也是一名工匠。'
                    ],
                    [
                        '<26>{#p/asriel1}{#f/13}* 在某条时间线，\n  我曾鼓励过帕派瑞斯去\n  皇家实验室应职。',
                        
                        '<25>{#f/17}* 但他还是我行我素... \n  致力于自己的小科研\n  而无心出岫。',
                        "<25>{#f/13}* 帕派瑞斯他真的好像进入了\n  一种超凡脱俗的境界。"
                    ],
                    [
                        '<26>{#p/asriel1}{#f/13}* 帕派瑞斯曾创造出\n  一把存在于传说中的\n  名为“鹤嘴斧”的工具。',
                        '<25>{#f/17}* 一件多功能工具，\n  可以斩断任何材料。',
                        '<25>{#f/15}* 其耐久度为...\n  永不磨损。',
                        '<25>{#f/13}* 但他却把它扔掉了，\n  用他自己的话来说...',
                        '<25>{#f/13}* “拥有一个万能工具\n   会使工作失去乐趣！”'
                    ],
                    ['<26>{#p/asriel1}{#f/20}* 所以帕派瑞斯拥有一个\n  独特的思维方式。']
                ][Math.min(asrielinter.sentryPapyrus2++, 3)]
                : ['<32>* 里面堆满了一箱又一箱未使用过的\n  电缆和过时玩意。'])
        ]),
        sentrySans1: () =>
            SAVE.data.b.svr
                ? ['<32>{#p/human}* （你觉得\n  这个哨站的作用微不足道。）']
                : world.darker
                    ? ["<32>{#p/basic}* 一个哨站。"]
                    : SAVE.data.n.plot < 31
                        ? [
                            "<32>{#p/basic}* 衫斯的哨站...",
                            "<32>* 这绝对是皇家守卫\n  最值得的投资。"
                        ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* 衫斯的哨站...", "<32>* 这项投资的质量一点都没有改变。"]
                            : ["<32>{#p/basic}* 衫斯的哨站...", '<33>* 事后看来，这真是\n  一项糟糕的投资。'],
        sentrySans2: pager.create(
            0,
            () => [
                '<32>{#p/human}* （你往桌板下面看了一眼...）',
                ...(SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/15}* 当我还是星星时，\n  总有一些黑暗的角落\n  是我不敢去探索的。',
                            "<25>{#f/20}* 所以，\n  一些阴暗的角落\n  我们最好视而不见。"
                        ],
                        ['<25>{#p/asriel1}{#f/20}* 求你了，\n  你想去任何地方都行\n  就是别来这里可以吗？']
                    ][Math.min(asrielinter.sentrySans2++, 1)]
                    : world.edgy
                        ? ["<32>{#p/basic}* 除了一支红蜡笔外，什么都没有。"]
                        : ['<32>{#p/basic}* 这里储存了几瓶蜂蜜，\n  阿尔弗雷多面酱，\n  以及雅莫万能酱。'])
            ],
            () => [
                '<32>{#p/human}* （你往桌板下面看了一眼...）',
                SAVE.data.b.svr
                    ? '<25>{#p/asriel1}{#f/20}* 求你了，\n  你想去任何地方都行\n  就是别来这里可以吗？'
                    : world.edgy
                        ? "<32>{#p/basic}* 那是令人不安的警示。"
                        : "<32>{#p/basic}* 里面存放着无穷无尽的食物佐料。"
            ]
        ),
        whew1: () =>
            [
                ['<32>{#p/basic}* 狗窝上覆盖着\n  烦人的白毛。'],
                ['<32>{#p/basic}* 和帕派瑞斯打了两架后，\n  你有点累了，但还不至于倒头就睡。'],
                [
                    '<32>{#p/basic}* 连着战斗三次后，你精疲力尽了。',
                    choicer.create('* （你该怎么办？）', '不睡', '睡觉')
                ],
                [
                    '<32>{#p/basic}* 接连的战斗使你精疲力尽了。',
                    choicer.create('* （你该怎么办？）', '不睡', '睡觉')
                ]
            ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 3)],
        whew2: ['<32>{#p/human}* （你没动狗窝。）'],
        whew3: ['<32>{#p/human}* （你睡在了狗窝里...）'],
        whew4: [
            "<32>{#p/alphys}* 那人真在这里？",
            '<32>{#p/sans}{#f/7}* 嗯。\n* 我兄弟说的，千真万确。',
            '<32>{#p/alphys}* 好-好吧...\n* 那我看看...',
            '<32>{#p/human}* （门开的声音。）',
            '<32>{#p/alphys}* ...',
            '<32>{#p/alphys}* 哦，还真在这里。',
            "<32>{#p/sans}{#f/7}* 嘿，咱们动作得快。",
            "<32>{#p/sans}{#f/7}* 说不定哪一会\n  安黛因就发现了。",
            '<32>{#p/alphys}* 我-我已经尽快了！'
        ],
        whew5: [
            '<32>{#p/human}* （你感觉有人正努力\n  把你扛起来。）',
            '<32>{#p/alphys}* 天哪，为-为什么人类\n  都这么重啊？！'
        ],
        whew6: [
            '<32>{#p/basic}* 嗯？\n* 我们这是到...',
            "<32>* ...艾斯戈尔家了。",
            "<32>* 来吧，\n  我们一起去找他..."
        ],
        trivia: {
            s_bbox: ["<32>{#p/basic}* 这是个休眠舱。\n* 有个人类在里头..."],
            
            ogkxsaucer: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你把手伸进喷酱机深处。）\n* （感觉有点不礼貌。）"]
                    : ["<32>{#p/basic}* 某种型号的喷酱机。"],
            mousehole: () =>
                [
                    ["<32>{#p/basic}* 这是一个老鼠洞。\n* 里面的老鼠正在讨论\n  你们之间的大战。"],
                    ["<32>{#p/basic}* 这是一个老鼠洞。\n* 里面的老鼠正在\n  担心你的安危。"],
                    ["<32>{#p/basic}* 这是一个老鼠洞。\n* 里面的老鼠想让你休息一下。"],
                    ["<32>{#p/basic}* 这是一个老鼠洞。\n* 里面的老鼠担心你会神志不清。"]
                ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 3)],
            lamppost: pager.create(
                2,
                ...[
                    ["<32>{#p/basic}* 一盏“弹”灯。"],
                    ['<32>{#p/basic}* 一盏很弹很弹的灯。'],
                    ['<32>{#p/basic}* 如此弹。\n* 如此灯。'],
                    ['<32>{#p/basic}* 灯，弹，灯，弹...'],
                    ['<32>{#p/basic}* 弹灯上下跳动着。'],
                    ['<32>{#p/basic}* ...弹动永不停歇。'],
                    ["<32>{#p/basic}* 所谓“永不停歇”，大抵如此。"]
                ].map(
                    lines => () =>
                        SAVE.data.b.svr
                            ? ['<32>{#p/human}* （你注视着奇怪的灯上下弹跳。）']
                            : world.darker
                                ? ['<32>{#p/basic}* 只是盏灯。']
                                : lines
                )
            ),
            ntower: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/13}* 我觉得艾菲斯大概\n  永远不会修理这个了。',
                            "<25>{#f/16}* 当然我不怪她。\n* 毕竟这东西的规则\n  简直像个噩梦。",
                            '<25>{#f/20}* 同样的，\n  运行这个谜题也需要衫斯。',
                            '<25>{#f/15}* 不过让他参与这个谜题... \n  估计不太可能。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/17}* 对... 衫斯...\n* 风趣横生，但不咋活跃。',
                            '<25>{#f/13}* 不咋“活跃”，\n  自然代表“身体”的不活跃。',
                            "<25>{#f/15}* 而“身体”不活跃，\n  意思就是说\n  他几乎不咋“移动”。",
                            '<25>{#f/16}* 最后不咋“移动”，\n  就是说他从头到晚\n  都不会起来走一步路。',
                            '<25>{#f/13}* 是的。\n* 除了他走捷径的时候。',
                            '<25>{#f/15}* 对于这个装置，\n  我是一点都不知道\n  它是怎么运作的。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 我猜你会说\n  艾菲斯不去修这个谜题的\n  理由是...？",
                            '<25>{#f/20}* 如果真去修，那她肯定\n  有个小捷径可以跳过\n  这个谜题。'
                        ],
                        ['<25>{#p/asriel1}{#f/20}* ...也许我的幽默感\n  有待提高。']
                    ][Math.min(asrielinter.ntower++, 3)]
                    : SAVE.data.b.s_state_puzzlenote || (!world.genocide && world.edgy)
                        ? ["<32>{#p/basic}* 装置没激活。"]
                        : postSIGMA()
                            ? ["<32>{#p/basic}* 不能使用了。"]
                            : ['<32>{#p/basic}* 真倒霉。'],
            s_secret_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上提到了\n  某件事物的逃逸。）']
                    : SAVE.data.n.state_starton_trashprogress < 2 && SAVE.data.n.plot < 72
                        ? [
                            '<32>{#p/basic}* “正在小憩。”',
                            ...(world.goatbro && SAVE.flag.n.ga_asrielDog++ < 1 ? ['<25>{#p/asriel2}{#f/15}* 什么鬼。'] : [])
                        ]
                        : ['<32>{#p/basic}* “逃走了。”'],
            grillflower: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （看起来这株植物\n  确实很像霓虹灯。）']
                    : world.darker
                        ? ["<32>{#p/basic}* 一株植物。"]
                        : [
                            "<32>{#p/basic}* 这不仅仅是一株植物...\n* 这是一株霓虹植物。",
                            '<32>* 这有什么区别吗？\n* 没有，完全没有。'
                        ],
            librarbywindow1: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （但这里没啥有趣的。）']
                    : ["<32>{#p/basic}* 窗户里面有一株植物。\n* 真有趣。"],
            librarbywindow2: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你够到了窗户边缘，\n  并将双手搭在了窗户上。）']
                    : ["<32>{#p/human}* （你够到了窗户边缘，\n  并将双手搭在了窗户上。）\n* （但你看不见里面的任何东西。）"],
            papwindow: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你往窗户里面看，\n  看起来没人在家。）"]
                    : SAVE.data.n.plot_date > 0 && SAVE.data.n.plot_date < 1 && SAVE.data.n.plot < 71.2
                        ? ['<32>{#p/basic}* ...看起来帕派瑞斯\n  正在耐心地等着你。']
                        : ["<32>{#p/basic}* ...看来没人在家。"],
            s_puzzlenote: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这张便条记述了\n  关于这个复杂挑战的规则。）']
                    : SAVE.data.b.s_state_puzzlenote
                        ? ["<33>{#p/basic}* 难以辨认的狗爬字。"]
                        : [],
            s_backrooms_lessdog: () =>
                SAVE.data.b.svr
                    ? [
                        "<32>{#p/human}* （你抚摸着一只想象出来的狗。）\n* （它似乎对此很享受。）",
                        ...[
                            ['<25>{#p/asriel1}{#f/13}* 弗里斯克，你在干啥？'],
                            ["<25>{#p/asriel1}{#f/13}* 弗里斯克，这里什么都没有。"],
                            ['<25>{#p/asriel1}{#f/15}* ...你还好吗？'],
                            ['<25>{#p/asriel1}{#f/15}* ...']
                        ][Math.min(asrielinter.s_backrooms_lessdog++, 3)]
                    ]
                    : SAVE.data.n.state_starton_lesserdog === 2 || (world.population === 0 && !world.bullied)
                        ? ['<32>{#p/basic}* ...但是谁也没有来。']
                        : world.runaway || world.population === 0
                            ? ['<32>{#p/basic}* ...但是大家都逃走了。']
                            : SAVE.data.n.plot < 72
                                ? ["<32>{#p/basic}* 它正在跟自己玩一种\n  扑克牌游戏。", '<32>* 感觉它要输了...']
                                : [
                                    "<32>{#p/basic}* 它正在跟自己玩一种\n  扑克牌游戏。",
                                    '<32>* 不知为何，它好像要赢了...？'
                                ],
            s_backrooms_lesstable: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你想知道人类是否可以吃狗粮。）']
                    : ["<32>{#p/basic}* 桌上放了一副4D扑克牌，\n  还有免费狗粮。"],
            s_beddinng_table: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你瞥了一眼桌子。）\n* （然后你移开了目光。）']
                    : ['<32>{#p/basic}* 必备之桌。\n* 虽无所用，却恰得其所。'],
            s_bh_bone: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你欣赏着这幅\n  极简主义画的工艺。）']
                        : [
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}一幅经典的绘画。',
                                    "<18>它总能让我想起\n我人生中最重要的东西。"
                                ]
                                : []),
                            "<32>{#p/basic}* 这是一幅极简主义的\n  卡通骨头画。"
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你欣赏着这幅\n  极简主义画的工艺。）']
                        : ["<32>{#p/basic}* 这是一幅极简主义的\n  卡通骨头画。"]
            ),
            s_bh_cottonball: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* (你对附着在棉球上的便条\n  上的内容毫不感到惊讶。）'
                    ]
                    : [
                        "<32>{#p/basic}* 这是个脏脏的棉球，\n  上面附着好几张便条。",
                        '<23>{#p/papyrusnt}“衫斯！”\n“把你的棉球捡起来！”',
                        '<32>{#p/without}* “好的。”',
                        '<23>{#p/papyrusnt}“别把它放回去！”\n“把它挪走！”',
                        '<32>{#p/without}* “好的。”',
                        '<23>{#p/papyrusnt}“你就挪了两微米！”\n“把它拿回你的房间！”',
                        '<32>{#p/without}* “好的。”',
                        '<23>{#p/papyrusnt}“不要再把它拿回来了！”',
                        '<32>{#p/without}* “好的。”',
                        '<23>{#p/papyrusnt}“它还在这！”',
                        '<32>{#p/without}* “你刚才不是说，\n   不要把它拿回我的房间吗？”',
                        '<23>{#p/papyrusnt}“算了！”'
                    ],
            s_paptrash: pager.create(
                0,
                ...[
                    () => [
                        ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                            ? [
                                "<18>{#p/papyrus}{#f/9}我都不知道你还\n喜欢捡垃圾！",
                                '<18>{#f/0}艾菲斯博士会\n对你很感兴趣的。'
                            ]
                            : []),
                        world.darker ? "<32>{#p/basic}* 一个垃圾桶。" : '<32>{#p/basic}* 这是个“闪亮”垃圾桶。'
                    ],
                    pager.create(
                        1,
                        ...[
                            [
                                '<32>{#p/basic}* 之所以说这个垃圾桶“闪亮”，\n  是因为它的一边就写着\n  “闪亮”两个字。'
                            ],
                            ['<32>{#p/basic}* 一个“闪亮”星仔\n  对一个“闪亮”垃圾桶。\n* 你还能有什么想知道的。'],
                            ['<32>{#p/basic}* 小镇这一带中\n  最“闪亮”的垃圾桶。'],
                            ['<32>{#p/basic}* 这么说来，\n  也可以是别的某一带。'],
                            ['<32>{#p/basic}* 它到底有多“闪亮”？'],
                            ['<32>{#p/basic}* 非常？\n* 非常非常？\n* 比别的任何东西都“闪亮”？'],
                            ["<32>{#p/basic}* 我们还有选择的余地，\n  宝贝！"],
                            [
                                '<33>{#p/basic}* 但不管时间如何流逝...\n  这个垃圾桶给你的印象\n  仍然“闪亮”。'
                            ],
                            [
                                '<32>{#p/basic}* 实际上，我越想越觉得，\n  “闪亮”这个形容\n  太浮皮潦草了。'
                            ],
                            ['<32>{#p/basic}* 就比如，也许\n  用“参天”这个词来形容\n  就更适合一点。'],
                            ["<33>{#p/basic}* 实际上，还是算了吧。\n* 这个词还是给皇家实验室的\n  高层留着吧。"],
                            ['<32>{#p/basic}* 嗯...\n* 万一这个垃圾桶是黑洞伪装的呢！'],
                            ['<32>{#p/basic}* 一个黑洞垃圾桶...\n* 你会愿意冒这个险吗？'],
                            ["<32>{#p/basic}* 这问题问得有点怪了。"],
                            [
                                '<32>{#p/basic}* 我觉得你现在就可以说，\n  都是因为这个垃圾桶，\n  我思绪完全“升空”了。'
                            ],
                            ["<32>{#p/basic}* 你甚至可以说，\n  我感觉要... 羽化登仙了。"],
                            ['<32>{#p/basic}* ...\n* 你当我最后一句没说。'],
                            ['<32>{#p/basic}* 实际上，你还是\n  把我说的最后九句全忘了吧。\n  算上这句。'],
                            ["<32>{#p/basic}* 说白了...\n* 这个垃圾桶只能用\n  一个形容词来形容。"],
                            ["<32>{#p/basic}* 你问是什么词？\n* 那，我就告诉你...\n  如果你真的想知道的话。"],
                            ["<32>{#p/basic}* 它不是一个参天的垃圾桶，\n  绝对不是。"],
                            ["<32>{#p/basic}* 从任何角度来看，\n  这也不像是黑洞样式的..."],
                            ["<32>{#p/basic}* 你还记得吗？\n* 你还记得我们是从哪里\n  开始的吗？"],
                            ['<32>{#p/basic}* 那是我对这个垃圾桶\n  说过的第一句话。'],
                            ['<32>{#p/basic}* ...\n* 我说过...\n* 你等一下...'],
                            ['<32>{#p/basic}* 这是个“闪亮”垃圾桶。']
                        ].map(lines => () => world.darker ? ["<32>{#p/basic}* 一个垃圾桶。"] : lines)
                    )
                ].map(
                    p => () =>
                        SAVE.data.b.svr
                            ? ["<32>{#p/human}* （你看不出来垃圾桶里有什么...）"]
                            : CosmosUtils.provide(p)
                )
            ),
            s_bh_fridge: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （冰箱内的食物看起来不错。）']
                        : world.runaway
                            ? ["<32>{#p/basic}* 底部被掏空了。"]
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 哎呦，全是意大利面。']
                                : [
                                    ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                        ? [
                                            '<18>{#p/papyrus}{#f/9}啊哈！\n对我的食物博物馆\n感兴趣了吗？',
                                            '<18>{#f/0}请随意参观我的\n烹饪艺术展。'
                                        ]
                                        : []),
                                    '<32>{#p/basic}* 冰箱的一半都堆满了\n  标有“意大利面”的容器。',
                                    '<32>* 另一半则只放了一瓶橙汁汽水。'
                                ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （冰箱内的食物看起来不错。）']
                        : world.runaway
                            ? ["<32>{#p/basic}* 底部被掏空了。"]
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 哎呦，全是意大利面。']
                                : [
                                    ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                        ? ["<18>{#p/papyrus}不错的冰箱，\n是吧？"]
                                        : []),
                                    '<32>{#p/basic}* 瓶子上写着\n  “艾菲斯”的名字。'
                                ]
            ),
            s_bh_rocktable: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你怀疑这些星尘\n  实际上可以食用。）']
                        : [
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}啊，没错，\n这是餐桌。',
                                    '<18>{#f/5}我们之前养过\n一块月岩...',
                                    '<18>{#f/7}但后来有一天，\n它彻底消失了！',
                                    '<18>{#f/4}最开始，我觉得是\n那只爱管闲事的\n狗干的。',
                                    '<18>{#f/7}但后来我发现，\n是衫斯用它来测试\n他的...',
                                    '<18>{#f/6}他的... 很有用的\n小玩意。\n哇...',
                                    "<18>{#f/0}所以呢，\n给他就给他了吧。",
                                    '<18>{#f/0}他真的在努力去\n做一件事。',
                                    '<18>{#f/4}即使要我们付出\n那块宝贵的月岩的\n代价。',
                                    "<18>{#f/0}是啊！！\n努力总比\n不努力强！！"
                                ]
                                : []),
                            "<32>{#p/basic}* 上面覆盖着\n  可食用的星尘。"
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你怀疑这些星尘\n  实际上可以食用。）']
                        : ["<32>{#p/basic}* 上面覆盖着\n  可食用的星尘。"]
            ),
            s_bh_stove: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                '<25>{#p/asriel1}{#f/13}* 弗里斯克，我想问一下...',
                                '<25>{#f/13}* 你听说过被遗弃的\n  芝士蛋糕的悲剧吗？',
                                '<25>{#f/16}* 就在这个烤盘里，\n  一个甜点被创造出来...',
                                '<25>{#f/3}* 这让烘焙师感到出乎意料。'
                            ],
                            [
                                '<25>{#p/asriel1}{#f/3}* 看，衫斯创造出了一个\n  多么甜蜜的芝士蛋糕啊...',
                                '<25>{#f/4}* 任何尝过这个蛋糕的人，\n  都将对其感到无法自拔。',
                                '<25>{#f/15}* 只要他愿意，\n  他的顾客将会遍布\n  前哨站的任何一个区域。'
                            ],
                            [
                                "<25>{#p/asriel1}{#f/13}* 最后，\n  衫斯知道这将会\n  出尽他兄弟的风头。",
                                "<25>{#f/15}* 而且，仅仅通过\n  制作一个芝士蛋糕\n  也太过分了。",
                                '<25>{#f/16}* 所以，他把它藏起来\n  以避免承担责任。'
                            ],
                            ['<25>{#p/asriel1}{#f/16}* 唉，这就是被遗弃的\n  芝士蛋糕的悲剧。']
                        ][Math.min(asrielinter.s_bh_stove++, 3)]
                        : [
                            "<32>{#p/basic}* 烤箱里有一个\n  空的锡纸盘。",
                            ...(dateready() && SAVE.data.n.state_starton_papyrus === 0
                                ? [
                                    '<18>{#p/papyrus}我兄弟经常\n去外面吃。',
                                    "<18>{#f/4}但最近，他开始\n尝试去“烘焙”\n一些东西了...",
                                    '<18>{#f/5}我猜那个是...\n芝士蛋糕？',
                                    "<18>{#f/6}我不太能确定。"
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            [
                                '<25>{#p/asriel1}{#f/13}* 总的说来，\n  衫斯创造了一个如此甜蜜的\n  芝士蛋糕...',
                                '<25>{#f/16}* 任何尝过这个蛋糕的人，\n  都将对其感到无法自拔。',
                                '<25>{#f/3}* 只要他愿意，\n  他的顾客将会遍布\n  前哨站的任何一个区域。',
                                '<25>{#f/3}* 这个芝士蛋糕，它就像一条...\n  通往成功道路上的捷径。',
                                '<25>{#f/4}* 但是他的兄弟帕派瑞斯\n  是绝对不会批准\n  让其通过的！'
                            ],
                            [
                                "<25>{#p/asriel1}{#f/13}* 最后，\n  衫斯知道这将会\n  出尽他兄弟的风头。",
                                "<25>{#f/15}* 而且，仅仅通过\n  制作一个芝士蛋糕\n  也太过分了。",
                                '<25>{#f/16}* 所以，他把它藏起来\n  以避免承担责任。'
                            ],
                            ['<25>{#p/asriel1}{#f/16}* 唉，这就是被遗弃的\n  芝士蛋糕的悲剧。']
                        ][Math.min(asrielinter.s_bh_stove++, 3)]
                        : ["<32>{#p/basic}* 烤箱里有一个\n  空的锡纸盘。"]
            ),
            s_chew: ["<32>{#p/basic}* 这是一个吱吱作响的咀嚼玩具，\n  标签上写着“特殊攻击”。"],
            s_crossroads_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上提到了\n  关于箱子的众多好处。）']
                    : [
                        '<32>{#p/basic}* “这是一个箱子。”',
                        '<32>* “你可以把物品放进去\n   或者拿出来。”',
                        '<32>* “同样的箱子之后还会出现，\n   不必担心要回来取东西。”',
                        '<32>* “谨上，一个箱子爱好者。”'
                    ],
            s_doghouse: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （这个狗屋的内墙\n  似乎被奇怪的圆圈环绕着。）'
                    ]
                    : SAVE.data.n.state_starton_greatdog === 2
                        ? ['<32>{#p/basic}* 这个狗窝内部一定有很大空间。']
                        : world.genocide || world.edgy || world.darker
                            ? ['<32>{#p/basic}* 小狗窝。']
                            : SAVE.data.n.plot === 72
                                ? ['<32>{#p/basic}* 我觉得这个狗屋\n  里有一个时空隧道。']
                                : ['<32>{#p/basic}* 多么小巧的狗屋啊！', '<32>{#p/basic}* 里头看起来比外边大。'],
            s_doghouse_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你很难理解牌子上的内容。）"]
                    : ['<32>{#p/basic}* “汪汪。”'],
            s_dogs_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子提到了\n  某些气味的危险程度分级。）']
                    : [
                        '<32>{#p/basic}* “气味危险分级”',
                        '<32>* “硅胶的气味 - 机器人”\n* “白色等级。”\n* “也可以变成{@fill=#2f2f2f}黑色{@fill=#fff}等级。”',
                        '<32>* “不可疑的气味 - 小狗”\n* “{@fill=#003cff}蓝色{@fill=#fff}等级。”\n* “在地里打滚的气味。”',
                        world.runaway
                            ? '<32>* “古怪的气味 - 人类”\n* “{@fill=#00c000}绿色{@fill=#fff}等级。”\n* “一旦看到，立马逃跑！”'
                            : SAVE.data.n.plot === 72
                                ? '<32>* “古怪的气味 - 人类”\n* “{@fill=#00c000}绿色{@fill=#fff}等级。”\n* “不惧神明之力。”'
                                : SAVE.data.n.plot < 31
                                    ? '<32>* “古怪的气味 - 人类”\n* “{@fill=#00c000}绿色{@fill=#fff}等级。”\n* “不惜一切代价消灭！”'
                                    : '<32>* “古怪的气味 - 小狗？”\n* “{@fill=#00c000}绿色{@fill=#fff}等级。”\n* “深谙撸狗之道。”'
                    ],
            s_dogstandA: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这个哨站似乎属于一只公狗。）']
                    : player.position.y > 50
                        ? ['<32>{#p/basic}* “他的。”']
                        : ['<32>{#p/basic}* 这里有一本\n  关于蓝灰混搭的花哨毛型杂志。'],
            s_dogstandB: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这个哨站似乎属于一只母狗。）']
                    : player.position.y > 50
                        ? ['<32>{#p/basic}* “她的。”']
                        : ['<32>{#p/basic}* 这里有一本\n  关于钝重型武器的宣传册。'],
            s_dogstandC: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这封信上的文字\n  似乎被忽略了。）']
                    : world.genocide
                        ? [
                            '<32>{#p/basic}* 地板上，是一封写着“果断撤离”的\n  皇家守卫签名信。',
                            '<32>{#p/basic}* 信上的“果”字几乎都被啃掉了...'
                        ]
                        : [
                            '<32>{#p/basic}* 在里面的地板上\n  放着一封关于统一制服尺寸的\n  皇家守卫签名信，',
                            "<32>{#p/basic}* 上面全是爪印。"
                        ],
            s_grillbys_beegstool: () =>
                SAVE.data.b.svr
                    ? ['<25>{#p/asriel1}{#f/20}* 我想这把凳子\n  对你来说有点太高了。']
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高脚凳。']
                        : ['<32>{#p/basic}* 一把高脚凳...', '<32>* 高度刚好适合衫斯。'],
            s_grillbys_drinks: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你无法辨认\n  折叠桌下有什么东西...）"]
                    : SAVE.data.n.plot === 72
                        ? ["<32>{#p/basic}* 一张折叠式餐桌。", '<32>* 底部的摄像头已经被拿走。']
                        : ["<32>{#p/basic}* 一张折叠式餐桌。", "<32>* 下面藏了个摄像头。"],
            s_grillbys_shelf: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            "<25>{#p/asriel1}{#f/16}* 我不认为\n  品尝这些是个好主意。",
                            '<25>{#f/15}* 上次有人喝的时候，\n  它们起火了...'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/15}* 剧透警告：\n* 是烈焰烤尔比。',
                            "<25>{#f/20}* 天呐。\n* 我今天感到炽烈无比。"
                        ],
                        ["<25>{#p/asriel1}{#f/17}* 不过说真的。\n* 你真不应该喝这些。"]
                    ][Math.min(asrielinter.s_grillbys_shelf++, 2)]
                    : SAVE.data.n.plot === 72
                        ? ['<32>{#p/basic}* 这些架子上的饮料\n  有些已经喝完了。']
                        : [
                            '<32>{#p/basic}* 柜子上摆满了\n  五花八门的派对酒水和恶心的液体。',
                            '<32>{#p/basic}* 唯一的一瓶水贴有\n  “当心明火”的标签。'
                        ],
            s_grillbys_sidestool: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/20}* 那把凳子\n  对你来说绝对太高了。"]
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高脚凳。']
                        : ['<32>{#p/basic}* 这把高脚凳上标着“帕派瑞斯”。'],
            s_grillbys_smolstool: () =>
                SAVE.data.b.svr
                    ? ['<25>{#p/asriel1}{#f/19}* 这把凳子\n  看起来对你来说刚刚好。']
                    : world.darker
                        ? ['<32>{#p/basic}* 另一把高脚凳。']
                        : SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 这把高脚凳没什么特别的。']
                            : [
                                '<32>{#p/basic}* 我有种感觉\n  这个酒吧凳很特别。',
                                ...(SAVE.data.n.plot === 33 ? ['<32>* 至少与上面的屁垫有关...'] : [])
                            ],
            s_helipad: () =>
                SAVE.data.b.svr
                    ? [
                        [
                            '<25>{#p/asriel1}{#f/21}* 啊对...\n* 悬浮车终端。',
                            "<25>{#f/4}* 它现在被废弃了，\n  但是在以前...",
                            '<25>{#f/3}* 操作员在这里\n  指挥该区域的交通。'
                        ],
                        [
                            '<25>{#p/asriel1}{#f/3}* 该终端主要在\n  星港建设期间使用。',
                            '<25>{#f/4}* 对这里建立的\n  第一个新区域，\n  这是一个明智的预防措施。',
                            
                            '<25>{#f/13}* 从工厂复制器那\n  运送补给的船只...\n  没有它几乎无法安全着陆。'
                        ],
                        [
                            "<25>{#p/asriel1}{#f/17}* 但慢慢的，\n  这样的终端\n  却不再被需要了。",
                            '<25>{#f/20}* 因为这些运输船驾驶员\n  着陆的技术提升了。',
                            '<25>{#f/13}* 所以，\n  这些终端就被逐渐遗忘了。'
                        ],
                        ['<25>{#p/asriel1}{#f/16}* 这只是\n  众多被遗忘的对象之一。']
                    ][Math.min(asrielinter.s_helipad++, 3)]
                    : ['<32>{#p/basic}* 一个曾经用来指挥\n  悬浮车着陆的废弃终端。'],
            s_jenga_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （牌子上写着：\n  量子台随机数生成器\n  已经坏了。）"]
                    : ['<32>{#p/basic}* “注意：这个显示台内置的\n   量子随机数生成器还没修好。”'],
            s_library_window: () => [
                '<32>{#p/human}* （你将双手搭在了窗户上。）',
                ...(SAVE.data.b.svr ? [] : ['<32>{#p/basic}* 有股油漆的味道。'])
            ],
            s_librarby_blueBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了\n  过去与现在的对比情况。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“旧事重提”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “战前，怪物每天都要学习魔法。”',
                            '<32>* “然而，大多数同胞都在战争中牺牲，\n   其中就包括许多教师。”',
                            '<32>* “面对这一问题，剩余的怪物们\n   开始采用集体学习的方式。”',
                            '<32>* “当时采用这一方式，是为了让我们\n   能在前哨站更好地生存。”',
                            '<32>* “如今，人口不足的问题\n   几乎不复存在。”',
                            '<32>* “尽管如此，我们还是\n   坚持新的学习方式，因为...”',
                            '<32>* “...我们懒得再改回去了。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了\n  过去与现在的对比情况。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“旧事重提”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “以前，\n   怪物使用多种货币进行交易。”',
                            '<32>* “主要流通的是珠宝和‘克里’...\n   但它们只能在母星上使用。”',
                            '<32>* “与人类进行贸易时，\n   就只能选择金钱作为货币。”',
                            '<32>* “丰富的金矿资源\n   为我们带来了许多便利。”',
                            '<32>* “但也因此导致\n   其他货币迅速贬值。”',
                            '<32>* “如今，金钱成为了\n   我们唯一的货币！”\n* “这就是怪物的作风。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了\n  过去与现在的对比情况。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“旧事重提”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “艾罗戈死后，国王尽己所能\n   去保留故园的遗存。”',
                            '<32>* “尽管在保存途中，\n   他还是把那件最重要的东西\n   弄丢了...”',
                            '<32>* “但我们早已习惯逆来顺受，\n   没有因此责怪他。”',
                            '<32>* “过去两百年间充满坎坷，\n   但同时自由也离我们越来越近。”',
                            '<32>* “天使即将降临...”',
                            '<32>* “...我们猜想，或许他已经到来，\n   此刻正读着这本书。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            s_librarby_desk: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （你注意到\n  这些借阅记录积满了灰尘。）']
                    : ["<32>{#p/basic}* 图书倌的借阅记录。"],
            s_librarby_greenBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了一些杂谈，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“杂谈”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “‘域外网’，是国王与皇家科学员\n   共同打造的网络平台。”',
                            '<32>* “...不过，主要是皇家科学员的功劳。\n   国王仅仅写了个欢迎致辞。”',
                            '<32>* “言归正传，\n   域外网作为一个‘虚拟广场’，\n   将前哨站的居民联系在一起。”',
                            '<32>* “想要创建账户，你只需要...”',
                            '<32>* “呃... 好吧...”',
                            "<32>* “这教程看着清楚，\n   写的可是不清不楚。”",
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了一些杂谈，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“杂谈”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “要是你想到前哨站各处逛逛的话，\n   呼叫旅人是你的不二之选。”',
                            '<32>* “不管你想去哪，他都可以载你一程。”',
                            '<32>* “...因为，你总可以\n   在最近的停靠站找到他。”',
                            '<32>* “而且，说真的，\n   他说话有点不知所云。”',
                            '<33>* “‘狗子的公道’到底是个啥？”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （这些书记载了一些杂谈，\n  其中一部分文字是有用的。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“杂谈”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “怪物们可以自由穿梭于\n   前哨站的各个区域。”',
                            '<32>* “只有首塔顶端的最终长廊\n   是禁区。”',
                            '<32>* “除了皇家科学员，\n   任何居民都不得通过那里。”',
                            '<32>* “...我们仍不清楚其中的原因。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            s_librarby_ladder: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （梯子上方的暗门似乎被封闭了。）']
                    : ["<32>{#p/basic}* 一把乱放的梯子。\n* 没什么好说的。"],
            s_librarby_pinkBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (这些书记载了\n  有关怪物生物学的各种事实。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物生物学”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “理论上讲，\n   怪物的葬礼十分酷炫。”',
                            '<32>* “当怪物老了，\n   然后翘辫子了，\n   他们就会化为尘埃。”',
                            '<32>* “在葬礼上，我们拿来这些尘埃，\n   洒在他生前最喜欢的东西上。”',
                            '<32>* “这样一来，他的精神\n   就会留存在那件物品中...”',
                            '<32>* “唔，我凑够字数了吗？”\n* “我有点讨厌写这个。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (这些书记载了\n  有关怪物生物学的各种事实。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物生物学”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “怪物的躯体由魔法构成，\n   因此和灵魂密不可分。”',
                            '<32>* “如果一个怪物蓄意伤人，\n   还对此执迷不悟...”',
                            '<32>* “他就会变得异常强大。”',
                            '<32>* “不过大多数我族同胞并不崇尚暴力，\n   至少不是打心底里。”',
                            '<32>* “可是，如果我们再次遭受袭击，\n   能用于自卫的，只有一座前哨站...”',
                            '<32>* ...',
                            '<32>{#p/human}* （你不想再读下去了。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* (这些书记载了\n  有关怪物生物学的各种事实。）'
                        ]
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物生物学”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “怪物的身体主要由魔法构成，\n   而人类的身体主要由水构成。”',
                            '<32>* “就物质组成来说，\n   人类比我们强大得多。”',
                            '<32>* “但是，他们永远不能体会到\n   使用魔法表达自我的乐趣。”',
                            '<32>* “他们永远不会收到\n   一张弹幕生日贺卡...”',
                            '<32>* “也永远不能\n   使用隐身术和鹰眼术玩捉迷藏...”',
                            '<32>* “更无法拿电魔法\n   办一场炫酷灯光秀！”',
                            '<32>* “太可怜了。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            s_librarby_purpleBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了\n  怪物家园的历史。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“故园历史”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “故园日夜，皆为奇观。”',
                            '<32>* “晨曦初露，光塔划空，天启新篇。”',
                            '<32>* “至于白昼，光层共振，辉煌万丈。”',
                            '<32>* “能量尽释，夜幕悄然。”',
                            '<32>* “星辰降临，魔力凝聚。”',
                            '<32>* “日光之能，尽数落地，归于尘寰。”',
                            '<32>* “直至光塔重升，耀眼如初。”',
                            '<32>* “此乃昼夜，永恒循环，主宰光阴。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了\n  怪物家园的历史。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“故园历史”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “你知道吗，怪物们如今的社会结构\n   并非一直存在。”',
                            '<32>* “很久很久以前，\n   确切来说，距今大约几千年时...”',
                            '<32>* “我们的祖先每天漫无目的，\n   肆意嬉戏。”',
                            '<32>* “不敢相信！\n   那时的怪物甚至连衣服都不穿！”',
                            '<32>* “不过，随着时间流逝，\n   我们有了新的追求，渴望进化。”',
                            '<32>* “在那场伟大的复兴运动中，\n   连魔法的本质都被摆上台面，\n   成为焦点。”',
                            '<32>* “这些进步奠定了我们的社会结构，\n   乃至如今的生活方式。”',
                            '<32>* “...我还是不敢相信\n   长达两千年的历史中，\n   我们都在裸着乱跑。”',
                            '<32>* “哪有风度？”\n* “哪有时尚？”\n* “太不可思议了。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了\n  怪物家园的历史。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“故园历史”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “人怪首次会面时，\n   当政的怪物王是艾罗戈。”',
                            '<32>* “在他英明的领导下，\n   两族和平共处，相安无事。”',
                            '<32>* “但随着艾罗戈寿终正寝...\n   这一切都一去不复返了。”',
                            '<32>* “艾罗戈有能力维持两族长久和平，\n   而王子却难以承袭此功。”',
                            '<32>* “于是，一场大战将在所难免...\n   实在令人痛心。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            s_librarby_yellowBooks: pager.create(
                1,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了怪物的科技技术。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物科技”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “葛森曾说，\n   前哨站以前只是个小太空站。”',
                            '<32>* “在受了整整二十年苦之后，\n   有人将目光转向了那道力场。\n   心想...”',
                            "<32>* “‘这股强大的能量，\n   能否为己所用呢？’”",
                            '<32>* “这主意简洁明了，\n   但又十分巧妙。”',
                            '<32>* “在这一想法的指引下，\n   核心最终建成，\n   我们因此有了稳定的能源。”',
                            '<32>* “时至今日，我们仍在使用它！”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了怪物的科技技术。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物科技”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “啊，人工智能真是\n   世界一大奇迹...”',
                            '<32>* “...也可能恰恰相反。”',
                            '<32>* “自从建筑机器人K-541.12出了事之后，\n   我们就彻底放弃了研发\n   有自我意识的AI。”',
                            '<32>* “王后甚至下令，\n   禁止任何人开发新的AI程序。”',
                            '<32>* “现在，还有能力与资源去搞AI的，\n   只剩一个怪物了。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （这些书记载了怪物的科技技术。）']
                        : [
                            '<32>{#p/basic}* 书架上标着“怪物科技”。',
                            '<32>{#p/human}* （你取下了一本书...）',
                            '<32>{#p/basic}* “如今，很多人都已经忘了\n   太空中几乎没有重力。”',
                            '<32>* “早在战前，怪物在科技方面\n   就有许多突破性成果。”',
                            '<32>* “其中之一，\n   就是先进的重力控制系统。”',
                            '<32>* “如今，前哨站的每一个角落，\n   不论大小，都安装了\n   使用这一技术的装置。”',
                            '<32>* “现在正在看书的你，\n   可能就站在其中一个装置上面。”',
                            '<32>{#p/human}* （你把书放回了书架。）'
                        ]
            ),
            s_math_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你对牌子上的内容感到困惑。）"]
                    : ['<32>{#p/basic}* “警告：狗子的公道”'],
            s_pacing_sign: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （看着牌子上的内容，\n  你不禁扬起嘴角。）"]
                    : ['<32>{#p/basic}* “留意有狗”\n* “...请抚摸狗...”'],
            s_phonecard: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （这张便条要求你\n  拨打某个电话号码。）',
                        '<32>{#s/phone}{#p/event}* 拨号中...',
                        '<32>{#p/human}* （无信号。）'
                    ]
                    : world.runaway
                        ? [
                            "<32>{#p/basic}* 这是张便条。",
                            '<32>* “给我打电话！”\n* “这是我的电话号码！”',
                            '<32>{#s/phone}{#p/event}* 拨号中...',
                            '<32>{#p/basic}* 电话直接转接到了\n  语音信箱。',
                            '<32>{#p/basic}* “你好，孤独的来电者！”\n* “你愿与我一起离开前哨站吗？”',
                            '<32>{#s/equip}{#p/event}* 滴...'
                        ]
                        : SAVE.data.n.plot === 72
                            ? [
                                "<32>{#p/basic}* 这是张便条。",
                                '<32>* “给我打电话！”\n* “这是我的电话号码！”',
                                '<32>{#s/phone}{#p/event}* 拨号中...',
                                '<32>{#p/human}* （无信号。）'
                            ]
                            : [
                                "<32>{#p/basic}* 这是张便条。",
                                '<32>* “给我打电话！”\n* “这是我的电话号码！”',
                                '<32>{#s/phone}{#p/event}* 拨号中...',
                                '<32>{#p/basic}* 电话直接转接到了\n  语音信箱。',
                                '<32>{#p/basic}* “你好，孤独的来电者！”\n* “我很抱歉没能在这里迎接你~”',
                                '<32>{#s/equip}{#p/event}* 滴...',
                                ...(world.goatbro && SAVE.flag.n.ga_asrielVoicemail++ < 1
                                    ? ['<25>{#p/asriel2}{#f/10}* ...莫名其妙。']
                                    : [])
                            ],
            s_sr_cottonball: () =>
                world.darker
                    ? ['<32>{#p/basic}* 一排棉球挡住了储藏室的门。']
                    : [
                        '<32>{#p/basic}* 这有一排整齐划一的棉球。',
                        ...(SAVE.data.b.s_state_inverter
                            ? ["<32>{#p/basic}* ...不禁让人好奇\n  为什么它们还挡着储藏室。"]
                            : ["<32>{#p/basic}* ...你想知道\n  衫斯的其他垃圾的去向。"])
                    ],
            s_sr_treadmill: ["<32>{#p/basic}* 这是一台跑步机。", "<32>{#p/basic}* 这是它的最高设定了。"],
            s_sr_lamp: [
                "<32>{#p/basic}* 这是一盏台灯，\n  里面挂着一张大字条。",
                '<23>{#p/papyrusnt}“抱歉，我把你在这里用的\n手电筒拿回去了。”',
                '<23>{#p/papyrusnt}“不是说我介意你用\n我的东西...”',
                '<23>{#p/papyrusnt}“但你用这种不正常的\n方式用就完全没有\n道理了！”',
                '<23>{#p/papyrusnt}“我不知道你是怎么想的，\n但据我所知...”',
                '<23>{#p/papyrusnt}“手电筒算不上灯泡！！”'
            ],
            s_sc_book: [
                "<32>{#p/basic}* 这是皇家实验室的旧日志。",
                '<32>{#p/human}* （你翻到了打开的那页...）',
                '<32>{#p/basic}* “活动日志，克历615年7月”',
                '<32>* “我们已经从花丛中\n   挑选到了理想的对象。”',
                '<32>* “试验物质的准备工作\n   将在未来几天结束。”',
                '<32>* “很快，实验对象就会\n   进行注射。”',
                '<32>* “这样一来，我们就比以往任何时候\n   都更接近自由...”'
            ],
            s_sc_drawer: [
                "<32>{#p/basic}* 抽屉里有一本相册。",
                '<32>{#p/basic}* 相册里有衫斯和艾菲斯\n  在皇家实验室的照片。',
                '<32>{#p/basic}* 有的照片中在做实验，\n  有的在沉迷看科幻动画...',
                '<32>{#p/basic}* 他们看起来很开心。'
            ],
            s_sc_diagram: () => [
                "<32>{#p/basic}* 桌子上有一份\n  力场削弱武器的蓝图。",
                '<32>{#p/basic}* 墙上还有其他\n  各种各样的概念图...',
                '<33>{#p/basic}* 一台非线性时空访问机，\n  一台虫洞孔径稳定仪，\n  还有个被怪物灵魂绑定的人类灵魂。',
                ...(!SAVE.data.b.s_state_charasker
                    ? ((SAVE.data.b.s_state_charasker = true),
                        [
                            '<32>{#p/basic}* ...这是可能的吗？\n* 一个人类灵魂和一个\n  怪物灵魂共生？',
                            "<32>{#p/basic}* 但是怪物灵魂主人的身份\n  将会丢失...",
                            '<32>{#p/basic}* ...'
                        ])
                    : ['<32>{#p/basic}* ...'])
            ],
            s_pr_papbed: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （总得来说，\n  你很欣赏这张床。）']
                        : [
                            '<32>{#p/basic}* 一张精心制作的超级跑车床。',
                            ...(roomready()
                                ? [
                                    "<18>{#p/papyrus}那是我的床！",
                                    '<18>{#f/4}如果我有机会\n去探索星星的话...',
                                    "<18>{#f/0}我想沿着一条\n漫长的星际公路\n航行。",
                                    '<18>感受发丝中的静电，\n和皮肤上映出的\n星光...',
                                    "<18>{#f/4}当然，这都只是\n一场梦罢了。",
                                    '<18>{#f/0}所以我就\n边打盹边航行了。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （总得来说，\n  你很感谢这张了不起的床。）']
                        : ['<32>{#p/basic}* 一张精心制作的超级跑车床。']
            ),
            s_pr_papbones: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            "<32>{#p/basic}* （你把手伸进箱子，\n  但骨头不会对你造成任何伤害。）",
                            ...[
                                ['<25>{#p/asriel1}{#f/21}* 当心啊，弗里斯克！\n* 这些骨头可能还在活动...'],
                                ['<25>{#p/asriel1}{#f/16}* ...或者没有。'],
                                ["<25>{#p/asriel1}{#f/13}* 我想知道\n  你是不是那种会站在\n  烧红煤炭上的人。"],
                                ['<25>{#p/asriel1}{#f/8}* 我是说烧红的骨质煤炭。']
                            ][Math.min(asrielinter.s_pr_papbones++, 3)]
                        ]
                        : [
                            '<32>{#p/basic}* 一箱子的骨头。',
                            ...(roomready()
                                ? [
                                    '<18>{#p/papyrus}嘿，那些就是我\n用来攻击你的东西。',
                                    '<18>真是段美好的回忆，\n是吧？',
                                    '<18>感觉仿佛\n就在昨日...',
                                    SAVE.data.n.plot < 42.1
                                        ? '<18>{#f/4}实际上就是刚刚才\n发生的事。'
                                        : '<18>{#f/4}实际上就是今天\n早些时候发生的事。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            "<32>{#p/basic}* （你把手伸进箱子，\n  但骨头不会对你造成任何伤害。）",
                            ...[
                                [],
                                ['<25>{#p/asriel1}{#f/16}* ...或者没有。'],
                                ["<25>{#p/asriel1}{#f/13}* 我想知道\n  你是不是那种会站在\n  烧红煤炭上的人。"],
                                ['<25>{#p/asriel1}{#f/8}* 我是说烧红的骨质煤炭。']
                            ][Math.min(asrielinter.s_pr_papbones++, 3)]
                        ]
                        : ['<32>{#p/basic}* 一箱子的骨头。']
            ),
            s_pr_papcloset: pager.create(
                0,
                () => [
                    '<32>{#p/human}* （你往衣橱里看...）',
                    ...(SAVE.data.b.svr
                        ? ["<32>{#p/human}* （太黑了，你什么都看不见。）"]
                        : !world.runaway
                            ? ['<32>{#p/basic}* 里面的衣服被疯狂地\n  挪来挪去。']
                            : [
                                '<32>{#p/basic}* 衣服整齐地挂在里面。',
                                SAVE.data.n.plot === 72
                                    ? '<32>* 其中一件衣服上写着“骸阔天空”。'
                                    : '<32>* 许多衣服上都有手写文字。'
                            ]),
                    ...(roomready()
                        ? [
                            "<18>{#p/papyrus}别担心，\n衣橱里没有骷髅。",
                            "<18>{#f/4}当然，\n除非我在换衣服。"
                        ]
                        : [])
                ],
                () => [
                    '<32>{#p/human}* （你往衣橱里看...）',
                    ...(SAVE.data.b.svr
                        ? ["<32>{#p/human}* （太黑了，你什么都看不见。）"]
                        : !world.runaway
                            ? ['<32>{#p/basic}* 里面的衣服被疯狂地\n  挪来挪去。']
                            : [
                                '<32>{#p/basic}* 衣服整齐地挂在里面。',
                                SAVE.data.n.plot === 72
                                    ? '<32>* 其中一件衣服上写着“骸阔天空”。'
                                    : '<32>* 许多衣服上都有手写文字。'
                            ])
                ]
            ),
            s_pr_papposter: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                "<25>{#p/asriel1}{#f/17}* 啊。\n* 那是帕派瑞斯的特殊攻击...",
                                
                                '<25>{#f/15}* 在之前的时间线，\n  就是这种攻击... 给我\n  带来了公平的失败。',
                                "<25>{#f/16}* ...不要问我为什么\n  要和帕派瑞斯战斗。"
                            ],
                            ["<25>{#p/asriel1}{#f/10}* 你说啥？拜托，那当时\n  并没有发生什么不好的事。\n* 反正不是那个时候。"],
                            [
                                '<25>{#p/asriel1}{#f/16}* 好吧，告诉你了。\n* 这是因为我可能把自己\n  伪装成了一个人类。',
                                '<25>{#f/15}* ...是的。\n* 它看起来\n  和你想的一样糟糕。',
                                '<25>{#f/5}* 但是，嘿，\n  我是在找机会和\n  最伟大的帕派瑞斯战斗！'
                            ],
                            ['<25>{#p/asriel1}{#f/20}* 这非常值得。']
                        ][Math.min(asrielinter.s_pr_papposter++, 3)]
                        : [
                            "<32>{#p/basic}* 一面旗帜，\n  上面画着一个吓人的骷髅。",
                            ...(roomready()
                                ? [
                                    "<18>{#p/papyrus}很漂亮的海报吧？",
                                    '<18>安黛因在捡垃圾的\n时候发现的。',
                                    '<18>{#f/4}一开始上面是\n一个头骨和\n两根交叉的骨头...',
                                    '<18>{#f/9}但我想到了\n更好的东西！'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            ["<25>{#p/asriel1}{#f/10}* 你说啥？拜托，那当时\n  并没有发生什么不好的事。\n* 反正不是那个时候。"],
                            [
                                '<25>{#p/asriel1}{#f/16}* 好吧，告诉你了。\n* 这是因为我可能把自己\n  伪装成了一个人类。',
                                '<25>{#f/15}* ...是的。\n* 它看起来\n  和你想的一样糟糕。',
                                '<25>{#f/5}* 但是，嘿，\n  我是在找机会和\n  最伟大的帕派瑞斯战斗！'
                            ],
                            ['<25>{#p/asriel1}{#f/20}* 这非常值得。']
                        ][Math.min(asrielinter.s_pr_papposter++, 3)]
                        : ["<32>{#p/basic}* 一面旗帜，\n  上面画着一个吓人的骷髅。"]
            ),
            s_pr_paptable: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （你很惊讶，\n  这些玩偶居然如此精致。）']
                        : [
                            '<32>{#p/basic}* 一套穿着俗气制服的动作玩偶。',
                            ...(roomready()
                                ? [
                                    '<18>{#p/papyrus}啊，那个，\n动作玩偶。',
                                    '<18>用来参考理论战斗\n布置场景很合适。',
                                    '<18>{#f/4}但我为什么\n会有这么多呢？',
                                    '<18>{#f/6}那个，嗯...\n国王把它们当做\n礼物送给了我...',
                                    '<18>{#f/5}我真心希望\n我也能回报他\n一份礼物。'
                                ]
                                : [])
                        ],
                () =>
                    SAVE.data.b.svr
                        ? ['<32>{#p/human}* （仔细一想，\n  你就知道是谁创造了这些。）']
                        : ['<32>{#p/basic}* 一套穿着俗气制服的动作玩偶。']
            ),
            s_puzzle1_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上写着\n  破解谜题的基础方法。）']
                    : ['<32>{#p/basic}* “按顺序激活每一条电路。”'],
            s_puzzle2_sign: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （牌子上点拨出了\n  解这个谜题的思路。）']
                    : ['<32>{#p/basic}* “从左边开始。”'],
            s_puzzle3_note: () =>
                SAVE.data.b.svr
                    ? world.postnoot && world.nootflags.has('s_puzzle3') // NO-TRANSLATE

                        ? [
                            "<32>{#p/human}* （纸条上提到了\n  某人吹嘘自己提前完成了\n  一个谜题。）",
                            ...[
                                ['<25>{#p/asriel1}{#f/20}* 啊哈哈... 我想知道是谁\n  留下了这张纸条...\n* 诶嘿嘿...'],
                                ["<25>{#p/asriel1}{#f/20}* 哈？\n  当然不可能是我！"],
                                ['<25>{#p/asriel1}{#f/13}* ...']
                            ][Math.min(asrielinter.s_puzzle3_note++, 2)]
                        ]
                        : ['<32>{#p/human}* （纸条上提到\n  谜题不再需要寻找破解方法。）']
                    : world.postnoot && world.nootflags.has('s_puzzle3') // NO-TRANSLATE

                        ? [
                            [
                                "<32>{#p/basic}* 这是一张没有署名的便条...",
                                '<32>* “像这样的谜题真的\n   很烦人对吧。”',
                                '<32>* “不过嘞，\n   我已经帮你搞定了。”',
                                '<32>* “这不是很棒吗？”\n* “你应该谢谢我！”',
                                '  -“真挚的，”\n  你最好的朋友'
                            ],
                            [
                                "<32>{#p/basic}* 这是一张没有署名的便条...",
                                '<32>* “别担心，”\n* “不管你重置多少次...”',
                                '<32>* “我永远都会帮你\n   解决这些糟透了的谜题。”',
                                '<32>* “举手之劳而已\n  不用谢我。”',
                                '<#32>  - “永远的，”\n  你最好的朋友'
                            ]
                        ][Math.min(SAVE.flag.n.neutral_twinkly_loop1, 1)]
                        : !world.genocide && world.edgy
                            ? [
                                "<32>{#p/basic}* 一张衫斯的字条...",
                                '<32>{#p/without}* “哎呀。”\n* “看来我兄弟最终还是找到你了。”',
                                '<32>* “我把你的所作所为全告诉了他，\n  现在，他愿意老实在家待着了。”',
                                '<32>* “真是太遗憾了，对不对？”',
                                '<32>* “帕派瑞斯不该卷到这堆破事中。”',
                                '<32>* “但也许，这就是命。”',
                                '<32>* “对了，解谜愉快哦。”',
                                '<32>* “我猜，你肯定\n   一眨眼工夫就能解开。”',
                                '<#32>- “恕我冒昧了，”\n  衫斯'
                            ]
                            : [
                                "<32>{#p/basic}* 这是张帕派瑞斯留的字条...",
                                '<23>{#p/papyrus}{#f/30}“人类！！这个谜题可跟\n看起来的不一样。”',
                                '<23>“我在等你的时候，\n试着改造了一下...”',
                                '<23>“当然，是为了让图案\n看起来更像我的脸！”',
                                '<23>“不过好像哪里出了岔子...”',
                                '<23>“所以我现在\n只能做成一个\n很烂的箭头形状了！！！”',
                                '<23>“（另外，这个谜题\n需要你自己完成。）”',
                                '<23>“但不用担心！”\n“你肯定做得到的，人类！”',
                                '<#23>  - “最相信你的，”\n  帕派瑞斯'
                            ],
            s_redbook: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （这本颜色不同的书记载了\n  一个随着时间流逝\n  而被遗忘了的秘密武器。）']
                    : [
                        "<32>{#p/basic}* 一个书架。",
                        '<32>{#p/human}* （你取下了那本红皮书...）',
                        '<32>{#p/basic}* “人怪大战进入到白热化阶段时，\n   皇家军队成立了一个秘密组织。”',
                        '<32>{#p/basic}* “也就是所谓的‘特种武器’研发部，\n   专门用来搞实验研究。”',
                        '<32>{#p/basic}* “他们造出了许多‘战斗利器’，\n   但实战效果都是微乎其微。”',
                        '<32>{#p/basic}* “只有一个例外，\n   它就是被称作‘顿悟’的魔法卷轴。”',
                        '<32>{#p/basic}* “这卷轴的力量超乎寻常，\n   即使用来对付人类也过于危险。”',
                        '<32>{#p/basic}* “结果，卷轴被从内部锁死，\n   并很快封存起来。”',
                        '<32>{#p/basic}* “传说，有人把它送上了\n   开往前哨站的运输船。”',
                        '<32>{#p/basic}* “如果传说属实，\n   那么它现在位于何处？”\n* “又该如何解开枷锁？”',
                        '<32>{#p/basic}* “但愿，以上疑问永埋尘土之下，\n   湮没无闻。”',
                        '<32>{#p/human}* （你把书放回了书架。）'
                    ],
            s_sansbox: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （邮箱太满，\n  你看不到里面。）"]
                    : SAVE.data.n.plot === 72 && !world.runaway
                        ? [
                            '<32>{#p/basic}* 不知为何，\n  邮箱内又被塞了一堆垃圾邮件。',
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...说实话，\n  这让我感到惊讶。'])
                        ]
                        : [
                            "<32>{#p/basic}* （邮箱里塞满了未开封的垃圾邮件。）",
                            ...(SAVE.data.b.oops ? [] : ['<32>{#p/basic}* ...他为啥\n  从来都不读这些邮件。'])
                        ],
            s_sheddoor: () =>
                SAVE.data.b.svr
                    ? ["<32>{#p/human}* （你好像没法进去。）"]
                    : ["<32>{#p/basic}* 门被反锁了。"],
            s_slew: ["<32>{#p/basic}* 这是狗粮。\n* 碎片看起来像是骨头。"],
            s_spagnote: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （纸条上提到了\n  用意大利面来诱惑你的妙处。）']
                    : !world.genocide && world.edgy
                        ? [
                            "<32>{#p/basic}* 一张衫斯的字条...",
                            '<32>{#p/without}* “哎呀，”\n* “你发现了我兄弟的意大利面。”',
                            '<32>* “是不是看起来很香，很好吃？”',
                            '<32>* “嘿，”\n* “那就对了。”',
                            '<32>* “不过，不要因此掉以轻心哦...”',
                            '<32>* “因为，你花越多时间在\n   尝试拿走这玩意上...”',
                            '<32>* “我就有更多时间\n   准备下一个谜题了。”',
                            '<#23>- “开个玩笑而已，”\n  衫斯'
                        ]
                        : [
                            "<32>{#p/basic}* 这是张帕派瑞斯留的字条...",
                            '<23>{#p/papyrus}{#f/30}“人类啊！！”\n“享用这盘意面吧。”',
                            '<23>（“但其实你不知道的是，\n这盘意面是个陷阱...”）',
                            '<23>（“单纯是为了吸引你的！！！”）',
                            '<23>（“你会忙着去够它...”）',
                            '<23>（“然后就不会意识到\n自己毫无进展！！”）',
                            '<23>（“再次彻底被\n伟大的帕派瑞斯戏弄！！！ ”）',
                            '<#23>  “捏嘿嘿，”\n  帕派瑞斯'
                        ],
            s_town_camera1: () =>
                SAVE.data.b.svr
                    ? []
                    : world.runaway
                        ? [
                            "<32>{#p/basic}* 再也没有人会用\n  藏在水晶荚的摄像头来监视你了。"
                        ]
                        : SAVE.data.n.plot === 72
                            ? ["<32>{#p/basic}* 水晶荚内\n  不再会有摄像头了。"]
                            : ["<32>{#p/basic}* 在这堆水晶荚里\n  藏着一个摄像头。"],
            s_trapnote: () =>
                [
                    [
                        "<32>{#p/basic}* 这是张帕派瑞斯留的字条...",
                        '<23>{#p/papyrus}{#f/30}“抱歉，到安黛因来之前，\n我得把你锁在客房里。”',
                        '<23>“把这里当自己家\n一样吧！！！”',
                        '<22>“已提供茶点和住宿。”',
                        '<#23>  “非常捏嘿嘿的，”\n  帕派瑞斯'
                    ],
                    [
                        "<32>{#p/basic}* 这是张帕派瑞斯留的字条...",
                        '<23>{#p/papyrus}{#f/30}“下次逃跑前\n记得跟我说一声！”',
                        '<23>“在你失踪的时候\n我可担心死你了！！！”',
                        '<#23>  “对你牵肠挂骨的，”\n  帕派瑞斯'
                    ],
                    [
                        "<32>{#p/basic}* 这是张帕派瑞斯留的字条...",
                        '<23>{#p/papyrus}{#f/30}“如果你想找个地方住...”',
                        '<23>“直接告诉我！！！\n你不需要和我打！！！”',
                        '<#23>  “你的房东，”\n  帕派瑞斯'
                    ]
                ][Math.min(SAVE.data.n.state_papyrus_capture - 1, 2)],
            s_tree: pager.create(
                0,
                () =>
                    SAVE.data.b.svr
                        ? [
                            [
                                '<25>{#p/asriel1}{#f/20}* $(name)总是喜欢\n  称这些蚁群\n  属于一种“文明”。',
                                '<25>{#f/17}* 我想这是为了\n  让自己被认为很聪明。',
                                '<25>{#f/13}* 我也想被认为很聪明，\n  但父母经常会看穿我。',
                                '<25>{#f/13}* $(name)总是\n  会比我撒谎技术要高。'
                            ],
                            [
                                '<26>{#p/asriel1}{#f/13}* 在$(name)坠落到此处后，\n  $(name)还试图让我们相信\n  自己是一名外交官。',
                                "<25>{#f/17}* 不过还好，\n  我那搭档并不是一个说谎大师。",
                                "<25>{#f/15}* 想象一下，\n  如果当时我父母相信了，\n  事情会变得多么糟糕..."
                            ],
                            [
                                "<26>{#p/asriel1}{#f/17}* 我很高兴\n  你不会说谎话，弗里斯克。",
                                "<25>{#f/13}* 我的生活总是充满谎言。",
                                '<25>{#f/20}* ...抱歉。\n* 我觉得这让人有点惊讶。'
                            ],
                            ['<26>{#p/asriel1}{#f/15}* 百岁光阴能有几，\n  一场扯淡没来由...']
                        ][Math.min(asrielinter.s_tree++, 3)]
                        : world.darker
                            ? ["<32>{#p/basic}* 这个树状物没什么特别的。"]
                            : SAVE.data.n.plot === 72
                                ? [
                                    '<32>{#p/basic}* 很快，\n  这个文明将要再次迁徙。',
                                    '<32>* 他们将去何方？\n* 我想待会我们就知道了。'
                                ]
                                : [
                                    '<32>{#p/basic}* 这个人畜无害的树状结构，\n  其实是一个文明的家园。',
                                    '<32>* 在濒临灭绝之时，\n  它们迁徙到这里\n  来拯救自己的种族。'
                                ],
                () =>
                    SAVE.data.b.svr
                        ? [
                            [],
                            [
                                '<26>{#p/asriel1}{#f/13}* 在$(name)坠落到此处后，\n  $(name)还试图让我们相信\n  自己是一名外交官。',
                                "<25>{#f/17}* 不过还好，\n  我那搭档并不是一个说谎大师。",
                                "<25>{#f/15}* 想象一下，\n  如果当时我父母相信了，\n  事情会变得多么糟糕..."
                            ],
                            [
                                "<26>{#p/asriel1}{#f/17}* 我很高兴\n  你不会说谎话，弗里斯克。",
                                "<25>{#f/13}* 我的生活总是充满谎言。",
                                '<25>{#f/20}* ...抱歉。\n* 我觉得这让人有点惊讶。'
                            ],
                            ['<26>{#p/asriel1}{#f/15}* 百岁光阴能有几，\n  一场扯淡没来由...']
                        ][Math.min(asrielinter.s_tree++, 3)]
                        : world.darker
                            ? ['<32>{#p/basic}* ...']
                            : SAVE.data.n.plot === 72
                                ? ["<32>{#p/basic}* 别担心。\n* 他们终将找到属于自己的道路。"]
                                : ["<32>{#p/basic}* 专家建议...\n* 不要摇晃这人畜无害的树状结构。"]
            ),
            doginfo: () =>
                SAVE.data.b.svr
                    ? ['<32>{#p/human}* （里面的狗粮\n  被吃掉了一些。）']
                    : SAVE.data.n.state_starton_doggo === 2 || SAVE.data.n.plot > 27
                        ? SAVE.data.b.oops
                            ? ['<32>{#p/basic}* 里面有一袋半空的狗粮。']
                            : ["<32>{#p/basic}* 里面有一袋半满的狗粮。"]
                        : [
                            SAVE.data.n.state_starton_doggo === 3
                                ? '<32>{#p/basic}* 狗窝里是只\n  看起来昏昏欲睡的守卫狗。\n* 它看不见你。'
                                : '<32>{#p/basic}* 狗窝里是只很困惑的守卫狗。\n* 它看不见你。'
                        ]
        },
        truetext: {
            doggo1: ['<32>{#p/basic}* 还惦记狗粮呢？\n* 咋不去看看眼科医生呢？'],
            doggo2: ['<32>{#p/basic}* 哈？抛接游戏？', "<33>{#p/basic}* 这招还蛮管用..."],
            dogs1: [],
            dogs2: ['<33>{#p/basic}* 哇，你可太勤快了，\n  费这么些劲还不抵\n  一扳手来得快呢。'],
            fetch: () =>
                [
                    ['<32>{#p/basic}* 哈？抛接游戏？', "<33>{#p/basic}* 这招还蛮管用..."],
                    ["<32>{#p/basic}* 这已经是第二次，\n  第二次用生锈的扳手那招了。", '<32>{#p/basic}* 没有什么新花样吗？'],
                    ["<32>{#p/basic}* 哇，你总不能\n  每次都靠这招蒙混过关吧！"]
                ][SAVE.data.n.state_starton_latefetch++],
            great1: [
                "<32>{#p/basic}* 哦，小狗狗太可爱了！",
                "<32>{#p/basic}* 事实证明，\n  什么都比不上一只小狗的吻。"
            ],
            great2: [
                '<32>{#p/basic}* 你只用一根扳手，\n  拿抛接游戏当幌子，\n  骗过了整支犬卫队。',
                '<32>* 这有多疯狂，\n  还需要我说吗？'
            ],
            great3: ['<32>{#p/basic}* 什么鬼？'],
            lesser1: ['<32>{#p/basic}* 关于伸展脖子的\n  神秘词汇突然就变得有意义了...'],
            lesser2: [
                "<32>{#p/basic}* 这已经是第二次，\n  第二次用生锈的扳手那招了。",
                '<32>{#p/basic}* 没有什么新花样吗？'
            ],
            papyrus1: [
                '<32>{#p/basic}* 帕派瑞斯的意大利面可出名了。',
                "<32>* 却没几个人知道\n  他拿的不是怪物菜谱。",
                '<32>* 他那个，呃，“烹饪老师”\n  不小心拿了本人类菜谱给他...',
                '<32>* 除了他自己，\n  估计只有人类\n  才吃得惯他的意面。',
                '<32>* 这也太讽刺了。'
            ],
            papyrus3: ['<32>{#p/basic}* 就是这样...', "<32>* 马上，你就要跟\n  镇子上最酷的骷髅\n  来场“较量”了。"],
            papyrus4: [
                '<32>{#p/basic}* 他这一生\n  可能都在等这一刻...',
                "<32>* 如果我是你，\n  我绝不会浪费这次机会。"
            ],
            papyrus5: ["<32>{#p/basic}* 别担心。", "<32>* 运气好的话，你们很快就会\n  成为好朋友了。"],
            puzzle1: () =>
                SAVE.data.b.svr
                    ? ["<25>{#p/asriel1}{#f/20}* 不错嘛，弗里斯克。\n* 没想到\n  你还是个数学高手..."]
                    : ['<32>{#p/basic}* 哇。\n* 你竟然真把它解开了？'],
            sans3: ['<32>{#p/basic}* 你尽力了。'],
            sans4: ['<32>{#p/basic}* 你以前做过这个吗...？'],
            sans5: ['<32>{#p/basic}* 拜托，衫斯。\n* 这“谜题”根本不值一看。'],
            sans6: ['<32>{#p/basic}* 拜托，衫斯。\n* 这“谜题”根本不是人能做的啊。'],
            sans7: ['<32>{#p/basic}* 不是，搞了半天就这啊。'],
            sans8: ["<32>{#p/basic}* 我和你一样对此感到困惑。"],
            sans9: ['<32>{#p/basic}* 拜托，让那些东西动起来吧！\n* 我好想看看啊！', '<32>* 唉... 算了...'],
            papdate: () => [
                '<32>{#p/basic}* 所以... 帕派瑞斯，嗯？',
                SAVE.data.n.plot > 64.1
                    ? '<32>* 过了这么久，\n  你们终于成了朋友。'
                    : '<32>* 我就知道你们俩\n  最终会成为朋友。',
                '<32>* ...\n* 我是看着那个骷髅在这里\n  长大的...',
                '<32>* 他总是会给他周围的人\n  树立一个好榜样...',
                '<32>* ...包括我也一样。',
                "<32>* 真可惜，\n  我没法亲自告诉他这些。",
                "<32>* 但没关系的。",
                '<32>* 看到你们俩相处得这么好，\n  就足够弥补遗憾了。'
            ]
        },
        vegetoid: pager.create(
            0,
            () => [
                SAVE.data.n.plot === 72
                    ? '<32>{#p/basic}* 我听说运输船司机\n  将在所有怪物离开前哨站后\n  独自回到这里。'
                    : world.population === 0
                        ? '<32>{#p/basic}* 我听说那个运输船司机\n  会在别的怪物全都逃走后\n  回到这里。'
                        : "<32>{#p/basic}* 我听说那个运输船司机\n  不吃绿色蔬菜。",
                '<33>{#p/basic}* 它真的是个怪物吗...？'
            ],
            () => [
                SAVE.data.n.plot === 72
                    ? "<32>{#p/basic}* 真正的怪物\n  绝不会想回到这个糟透了的地方。"
                    : world.population === 0
                        ? '<32>{#p/basic}* ...'
                        : '<32>{#p/basic}* 真正的怪物\n  都吃绿色蔬菜的。'
            ]
        ),
        vegetoidx: () =>
            SAVE.data.b.svr
                ? ["<32>{#p/human}* （你在这洞里谁都没找到。）"]
                : world.bulrun
                    ? ['<32>{#p/basic}* ...但是大家都逃走了。']
                    : ['<32>{#p/basic}* ...但是谁也没有来。'],
        xtowerHiscoreNames: {
            kidd: '超爱安黛因10',
            napstablook: '纳普斯特22',
            papyrus: '酷炫骷髅95',
            sans: '懒骨。',
            undyne: '壮鱼91',
            you: '（游客）'
        },
        xtowerMessage1: '新纪录！',
        xtowerMessage2: '祝你下次好运...',
        xtowerMessage3: '感谢游玩！',
        xtowerSans: () =>
            world.genocide
                ? [
                    '<32>{#p/event}* 铃铃，铃铃...',
                    "<32>{#p/alphys}* ...合着杀了他，\n  你还没爽-爽够是吧？",
                    '<32>* 你就非得在我... 那破-破游戏上\n  把他从榜一撵下去是吧...',
                    '<32>* 诶嘿嘿...',
                    "<32>* 你可真恶心...",
                    '<32>* ...',
                    '<32>{#s/equip}{#p/human}* （你失去了所有金钱。）',
                    ...(world.goatbro
                        ? SAVE.flag.n.genocide_milestone < 5
                            ? SAVE.flag.n.ga_asrielXtower++ < 1
                                ? ["<25>{#p/asriel2}{#f/10}* 今儿我们胆量可嘉啊。"]
                                : []
                            : SAVE.flag.n.genocide_milestone < 6
                                ? SAVE.flag.n.ga_asrielAlphysCom2++ < 1
                                    ? ["<25>{#p/asriel2}{#f/1}* 这才是\n  我想看到的艾菲斯。"]
                                    : []
                                : SAVE.flag.n.ga_asrielAlphysCom5++ < 1
                                    ? ["<25>{#p/asriel2}{#f/4}* 可惜这样救不了她。"]
                                    : []
                        : [])
                ]
                : [
                    '<32>{#p/event}* 铃铃，铃铃...',
                    '<25>{#p/sans}* 你在这花这么大的努力\n  就只是为了超过\n  我的分数吗？',
                    "<25>{#f/3}* 哇塞。\n* 那你可比我兄弟\n  固执多了。",
                    ...(SAVE.data.n.state_starton_papyrus === 1
                        ? [
                            '<25>{#f/3}* ...',
                            "<25>{*}{#p/darksans}{#f/1}{#i/5}{#s.stop}* 可惜他已经死了，\n  不是吗？",
                            '{*}{#s.resume}{%}'
                        ]
                        : [
                            SAVE.data.n.plot === 72
                                ? "<25>{#f/0}* 我本想给你一份\n  特殊大礼，但不巧的是\n  我还在找托丽尔。"
                                : "<25>{#f/0}* 我本想给你一份\n  特殊大礼，但不巧的是\n  我还在休息。",
                            ...(world.edgy_x
                                ? ['<25>{#f/0}* 不要见怪。', '<32>{#s/equip}{#p/event}* 滴...']
                                : [
                                    "<25>{#f/2}* 所以先给你一些零花钱\n  作为奖励吧。",
                                    '<32>{#s/equip}{#p/human}* （你得到了10000G。）'
                                ])
                        ])
                ],
        xtowerAsriel: [
            '<25>{#p/asriel1}{#f/13}* ...你居然真的打破了最高纪录？',
            '<25>{#f/17}* 哇哦。\n* 我也许低估了你。',
            '<25>{#f/20}* 弗里斯克，\n  你真的超酷！'
        ],
        xtowerScore: '得分：$(x)'
    },

    b_group_starton: {
        dogs: () => (world.goatbro ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。'] : ['<32>{#p/story}* 狗夫妇发起突袭！']),
        spacetopJerry: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 俗气的帽子再配上没谱的伙计。']
                : ['<32>{#p/story}* 太空帽大摇大摆地晃了过来！\n* 杰瑞也来了。'],
        stardrakeSpacetop: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 笨蛋青年两人组。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* 小酷龙和太空帽摆着姿势，\n  扮作大反派。']
                    : ['<32>{#p/story}* 星铁龙和太空帽摆着姿势，\n  扮作大反派。'],
        stardrakeSpacetop2a: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 只剩一个了。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* 小酷龙泰然自若。']
                    : ['<32>{#p/story}* 星铁龙泰然自若。'],
        stardrakeSpacetop2b: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一个了。'] : ['<32>{#p/story}* 太空帽泰然自若。'],
        stardrakeSpacetop2c: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一个了。'] : ['<32>{#p/story}* 只剩下“太空帽”了。'],
        stardrakeSpacetop2d: () => (world.goatbro ? ['<32>{#p/asriel2}* 杰瑞。'] : ['<32>{#p/story}* 杰瑞。']),
        stardrakeSpacetopJerry: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 笨蛋青年两人组。\n* 再加一个，杰瑞。']
                : SAVE.data.b.spared_jerry
                    ? ['<32>{#p/story}* 杰瑞和朋友们出现了！']
                    : SAVE.data.b.s_state_chilldrake
                        ? ['<32>{#p/story}* 太空帽和小酷龙叹着气\n  来和你对峙了。\n* 杰瑞。']
                        : ['<32>{#p/story}* 太空帽和星铁龙叹着气\n  来和你对峙了。\n* 杰瑞。'],
        stardrakeSpacetopJerry2a: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 还剩下两个。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* 太空帽和小酷龙\n  仍然泰然自若。']
                    : ['<32>{#p/story}* 太空帽和星铁龙\n  仍然泰然自若。'],
        stardrakeSpacetopJerry2b: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 还剩下两个。'] : ['<32>{#p/story}* 太空帽泰然自若。\n* 杰瑞.'],
        stardrakeSpacetopJerry2c: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 还剩下两个。']
                : SAVE.data.b.s_state_chilldrake
                    ? SAVE.data.b.spared_jerry
                        ? ['<32>{#p/story}* 小酷龙和杰瑞\n  不会为此产生任何情绪！']
                        : ['<32>{#p/story}* 小酷龙泰然自若。\n* 杰瑞。']
                    : SAVE.data.b.spared_jerry
                        ? ['<32>{#p/story}* 星铁龙和杰瑞\n  不会为此产生任何情绪！']
                        : ['<32>{#p/story}* 星铁龙泰然自若。\n* 杰瑞。']
    },

    b_opponent_stardrake: {
        act_check: () =>
            world.goatbro
                ? SAVE.data.b.s_state_chilldrake
                    ? [
                        '<32>{#p/asriel2}* 小酷龙，中二叛逆。\n* 胡乱撒气，荒唐至极。'
                    ]
                    : [
                        '<32>{#p/asriel2}* 星铁龙，逗逼。\n* 总喜欢给别人讲笑话，\n  殊不知自己就是个最大的笑话。'
                    ]
                : SAVE.data.b.s_state_chilldrake
                    ? ['<33>{#p/story}* 小酷龙 - 攻击12 防御7\n* 看啥都要对着干！！\n* 他在找星儿。']
                    : ['<32>{#p/story}* 星铁龙 - 攻击12 防御7\n* 这名喜剧演员拼尽力气\n  想留住一位观众。'],
        act_check2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙 - 攻击12 防御7\n* 看啥都要对着干！！\n* 他在找逃跑路线。']
                : ["<32>{#p/story}* 星铁龙 - 攻击12 防御7\n* 想跟你打趣，\n  但被打得没趣了。"],
        act_check3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙 - 攻击12 防御7\n* 看啥都要对着干！！\n* 尤其是调情！！']
                : ['<32>{#p/story}* 星铁龙 - 攻击12 防御7\n* 调情对这个青年喜剧演员来说\n  可不是开玩笑的。'],
        act_check4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙 - 攻击12 防御7\n* 逐渐变得不再叛逆...']
                : ['<32>{#p/story}* 星铁龙 - 攻击12 防御7\n* 这位青年喜剧演员的\n  前途一片光明。'],
        act_flirt: () => ['<32>{#p/human}* （你讲了一个浪漫的笑话。）'],
        flirtTalk1: ["<08>{#p/basic}{~}你可真怪。"],
        flirtTalk2: ["<08>{#p/basic}{~}你刻薄\n且奇怪。"],
        genoStatus: () =>
            SAVE.data.b.s_state_chilldrake ? ['<32>{#p/asriel2}* 小酷龙。'] : ['<32>{#p/asriel2}* 星铁龙。'],
        heckleStatus: () =>
            world.goatbro
                ? SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/asriel2}* 小酷龙。']
                    : ['<32>{#p/asriel2}* 星铁龙。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* 小酷龙骄傲自满...']
                    : ['<32>{#p/story}* 星铁龙骄傲自满...'],
        heckleTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}不！！\n我就\n这么干！']
                : ["<08>{#p/basic}{~}这个也\n不好笑！"],
        heckleTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}肮脏的\n法律\n践踏者。']
                : ['<08>{#p/basic}{~}你就是\n坨烂肉。'],
        heckleTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}反抗\n不让\n反抗的！"]
                : ['<08>{#p/basic}{~}（对人类\n骂骂咧咧）'],
        heckleText1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* (你谴责小酷龙的行为。）']
                : ['<32>{#p/human}* （你对星铁龙喝倒彩。）'],
        heckleText2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你鼓励小酷龙\n  去其他地方当反叛者。）']
                : ["<32>{#p/human}* （你说星铁龙\n  没有一点幽默细胞。）"],
        heckleText3: () =>
            SAVE.data.b.s_state_chilldrake
                ? [
                    '<32>{#p/human}* （你嘲笑小酷龙\n  在鸟不拉屎的地方抗议。）',
                    '<32>{#p/basic}* 小酷龙将你的嘲讽当做建议，\n  溜达着去镇上了。'
                ]
                : [
                    '<32>{#p/human}* （你告诉星铁龙，\n  再这样下去，它就成万人烦了。）',
                    '<32>{#p/basic}* 他百口莫辩，灰溜溜地逃走了...'
                ],
        hurtStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 离死不远了。']
                : SAVE.data.b.s_state_chilldrake
                    ? ['<32>{#p/story}* 小酷龙的身体要散架了。']
                    : ['<32>{#p/story}* 星铁龙的身体要散架了。'],
        idleTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}让我\n刷牙？\n没门！']
                : ['<08>{#p/basic}{~}尽量不要\n放“空”\n自我..'],
        idleTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}夜猫子\n不需要\n睡觉！']
                : ['<08>{#p/basic}{~}我的双关\n“月”来\n“月相”样了'],
        idleTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}谁还要\n爸妈管啊！？']
                : ['<08>{#p/basic}{~}已经好\n几“光年”\n没回家了..'],
        idleTalk4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}嘿呀，\n人生在世，\n总要撒点野！']
                : ['<08>{#p/basic}{~}敲代码很快，\n又称\n快“码”\n加“编”'],
        idleTalk5: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}没人能\n教我做事！']
                : ['<08>{#p/basic}{~}想干一架？\n直说就行嘛，\n干嘛那么\n“星”师动众呢？'],
        idleTalk6: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}权力应该\n消失！']
                : ['<08>{#p/basic}{~}别生气，\n生出的气\n说不定会\n污染空气~'],
        idleTalk7: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}想剪\n我的爪子？\n门都没有！']
                : ['<08>{#p/basic}{~}我有40个G，\n为啥还没被\n超重压死呢？'],
        jokeStatus: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙对他的反抗\n  失去了信心。']
                : ['<32>{#p/story}* 星铁龙对自己的\n  五“星”级笑话感到满意。'],
        jokeTalk0: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}至少你\n承认了。']
                : ["<08>{#p/basic}{~}这不是为\n了搞笑！"],
        jokeTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}你根本不懂\n我为什么\n要这么做！"]
                : ["<08>{#p/basic}{~}你笑什么\n呢？"],
        jokeTalk2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}你...\n真的...']
                : ['<08>{#p/basic}{~}看到没！？\n笑了！\n老妈是\n对的！'],
        jokeTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<08>{#p/basic}{~}我不\n认为你\n..."]
                : ["<08>{#p/basic}{~}谢谢你，\n你是\n最棒的！"],
        jokeTalk4: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}说实话...']
                : ['<08>{#p/basic}{~}你很有\n品味！！'],
        jokeText0: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你认同了小酷龙。）']
                : ["<32>{#p/human}* （你对星铁龙的言论回以大笑。）"],
        jokeText1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ["<32>{#p/human}* （但是他还没讲出什么\n  能被同意的言论。）"]
                : ["<32>{#p/human}* （但是他还没有讲出什么笑话。）"],
        jokeText2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你认同了小酷龙。）']
                : ["<32>{#p/human}* （你对星铁龙的笑话\n  回以大笑。）"],
        jokeText3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/human}* （你再次认同了小酷龙。）']
                : ["<32>{#p/human}* （你继续对星铁龙的双关\n  回以大笑。）"],
        name: () => (SAVE.data.b.s_state_chilldrake ? '* 小酷龙' : '* 星铁龙'),
        punTalk1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}只有\n星儿\n可以\n那样做。']
                : ["<08>{#p/basic}{~}你在\n搞笑吗？"],
        punTalk2: () =>
            SAVE.data.b.s_state_chilldrake ? ["<08>{#p/basic}{~}你可不是\n星儿。"] : ['<08>{#p/basic}{~}哈..\n哈..'],
        punTalk3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<08>{#p/basic}{~}别再模仿\n我的朋友\n了。']
                : ["<08>{#p/basic}{~}我早就\n听过了。"],
        punText1: ['<32>{#p/human}* （你讲了一个太空双关笑话。）'],
        randStatus1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙想知道星儿的去向。']
                : ['<32>{#p/story}* 星铁龙正在审视人群。'],
        randStatus2: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙正在吟唱\n  无政府主义的咒语。']
                : ['<32>{#p/story}* 星铁龙正在练习下一个双关。'],
        randStatus3: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙着手着一场\n  怪物暴动。']
                : ['<32>{#p/story}* 星铁龙被自己想出的\n  下一个双关笑话逗笑了。'],
        randStatus4: () => ['<32>{#p/story}* 闻起来像湿枕头。'],
        randStatus5: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 身体喷雾的味道扑面而来。']
                : ['<32>{#p/story}* 星铁龙因自己的名字\n  不是双关语而松了一口气。'],
        status1: () =>
            SAVE.data.b.s_state_chilldrake
                ? ['<32>{#p/story}* 小酷龙大摇大摆地晃了过来！']
                : ['<32>{#p/story}* 星铁龙扑腾了过来！']
    },
    b_opponent_jerry: {
        act_check: () =>
            SAVE.data.b.spared_jerry
                ? world.goatbro
                    ? [
                        '<33>{#p/asriel2}* 杰瑞，公认的傻帽。\n* 调情这么有用？打死我也不信。'
                    ]
                    : [
                        '<32>{#p/story}* 杰瑞 - 攻击0 防御30\n* 一个重生的怪物，因友谊的力量而觉醒。'
                    ]
                : world.goatbro
                    ? [
                        '<32>{#p/asriel2}* 杰瑞，公认的傻帽。\n* 他就是个不折不扣的废物，一文不值。'
                    ]
                    : ['<32>{#p/story}* 杰瑞 - 攻击0 防御30\n* 大家都认识杰瑞。\n* 会延长攻击时间。'],
        act_flirt: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/human}* （你向杰瑞调情。）\n* （它感谢你的赞美。）']
                : 5 <= world.flirt
                    ? ['<32>{#p/human}* （你调用你的经验，\n  发出一场改变人生的调情。）']
                    : [
                        '<32>{#p/human}* （你向杰瑞调情。）',
                        '<32>{#p/basic}* 杰瑞有点喜欢你了...\n  好像过头了。'
                    ],
        act_ditch: () => ['<32>{#p/human}* （你甩掉了杰瑞。）'],
        act_kiss: () => ['<32>{#p/human}* （你亲吻了杰瑞。）'],
        flirtStatus: ["<32>{#p/story}* 杰瑞的救赎之旅开始了。"],
        flirtStatusWeird: ['<32>{#p/story}* 这事咋看咋奇葩。'],
        flirtTalk: [
            '<08>{#p/basic}{~}你...\n你...',
            "<08>{#p/basic}{~}就算\n只是\n为了你...",
            "<08>{#p/basic}{~}我也会\n尽力当个\n更好的人！"
        ],
        flirtTalkWeird: ['<08>{#p/basic}{~}\x00*舔嘴唇*'],
        genoStatus: ['<32>{#p/asriel2}* 杰瑞。'],
        hurtStatus: () => (world.goatbro ? ['<32>{#p/asriel2}* 离死不远了。'] : ['<32>{#p/story}* 杰瑞受了伤。']),
        idleTalk1: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}我为\n我们在\n这里感\n到高兴。"]
                : ["<08>{#p/basic}{~}你们\n不觉得\n无聊吗？"],
        idleTalk2: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}我们能\n经常\n这么做\n吗？']
                : ['<08>{#p/basic}{~}我们到底\n为什么在\n干这事？'],
        idleTalk3: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}嘿，\n伙计们！\n你们都\n很棒！']
                : ['<08>{#p/basic}{~}哎呀呀，\n老兄你们\n真废啊。'],
        idleTalk4: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}有人想\n得到一个\n拥抱吗？']
                : ['<08>{#p/basic}{~}嘘嘘嘘！\n别吵，\n让我思考！'],
        idleTalkSolo1: () =>
            SAVE.data.b.spared_jerry ? ['<08>{#p/basic}{~}我感谢\n我们\n能够\n相遇！'] : ['<08>{#p/basic}{~}尬死了。'],
        idleTalkSolo2: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}你\n真棒！\n只是\n说一下。"]
                : ['<08>{#p/basic}{~}所以，\n你在做\n什么？'],
        idleTalkSolo3: () =>
            SAVE.data.b.spared_jerry
                ? ["<08>{#p/basic}{~}你就是\n我的\n整个\n银河系！"]
                : ['<08>{#p/basic}{~}这儿的信号\n烂透了。'],
        idleTalkSolo4: () =>
            SAVE.data.b.spared_jerry
                ? ['<08>{#p/basic}{~}我爱人类！']
                : ['<08>{#p/basic}{~}作为\n人类\n肯定\n很不错。'],
        name: '* 杰瑞',
        randStatus1: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* 杰瑞的生活无忧无虑。']
                : ['<32>{#p/story}* 杰瑞吃着粉状的食物，\n  自豪地舔着手。'],
        randStatus2: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* 杰瑞咯咯地笑着。']
                : ['<32>{#p/story}* 杰瑞打喷嚏时的粘液\n  飞的到处都是。'],
        randStatus3: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* 杰瑞发出一声兴奋的尖叫。']
                : ['<32>{#p/story}* 杰瑞打了个哈欠。'],
        randStatus4: () =>
            SAVE.data.b.spared_jerry
                ? ['<32>{#p/story}* 闻起来像... 杰瑞？']
                : ['<32>{#p/story}* 闻起来像... 杰瑞。'],
        status1: ['<32>{#p/story}* 杰瑞缠上你了！'],
        kissTalk: ['<08>{#p/basic}{~}哇哦...', '<08>{#p/basic}{~}一个\n来自我\n最好的\n朋友的\n吻！'],
        kissStatus: ['<32>{#p/story}* ...'],
        kissResult: () =>
            battler.alive.length === 2
                ? ["<32>{#p/basic}* 其他怪物表示没眼看..."]
                : ["<32>{#p/basic}* 其他怪物表示没眼看..."],
        ditchResult: () =>
            battler.alive.length === 1
                ? ["<32>{#p/basic}* 其他怪物正在庆祝杰瑞的消失。"]
                : ["<32>{#p/basic}* 其他怪物正在庆祝杰瑞的消失。"]
    },
    b_opponent_mouse: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 绅鼠猫，流浪猫。\n* 早已活得浑浑噩噩。']
                : ['<33>{#p/story}* 绅鼠猫 - 攻击16 防御8\n* 这只以城为家的时髦的猫\n  只想过简单的生活。'],
        act_check2: [
            "<33>{#p/story}* 绅鼠猫 - 攻击16 防御8\n* 这只城里猫\n  后悔来了不该来的地方。"
        ],
        act_check3: [
            '<33>{#p/story}* 绅鼠猫 - 攻击16 防御8\n* 这只改过自新的乡下老鼠\n  对自己的改变非常满意。'
        ],
        act_check4: [
            '<33>{#p/story}* 绅鼠猫 - 攻击16 防御8\n* 这只改过自新的\n  乡下老鼠看上你了。'
        ],
        act_direct: ['<32>{#p/human}* （你告诉绅鼠猫一个\n  关于老鼠的事实。）'],
        act_direct2: [
            '<32>{#p/human}* （你把你知道的关于老鼠的全部知识\n  告诉了绅鼠猫。）',
            '<32>{#p/basic}* 突然间..！'
        ],
        act_direct3: ["<32>{#p/human}* （你尝试告诉绅鼠猫更多，\n  但它已经找到了适合\n  自己的生活方式。）"],
        act_disown: [
            "<32>{#p/human}* （你拔下了绅鼠猫\n  脸上的一根胡须。）",
            '<32>{#p/basic}* 绅鼠猫发出了刺耳的嘶嘶声！'
        ],
        act_disown2: [
            "<32>{#p/human}* （你又拔下了绅鼠猫\n  脸上的一根胡须。）",
            '<32>{#p/basic}* 绅鼠猫吃痛，匆匆跑开了！'
        ],
        act_disown3: ['<32>{#p/human}* （你想拔掉它的胡须，\n  但绅鼠猫假装它不存在。）'],
        act_flirt: ["<32>{#p/human}* （你说了一句可爱的话，\n  然后抓了抓绅鼠猫的脖子。）"],
        disownStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 绅鼠猫。'] : ['<32>{#p/story}* 绅鼠猫逐渐变得不再冷静。'],
        disownTalk1: ['<08>{#p/basic}{~}把你的\n爪子\n拿开..！'],
        flirtTalk: ['<08>{#p/basic}{~}呜咪不行。'],
        flirtTalk2: ['<08>{#p/basic}{~}\x00*呼噜声*'],
        genoStatus: ['<32>{#p/asriel2}* 绅鼠猫。'],
        hurtStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 离死不远了。'] : ['<32>{#p/story}* 绅鼠猫快断气了。'],
        idleTalk1: ['<08>{#p/basic}{~}它们\n吃啥？'],
        idleTalk2: ['<08>{#p/basic}{~}它们\n藏哪？'],
        idleTalk3: ['<08>{#p/basic}{~}它们\n如何\n说话？'],
        idleTalk4: ['<08>{#p/basic}{~}它们\n会做梦\n吗？'],
        initTalk1: ['<08>{#p/basic}{~}唉，\n我还在\n这里。'],
        initTalk2: ['<08>{#p/basic}{~}哦，\n我迷失\n了方向\n...'],
        initTalk3: ['<08>{#p/basic}{~}事态\n并不\n理想。'],
        initTalk4: ['<08>{#p/basic}{~}你能\n帮我吗？'],
        name: '* 绅鼠猫',
        randStatus1: ['<32>{#p/story}* 绅鼠猫幻想着四肢着地。'],
        randStatus2: ['<32>{#p/story}* 绅鼠猫正在扫描这个区域。'],
        randStatus3: ['<32>{#p/story}* 绅鼠猫正试图装成\n  自己很小的样子。'],
        randStatus4: ['<32>{#p/story}* 闻起来像世界奶酪排行榜的\n  前二十名的奶酪。'],
        remindStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 绅鼠猫。']
                : ['<32>{#p/story}* 绅鼠猫只需要一点\n  小小的帮助。'],
        remindTalk1: ['<08>{#p/basic}{~}住在\n洞里，\n是吗..？'],
        remindTalk2: ['<08>{#p/basic}{~}会像\n玩具\n吱吱叫，\n是吗..？'],
        remindTalk3: ['<08>{#p/basic}{~}从现在\n开始，\n我应该像\n老鼠一样\n生活。'],
        safeStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一击。"] : ['<32>{#p/story}* 绅鼠猫前程无量。'],
        safeTalk1: ['<08>{#p/basic}{~}真美妙\n...'],
        safeTalk2: ['<08>{#p/basic}{~}太棒了\n...'],
        status1: ['<32>{#p/story}* 绅鼠猫来了！']
    },
    b_opponent_doggo: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 遁狗，一条不顺眼的狗。\n* 这个蠢货怎么又上岗了？']
                : ['<32>{#p/story}* 遁狗 - 攻击13 防御7\n* 一点风吹草动便能让它兴奋。\n* 喜好之一：拥抱。'],
        act_check2: ['<32>{#p/story}* 遁狗 - 攻击13 防御7\n* 他看眼自己都得费老劲...'],
        act_check3: ['<32>{#p/story}* 遁狗 - 攻击13 防御7\n* 一只非常兴奋的狗，\n  正在享受其所好。'],
        act_check4: ['<32>{#p/story}* 遁狗 - 攻击13 防御7\n* 在你眼里，这只狗在生活中\n  非常地孤独。'],
        act_flirt: () => ['<32>{#p/human}* （你向遁狗调情。）'],
        act_cuddle: () => ['<32>{#p/human}* （你紧紧地抱住遁狗。）'],
        fetch: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗跑出去捡了回来。）\n* （你们就这样玩了一会抛接游戏。）'
        ],
        fetchTalk: pager.create(
            0,
            ['<11>{#p/basic}{~}哈！！\n有趣的扳手\n出现了！'],
            ['<11>{#p/basic}{~}哈！！\n又出现了！']
        ),
        fetchTalkX1: ["<11>{#p/basic}{~}它去哪\n了！？"],
        fetchTalkX2: ["<11>{#p/basic}{~}我的扳手\n在哪里！？"],
        flirt1: ['<11>{#p/basic}{~}（情不自禁\n地脸红）'],
        invisStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一击。"] : ['<32>{#p/story}* 遁狗找不到你了。'],
        name: '* 遁狗',
        fetchStatus: ['<32>{#p/story}* 遁狗喜欢玩抛接游戏！'],
        fetchpet: ['<32>{#p/human}* （但是遁狗忙于寻找扳手，\n  没时间让你摸。）'],
        fetchflirt: ['<32>{#p/human}* （但是遁狗忙于寻找扳手，\n  没时间听你说话。）'],
        fetchcuddle: ['<32>{#p/human}* （但是遁狗忙于寻找扳手，\n  没时间让你抱。）'],
        normaStatus: () => (world.goatbro ? ['<32>{#p/asriel2}* 遁狗。'] : ["<32>{#p/story}* 遁狗知道你在这里。"]),
        pet: () => [
            '<32>{#p/human}* （你摸了摸遁狗。）',
            ...(world.goatbro
                ? [
                    [],
                    ['<32>{#p/asriel2}* ...又摸？'],
                    ["<32>{#p/asriel2}* 摸狗有那么有趣吗..."],
                    ['<32>{#p/asriel2}* ...有趣吗？'],
                    ['<32>{#p/asriel2}* 蠢死了。'],
                    ['<32>{#p/asriel2}* 你非得要这么摸吗？'],
                    ['<32>{#p/asriel2}* ...非得摸吗？'],
                    ['<32>{#p/asriel2}* 我看真是。'],
                    ['<32>{#p/asriel2}* ...'],
                    ['<32>{#p/asriel2}* 事态快要失控了...'],
                    ['<32>{#p/asriel2}* 还摸？\n* 没完了是吧...'],
                    ['<32>{#p/asriel2}* 哇哦。\n* 后面忘了。'],
                    ['<32>{#p/asriel2}* 你摸得可真是不亦乐乎啊。'],
                    ['<32>{#p/asriel2}* ...']
                ][Math.min(battler.volatile[0].vars.pet - 1, 13)]
                : [])
        ],
        cuddle: pager.create(
            0,
            ['<11>{#p/basic}{~}抱抱！？\n行吧，至少\n我知道它在\n哪里了！'],
            ['<11>{#p/basic}{~}又抱！？']
        ),
        petStatus: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一击。"] : ['<32>{#p/story}* 遁狗已经被摸过了。'],
        petTalk1: ["<11>{#p/basic}{~}啥！！！\n有人摸我！"],
        petTalk2: ["<11>{#p/basic}{~}那人从哪\n冒出来的！？"],
        petTalk3: ["<11>{#p/basic}{~}咋还\n没完了呢！！"],
        petTalk4: ['<11>{#p/basic}{~}汪呜，\n摸得可\n真彻底啊！！'],
        petTalk5: ['<11>{#p/basic}{~}（爽死了）'],
        petTalk6: ['<11>{#p/basic}{~}（活力四射）'],
        petTalk7: ['<11>{#p/basic}{~}居然还在摸！'],
        petTalk8: ['<11>{#p/basic}{~}还在摸！！'],
        petTalk9: ['<11>{#p/basic}{~}还\n在\n摸！！！'],
        petTalk10: ["<11>{#p/basic}{~}够了。\n玩闹结束了。"],
        petTalk11: ['<11>{#p/basic}{~}我都说了，\n“结束了”！'],
        petTalk12: ["<11>{#p/basic}{~}我滴妈，\n居然还没有停！"],
        petTalk13: ["<11>{#p/basic}{~}我的天呐，\n抚摸永不停歇！！"],
        petTalk14: ['<11>{#p/basic}{~}汪呜——！！！'],
        query1: ['<11>{#p/basic}{~}别想逃！'],
        query2: ["<11>{*}{#p/basic}{~}哈！\n它动了！\n它肯定动了！{^30}{%}"],
        query3: ['<11>{#p/basic}{~}我倒要看看\n这次它还动吗？'],
        status1: () => (world.goatbro ? ['<32>{#p/asriel2}* 遁狗。'] : ['<32>{#p/story}* 遁狗挡住了去路！']),
        sussy: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 遁狗。'] : ['<32>{#p/basic}* 遁狗对你的行动\n  十分戒备。']
    },
    b_opponent_lesserdog: {
        act_check: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 小犬座，一条蠢狗。\n* 估计他都不知道自己为啥在这。"]
                : ['<32>{#p/story}* 小犬座 - 攻击12 防御2\n* 手持一把闪亮的狗狗长剑，\n  剑身由“砹锌合金”锻造而成。'],
        act_check2: [
            '<32>{#p/story}* 小犬座 - 攻击12 防御2\n* 这只小狗受到了难以愈合的创伤，\n  想要夹起尾巴逃跑。'
        ],
        act_check3: [
            "<32>{#p/story}* 小犬座 - 攻击12 防御2\n* 这个怪物拥有着\n  全银河系最长的脖子。"
        ],
        act_check4: ['<32>{#p/story}* 小犬座 - 攻击12 防御2\n* 为破译你发出的\n  爱的密码而付出全力。'],
        act_check5: ['<32>{#p/story}* 小犬座 - 攻击12 防御2\n* 这只小狗的旅程才刚刚开始。'],
        act_flirt: ['<32>{#p/human}* （你用摩斯密码的方式\n  拍抚着小犬座，\n  以此传达你对它的爱意。）'],
        act_handshake: [
            "<32>{#p/human}* （你把手放在小犬座的头上\n  晃啊晃，抚摸着它的毛。）"
        ],
        act_inquire: [
            "<32>{#p/human}* （你抚摸着小犬座，\n  并问它好狗狗是谁。\n  它兴奋地汪汪叫以示回答。）"
        ],
        act_tickle: [
            "<32>{#p/human}* （你抓挠着小犬座的侧边\n  来爱抚它。）\n* （它兴奋得近于狂乱。）"
        ],
        fetch: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗伸长脖子把扳手捡了回来。）',
            '<32>{#p/human}* （你们就这样\n  玩了一会抛接游戏。）',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 但是为什么呢？'] : [])
        ],
        fetchStatus: ['<32>{#p/story}* 小犬座喜欢玩抛接游戏！'],
        fetchTalk: ['<11>{#p/basic}{~}（剧烈\n喘喘）'],
        hurtStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 离死不远了。']
                : ['<32>{#p/story}* 小犬座将它的尾巴\n  夹到两条腿之间。'],
        name: '* 小犬座',
        petTalk1: ['<11>{#p/basic}{~}（喘气 \n喘气）'],
        petTalk2: ['<11>{#p/basic}{~}（轻微的\n犬叫声）'],
        petTalk3: ['<11>{#p/basic}{~}（尾巴\n摇摇）'],
        petTalk4: ['<11>{#p/basic}{~}（想着吃的）'],
        petTalk5: ['<11>{#p/basic}{~}（喘气！\n喘气！）'],
        petTalk6: ['<11>{#p/basic}{~}（兴奋\n叫喊）'],
        petTalk7: ['<11>{#p/basic}{~}（摩托\n发动）'],
        petTalk8: ['<11>{#p/basic}{~}（飞机\n起飞）'],
        petTalk9: ['<11>{#p/basic}{~}（水壶\n鸣笛）'],
        petTalk10: ['<11>{#p/basic}{~}（...）'],
        petTalk11: ['<11>{#p/basic}{~}（来自\n星空的\n汪汪）'],
        petTalk12: ['<11>{#p/basic}{~}（汪汪）'],
        petText1: () => ['<32>{#p/human}* （你只是稍微抬了下手。）', '<32>{#p/basic}* 好兴奋哦！'],
        petText2: () => [
            '<32>{#p/human}* （你轻轻地摸了一下狗子。）',
            "<32>{#p/basic}* 它已经兴奋过头了...",
            ...(world.goatbro ? ['<32>{#p/asriel2}* 狗子们还真喜欢被摸啊。'] : [])
        ],
        petText3: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            "<32>{#p/basic}* 它仰起头，迎向你的手心。",
            ...(world.goatbro ? ["<32>{#p/asriel2}* 够了，你都摸过它了。\n* 真没必要继续摸了。"] : [])
        ],
        petText4: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 真是只好狗狗。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 继续摸它有必要吗？'] : [])
        ],
        petText5: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 它的兴奋永无止境...',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 没必要继续摸了。'] : [])
        ],
        petText6: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 会心一摸！\n* 狗子的兴奋度增加了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 天呐，$(name)。'] : [])
        ],
        petText7: () => [
            '<32>{#p/human}* （你得跳起来才摸得到狗子了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 我们不能以摸狗为生。"] : [])
        ],
        petText8: () => [
            '<32>{#p/human}* （你想摸摸小犬座，\n  结果，连够都够不到。）',
            '<32>{#p/basic}* 不过它还是更加兴奋了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 我们真要摸一整天狗吗...？'] : [])
        ],
        petText9: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 根本没法停下这场闹剧。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        petText10: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 不积跬步，无以至千里。\n  不积小摸，无以得巨狗。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 为啥要在这浪费时间？'] : [])
        ],
        petText11: () => [
            '<32>{#p/human}* （你呼唤着小犬座，\n  然而它已经听不到你说话了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 这下好了。\n* 再也别想够着它了。"] : [])
        ],
        petText12: () => ['<32>{#p/basic}* ...', ...(world.goatbro ? ['<32>{#p/asriel2}* ？？？'] : [])],
        petText13: () => [
            '<32>{#p/human}* （你又够得着小犬座了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 你跟我开玩笑呢是吧？"] : [])
        ],
        petText14: () => ['<32>{#p/human}* （你摸了摸小犬座。）'],
        petText15: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            "<32>{#p/basic}* 你可能有什么毛病。"
        ],
        petText16: () => [
            '<32>{#p/human}* （你没摸着小犬座，\n  但它很看好你的努力。）',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 给我停下。'] : [])
        ],
        petText17: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 节制撸狗，人人有责。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 请你停下。'] : [])
        ],
        petText18: () => [
            '<32>{#p/human}* （你摸了摸小犬座。）',
            '<32>{#p/basic}* 闹剧还在继续。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        petText19: () => [
            '<32>{#p/human}* （你够不着小犬座了。）',
            ...(world.goatbro ? ["<32>{#p/asriel2}* 好了，该结束了。\n* 赶紧杀了这个蠢货。"] : [])
        ],
        petText20: () => [
            '<32>{#p/human}* （开玩笑吧。）',
            '<32>{#p/basic}* ...开玩笑吧。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 开玩笑吧...'] : [])
        ],
        statusX: ["<32>{#p/asriel2}* 不堪一击。"],
        status0: () => (world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 小犬座出现了。']),
        status1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座将自己的头\n  歪向一侧。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座觉得你的武器\n  是狗饼干。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座有点心不在焉。'],
        status4: () => (world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 有一股狗粮的气味。']),
        status5: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 小犬座在兴奋地汪汪叫。'],
        status6: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 小犬座有点兴奋过头了。'],
        status7: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座看样子\n  根本停不下来。'],
        status8: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 小犬座正在下降。'],
        status9: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 小犬座正在尝试着编码。'],
        status10: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ["<32>{#p/story}* 小犬座由于看不见你\n  而发出呜呜的哀鸣。"],
        status11: () => (world.goatbro ? ['<32>{#p/asriel2}* 小犬座。'] : ['<32>{#p/story}* 你好啊。']),
        status12: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座对于你的生活选择\n  表示质疑。'],
        status13: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 小犬座。']
                : ['<32>{#p/story}* 小犬座去了没有任何狗狗\n  到过的地方。']
    },
    b_opponent_dogamy: {
        act_check: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米，一条废狗。\n* 纯靠他的疯狗老婆过活。']
                : ['<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 狗媳儿的老公。\n* 只认识他闻到的东西。'],
        act_check2: ['<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 老婆死了，成了鳏夫。\n* 沉浸在悲伤中，鼻子也不好使了。'],
        act_check3: ['<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 狗媳儿的老公。\n* 认识的东西比先前更多了。'],
        act_check4: ["<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 狗媳儿的老公。\n* 也想把这份爱分享给老婆...？"],
        act_check5: ["<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 狗媳儿的老公。\n* 你要让他走... 他大概也不介意？"],
        fetchText: [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗们跑出去捡了回来。）\n* （你们就这样玩了一会抛接游戏。）'
        ],
        fetchTextLone: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （但狗来米没有理它，\n  任由其滚落到了边缘。）',
            ...(world.goatbro && SAVE.flag.n.ga_asrielSpannerComment++ < 1 ? ['<32>{#p/asriel2}* 预料到了。'] : [])
        ],
        flirtTalk1: ['<11>{#p/basic}{~}啊！\n但是为啥\n...！？'],
        flirtTalk2: ['<11>{#p/basic}{~}爱无处不在？'],
        flirtTalk3: ["<11>{#p/basic}{~}你刚才..."],
        flirtTalk4: ["<11>{#p/basic}{~}这只小狗在\n干什么？"],
        flirtText: [
            '<32>{#p/human}* （你向狗来米调情。）',
            "<32>{#p/basic}* 你的... 信息素，\n  传到了狗来米的鼻子上。"
        ],
        flirtTextLone: ['<32>{#p/human}* （你向狗来米调情。）', "<32>{#p/basic}* 狗来米的表情没有发生变化。"],
        loneStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 只剩一个了。']
                : ['<32>{#p/story}* 狗媳儿一心想要踢\n  人类的尾巴。'],
        loneTalk1: ['<11>{#p/basic}{~}汪呜！'],
        loneTalk2: ['<11>{#p/basic}{~}呜——'],
        loneTalk3: ['<11>{#p/basic}{~}嗷呜...'],
        name: '* 狗来米',
        fetchStatus: ['<32>{#p/story}* 狗夫妇喜欢玩抛接游戏！'],
        fetchStatusX: ["<32>{#p/story}* 狗狗们的思绪正指数增长！"],
        otherPet: ['<11>{#p/basic}{~}...'],
        petNeedStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗媳儿正在寻求关爱。'],
        petStatus: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 不堪一击。"]
                : ["<32>{#p/story}* 狗狗们的思绪增加了！"],
        petTalk1: ['<11>{#p/basic}{~}手拿开，\n你这个\n该死的\n人类。'],
        petTalk1x: ['<11>{#p/basic}{~}手拿开，\n你这只\n奇怪的\n小狗。'],
        petTalk2: ['<11>{#p/basic}{~}哇！！！\n来自另一只\n小狗的抚摸\n！！！'],
        petTalk3: ["<11>{#p/basic}{~}停下！\n别碰她！"],
        petTalk4: ['<11>{#p/basic}{~}那我呢\n......'],
        petTalk5: ['<11>{#p/basic}{~}谢谢你...'],
        petText: ['<32>{#p/human}* （你抚摸了狗来米。）'],
        petTextLone: ['<32>{#p/human}* （你尝试抚摸狗来米，\n  但他畏惧地缩起自己的头。）'],
        randTalk1: () =>
            world.goatbro
                ? ['<11>{#p/basic}{~}王子已经\n失去了\n理智...']
                : ["<11>{#p/basic}{~}带走\n我老婆...\n身上的\n跳蚤。"],
        randTalk2: () =>
            world.goatbro ? ['<11>{#p/basic}{~}你走的\n有点太远了...'] : ["<11>{#p/basic}{~}别碰我的\n热狗。"],
        randTalk3: () =>
            world.goatbro
                ? ["<11>{#p/basic}{~}我们会\n打倒你！"]
                : ['<11>{#p/basic}{~}克历614年\n卖萌大赛\n冠军！！'],
        randTalk4: () =>
            world.goatbro ? ["<11>{#p/basic}{~}这次\n你不会赢的..."] : ["<11>{#p/basic}{~}咱们一起\n踩烂人类的\n尾巴！！"],
        resmellStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗狗们把你当成了\n  一条走丢的小狗。'],
        resmellText1: [
            '<32>{#p/human}* （你让狗狗们再闻闻你。）',
            '<32>* （你闻起来仍然很古怪。）'
        ],
        resmellText2: [
            '<32>{#p/human}* （你让狗狗们再闻闻你。）',
            '<32>* （在泥里打了几个滚后，\n  你的气味正常了。）'
        ],
        resmellText3: [
            '<32>{#p/human}* （你让狗狗们再闻闻你，\n  但他们已经知道你的气味正常了。）'
        ],
        resmellTextFetch: [
            '<32>{#p/human}* （你让狗狗们闻闻你，\n  但他们正忙着做别的事。）'
        ],
        resmellTextLone: ["<32>{#p/human}* （你让狗来米闻闻你，\n  但他连鼻子都没抬一下。）"],
        rollStatus: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 你会把衣服弄脏的，\n  $(name)。"]
                : ['<32>{#p/story}* 狗狗们也许想重新闻闻你。'],
        rollText: () => [
            '<32>{#p/human}* （你在泥里打了几个滚。）\n* （这泥好像是合成的。）',
            '<32>{#p/basic}* 你的气味有变化了...',
            ...(world.goatbro ? ['<32>{#p/asriel2}* 你在做什么。'] : [])
        ],
        rollText2: [
            '<32>{#p/human}* （你在泥里打了几个滚。）\n* （这泥好像是合成的。）',
            '<33>{#p/basic}* 你的气味已经变了。'
        ],
        rollTextLone: () => [
            "<32>{#p/human}* （你在狗媳儿的尘埃里打了几个滚。）",
            '<32>{#p/basic}* 狗来米更颓丧了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        smellTalk1: ["<11>{#p/basic}{~}嗯？\n那是\n什么气味？"],
        smellTalk2: ['<11>{#p/basic}{~}什么！\n闻上去\n像是...'],
        smellTalk3: ['<11>{#p/basic}{~}啊！\n多么可爱的\n气味...'],
        status1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗狗们不停地挥舞着各自的斧头\n  以保护彼此。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗狗们正在重新评估\n  你的气味。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗狗们正为下一场情侣大赛\n  做练习。'],
        status4: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗狗们正互相低声说着甜言蜜语。'],
        susText: ["<32>{#p/basic}* 狗狗们仍然认为你是个\n  臭烘烘的人类。"],
        fetchTalk: ['<11>{#p/basic}{~}抛接游戏\n真是\n太有趣啦！'],
        fetchTalkX: ['<11>{#p/basic}{~}和另外一只\n小狗狗一起\n玩抛接\n游戏！？']
    },
    b_opponent_dogaressa: {
        act_check: () =>
            world.goatbro
                ? ["<32>{#p/asriel2}* 狗媳儿，一条疯狗。\n* 没了她老公，分分钟发疯。"]
                : ['<32>{#p/story}* 狗媳儿 - 攻击14 防御5\n* 这只小狗认为她丈夫很可爱。\n  仅限于气味的那种？'],
        act_check2: ['<32>{#p/story}* 狗媳儿 -  攻击14 防御5\n* 这只小狗非常想念她的老公\n  仅限于被杀掉后的那种？'],
        act_check3: ['<32>{#p/story}* 狗媳儿 - 攻击14 防御5\n* 对这只小狗来说\n  事态进展得很顺利。'],
        act_check4: [
            "<32>{#p/story}* 狗媳儿 - 攻击14 防御5\n* 这只小狗发觉可爱的东西\n  不只有她老公。"
        ],
        act_check5: ["<32>{#p/story}* 狗来米 - 攻击14 防御5\n* 这只小狗在为她老公的安危担忧。"],
        fetchTextLone: () => [
            '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗媳儿将其捡了起来，然后摔了个粉碎。）',
            ...(world.goatbro && SAVE.flag.n.ga_asrielSpannerComment++ < 1 ? ['<32>{#p/asriel2}* 预料到了。'] : [])
        ],
        flirtTalk1: ['<11>{#p/basic}{~}（嘿！\n别闹了！）'],
        flirtTalk2: ['<11>{#p/basic}{~}（变得\n越来越\n奇怪了。）'],
        flirtTalk3: ['<11>{#p/basic}{~}（...\n跟我调情！\n啊！）'],
        flirtTalk4: ['<11>{#p/basic}{~}（我觉得\n它爱我，\n非常爱我。）'],
        flirtText: [
            '<32>{#p/human}* （你向狗媳儿调情。）',
            "<32>{#p/basic}* 你的... 信息素，\n  传到了狗媳儿的鼻子上。"
        ],
        flirtTextLone: [
            '<32>{#p/human}* （你向狗媳儿调情。）',
            "<32>{#p/basic}* 狗媳儿的表情没有发生变化。"
        ],
        loneStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 只剩一个了。'] : ['<32>{#p/story}* 狗来米心碎了。'],
        loneTalk1: ['<11>{#p/basic}{~}（有你\n好受的。）'],
        loneTalk2: ["<11>{#p/basic}{~}（看我不\n弄死你。）"],
        name: '* 狗媳儿',
        otherPet: ['<11>{#p/basic}{~}（...）'],
        petNeedStatus: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 狗来米和狗媳儿。']
                : ['<32>{#p/story}* 狗来米正在寻求关爱。'],
        petTalk1: ["<11>{#p/basic}{~}（他可不是\n你的老公，\n知道吗？）"],
        petTalk2: ["<11>{#p/basic}{~}（嘿！\n别忽视\n我啊！）"],
        petTalk3: ['<11>{#p/basic}{~}（当心\n狗狗。）'],
        petTalk4: ['<11>{#p/basic}{~}（狗狗\n抚摸狗狗...\n好神奇！）'],
        petTalk5: ["<11>{#p/basic}{~}（你是\n最棒的！）"],
        petText: ['<32>{#p/human}* （你抚摸了狗媳儿。）'],
        petTextLone: ['<32>{#p/human}* （你试图抚摸狗媳儿，\n  但她只是对你低吼。）'],
        randTalk1: () => (world.goatbro ? ['<11>{#p/basic}{~}（确实。）'] : ["<12>{#p/basic}{~}（别真的\n那么做...）"]),
        randTalk2: () => (world.goatbro ? ['<11>{#p/basic}{~}（够远了。）'] : ['<11>{#p/basic}{~}（他指的\n是我。）']),
        randTalk3: () =>
            world.goatbro
                ? ['<11>{#p/basic}{~}（必要时\n使用武力。）']
                : ['<11>{#p/basic}{~}（我们当然\n是冠军。）'],
        randTalk4: () =>
            world.goatbro ? ["<11>{#p/basic}{~}（时间到。）"] : ['<11>{#p/basic}{~}（人类\n有尾巴\n吗？）'],
        resmellTalkLone: ['<11>{#p/basic}{~}（这就是\n你想要的\n吗？？）\n（嗯？）'],
        resmellTextLone: [
            '<33>{#p/human}* （你激励狗媳儿来闻闻你，\n  她用鼻子使劲在你脸上\n  蹭来蹭去。）'
        ],
        rollTextLone: () => [
            "<32>{#p/human}* （你在狗来米的尘埃里打了几个滚。）",
            '<32>{#p/basic}* 狗媳儿更疯狂了。',
            ...(world.goatbro ? ['<32>{#p/asriel2}* ...'] : [])
        ],
        smellTalk1: ['<11>{#p/basic}{~}（闻起来\n很迷...）'],
        smellTalk2: ['<11>{#p/basic}{~}（你真的\n是只\n小狗吗！？）'],
        smellTalk3: ['<11>{#p/basic}{~}（这气味...\n好像是只\n奇怪小狗！）'],
        fetchTalk: ['<11>{#p/basic}{~}（我们喜欢玩\n抛接游戏。）'],
        fetchTalkX: ['<11>{#p/basic}{~}（这只狗狗\n什么事\n都能做！）']
    },
    b_opponent_greatdog: {
        act_check: () =>
            world.goatbro
                ? ['<33>{#p/asriel2}* 大犬座，一条傻狗。\n* 这群狗里面，\n  属它头脑简单，四肢发达。']
                : ["<32>{#p/story}* 大犬座 - 攻击15 防御8\n* 太过兴奋，以至于将\n  战斗当作儿戏。"],
        act_check2: ['<32>{#p/story}* 大犬座 - 攻击15 防御8\n* 渴望着关爱与照顾...'],
        act_check3: ['<32>{#p/story}* 大犬座 - 攻击15 防御8\n* 已经累到虚脱了。'],
        act_flirt: [
            '<32>{#p/human}* （你向大犬座调情。）',
            '<32>{#p/basic}* 大犬座尴尬地歪着头。'
        ],
        beckonText: [
            '<32>{#p/human}* （你叫了叫大犬座。）',
            '<32>{#p/basic}* 它跃向你，甩了你满脸口水。'
        ],
        closeStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 大犬座。'] : ['<32>{#p/story}* 大犬座渴望着关爱。'],
        closeText: ["<32>{#p/human}* （你叫了叫大犬座。）\n* （但狗狗只是竖了竖耳朵。）"],
        doneText: ['<32>{#p/basic}* 大犬座觉得你太无趣了。'],
        fetch: () =>
            world.goatbro
                ? [
                    '<32>{#p/human}* （你把扳手扔了出去。）\n* （大犬座把它吸收进自己的身体，\n  然后若无其事地继续玩耍。）',
                    '<32>{#p/asriel2}* 呃... 这河里吗。'
                ]
                : [
                    '<32>{#p/human}* （你把扳手扔了出去。）\n* （狗狗跑出去捡了回来。）\n* （你们就这样玩了一会抛接游戏。）'
                ],
        hurtStatus: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 离死不远了。'] : ['<32>{#p/story}* 大犬座正缓缓地喘着气。'],
        ignoreStatus1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 大犬座。']
                : ['<32>{#p/story}* 大犬座只是想要一些关爱。'],
        ignoreStatus2: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 大犬座。'] : ['<32>{#p/story}* 大犬座正在卖萌。'],
        name: '* 大犬座',
        fetchStatus: ['<32>{#p/story}* 大犬座喜欢玩抛接游戏！'],
        petStatus1: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 大犬座。']
                : ['<32>{#p/story}* 大犬座正用前爪拍打着地面。'],
        petStatus2: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 大犬座。'] : ['<32>{#p/story}* 大犬座想要温柔的关爱。'],
        petStatus3: () =>
            world.goatbro ? ['<32>{#p/asriel2}* ...'] : ['<32>{#p/story}* 抚摸能量，百分之四十！'],
        petStatus4: () =>
            world.goatbro ? ["<32>{#p/asriel2}* 不堪一击。"] : ['<32>{#p/story}* 大犬座非常满足。'],
        petText0: ['<32>{#p/human}* （但是大犬座离你太远了，\n  你摸不着它。）'],
        petText1: [
            '<32>{#p/human}* （大犬座享受着你的抚摸，\n  它把整个身子都蜷缩在你的腿上。）',
            '<32>* （它太舒服了，呼呼睡着了。）',
            '<32>* （狗子打呼着，打呼着...）',
            '<32>* （...然后它醒了。）',
            "<32>{#p/basic}* 大犬座的兴奋度\n  毫无征兆地增加了！"
        ],
        petText2: [
            '<32>{#p/human}* （你想摸摸狗子...）',
            '<32>* （...然而它的兴奋能量\n  形成了一个反抚摸能量场。）'
        ],
        petText3: [
            '<32>{#p/human}* （你摸了摸狗狗。）\n* （他将自身全部重量都压到了\n  你身上。）',
            "<32>* （你的移动速度变慢了，但仍没有\n  给予狗狗足够的抚摸。）"
        ],
        petText4: [
            '<32>{#p/human}* （你又是一摸。）\n* （这一摸不得了，直接把\n  抚摸能量干到了百分之百！）',
            '<32>{#p/basic}* 大犬座四肢朝天躺在地上。'
        ],
        petText5: [
            '<32>{#p/human}* （你揉了揉狗狗的肚皮。）',
            '<32>{#p/basic}* 大犬座幸福地呜叫着。'
        ],
        playText1: ['<32>{#p/human}* （但大犬座不够兴奋，\n  不能和你一起玩。）'],
        playText2: [
            '<32>{#p/human}* （你放出了一个全息影像，\n  让狗狗去追。）',
            '<32>* （最终，全息影像无法聚合，\n  自动消散了。）',
            '<32>* （大犬座收集了这个区域\n  残存的所有能量，并将其\n  带还给你。）',
            '<32>{#p/basic}* 疲惫的大犬座把头\n  靠在了你身边...'
        ],
        playText3: ['<32>{#p/basic}* 大犬座精疲力尽，\n  不想再玩了。'],
        playText4: ['<32>{#p/human}* （但是大犬座已经开始在玩\n  抛接游戏了。）'],
        status0: () => (world.goatbro ? ['<32>{#p/asriel2}* 大犬座。'] : ['<32>{#p/story}* 大犬座出现了。']),
        status1: () =>
            world.goatbro ? ['<32>{#p/asriel2}* 大犬座。'] : ['<32>{#p/story}* 大犬座正紧紧地注视着你。'],
        status2: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 大犬座。']
                : ['<32>{#p/story}* 大犬座正等待你的指令。'],
        status3: () =>
            world.goatbro
                ? ['<32>{#p/asriel2}* 大犬座。']
                : ['<32>{#p/story}* 有股鲜榨小狗汁的味道。'],
        waitText: ['<32>{#p/basic}* 大犬座逐渐向你靠近。']
    },
    b_opponent_papyrus: {
        act_flirt: ['<32>{#p/human}* （你向帕派瑞斯调情。）'],
        act_insult: ['<32>{#p/human}* （你骂了帕派瑞斯一顿。）'],
        spanner: ['<32>{#p/human}* （你丢出旧版手。）\n* （帕派瑞斯将它叼在嘴里，\n  然后还给了你。）'],
        spannerTalk1: ['<15>{#p/papyrus}{#f/20}多么\n瞠目结舌的举动！'],
        spannerTalk2: [],
        spannerTalk3: ['<15>{#p/papyrus}{#f/20}我可以做一整天！\n就像电视里的那样！'],
        spannerTalk4: ['<15>{#p/papyrus}{#f/20}捏嘿嘿！'],
        sparableSpannerTalk1: ['<15>{#p/papyrus}{#f/20}现在，\n展示你的仁慈吧！'],
        sparableSpannerTalk2: ['<15>{#p/papyrus}{#f/20}...'],
        bullySpareTalk: [
            '<15>{#p/papyrus}{#f/27}怎么...\n天暗下来了？',
            "<15>{#f/27}看来抓你\n不是啥好主意...",
            "<15>{#f/15}没错！！\n我敢说，你正渴求着\n我的仁慈！",
            '<15>{#f/20}我，伟大的帕派瑞斯，\n乐意为您效劳！',
            '<15>{#f/20}人类，\n我会{@fill=#f00}饶恕{@fill=#000}你！！！',
            "<15>{#f/27}...是时候... 接受...\n我的{@fill=#f00}仁慈{@fill=#000}了..."
        ],
        act_check: () =>
            world.genocide
                ? ['<32>{#p/story}* 帕派瑞斯 - 攻击3 防御3\n* 亡兄之弟。']
                : papreal()
                    ? ['<32>{#p/story}* 帕派瑞斯 - 攻击3 防御3\n* 依然相信着你。']
                    : ['<32>{#p/story}* 帕派瑞斯 - 攻击20 防御20\n* 喜欢说“捏嘿嘿！”'],
        act_check2: ['<32>{#p/story}* 帕派瑞斯 - 攻击20 防御20\n* 一切都很顺利。'],
        act_check3: ['<32>{#p/story}* 帕派瑞斯 - 攻击20 防御20\n* 最最最仁慈的卫兵！'],
        capture1: [
            "<15>{#p/papyrus}{#f/20}看来你得进\n关押区了！！",
            '<15>{#f/24}...也叫车库。',
            '<15>{#f/20}咳咳，\n一个加固的车库！',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture2: [
            '<15>{#p/papyrus}{#f/24}好吧！！！你之\n前可能很机智地\n逃脱过关押区...',
            "<15>{#f/20}但这次，\n我升级了设施。",
            '<15>{#f/20}你不仅会\n被困住...',
            "<15>{#f/15}而且你永远\n也不愿离开！！！",
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture3: [
            '<15>{#p/papyrus}{#f/20}你也许...\n充满决心！',
            "<15>然而这对我并\n没有什么卵用！！",
            '<15>我是最有决心的！',
            '<99>{#f/24}如果你认为\n你比最有决心\n还有决心的话...',
            '<15>{#f/20}那简直是大错\n特错！语法上\n就是错的！',
            '<15>{#f/24}因为正确的说法\n应该是...',
            '<15>{#f/20}你不如帕派瑞斯，\n最最有决心的人\n那么最有决心！',
            '<15>{#f/10}我希望\n你喜欢这堂课。',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture4: [
            '<15>{#p/papyrus}{#f/24}你确定\n你能坚持下去吗？',
            '<15>{#f/21}再次被抓住一定\n让你感到沮丧！！！',
            "<15>{#f/21}我不想让你\n因为一再失败\n而感到生气...",
            '<15>{#f/20}也许下次我们可以\n跳过这场战斗！',
            "<15>{#f/20}现在，你还是要\n回到关押区！！！",
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        capture5: [
            '<15>{#p/papyrus}{#f/27}我嘞个...\n还来？？？',
            '<15>{#f/15}好吧，如果你坚持的话...！',
            '<15>{#f/20}捏嘿嘿嘿嘿\n嘿嘿！！！'
        ],
        checkTalk: ['<15>{#p/papyrus}{#f/20}捏嘿嘿！'],
        death1: () =>
            world.genocide
                ? ['<15>{#p/papyrus}{#f/27}不...\n不-不...']
                : ["<15>{#p/papyrus}{#f/21}呃，我没想到\n会这样..."],
        death2: () =>
            world.genocide
                ? ['<15>{#p/papyrus}{#f/21}衫斯，我...', '<15>{#f/33}{@random=1.1/1.1}我让你失望了...']
                : papreal()
                    ? [
                        '<15>{#p/papyrus}{#f/27}...尽-尽管如此，\n我仍然相信你！',
                        '<15>{#p/papyrus}{#f/21}只要你努力，\n肯定能变得更好...',
                        '<15>{#p/papyrus}{#f/27}我-我保证...！'
                    ]
                    : ['<15>{#p/papyrus}{#f/27}...幸-幸好，\n我的头还在！'],
        dots: ['<32>{#p/basic}* ...'],
        flirt0: ['<32>{#p/basic}* 可爱。'],
        flirt1: [
            '<15>{#p/papyrus}{#f/20}什么！？对我\n调-调-调情！？',
            '<15>你终于表露出\n你的{@fill=#f00}真实感受{@fill=#000}了！',
            "<15>但-但是！\n我可是个\n眼光很高的\n骷髅！！！",
            '<15>你又能做什么\n来回报我的\n爱意呢？？？'
        ],
        flirt2: [choicer.create('* （你要怎么回答？）', '\n我会做\n意大利面', '\n\n我啥也不会',)],
        flirt3a: ['<15>{#p/papyrus}{#f/24}这种\n自信的品格...\n让我想到了...'],
        flirt3b: ['<15>{#p/papyrus}{#f/24}这种\n谦逊的品格...\n让我想到了...'],
        flirt4: [
            '<15>{#f/22}我自己！！！',
            "<15>{#f/10}你完美地\n贴合了我的\n所有标准！！！",
            '<15>{#f/27}我想这意味着...\n我必须和你来场\n约会了？'
        ],
        flirt5: ["<15>{#p/papyrus}{#f/20}约会的事\n还是等到我抓住\n你之后再谈吧！"],
        flirt6: ["<32>{#p/human}* （没有效果...）\n* （似乎行动不会让这战斗\n  进一步升级。）"],
        flirt7: ['<32>{#p/human}* （但帕派瑞斯现在忙于战斗，\n  没时间听你说话。）'],
        flirtStatus1: ['<32>{#p/story}* 帕派瑞斯正在为约会考虑\n  要穿什么。'],
        flirtStatus2: ['<32>{#p/story}* 帕派瑞斯往他耳后拍了些\n  骨龙水。'],
        flirtStatus3: ['<32>{#p/story}* 帕派瑞斯正在为约会考虑\n  要煮什么。'],
        flirtStatus4: ['<32>{#p/story}* 帕派瑞斯往他耳后拍了些\n  番茄酱。'],
        flirtStatus5: ['<32>{#p/story}* 帕派瑞斯正在想{@fill=#ff0}方色{@fill=#fff}法\n  变得出名。'],
        flirtStatus6: ['<32>{#p/story}* 帕派瑞斯往他耳后拍了些\n  镁塔牌面霜。'],
        flirtStatus7: ['<32>{#p/story}* 帕派瑞斯往他耳后拍了些\n  镁塔动漫定妆粉。'],
        flirtStatus8: ['<32>{#p/story}* 帕派瑞斯往他耳后抹了点\n  镁塔牌可爱汁。'],
        flirtStatus9: ["<32>{#p/story}* 帕派瑞斯意识到他没有耳朵。"],
        flirtStatus10: ['<32>{#p/story}* 帕派瑞斯头上随便贴了一些药膏。'],
        flirtStatus11: ["<32>{#p/story}* ...他还在想{@fill=#ff0}方色{@fill=#fff}法\n  变得出名。"],
        hurtStatus: ['<32>{#p/story}* 帕派瑞斯要被打败了。'],
        insult1: ['<15>{#p/papyrus}{#f/20}多么无私！', '<15>{#f/21}你想让我\n对这场战斗\n减轻心理负担...'],
        insult2: ["<15>{#p/papyrus}{#f/15}但你没必要\n对自己撒谎！！！"],
        insult3: ["<32>{#p/human}* （没有效果...）\n* （似乎行动不会让这战斗\n  进一步升级。）"],
        insult4: ['<32>{#p/human}* （但帕派瑞斯现在忙于战斗，\n  没时间听你说话。）'],
        name: '* 帕派瑞斯',
        randomStatus1: ['<32>{#p/story}* 帕派瑞斯正在准备一记\n  骨头攻击。'],
        randomStatus2: ['<32>{#p/story}* 帕派瑞斯准备了一记非骨头攻击，\n  然后花了一分钟的时间来纠正错误。'],
        randomStatus3: ['<32>{#p/story}* 帕派瑞斯正在做饭。'],
        randomStatus4: ['<32>{#p/story}* 帕派瑞斯悄悄说了一句“捏嘿嘿！”'],
        randomStatus5: ['<32>{#p/story}* 帕派瑞斯正在左右摇晃他的骨头。'],
        randomStatus6: ['<32>{#p/story}* 帕派瑞斯正在努力扮酷。'],
        randomStatus7: ['<32>{#p/story}* 帕派瑞斯正在考虑他的选择。'],
        randomStatus8: ['<32>{#p/story}* 骨头的气味。'],
        randomStatus9: ['<32>{#p/story}* 帕派瑞斯想起了\n  衫斯讲过的一段笑话，\n  忍不住笑了几下。'],
        spaghetti1: () => [
            '<15>{#p/papyrus}{#f/12}我的意大利面！',
            "<15>{#p/papyrus}{#f/13}看起来你似乎\n很喜欢吃...",
            papreal()
                ? "<15>{#p/papyrus}{#f/27}我很高兴\n能让你感到快乐！"
                : [
                    '<15>{#p/papyrus}{#f/27}而且我很期待我\n们可以共进晚餐！',
                    '<15>{#p/papyrus}{#f/27}而且我很期待为\n你制作更多美味！'
                ][(SAVE.data.n.state_papyrus_spaghet + 1) % 2]
        ],
        spaghetti2: ["<32>{#p/basic}* 要不是帕派瑞斯现在忙于战斗，\n  他大概就注意到了。"],
        specialStatus0: ["<32>{#p/story}* 帕派瑞斯的气场越来越强。"],
        specialStatus1: ['<32>{#p/story}* 特殊攻击。'],
        specialStatus2: ['<32>{#p/story}* 帕派瑞斯正全力以赴。'],
        specialStatus3: ['<32>{#p/story}* 帕派瑞斯将所有逻辑都抛之脑后。'],
        specialStatus4: ['<32>{#p/story}* 帕派瑞斯发觉自己有些缺乏逻辑，\n  又把它捞回来了。'],
        specialStatus5: ['<32>{#p/story}* 帕派瑞斯汗流浃背。'],
        specialStatus6: ["<32>{#p/story}* 帕派瑞斯已经束手无策了。"],
        status1: ['<32>{#p/story}* 帕派瑞斯正在饶恕你。'],
        status2: ['<32>{#p/story}* 帕派瑞斯挡住了去路！'],
        turnTalk0a: ["<15>{#p/papyrus}{#f/24}看来，\n你要来真的..."],
        turnTalk0b: ["<15>{#p/papyrus}{#f/24}看来，\n你不想战斗..."],
        turnTalk0c: ["<15>{#p/papyrus}{#f/20}那就让我看看\n你会如何应对\n我传说中的\n“蓝色攻击”！"],
        turnTalk0x: [
            "<15>{#p/papyrus}{#f/10}你现在是\n蓝色的了。",
            "<15>{#f/10}那就是\n我的攻击！",
            '<15>{#f/20}捏嘿嘿嘿嘿嘿\n嘿嘿嘿！！！'
        ],
        turnTalk1a: ['<15>{#p/papyrus}{#f/20}看好了！'],
        turnTalk1b: ['<15>{#p/papyrus}{#f/20}嗯...\n我在想我应该\n穿什么...'],
        turnTalk2a: ['<15>{#p/papyrus}{#f/20}你能跳多高呢？'],
        turnTalk2b: ["<15>{#p/papyrus}{#f/22}什么！？\n我才没有想着\n约会的事情呢！"],
        turnTalk3: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/21}...是不是只有我觉得\n空气有点不对劲？']
                : ["<15>{#p/papyrus}{#f/20}对！\n别逼我用出我的\n{@fill=#f00}特殊攻击{@fill=#000}！"],
        turnTalk4: () =>
            world.postnoot
                ? ["<15>{#p/papyrus}{#f/20}算了。\n应该没什么。"]
                : ['<15>{#p/papyrus}{#f/20}我都能嗅到\n我未来的\n人气了！！！'],
        turnTalk5: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/20}我还从\n我的未来里\n看到了番茄酱！']
                : ['<15>{#p/papyrus}{#f/20}帕派瑞斯:\n举世无双意面王！'],
        turnTalk6: () =>
            world.postnoot
                ? ['<15>{#p/papyrus}{#f/20}以及在特战队的\n一席之地！']
                : ['<15>{#p/papyrus}{#f/20}帕派瑞斯:\n特战队成员！'],
        turnTalk7: ['<15>{#p/papyrus}{#f/10}安黛因一定会\n为我感到骄傲！！'],
        turnTalk8: ['<15>{#p/papyrus}{#f/20}国王会在首塔\n为我建造一座\n雕像！！！'],
        turnTalk9: ["<15>{#p/papyrus}{#f/10}...我也会\n让我兄弟\n拥有一座的。"],
        turnTalk10: ["<15>{#p/papyrus}{#f/27}我们将会收获\n众多崇拜者！！\n但是..."],
        turnTalk11a: ['<15>{#p/papyrus}{#f/20}我又如何知道\n人们是否真心\n喜欢我呢？？？'],
        turnTalk11b: ['<15>{#p/papyrus}{#f/20}会有人像你一样\n喜欢我吗？'],
        turnTalk12: ['<15>{#p/papyrus}{#f/21}像你这样的人\n真是很少见...'],
        turnTalk13a: ["<15>{#p/papyrus}{#f/21}我不觉得他们\n会轻易放你走..."],
        turnTalk13b: ['<15>{#p/papyrus}{#f/21}再想约会\n估计会很难...'],
        turnTalk14: ["<15>{#p/papyrus}{#f/26}如果你被抓到，\n然后送走的话。"],
        turnTalk15: ['<15>{#p/papyrus}{#f/17}呃...\n管他呢！\n放弃吧！！'],
        turnTalk16: ['<15>{#p/papyrus}{#f/15}要么放弃，要么...\n就准备面对我的\n{@fill=#f00}特殊攻击{@fill=#000}！'],
        turnTalk17: ['<15>{#p/papyrus}{#f/20}没错！！！\n待会我就要使用\n我的{@fill=#f00}特殊攻击{@fill=#000}了！'],
        turnTalk18: [
            '<15>{#p/papyrus}{#f/20}在我使用\n{@fill=#f00}特殊攻击{@fill=#000}前...\n这是你的最后机会！'
        ],
        turnTalk19: ['<15>{#p/papyrus}{#f/20}看好了...！\n我的{@fill=#f00}特殊攻击{@fill=#000}！'],
        turnTalk19x: [
            '<15>{#p/papyrus}{#f/15}捏嘿嘿！',
            '<15>{#f/20}在这之前可没有人类\n能躲过我的\n{@fill=#f00}特殊攻击{@fill=#000}！',
            '<15>{#f/20}做好被抓住的准备吧！\n一劳永逸的那种！'
        ],
        turnTalk20: ['<15>{#p/papyrus}{#f/20}特殊攻击，\n阿尔法编阵！'],
        turnTalk21: ['<15>{#p/papyrus}{#f/20}特殊攻击，\n贝塔编阵！'],
        turnTalk22: ['<15>{#p/papyrus}{#f/20}特殊攻击，\n伽马编阵！'],
        turnTalk23: ['<15>{#p/papyrus}{#f/20}特殊攻击，\n德尔塔编阵！'],
        turnTalk24: [
            '<15>{#p/papyrus}{#f/27}哇塞！\n你也太强了吧！',
            '<15>{#f/20}但我可不怕！\n我不会被你的\n实力吓倒！',
            '<15>{#f/14}...特殊攻击...',
            '<15>{#f/17}{@fill=#f00}西格玛{@fill=#000}编阵！！！'
        ],
        turnTalk24x: [
            "<15>{#p/papyrus}{#f/27}行吧...！（喘气）\n很明显... 你不能！\n（喘气）打败我！",
            '<15>{#f/15}没错！！！\n我看见你被吓得\n全身发抖了！！',
            '<15>{#f/20}我，伟大的帕派瑞斯，\n选择给予你怜悯！！',
            '<15>{#f/20}我会{@fill=#f00}饶恕你{@fill=#000}，\n人类！！！',
            "<15>{#f/10}现在是你接受\n我{@fill=#f00}仁慈{@fill=#000}的机会了。"
        ],
        idleTalk: ['<15>{#p/papyrus}{#f/20}...'],
        idleTalkBullied: ['<18>{#p/papyrus}{#f/27}...'],
        secretFlirt1: ['<15>{#p/papyrus}{#f/27}你盼着能伴我左右...\n直到永远？', '<15>{#p/papyrus}{#f/21}呃...'],
        secretFlirt2: [
            '<15>{#p/papyrus}{#f/27}有人想拆散我们？',
            '<15>{#p/papyrus}{#f/21}是谁呢...'
        ],
        secretFlirt2x: [
            "<15>{#p/papyrus}{#f/27}所以你【不愿】\n与我在一起？",
            "<15>{#p/papyrus}{#f/14}但为何... 你不\n接受我的仁慈\n然后离我远去？"
        ],
        secretFlirt3: [
            "<15>{#p/papyrus}{#f/25}呃，我们还没到\n【那么】浓情\n蜜意的地步吧...",
            '<15>{#p/papyrus}{#f/15}...但事后\n我们可以继续！'
        ],
        secretFlirt3x: ["<15>{#p/papyrus}{#f/27}等等，\n【你】不想和我\n在一起？"],
        secretFlirt4: ['<15>{#p/papyrus}{#f/24}等等，你是想说...\n三角恋？？？'],
        secretFlirt4x: [
            "<15>{#p/papyrus}{#f/26}...所以你\n【不想】待会\n再试试？",
            '<15>{#p/papyrus}{#f/24}不仅如此，\n而且...',
            '<15>{#p/papyrus}{#f/22}你一开始就不想\n我们在一起？'
        ],
        secretFlirt5: ["<15>{#p/papyrus}{#f/22}或者你想说...\n如梯形般\n稳定的爱？"],
        secretFlirt5x: [
            "<15>{#p/papyrus}{#f/21}不是？那么就是\n说这段爱缺少了\n两条边？",
            "<15>{#p/papyrus}{#f/18}但是...\n这根本不算一个\n正确的形状！",
            "<15>{#p/papyrus}{#f/27}你是想说，\n我们的爱情永远\n不会开花！？"
        ],
        secretFlirt6: [
            '<15>{#p/papyrus}{#f/14}等等... 我明白了！',
            '<15>{#p/papyrus}{#f/15}王子嫉妒我们\n之间的爱情！',
            '<15>{#p/papyrus}{#f/24}所以...\n他设下圈套，\n阻止我们在一起！'
        ],
        secretFlirt6x: [
            "<15>{#p/papyrus}{#f/27}不是？\n但是至少我的\n方向是正确的吧？",
            '<15>{#p/papyrus}{#f/24}等等...\n梯形的形状...',
            "<15>{#p/papyrus}{#f/22}你是说\n我们此时\n深处牢笼？",
            "<15>{#p/papyrus}{#f/14}但是... 为何你\n不饶恕我然后\n逃离呢？",
            '<15>{#p/papyrus}{#f/21}...所以一定\n还有其他原因。',
            '<15>{#p/papyrus}{#f/26}不...\n我知道了！',
            
            '<15>{#p/papyrus}{#f/20}没错！\n我终于理解\n你的意思了！',
            '<15>{#p/papyrus}{#f/15}一定是那个\n“艾斯利尔”\n对你做了什么！',
            "<15>{#p/papyrus}{#f/14}他一定是通过\n某些手段阻止了\n你饶恕我的行为！"
        ],
        secretFlirt7: [
            '<15>{#p/papyrus}{#f/14}所以... 我不会\n让他的阴谋得逞！',
            '<15>{#p/papyrus}{#f/20}事实上，\n我已经有了一个\n完美的解决方案！',
            "<15>{#p/papyrus}{#f/10}为了避免发生如\n爱情剧里面的\n场景，\n我会绅士地离去。",
            "<15>{#p/papyrus}{#f/24}然后，\n当你单独\n和他在一起时...",
            "<15>{#p/papyrus}{#f/25}你将在这段恋情\n中处于一个\n完美的位置...",
            '<15>{#p/papyrus}{#f/15}这将让他不会\n伤害你的感情！',
            '<15>{#p/papyrus}{#f/20}捏嘿嘿嘿嘿嘿\n嘿嘿嘿嘿！！！'
        ],
        secretFlirt8: [
            '<15>{#p/papyrus}{#f/20}别担心，\n人类！',
            '<15>{#p/papyrus}{#f/14}我，帕派瑞斯，\n将确保我们不会\n受到任何伤害！',
            '<15>{#p/papyrus}{#f/20}为了你，\n我将饶恕我自己！',
            '<15>{#p/papyrus}{#f/20}然后我会找\n一个安全的地方\n躲起来。',
            "<15>{#p/papyrus}{#f/15}别担心，人类！\n一切尽在\n帕派瑞斯的掌控之中！"
        ],
        secretInsult1: ['<15>{#p/papyrus}{#f/27}呃... 大可不必？？？'],
        secretInsult2: ['<15>{#p/papyrus}{#f/21}蠢货...\n我好像在哪听过...'],
        secretInsult2x: [
            '<15>{#p/papyrus}{#f/22}或者没有...？',
            '<15>{#p/papyrus}{#f/24}所以，\n让我把事情\n搞清楚。',
            '<15>{#p/papyrus}{#f/27}你想说...\n你爱我？',
            '<15>{#p/papyrus}{#f/27}有什么东西想要\n破坏我们\n之间的爱情？'
        ],
        secretInsult3: ['<15>{#p/papyrus}{#f/29}搞什么...'],
        secretInsult3x: [
            "<15>{#p/papyrus}{#f/27}你骂我是个蠢货，\n是因为我没有\n感觉到\n你有多爱我？",
            '<15>{#p/papyrus}{#f/28}所以你想让... \n额...',
            "<15>{#p/papyrus}{#f/25}我—我的意思是，\n我们的关系还没\n有发展得\n【那么】快吧...",
            '<15>{#p/papyrus}{#f/15}...但事后\n我们可以继续！'
        ],
        secretInsult4: ["<15>{#p/papyrus}{#f/27}你骂我没脑子，\n没懂你啥意思..."],
        secretInsult4x: [
            "<15>{#p/papyrus}{#f/27}所以... 你想\n说我们身处在\n三角恋中？",
            "<15>{#p/papyrus}{#f/19}好吧，这至少解释了\n你说话为何\n这么刻薄！"
        ],
        secretInsult5: [
            '<15>{#p/papyrus}{#f/27}啥？\n“志在星辰大海，\n何必自暴自弃”...',
            '<15>{#p/papyrus}{#f/17}你在说啥呢...？'
        ],
        secretInsult5x: [
            '<15>{#p/papyrus}{#f/25}等等...\n你想让我知道\n你暗恋着我？',
            "<15>{#p/papyrus}{#f/22}我们的感情实际\n上是... 如梯形\n般稳定吗！？"
        ],
        secretInsult6: [
            '<15>{#p/papyrus}{#f/14}等等... 我明白了！',
            '<15>{#p/papyrus}{#f/21}蠢货...',
            '<15>{#p/papyrus}{#f/21}星辰大海...',
            '<15>{#p/papyrus}{#f/20}有颗星星，闪闪，\n他也喜欢叫人“蠢货”！',
            '<15>{#p/papyrus}{#f/25}我...',
            "<15>{#p/papyrus}{#f/22}我才反应过来\n是怎么回事！",
            '<15>{#p/papyrus}{#f/20}那个“艾斯利尔”好像\n也喜欢骂人蠢货！',
            '<15>{#p/papyrus}{#f/24}也就是说...',
            '<15>{#p/papyrus}{#f/22}你刚说的“星辰”\n肯定就是指他！',
            '<15>{#p/papyrus}{#f/19}他肯定干了啥，\n害【我】表现得\n像个蠢货！'
        ],
        secretInsult6x: [
            '<15>{#p/papyrus}{#f/10}哦...\n哦我知道了！',
            "<15>{#p/papyrus}{#f/10}你想说我是\n你的星辰大海！",
            "<15>{#p/papyrus}{#f/20}因为你一直\n想得到我的爱！",
            '<15>{#p/papyrus}{#f/27}哇哦...\n你这么做\n真的很奇怪。',
            '<15>{#p/papyrus}{#f/24}真的太奇怪了...',
            "<15>{#p/papyrus}{#f/15}...你应该有更好的事\n要做吧！",
            "<15>{#p/papyrus}{#f/21}毕竟，你如果只想\n告诉我这个...",
            '<15>{#p/papyrus}{#f/21}何必这么麻烦...',
            '<15>{#p/papyrus}{#f/27}而不是饶恕我\n后再谈这件事？',
            "<15>{#p/papyrus}{#f/21}除非...\n你【无法】饶恕我对吧。",
            '<15>{#p/papyrus}{#f/26}不...\n我知道了！',
            
            '<15>{#p/papyrus}{#f/20}没错！\n我终于理解\n你的意思了！',
            '<15>{#p/papyrus}{#f/24}既然那个\n“艾斯利尔”这么\n肯定你会\n杀了我...',
            "<15>{#p/papyrus}{#f/20}直觉告诉我，\n他用了什么方式\n干预了你的行为！",
            "<15>{#p/papyrus}{#f/15}他一直嫉妒\n你对我的感情！"
        ],
        secretInsult7: [
            '<15>{#p/papyrus}{#f/14}现在...\n我不会再\n被他骗了！',
            '<15>{#p/papyrus}{#f/20}我，帕派瑞斯，\n保证让他再也\n找不到我！',
            "<15>{#p/papyrus}{#f/15}别担心，人类！\n一切尽在\n帕派瑞斯的掌控之中！"
        ],
        sparableFlirt1: [
            "<15>{#p/papyrus}{#f/27}你现在\n要做的是饶恕，\n而不是调情！",
            '<15>{#f/14}我必须\n抗住诱惑！'
        ],
        sparableFlirt1x: [
            '<15>{#p/papyrus}{#f/27}啊？\n在这种时候... 调情？',
            "<15>{#f/14}嗯...\n这倒也算是一种\n赎罪方式！"
        ],
        sparableFlirt2: ['<15>{#p/papyrus}{#f/14}不-不...！'],
        sparableFlirt2x: ['<15>{#p/papyrus}{#f/14}啊-啊...！'],
        sparableFlirt3: ['<15>{#p/papyrus}{#f/14}...'],
        sparableInsult1: [
            "<15>{#p/papyrus}{#f/20}嘿，你没必要\n辱骂自己的！",
            '<15>{#f/21}我知道你已经尽力了...'
        ],
        sparableInsult1x: [
            "<15>{#p/papyrus}{#f/20}嘿，你没必要\n辱骂自己的！",
            "<15>{#f/15}人类，你要记住：\n来这里是为了\n做个好人的！"
        ],
        sparableInsult2: ['<15>{#p/papyrus}{#f/21}人类...'],
        sparableInsult2x: ['<15>{#p/papyrus}{#f/15}你可以的...！'],
        sparableInsult3: ['<15>{#p/papyrus}{#f/21}...']
    },
    b_opponent_shockasgore: {
        act_check: ['<32>{#p/asriel2}* 艾斯戈尔。\n* 亲手葬送自己家园的昏君。'],
        act_hug: ['<32>{#p/human}* （你想抱抱艾斯戈尔...）'],
        hugText: ['<32>{#p/human}* （...但你的身体直接穿了过去。）', '<32>{#p/asriel2}* ...啊？'],
        foodText: ['<11>{#p/asgore}{#f/5}那是...'],
        idleText1: ['<11>{#p/asgore}{#f/1}开玩笑吧...'],
        idleText2: ['<11>{#p/asgore}{#f/1}一定要\n诉诸暴力吗？'],
        idleText3: ['<11>{#p/asgore}{#f/1}为什么不能\n和平解决呢？'],
        idleText4: ['<11>{#p/asgore}{#f/1}真的有必要吗？'],
        stickText: [
            '<32>{#p/human}* （你朝艾斯戈尔扔出扳手。）\n* （扳手直接穿过了他的身体。）',
            '<32>{#p/asriel2}* ...啊？'
        ],
        miss: [
            '<11>{#p/asgore}{#f/2}...',
            '<11>{#f/1}我本人不在这，\n艾斯利尔。',
            "<11>{#f/2}这不过\n是个投影。"
        ],
        name: '* 艾斯戈尔',
        status1: ['<32>{#p/asriel2}* 现在杀了他，$(name)。'],
        status2: ['<32>{#p/asriel2}* ...']
    },

    i_berry: {
        battle: {
            description: '一小串半透明的浆果。',
            name: '洋梅'
        },
        drop: ['<32>{#p/human}* （你把洋梅扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （7 HP。）']
                : ['<32>{#p/basic}* “洋梅” 回复7 HP\n* 一小串半透明的浆果。'],
        name: '洋梅',
        use: ['<32>{#p/human}* （你吃掉了洋梅。）']
    },
    i_blookpie: {
        battle: {
            description: '将新鲜洋梅浸润在果冻中制作而成。',
            name: '洋梅派'
        },
        drop: () => [
            '<32>{#p/human}* （你把洋梅果冻派扔掉了。）',
            ...(instance('main', 'blookishly') !== void 0 // NO-TRANSLATE

                ? game.room === '_frontier4' // NO-TRANSLATE

                    ? ['<32>{#p/napstablook}* ......... 嗯？']
                    : ['<32>{#p/napstablook}* 哦..................']
                : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （99 HP。）']
                : ['<32>{#p/basic}* “洋梅果冻派” 回复99 HP\n* 将新鲜洋梅浸润在果冻中制作而成。'],
        name: '洋梅果冻派',
        use: () => [
            '<32>{#p/human}* （你吃掉了洋梅果冻派。）',
            ...(instance('main', 'blookishly') !== void 0 // NO-TRANSLATE

                ? game.room === '_frontier4' // NO-TRANSLATE

                    ? ['<32>{#p/napstablook}* ......... 嗯？']
                    : ['<32>{#p/napstablook}* 哦.........\n* 希望你爱吃.........']
                : [])
        ]
    },
    i_chip: {
        battle: {
            description: '请将其带往星系之外。',
            name: '“芯”型薯片'
        },
        drop: () => [
            '<32>{#p/human}* （你把“芯”型薯片扔掉了。）',
            ...(SAVE.data.b.svr && !SAVE.data.b.freedom
                ? ["<25>{#p/asriel1}{#f/15}* 额... 你不打算\n  保护好它吗？"]
                : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （45 HP。）\n* （比起吃掉它，你更想保护好它。）']
                : ['<32>{#p/basic}* “‘芯’型薯片” 回复45 HP\n* 请将其带往星系之外。'],
        name: '“芯”型薯片',
        use: () => [
            '<32>{#p/human}* （你咬了一口“芯”型薯片。）',
            ...(SAVE.data.b.svr && !SAVE.data.b.freedom
                ? ["<25>{#p/asriel1}{#f/15}* 额... 你不打算\n  保护好它吗？"]
                : world.darker || SAVE.data.b.ufokinwotm8
                    ? []
                    : calcHP() - SAVE.data.n.hp > 45
                        ? ['<32>{#p/basic}* 你的HP值获得了一个增量。']
                        : ['<32>{#p/basic}* 你的伤口被覆盖掉了。'])
        ]
    },
    i_eye: {
        battle: {
            description: '可随身携带的力场发射器。',
            name: '力场护盾'
        },
        drop: ['<32>{#p/human}* （你把力场护盾扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （7防御。）']
                : ['<32>{#p/basic}* “力场护盾” （7防御）\n* 可随身携带的力场发射器。'],
        name: '力场护盾',
        use: ['<32>{#p/human}* （你启动了力场护盾。）']
    },
    i_eye_x: {
        battle: {
            description: '可随身携带的力场发射器，\n但能量不足。',
            name: '力场护盾？'
        },
        drop: ['<32>{#p/human}* （你把力场护盾扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （5防御。）']
                : ['<32>{#p/basic}* “力场护盾” （5防御）\n* 可随身携带的力场发射器，\n  但能量不足。'],
        name: '力场护盾？',
        use: ['<32>{#p/human}* （你启动了力场护盾。）']
    },
    i_fruit: {
        battle: {
            description: '非欧几何形状的水果，\n里头比外边还大。',
            name: '幽灵水果'
        },
        drop: ['<32>{#p/human}* （你吸收了幽灵水果。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。）']
                : ['<32>{#p/basic}* “幽灵水果” 回复15 HP\n* 非欧几何形状的水果，\n  里头比外边还大。'],
        name: '幽灵水果',
        use: ["<32>{#p/human}* （你展开了幽灵水果多个面的空间。）"]
    },
    i_glove: {
        battle: {
            description: "源自尖端科技，揍人超级有力的\n仿生手套。",
            name: '超能手套'
        },
        drop: ['<32>{#p/human}* （你把超能手套扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （5攻击。）']
                : ['<32>{#p/basic}* “超能手套” （5攻击）\n* 源自尖端科技，揍人超级有力的\n  仿生手套。'],
        name: '超能手套',
        use: ['<32>{#p/human}* （你戴上了超能手套。）']
    },
    i_glove_x: {
        battle: {
            description: "虽然是仿制手套，\n但不妨碍你用它痛扁敌人。",
            name: '超能手套？'
        },
        drop: ['<32>{#p/human}* （你把超能手套扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （3攻击。）']
                : ['<32>{#p/basic}* “超能手套？” （3攻击）\n* 虽然是仿制手套，\n  但不妨碍你用它痛扁敌人。'],
        name: '超能手套？',
        use: ['<32>{#p/human}* （你戴上了超能手套。）']
    },
    i_milkshake: {
        battle: {
            description: '由白如珍珠的不明物质制成。',
            name: '奶昔'
        },
        drop: ['<32>{#p/human}* （你摆脱掉了奶昔。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （18 HP。）']
                : ['<32>{#p/basic}* “奶昔” 回复18 HP\n* 由白如珍珠的不明物质制成。'],
        name: '奶昔',
        use: () => [
            '<32>{#p/human}* （你咽下了最后一滴奶昔。）',
            ...(SAVE.data.b.svr || world.darker || SAVE.data.b.ufokinwotm8 ? [] : ['<32>{#p/basic}* ...好咸。'])
        ]
    },
    i_nice_cream: {
        battle: {
            description: '包装纸上印的不是笑话，\n而是一些天马行空的想象。',
            name: '冰意灵'
        },
        drop: ['<32>{#p/human}* （你把冰意灵扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。）']
                : ['<32>{#p/basic}* “冰意灵” 回复15 HP\n* 包装纸上印的不是笑话，\n  而是一些天马行空的想象。'],
        name: '冰意灵',
        use: pager.create(
            2,
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上写着拯救世界的冒险。）'
                    : '<32>{#p/basic}* “你是一个伟大的冒险家，\n   肩负着拯救世界的使命！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上把你描述成\n  一个星际飞船的船长。）'
                    : '<32>{#p/basic}* “你是一艘星际飞船的船长，\n   正驶向未知的太空！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上写着只有你一个人\n  能解开一个谜团。）'
                    : '<32>{#p/basic}* “一个巨大的谜团正在揭开，\n   而你是唯一能解开它的人！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上写着你穿越时空后\n  做出的努力。）'
                    : '<32>{#p/basic}* “你穿越回过去，\n   阻止了一场可怕的灾难！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上写着你的科学才华。）'
                    : '<32>{#p/basic}* “你是一位杰出的科学家，\n   即将取得重大突破！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? "<32>* （包装上建立了一个\n  你发现的无辜的世界。）"
                    : '<32>{#p/basic}* “你偶然发现了一个充满无辜的\n   生物的世界，接下来会发生什么\n   就取决于你了！”'
            ],
            () => [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                SAVE.data.b.svr
                    ? '<32>* （包装上详细介绍了\n  你的新能力。）'
                    : '<32>{#p/basic}* “你已经获得了随心所欲\n   改变宇宙的力量！\n   明智地使用它吧！”'
            ],
            [
                '<32>{#p/human}* （你撕开了冰意灵的包装。）',
                "<32>{#p/human}* （上面是你找到了一个\n  充满爱的家庭的全息图像。）"
            ]
        )
    },
    i_pop: {
        battle: {
            description: '可改变主观时间流速。',
            name: '涡旋棒棒糖'
        },
        drop: ['<32>{#p/human}* （你把涡旋棒棒糖扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （11 HP。）']
                : [
                    '<33>{#p/basic}* “涡旋棒棒糖” 回复11 HP\n* 可改变主观时间流速。\n* 仅在战斗中有效。'
                ],
        name: '涡旋棒棒糖',
        use: () => [
            '<32>{#p/human}* （你把涡旋棒棒糖舔没了。）',
            ...(battler.active
                ? game.vortex
                    ? ['<32>{#p/human}* （主观时间流速之前已改变。）']
                    : [
                        '<32>{#p/human}* （你的主观时间流速开始改变。）',
                        '<32>{#p/story}* 两回合内，你的专注力提升！'
                    ]
                : ['<32>{#p/human}* （战斗外使用无效。）'])
        ]
    },
    i_spaghetti: {
        battle: {
            description: '丝般柔滑的意面，\n在时间膨胀单元之中精细陈化。',
            name: '意大利面'
        },
        drop: () => [
            '<32>{#p/human}* （你把意大利面扔掉了。）',
            ...(game.room === 's_jenga' && SAVE.data.n.plot < 26 // NO-TRANSLATE

                ? []
                : !world.genocide && !world.runaway && (SAVE.data.n.state_papyrus_spaghet !== 0 || game.room === 's_bros') // NO-TRANSLATE

                    ? game.room === 'f_kitchen' // NO-TRANSLATE

                        ? [
                            SAVE.data.b.undyne_respecc ? '<25>{#p/undyne}{#f/1}* ...' : '<25>{#p/undyne}{#f/14}* ...',
                            "<25>{#p/undyne}{#f/17}* 我会将它从地板上刮下来\n  然后放在冰箱里重新加热的。"
                        ]
                        : SAVE.data.n.plot === 72 && game.room === 'c_asgore_kitchen' // NO-TRANSLATE

                            ? [
                                '<18>{#p/papyrus}{#f/8}别啊！！\n你怎么能这么对它！？！？',
                                '<18>{#f/5}...那是我亲自下厨\n为你做的意面啊...',
                                '<18>{#f/4}...说实话...\n这面放的时间确实\n有点太久了。',
                                '<18>{#f/0}是啊！！\n我的新菜会更棒的！',
                                "<18>{#f/9}当它完成时，\n请务必前来品尝！",
                                '<25>{#p/sans}{#f/2}* 信我的。\n* 他的新作品\n  你不会想丢掉的。',
                                '<18>{#p/papyrus}{#f/6}...好耶！！'
                            ]
                            : (game.room === 's_bonehouse' && dateready()) || // NO-TRANSLATE

                                (fetchCharacters()
                                    .find(c => c.key === 'papyrus') // NO-TRANSLATE

                                    ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                ? [
                                    '<18>{#p/papyrus}{#f/8}别啊！！\n你怎么能这么对它！？！？',
                                    '<18>{#f/5}...那是我亲自下厨\n为你做的意面啊...',
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? [
                                            '<25>{#p/undyne}{#f/4}* 完全没问题！',
                                            '<25>{#p/undyne}{#f/7}* 人类！\n* 快点把意大利面\n  从地上捡起来！',
                                            "<18>{#p/papyrus}{#f/6}安黛因，别！！\n太不卫生了！！"
                                        ]
                                        : ['<18>{#f/6}...再也没法吃了！！']),
                                    "<18>{#f/4}不过... 这样也好。",
                                    '<18>{#f/5}你丢掉了那份意面...',
                                    '<18>{#f/6}那我就做一份【更赞的】！',
                                    '<18>{#f/9}没错！\n你看我，充满了斗志！',
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? ['<25>{#p/undyne}{#f/17}* 耶！！\n* 你看他现在多么\n  备受鼓舞啊！！']
                                        : []),
                                    "<18>{#p/papyrus}{#f/9}我要做银河系史上\n最好的菜！",
                                    ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                        ? [
                                            "<25>{#p/undyne}{#f/7}* 这次你一定会喜欢上它的！！",
                                            "<18>{#p/papyrus}{#f/6}但如果你不喜欢\n也没关系！！！",
                                            '<25>{#p/undyne}{#f/17}* 对！！！！',
                                            '<18>{#p/papyrus}{#f/9}对！！！！！',
                                            '<25>{#p/undyne}{#f/8}* 对！！！！！！',
                                            '<18>{#p/papyrus}{#f/4}...对。'
                                        ]
                                        : [])
                                ]
                                : instance('main', 'sentryskeleton') !== void 0 || // NO-TRANSLATE

                                    (fetchCharacters()
                                        .find(c => c.key === 'sans') // NO-TRANSLATE

                                        ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                    ? [
                                        "<25>{#p/sans}{#f/0}* 啊？\n* 你不喜欢我兄弟的\n  招牌意大利面？",
                                        '<25>{#f/2}* 我猜意面更适合我。'
                                    ]
                                    : []
                    : [])
        ],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （16 HP。）']
                : ['<32>{#p/basic}* “意大利面” 回复16 HP\n* 丝般柔滑的意面，\n  在时间膨胀单元之中精细陈化。'],
        name: '意大利面',
        use: () => [
            '<32>{#p/human}* （你吃光了意大利面。）',
            ...(game.room === 's_jenga' && SAVE.data.n.plot < 26 // NO-TRANSLATE

                ? []
                : !battler.active &&
                    !world.genocide &&
                    !world.runaway &&
                    (SAVE.data.n.state_papyrus_spaghet !== 0 || game.room === 's_bros') // NO-TRANSLATE

                    ? game.room === 'f_kitchen' // NO-TRANSLATE

                        ? [
                            SAVE.data.b.undyne_respecc
                                ? '<25>{#p/undyne}{#f/1}* 意大利面，对吗？'
                                : '<25>{#p/undyne}{#f/14}* 意大利面，对吗？',
                            "<25>{#p/undyne}{#f/8}* 你最好会喜欢它，\n  因为这是用我的\n  食谱做的！！"
                        ]
                        : SAVE.data.n.plot === 72 && game.room === 'c_asgore_kitchen' // NO-TRANSLATE

                            ? [
                                '<18>{#p/papyrus}{#f/1}啥？\n你刚刚是不是\n吃了那份意大利面？',
                                '<18>{#f/5}我做了它\n已经很长时间了...',
                                '<25>{#p/sans}{#f/2}* 至少也得几个小时。',
                                "<18>{#p/papyrus}{#f/6}我觉得\n它已经过期了。",
                                "<18>{#f/6}我是说它的新品期\n已经过去了。",
                                "<18>{#f/4}但是不用担心。\n这道新做的\n意大利面...",
                                '<18>{#f/9}...会比以前的\n更加美味！',
                                "<18>{#f/9}当它完成时，\n请务必前来品尝！"
                            ]
                            : (game.room === 's_bonehouse' && dateready()) || // NO-TRANSLATE

                                (fetchCharacters()
                                    .find(c => c.key === 'papyrus') // NO-TRANSLATE

                                    ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                ? SAVE.data.n.state_papyrus_spaghet === 0
                                    ? ((SAVE.data.n.state_papyrus_spaghet = 2),
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你刚刚是不是\n吃了那份意大利面？',
                                            "<18>{#f/5}我刚想问你\n拿它怎么办呢...",
                                            '<18>{#f/6}但是现在答案\n就在我面前！',
                                            '<18>{#f/0}谢谢你，人类，\n吃掉时提供了\n这么多信息。'
                                        ])
                                    : [
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你刚刚是不是\n吃了那份意大利面？',
                                            '<18>{#f/7}我还以为你\n要和我分享呢！',
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    "<25>{#p/undyne}{#f/7}* 好吧，\n  看起来那人类\n  不愿与我们分享！",
                                                    '<18>{#p/papyrus}{#f/6}但是人类之前\n答应过我的！'
                                                ]
                                                : []),
                                            '<18>{#f/5}...也许原因在于\n我的厨艺...',
                                            "<18>{#f/6}你忍受不住\n它的美味，\n所以就尝了一口！",
                                            '<18>{#f/5}还有，\n还有就是...',
                                            "<18>{#f/6}在你意识到之前，\n你就差点\n把盘子也吃了！",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? ['<25>{#p/undyne}{#f/14}* 哇。\n* 多么罪恶啊。']
                                                : []),
                                            '<18>{#p/papyrus}{#f/5}是我极佳的厨艺\n让你背叛了我...',
                                            "<18>{#f/9}不-不...！\n我会解决\n这个问题的！",
                                            '<18>{#f/4}...“咳咳”。',
                                            '<18>{#f/0}我，帕派瑞斯，\n特此声明\n你对我的承诺无效！',
                                            '<18>{#f/0}你瞧！\n现在你可以\n放心地享用了。',
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    '<25>{#p/undyne}{#f/11}* ...',
                                                    '<18>{#p/papyrus}{#f/4}（你可以\n配合一下吗？）',
                                                    "<25>{#p/undyne}{#f/12}* 对！\n* 放心吧！\n* 你就这么吃吧！",
                                                    '<18>{#p/papyrus}{#f/0}（谢啦。）'
                                                ]
                                                : [])
                                        ],
                                        [
                                            '<18>{#p/papyrus}{#f/1}啥？\n你刚刚是不是\n吃了那份意大利面？',
                                            "<18>{#f/4}好吧，你并没有\n承诺要分享它...",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    "<25>{#p/undyne}{#f/11}* 所以问题是？",
                                                    "<18>{#p/papyrus}{#f/0}哦，额，\n我想这没啥问题。"
                                                ]
                                                : ["<18>{#f/0}额，我想这\n感觉挺好。"]),
                                            '<18>{#f/5}毕竟，\n如果你【曾经】\n作出过这种承诺...',
                                            '<18>{#f/6}我们处于一个\n进退两难的困境。',
                                            "<18>{#f/0}但是你没有！\n所以我们仍然\n保持完美！",
                                            ...(fetchCharacters().find(c => c.key === 'undyne') !== void 0 // NO-TRANSLATE

                                                ? [
                                                    '<25>{#p/undyne}{#f/12}* 世界未来一片光明，\n  是吧？',
                                                    "<18>{#p/papyrus}{#f/7}嘿！\n我正要说这个！",
                                                    '<18>{#f/0}但是对对对。'
                                                ]
                                                : ['<18>{#f/0}世界未来一片光明！'])
                                        ]
                                    ][SAVE.data.n.state_papyrus_spaghet - 1]
                                : instance('main', 'sentryskeleton') !== void 0 || // NO-TRANSLATE

                                    (fetchCharacters()
                                        .find(c => c.key === 'sans') // NO-TRANSLATE

                                        ?.position.extentOf(game.camera.position.clamp(...renderer.region)) ?? 240) < 240
                                    ? [
                                        "<25>{#p/sans}{#f/3}* 它很美味，不是吗？",
                                        "<25>{#f/2}* 我应该知道。\n* 我是第一个试吃者。"
                                    ]
                                    : []
                    : [])
        ]
    },
    i_swirl: {
        battle: {
            description: '一个五彩斑斓的发光瑞士卷。',
            name: '光彩漩涡'
        },
        drop: ['<32>{#p/human}* （你把光彩漩涡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （22 HP。）']
                : ['<32>{#p/basic}* “光彩漩涡” 回复22 HP\n* 一个五彩斑斓的发光瑞士卷。'],
        name: '光彩漩涡',
        use: ['<32>{#p/human}* （你吃掉了光彩漩涡。）']
    },
    i_voidy: {
        battle: {
            description: '可传送到某个隐藏房间，\n战斗中使用无效。',
            name: '圣所'
        },
        drop: ['<32>{#p/human}* （你将圣所弃如敝屣。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （一件存在之外的物品。）']
                : ['<32>{#p/basic}* 可传送到某个隐藏房间，\n  战斗外可用。'],
        name: '圣所',
        use: () =>
            battler.active
                ? ['<32>{#p/human}* （你使用了圣所。）', '<32>{#p/human}* （战斗中使用无效。）']
                : ['<32>{#p/human}* （你使用了圣所。）']
    },
    i_corndog_sword: {
        battle: {
            description: '绝对是独一无二的武器。',
            name: '玉狗圣剑'
        },
        drop: ['<32>{#p/human}* （你想扔掉玉狗圣剑...）', '<32>{#p/human}* （...但是它拒绝了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （你觉得还是不要思考\n  这玩意怎么工作的比较好。）']
                : ['<32>{#p/basic}* 绝对是独一无二的武器。'],
        name: '玉狗圣剑',
        use: () =>
            battler.active && battler.alive[0].opponent.metadata.corndogger
                ? [
                    '<32>{#p/human}* （你装备上玉狗圣剑。）',
                    "<32>{#p/human}* （它太诱人了，你禁不住想咬一口。）",
                    [
                        '<32>{#p/human}* （你吃掉了外层的面衣...）',
                        '<32>{#p/human}* （你吃掉了剑尖...）',
                        '<32>{#p/human}* （你吃掉了剑身...）',
                        '<32>{#p/human}* （你吃掉了剑柄...）',
                        '<32>{#p/human}* （你吃掉了最后的握柄...）'
                    ][SAVE.data.n.corndogger++],
                    '<32>{#p/basic}* 突然间..！'
                ]
                : [
                    '<32>{#p/human}* （你试图装备上玉狗圣剑...）',
                    "<32>{#p/human}* （...但是，它没有嗅到\n  足够大的威胁！）"
                ]
    },
    i_fryz: {
        battle: {
            description: '这次可不只是“暖暖的”了哦。',
            name: '烤尔比'
        },
        drop: ["<32>{#p/human}* （你把烈焰烤尔比当做燃烧瓶\n  抛了出去。）"],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （30 HP。）']
                : ['<32>{#p/basic}* “烈焰烤尔比” 回复30 HP\n* 这次可不只是“暖暖的”了哦。'],
        name: "烈焰烤尔比",
        use: ["<32>{#p/human}* （你喝掉了烈焰烤尔比。）"]
    },
    i_burgerz: {
        battle: {
            description: '很像普通汉堡，只是小了一些。\n共有三个。',
            name: '三只小汉堡'
        },
        drop: ['<32>{#p/human}* （你把小汉堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。共有三个。）']
                : ['<32>{#p/basic}* “小汉堡” 回复15 HP\n* 很像普通汉堡，只是小了一些。\n* 共有三个。'],
        name: '三只小汉堡',
        use: ['<32>{#p/human}* （你吃掉了一个小汉堡。）']
    },
    i_burgerz_use1: {
        battle: {
            description: '很像普通汉堡，只是小一些。\n还剩两个。',
            name: '两只小汉堡'
        },
        drop: ['<32>{#p/human}* （你把小汉堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。还剩两个。）']
                : ['<32>{#p/basic}* “小汉堡” 回复15 HP\n* 很像普通汉堡，只是小了一些。\n* 还剩两个。'],
        name: '两只小汉堡',
        use: ['<32>{#p/human}* （你吃掉了一个小汉堡。）']
    },
    i_burgerz_use2: {
        battle: {
            description: '很像普通汉堡，只是小了一些。',
            name: '小汉堡'
        },
        drop: ['<32>{#p/human}* （你把小汉堡扔掉了。）'],
        info: () =>
            SAVE.data.b.svr || SAVE.data.b.ufokinwotm8
                ? ['<32>{#p/human}* （15 HP。最后一个。）']
                : ['<32>{#p/basic}* “小汉堡” 回复15 HP\n* 很像普通汉堡，只是小了一些。\n* 最后一个。'],
        name: '小汉堡',
        use: ['<32>{#p/human}* （你吃掉了一个小汉堡。）']
    },

    k_premium: {
        name: '高级会员券',
        description: () =>
            SAVE.data.b.f_state_voucher
                ? '与你根本不存在的付费望远镜订阅\n配套使用。'
                : '在使用过星港的望远镜之后，\n怪物小孩给你的东西。'
    },

    k_inverter: {
        name: '重力转换器遥控器',
        description: () =>
            SAVE.data.b.s_state_inverter
                ? '用它激活了与之匹配的\n重力转换器。'
                : "在衫斯房间里的没封上的信封中\n搞到的。"
    },

    k_security: {
        name: '生锈的钥匙',
        description: () =>
            SAVE.data.n.state_aerialis_lockup > 0
                ? '用它解锁了休闲回廊的\n军火库。'
                : '在星港小镇北侧的“警察岗”\n搞到的。'
    },

    n_shop_blook: {
        exit: ["<32>{#p/napstablook}{#k/0}* 哦... 要走了吗...", '<32>{#k/1}* 好吧，下次再见，也许吧...'],
        item: () =>
            blookGone()
                ? [
                    '§fill=#808080§---- 售罄 ----',
                    SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '0G - 洋梅果冻派',
                    '0G - 幽灵水果',
                    '0G - 奶昔',
                    '离开'
                ]
                : SAVE.data.n.plot === 72
                    ? [
                        SAVE.data.b.item_voidy ? '§fill=#808080§---- 售罄 ----' : '432G - 圣所',
                        SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '80G - 洋梅果冻派',
                        '5G - 幽灵水果',
                        '5G - 奶昔',
                        '离开'
                    ]
                    : [
                        SAVE.data.b.item_voidy ? '§fill=#808080§---- 售罄 ----' : '432G - 圣所',
                        SAVE.data.b.item_blookpie ? '§fill=#808080§---- 售罄 ----' : '100G - 洋梅果冻派',
                        '12G - 幽灵水果',
                        '16G - 奶昔',
                        '离开'
                    ],
        itemInfo: [
            '特殊物品：\n传送到\n某个\n隐藏房间。',
            '回复99 HP\n在黑暗中\n发出\n幽幽荧光。',
            "回复15 HP\n非欧几何的\n产物。",
            '回复18 HP\n也许含有\n灵质。'
        ],
        itemPrompt: '<09>{#p/napstablook}{#k/3}看上\n什么了吗？',
        itemPurchase: [
            '<09>{#p/napstablook}{#k/3}嘿... 谢谢你...',
            "<09>{#p/napstablook}{#k/0}不买也没\n关系的...",
            '<09>{#p/napstablook}{#k/0}对不起...\n钱不够...',
            "<10>{#p/human}（你带的\n东西\n太多了。）"
        ],
        itemPurchasePrompt: () => (blookGone() ? '偷走吗？' : '花$(x)G\n买它吗？'),
        itemUnavailable: () =>
            blookGone() ? '<09>{#p/basic}空无一物。' : "<09>{#p/napstablook}{#k/0}哦... 这个\n卖光了...",
        menu: () =>
            blookGone() ? ['拿取', '偷窃', '阅读', '离开'] : ['购买', world.meanie ? '偷窃' : '出售', '交谈', '离开'],
        menuPrompt1: () =>
            [
                '<23>{#p/napstablook}{#k/3}* 来随便看看吧...',
                "<23>{#p/napstablook}{#k/3}* 希望这里有你想要的东西...",
                "<23>{#p/napstablook}{#k/3}* 来随便看看吧...\n  不想也行...\n  一切由你...",
                '<23>{#p/napstablook}{#k/3}* 来随便看看...\n* 也许吧...',
                "<23>{#p/napstablook}{#k/3}* 来随便看看吧...\n  不想也行...\n  一切由你..."
            ][Math.min(SAVE.data.n.state_wastelands_napstablook, 4)],
        menuPrompt2: '<23>{#p/napstablook}{#k/0}* 你可以随时离开这里... ',
        menuPrompt3: () =>
            world.bulrun ? '<23>{#p/basic}* ...但是大家都逃走了。' : '<23>{#p/basic}* ...但是谁也没有来。',
        note: () =>
            ['f_blooky', 'f_napstablook'].includes(SAVE.data.s.state_foundry_deathroom) // NO-TRANSLATE

                ? ["<32>{#p/basic}* 没有人给你留字条。"]
                : SAVE.data.b.killed_mettaton
                    ? ["<32>{#p/basic}* 这里有一张字条。", '<32>{#p/napstablook}* “都是你的错...”']
                    : world.runaway
                        ? ["<32>{#p/basic}* 这里有一张字条。", '<32>{#p/napstablook}* “我们别无选择...”']
                        : ["<32>{#p/basic}* 这里有一张字条。", '<32>{#p/napstablook}* “对不起，我得走了...”'],
        sell1: () =>
            blookGone()
                ? ['<30>{#p/human}* （你从柜台后面拿走了42G。）']
                : world.meanie
                    ? [
                        "<30>{#p/napstablook}{#k/2}* 哦...\n  你想偷我的东西...",
                        '<30>{#p/napstablook}{#k/5}* 你肯定很需要钱...',
                        SAVE.data.b.item_voidy
                            ? "<30>{#k/0}* 对不起...\n  我唯一的收入还是你刚给的钱..."
                            : "<30>{#k/0}* 对不起...\n  我很穷，没钱给你..."
                    ]
                    : [
                        '<30>{#p/napstablook}{#k/2}* 哦... 你是想卖掉一些东西吗',
                        "<30>{#k/0}* 我不清楚我能不能买下\n  所有东西...\n  抱歉..."
                    ],
        sell2: () =>
            blookGone()
                ? ['<30>{#p/basic}* 空无一物。']
                : world.meanie
                    ? [
                        "<30>{#p/napstablook}{#k/5}* 嗯...\n* 我没法给你值钱的东西...",
                        "<30>{#p/napstablook}{#k/0}* 我理解...\n  这会让你很难过"
                    ]
                    : [
                        '<30>{#p/napstablook}{#k/5}* 嗯... 想卖东西的话...\n  可以问问我的表亲...',
                        '<30>{#k/0}* 它应该和安黛因住在一块'
                    ],
        talk: (name: string) =>
            SAVE.data.n.plot === 72
                ? ['打招呼', '发生什么了', name, '未来打算', '离开']
                : [
                    '打招呼',
                    '幽灵',
                    '圣所',
                    65 <= SAVE.data.n.plot
                        ? SAVE.data.b.a_state_hapstablook && 68 <= SAVE.data.n.plot
                            ? '你的家人'
                            : '你的生活'
                        : 63 <= SAVE.data.n.plot && SAVE.data.b.a_state_hapstablook
                            ? '镁塔顿'
                            : 60 <= SAVE.data.n.plot
                                ? '喵喵玩偶'
                                : 48 <= SAVE.data.n.plot
                                    ? '旅途'
                                    : SAVE.data.b.napsta_performance
                                        ? 'DJ生涯'
                                        : SAVE.data.n.state_wastelands_napstablook === 0
                                            ? '纳普斯文？'
                                            : '你的生活',
                    '离开'
                ],
        talkPrompt: '<09>{#p/napstablook}{#k/1}哦，\n想和我\n聊天吗？',
        talkText: [
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/napstablook}{#k/3}* 哦，你好啊...',
                        '<32>{#k/0}* 有那么会，大伙全都失踪了...',
                        '<32>{#k/1}* 当他们再次出现的时候，\n  他们都知道了你的名字...',
                        "<32>{#k/3}* 所以...\n  你叫弗里斯克，对吧？",
                        '<32>{#k/4}* 那，很高兴见到你，弗里斯克'
                    ]
                    : SAVE.data.b.a_state_napstadecline
                        ? ['<32>{#p/napstablook}{#k/2}* 啊...', '<32>{#p/napstablook}{#k/2}* 嘿...']
                        : SAVE.data.n.state_wastelands_napstablook < 2
                            ? [
                                [
                                    '<32>{#p/napstablook}{#k/3}* 哦，你好啊...',
                                    '<32>{#p/napstablook}{#k/3}* 哦，很高兴又见到你...'
                                ][SAVE.data.n.state_wastelands_napstablook],
                                ...(world.meanie
                                    ? ["<32>{#k/0}* 为什么露出那副表情？\n* 我做错什么了吗..."]
                                    : ['<32>{#k/4}* 最近在忙些什么呀？'])
                            ]
                            : SAVE.data.n.state_wastelands_napstablook < 5
                                ? [
                                    "<32>{#p/napstablook}{#k/0}* 哦...\n* 不太确定我要怎么接...",
                                    '<32>{#k/3}* 呃... 你好？\n  应该行吧...'
                                ]
                                : [
                                    '<32>{#p/napstablook}{#k/4}* 嘿...\n* 嘿...',
                                    '<32>{#k/3}* 问一下，\n  你刚来吗？',
                                    "<32>{#k/5}* 你看起来有点陌生..."
                                ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/napstablook}{#k/2}* 老实说，\n  我真的不知道发生了什么...",
                        "<32>{#k/2}* 和我的家人一样\n* 我们没有像其他人一样被拉进去",
                        '<32>{#k/1}* 我们的确看到了一道亮光，\n  但当它经过的时候...\n  我们只是拒绝了它',
                        "<32>{#k/0}* 尽管，我们不咋了解...",
                        "<32>{#k/3}* 但我们都听说了\n  你对我们所做的一切",
                        '<32>{#k/3}* 所以... 谢谢你'
                    ]
                    : [
                        '<32>{#p/napstablook}{#k/2}* 你想了解幽灵吗？',
                        '<32>{#k/0}* 嗯，除了我自己\n  我只认识三个幽灵...\n  都是我的表亲...',
                        '<32>{#k/3}* 当然，还有你身后那一个',
                        "<32>{#k/1}* 除此之外，没什么可以说了",
                        '<32>{#k/0}* 如果不与容器融合，\n  我们就只能... 这样存在',
                        '<32>{#k/0}* 嗯，我懂...\n* 这特质确实很有趣...'
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/napstablook}{#k/2}* ...',
                        "<32>{#k/2}* 那个...\n  那个幽灵还在你身后对吧",
                        '<32>{#k/0}* 对...\n  我可以看到...',
                        ...(SAVE.data.b.oops
                            ? [
                                "<32>{#k/0}* 那个幽灵...\n  似乎不喜欢被我指出来...",
                                '<32>{#k/0}* 哦不...'
                            ]
                            : [
                                '<32>{#k/2}* 看起来那个幽灵... 很开心？',
                                '<32>{#k/4}* 弗里斯克，如果你能\n  让那个幽灵有这种感觉...',
                                '<32>{#k/3}* 你真的很特别'
                            ])
                    ]
                    : [
                        '<32>{#p/napstablook}{#k/3}* 哦... 你说那个啊...',
                        '<32>{#k/1}* 有一天，我在地上\n  发现了一个小盒子...',
                        "<32>{#k/5}* 当我打开它的时候，\n  就到了一个我从未见过的\n  神秘地方...",
                        '<32>{#k/4}* 现在，我偶尔会去\n  那个地方放松自己',
                        "<32>{#k/3}* 那里很安宁..."
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        SAVE.data.b.a_state_hapstablook
                            ? '<32>{#p/napstablook}{#k/0}* 好吧，在解决了我与我的表亲\n  之间的问题后...'
                            : "<32>{#p/napstablook}{#k/0}* 好吧，因为我真的无事可做...",
                        '<32>{#k/0}* 我想是时候\n  尝试一些新东西了',
                        '<32>{#k/3}* 我在听说\n  档案内的人类的事情后，\n  由衷地为他们感到难过...',
                        '<32>{#k/3}* 因此... 我收养了一个',
                        '<32>{#k/1}* 我只希望\n  我能尽全力照顾那个人类'
                    ]
                    : 65 <= SAVE.data.n.plot
                        ? SAVE.data.b.a_state_hapstablook
                            ? 68 <= SAVE.data.n.plot
                                ? [
                                    '<32>{#p/napstablook}{#k/3}* 嘿，镁塔顿刚刚来过',
                                    "<32>{#k/0}* 我们聊了一些以前的家常...",
                                    
                                    "<32>{#k/3}* 嗯，我从来没有这么开心过",
                                    '<32>{#k/3}* 你为我们所做的一切...\n  真的意义重大'
                                ]
                                : [
                                    "<32>{#p/napstablook}{#k/0}* 嘿...\n  很抱歉事情并未如我们所愿...",
                                    '<32>{#k/3}* 很高兴有你在那里，\n  尽管...'
                                ]
                            : [
                                '<32>{#p/napstablook}{#k/7}* 时间每流逝一点，\n  我离幸福也就更远一步...'
                            ]
                        : 63 <= SAVE.data.n.plot && SAVE.data.b.a_state_hapstablook
                            ? [
                                "<32>{#k/7}* 哦... 你可能在想关于会议的事",
                                "<32>{#k/7}* 别担心，它还没结束...",
                                '<32>{#k/7}* 我只是回到这\n  检查一下我的商店...'
                            ]
                            : 60 <= SAVE.data.n.plot
                                ? SAVE.data.b.a_state_napstadecline
                                    ? [
                                        '<32>{#k/7}* ...',
                                        "<32>{#k/7}* 我不怎么... 想谈论那个...",
                                        ...(SAVE.storage.inventory.contents.includes('tvm_mewmew') // NO-TRANSLATE

                                            ? ["<32>{#k/2}* 特别是它就在你的物品栏..."]
                                            : [])
                                    ]
                                    : [
                                        '<32>{#k/1}* 哦... 对...',
                                        '<32>{#k/3}* 谢谢你同意\n  帮助我去做那件事',
                                        "<32>{#k/2}* 镁塔顿最近的行为有点奇怪...",
                                        "<32>{#k/0}* 但他这么做\n  我一点都不惊讶",
                                        '<32>{#k/4}* 艾菲斯前阵子第一次带我看\n  喵喵太空探险系列的电影...',
                                        '<32>{#k/3}* 我们在一晚上追完了整整四季...',
                                        '<32>{#k/6}* 那结局...\n  有点东西...',
                                        
                                    ]
                                : 48 <= SAVE.data.n.plot
                                    ? [
                                        '<32>{#k/1}* 是的... 现在当我消遣时\n  一般就会看这个',
                                        ...[
                                            ['<32>{#k/0}* 很抱歉我打扰了\n  你和我表亲在一起的时光'],
                                            ['<32>{#k/0}* ...\n* 你见过我表亲了吗？'],
                                            ['<32>{#k/3}* 我听说我的表亲\n  很喜欢你...'],
                                            [
                                                "<32>{#k/5}* 我表亲告诉我\n  你不怎么风趣...",
                                                '<32>{#k/5}* 但我不同意...'
                                            ],
                                            [],
                                            []
                                        ][SAVE.data.n.state_wastelands_toriel === 0 ? 2 : SAVE.data.n.state_foundry_maddummy],
                                        '<32>* ...',
                                        "<32>{#f/1}* 不管怎样\n* 我希望你在外一切都好...",
                                        '<32>{#f/2}* 因为走过星港之后，\n  会有一些东西比较... 狂躁'
                                    ]
                                    : SAVE.data.b.napsta_performance
                                        ? [
                                            '<32>{#p/napstablook}{#k/1}* 嗯，我有时会创作音乐',
                                            "<32>{#k/0}* 人们觉得我的音乐很棒，\n  但我明白这只是他们\n  为了激励我说的谎\n  罢了...",
                                            '<32>{#k/4}* 不过，感谢你来我的小演出捧场...',
                                            '<32>{#k/3}* 见到你，我很高兴...'
                                        ]
                                        : [
                                            [
                                                '<32>{#p/napstablook}{#k/2}* 你指的是...\n  之前我给你表演的帽子魔术吗...？',
                                                '<32>{#k/1}* 嗯，那个是我一个表亲\n  教我的...',
                                                '<32>{#k/3}* 以前，我和他常常在一块\n  做各种事...',
                                                '<32>{#k/0}* 后来有一天，他...',
                                                '<32>{#k/6}* ...',
                                                '<32>{#k/0}* 没事...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 哦，我的生活蛮平淡的，\n  拿不出什么好聊的事...",
                                                '<32>{#k/3}* 碰上你这事，\n  都算这周末比较出彩的了...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 哦，我的生活蛮平淡的，\n  拿不出什么好聊的事...",
                                                '<32>{#k/6}* 而且有你在这，\n  我的生活估计也不会有啥起色了...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 哦，我的生活蛮平淡的，\n  拿不出什么好聊的事...",
                                                "<32>{#k/3}* 每天能做的...\n  也只有记{@fill=#ff0}录{@fill=#fff}生活的{@fill=#ff0}轨{@fill=#fff}迹..."
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 哦，我的生活蛮平淡的，\n  拿不出什么好聊的事...",
                                                '<32>{#k/6}* 我想你对这事...\n  也没啥兴趣...'
                                            ],
                                            [
                                                "<32>{#p/napstablook}{#k/0}* 哦，我的生活蛮平淡的，\n  拿不出什么好聊的事...",
                                                "<32>{#k/0}* 每天{@fill=#ff0}混{@fill=#fff}日子，\n  做点喜欢的{@fill=#ff0}音{@fill=#fff}乐"
                                            ]
                                        ][SAVE.data.n.state_wastelands_napstablook]
        ],
        zeroPrompt: '<09>{#p/basic}...'
    },
    n_shop_hare: {
        exit: ['<32>{#p/basic}{#k/11}* 再见！\n* 有空常来啊！'],
        item: () =>
            world.population === 0 || world.runaway
                ? [
                    '0G - 超能手套？',
                    SAVE.data.b.item_eye ? '0G - 力场护盾？' : '0G - 力场护盾',
                    '0G - 涡旋棒棒糖',
                    '0G - 光彩漩涡',
                    '离开'
                ]
                : SAVE.data.n.plot === 72
                    ? [
                        '10G - 超能手套？',
                        SAVE.data.b.item_eye ? '10G - 力场护盾？' : '20G - 力场护盾',
                        '8G - 涡旋棒棒糖',
                        '5G - 光彩漩涡',
                        '离开'
                    ]
                    : [
                        '30G - 超能手套？',
                        SAVE.data.b.item_eye ? '30G - 力场护盾？' : '40G - 力场护盾',
                        '28G - 涡旋棒棒糖',
                        '20G - 光彩漩涡',
                        '离开'
                    ],
        itemInfo: () => [
            "武器：3攻击\n(当前攻击$(x))\n重拳出击，\n仿制品。",
            SAVE.data.b.item_eye
                ? '防具：5防御\n(当前防御$(x))\n有力防御，\n仿制品。'
                : '防具：7防御\n(当前防御$(x))\n有力防御。',
            '回复11 HP\n可改变\n主观时间\n流速。',
            "回复22 HP\n她的\n独家配方。"
        ],
        itemPrompt: '<09>{#p/basic}{#k/0}想买点\n什么？',
        itemPurchase: [
            '<09>{#p/basic}{#k/4}谢谢惠顾。',
            '<09>{#p/basic}{#k/7}只是\n看看？',
            "<09>{#p/basic}{#k/5}这点钱不够。",
            "<10>{#p/human}（你带的\n东西\n太多了。）"
        ],
        itemPurchasePrompt: () => (world.population === 0 || world.runaway ? '偷走吗？' : '花$(x)G\n买它吗？'),
        menu: () =>
            world.population === 0 || world.runaway
                ? ['拿取', '偷窃', '阅读', '离开']
                : ['购买', world.meanie ? '偷窃' : '出售', '交谈', '离开'],
        menuPrompt1: '<23>{#p/basic}{#k/0}* 你好啊，旅行者。\n* 想来点什么吗？',
        menuPrompt2: '<23>{#p/basic}{#k/0}* 慢慢挑。',
        menuPrompt3: () =>
            world.bulrun ? '<23>{#p/basic}* ...但是大家都逃走了。' : '<23>{#p/basic}* ...但是谁也没有来。',
        note: () =>
            world.runaway
                ? ["<32>{#p/basic}* 这里有一张字条。", '<32>{#p/basic}* “请你别跟过来。”']
                : SAVE.data.n.plot === 72
                    ? ["<32>{#p/basic}* 这里有一张字条。", '<33>{#p/basic}* “对不起，我不敢回去。”']
                    : ["<32>{#p/basic}* 这里有一张字条。", '<33>{#p/basic}* “请不要伤害我的家人。”'],
        sell1: () =>
            world.population === 0 || world.runaway
                ? ['<30>{#p/human}* （你从柜台后面拿走了758G。）']
                : world.meanie
                    ? [
                        "<30>{#p/basic}{#k/1}* 哈？\n* 这是不是\n  代表着我应该报警呢？",
                        "<30>{#k/2}* 你想买东西，那就得掏钱，\n  知不知道！",
                        '<30>{#k/12}* 这事没得商量。'
                    ]
                    : [
                        "<30>{#p/basic}{#k/6}* 哈？\n* 你想卖东西？\n* 这里看起来像当铺吗？",
                        "<30>{#k/3}* 我不知道在你家乡是\n  什么样子的... 但是...",
                        "<30>* 如果我开始花钱买\n  旧扳手和穿过的太空服，\n  我生意就做不下去了！"
                    ],
        sell2: () =>
            world.population === 0 || world.runaway
                ? ['<30>{#p/basic}* 空无一物。']
                : world.meanie
                    ? ["<30>{#p/basic}{#k/8}* 我不知道你想耍什么花招，\n  但是这对我毫无作用。"]
                    : [
                        "<30>{#p/basic}{#k/8}* 你要是真缺钱的话，\n  可以试试众筹啊。",
                        '<30>{#k/2}* 我听说，现在不管是啥，\n  都有人愿意掏钱。'
                    ],
        talk: () =>
            SAVE.data.n.plot === 72
                ? ['打招呼', '发生什么了', '外域', '未来打算', '离开']
                : ['打招呼', '这里可以干什么', '小镇的历史', '你的生活', '离开'],
        talkPrompt: '<09>{#p/basic}{#k/0}想聊聊\n天吗？',
        talkText: [
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/4}* 哦，你是弗里斯克，对吧！\n* 大伙都在讨论你的光辉事迹呢！",
                        "<32>{#k/0}* 谢谢你让我们重获自由！",
                        "<32>{#k/5}* 大伙都看到过同样的事情... \n  所以我们知道你一定需要休息一下。",
                        "<32>{#k/4}* 尽管如此。\n* 我们还是为自由而忍不住兴奋。"
                    ]
                    : [
                        "<32>{#p/basic}{#k/4}* 你好呀！欢迎来到星港！\n* 我都记不得上次看到新面孔\n  是什么时候的事情了。",
                        '<32>{#k/8}* 你是从哪里来的？\n* 首塔吗？',
                        "<32>{#k/7}* 你看起来不像是游客。\n* 你是自己来的吗？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/8}* 你知道发生了什么，不是吗？",
                        "<32>{#k/9}* 另一方面，\n  你看到的东西可能有些不同...",
                        "<32>{#k/0}* 来。\n* 我告诉你我看到了什么。",
                        '<32>{#k/0}* 我们大伙\n  都被一束强光拉了进来后...',
                        "<32>{#k/7}* 然后我们似乎...\n  以别人的视角看到了...",
                        "<32>{#k/5}* 你受到了来自四面八方的攻击，\n  那时我觉得你肯定死掉了。",
                        "<32>{#k/11}* 但是我错了，\n  你仍在那傲然挺立着。",
                        '<32>{#k/8}* 最后，你向攻击你的人说了一些\n  特别的话，而那人听到后...\n  居然停止了攻击。',
                        '<32>{#k/9}* 在此之后，\n  我们大伙就都醒了过来，\n  然后看到力场被摧毁了。'
                    ]
                    : [
                        '<32>{#p/basic}{#k/8}* 你想知道在星港可以干什么？',
                        "<32>{#k/9}* 你可以去烤尔比用餐，\n  可以去图书倌获取信息...",
                        "<32>{#k/2}* 如果你累了，\n  你可以去旅馆打个盹。\n* 就在隔壁，我姐妹开的。",
                        "<32>{#k/0}* 你要是觉得无聊了，\n  可以坐在外面，\n  看那两个古怪的骷髅\n  做他们的事情。",
                        "<32>* 他们两个...\n* 我觉得，应该是兄弟。\n* 从我记事的时候，\n  他们就在这里了。",
                        '<32>{#k/9}* 哦，我差点忘了。\n* 最近，有个小鬼儿决定\n  在小镇的南边开一家商店。',
                        "<32>{#k/11}* 虽然事情不算大，\n  但如果你路过，\n  一定要打声招呼。\n* 那伙计很需要陪伴的。"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        '<32>{#p/basic}{#k/12}* 关于外域的事你听说了吗？',
                        '<32>{#k/2}* 据说女王\n  在那待了很长很长的时间。',
                        '<32>{#k/8}* 不可思议，对吧！？',
                        "<32>{#k/10}* 我敢打包票，\n  当她看到那些人类都还活着时，\n  肯定比我们还惊讶。"
                    ]
                    : [
                        '<32>{#p/basic}{#k/9}* 复习下你历史课上\n  学到的东西...',
                        '<32>{#k/0}* 很久以前，怪物们住在\n  我们现在称之为铸厂的地方。',
                        '<32>* 过了一段时间，\n  我们发明了在前哨站\n  建造新区域的技术。',
                        "<32>* 首先建造出来的就是星港，\n  他们认为这是一个建小镇的\n  好地方。",
                        "<32>{#k/10}* 听起来很古怪，\n  但我还挺喜欢的，\n  你懂吗？"
                    ],
            () =>
                SAVE.data.n.plot === 72
                    ? [
                        "<32>{#p/basic}{#k/5}* 嗯，我会考虑\n  将我的商店搬到新家园。",
                        "<32>{#k/4}* ...恐怕我没有其他计划了。"
                    ]
                    : [
                        '<32>{#p/basic}* 生活总是一成不变。',
                        '<32>{#k/5}* 虽然有点孤单...',
                        "<32>{#k/10}* 但是... 在我们内心深处\n  都知道自由即将到来，\n  不是吗？",
                        '<32>{#k/9}* 只要我们心存希望，\n  我们就能咬紧牙关，\n  日复一日地面对\n  同样的困难...',
                        "<32>{#k/0}* 这就是生活啊，不是吗？"
                    ]
        ],
        zeroPrompt: '<09>{#p/basic}...'
    },

    c_name_starton: {
        papyrus: () =>
            SAVE.data.n.plot_date < 2 || (SAVE.data.n.exp > 0 && SAVE.data.b.a_state_fishbetray)
                ? "给帕派瑞斯打电话"
                : '帕派瑞斯和安黛因'
    },

    c_call_papyrus: <Partial<CosmosKeyed<CosmosProvider<string[]>>>>{
        s_start: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}啊，你在星港入口那儿。',
                '<18>{#p/papyrus}{#f/5}这条路没啥人去，\n看着空荡荡的，\n不过嘛...',
                '<18>{#p/papyrus}{#f/0}它承载了我的\n许多美好回忆！',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}比如，在我和衫斯\n还小的时候...',
                        '<18>{#p/papyrus}{#f/0}我俩经常在这赛车。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 讲讲呗。',
                        '<18>{#p/papyrus}{#f/0}那就说说我和衫斯的\n悬浮车竞速赛吧！',
                        "<18>{#p/papyrus}{#f/5}小时候，\n咱俩经常在这纵情飞驰，\n看谁开得更快..."
                    ]),
                '<18>{#p/papyrus}{#f/4}可惜，\n不管我怎么努力...',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/7}等我到终点线，\n他车都停那好久了！',
                        '<18>{#p/papyrus}{#f/5}每次都这样，\n你说我难不难过。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/17}* 他从来没输过？',
                        "<25>{#p/undyne}{#f/4}* 这太正常了，\n  他总作弊，都成惯犯了。",
                        '<25>{#p/undyne}{#f/5}* 射击游戏的\n  排行榜看过没？',
                        "<25>{#p/undyne}{#f/8}* 他那分数，\n  简直是个天文数字！！",
                        '<18>{#p/papyrus}{#f/4}他要是没作弊，\n那就有鬼了。',
                        "<18>{#p/papyrus}{#f/7}真希望\n他能收敛一点！",
                        '<18>{#p/papyrus}{#f/7}他那么整，别人还咋玩？',
                        '<25>{#p/undyne}{#f/1}* 也不一定...',
                        '<25>{#p/undyne}{#f/8}* 说不定，“冲榜”本身\n  也是个新奇的挑战呢！',
                        '<18>{#p/papyrus}{#f/4}...才怪。'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/5}衫斯他...\n总是喜欢走捷径。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/4}我怀疑他用\n那玩意作弊了。\n不然咋能把把都赢呢？']
                    : ["<18>{#p/papyrus}{#f/4}大概这就是\n所谓的“优胜劣汰”吧。"])
            ]
        ),
        s_sans: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}这里是衫斯的哨站，\n然后...",
                '<18>{#p/papyrus}{#f/5}...',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}对了，\n我前几天听到他说...',
                        '<18>{#p/papyrus}{#f/6}...要帮哪个人去\n避开其他守卫。',
                        "<18>{#p/papyrus}{#f/5}我虽然不太能确定，\n但我感觉...",
                        "<18>{#p/papyrus}{#f/5}我兄弟...\n该不会是什么\n特务吧？",
                        '<18>{#p/papyrus}{#f/4}...',
                        '<18>{#p/papyrus}{#f/4}...或者应该叫\n叛贼？'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/5}没啥可聊的了...',
                        "<25>{#p/undyne}{#f/17}* 帕派瑞斯，你有没有...\n  呃... 往上看过？",
                        '<18>{#p/papyrus}{#f/6}什么！？',
                        "<18>{#p/papyrus}{#f/7}我可没这闲工夫！",
                        "<25>{#p/undyne}{#f/1}* 现在你也没在抓谁啊。",
                        '<18>{#p/papyrus}{#f/6}瞎-瞎说！\n我-我当然在抓人！\n在抓另一个“人”！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}“特务”和“叛贼”...',
                        '<18>{#p/papyrus}{#f/1}...难不成我兄弟\n其实是只乌贼！？'
                    ]
                    : ["<18>{#p/papyrus}{#f/4}我刚才指的是...\n一个长方形的伙计。"]
        ),
        s_crossroads: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}最近，前哨站上\n掀起了一股留言热潮。',
                '<18>人们用便条\n记载梦想，送出祝福，\n也有向爱人表白的...',
'<18>能写的东西可多了。',
                ...(solo()
                    ? [
                        
                        "<18>{#p/papyrus}{#f/9}看到大伙敞开心扉，\n我真的很高兴。",
                        '<18>{#p/papyrus}{#f/4}不过我兄弟，就...',
                        "<18>{#p/papyrus}{#f/4}他{@fill=#ff0}月{@fill=#fff}想{@fill=#ff0}月{@fill=#fff}觉得\n那帮家伙\n都是在做梦。"
                    ]
                    : [
                        '<18>...',
                        "<18>安黛因，\n干嘛露出这幅表情？",
                        '<25>{#p/undyne}{#f/3}* ...你有没有见过，呃...',
                        '<18>{#p/papyrus}{#f/0}...见过啥？',
                        '<25>{#p/undyne}{#f/15}* ...跟科学有关的便条？',
                        '<18>{#p/papyrus}{#f/0}噢。',
                        '<18>{#p/papyrus}{#f/0}...没。',
                        '<25>{#p/undyne}{#f/1}* 真见鬼！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}话说，要是有个月亮\n绕着咱们转，\n生活会变成啥样。']
                    : ["<18>{#p/papyrus}你没啥想要分享的\n希望与梦想吗？"]
        ),
        s_human: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我说说那段\n出色的演讲吧！',
                '<18>{#p/papyrus}{#f/0}说来挺巧的，\n我第一次排练\n就是在这儿。',
                '<18>{#p/papyrus}{#f/9}当然，衫斯也在！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}不过我们一直在争\n站哪边比较好。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 你们肯定没争起来吧。",
                        '<18>{#p/papyrus}{#f/0}啊，正好相反。',
                        '<18>{#p/papyrus}{#f/0}我们经常争起来！'
                    ]),
                "<18>{#p/papyrus}{#f/4}我转向这个方向\n说站这边比较好...",
                "<18>{#p/papyrus}{#f/4}他又转向那个方向，\n说站那边更好。",
                '<18>{#p/papyrus}{#f/6}我们争啊争，\n最后我们俩都转得\n越来越快。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}于是，“二人转”就成了\n我们兄弟俩的招牌动作。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* ...难怪我看到你俩\n  之前在我家门口- {%}',
                        '<18>{#p/papyrus}{#f/1}你看到啥了！？',
                        '<18>{#p/papyrus}{#f/6}等下，\n你听我解释...',
                        '<18>{#p/papyrus}{#f/5}咳咳，\n衫斯只是担心... 呃...',
                        "<18>{#p/papyrus}{#f/6}...担心我赖在你家\n说啥都不走。",
                        '<18>{#p/papyrus}{#f/6}对对对，就是这样！！',
                        "<25>{#p/undyne}{#f/16}* 毕竟你俩是亲兄弟...",
                        "<25>{#p/undyne}{#f/1}* 也许他只是\n  想让你多陪陪他。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}说个有意思的事。',
                        '<18>{#p/papyrus}{#f/0}我们的转速加起来...\n结果是零。',
                        
                        '<18>{#p/papyrus}{#f/4}...因为我们总是\n朝相反的方向转。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}毕竟，\n与家人共度时光\n很重要。',
                        '<18>{#p/papyrus}{#f/9}有的时候\n甚至需要用\n飞行魔法！'
                    ]
        ),
        s_papyrus: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}捏嘿嘿！！\n我不光是个谜题大师...',
                
                '<18>{#p/papyrus}{#f/9}还是一名\n德高望重的建筑师！',
'<18>{#p/papyrus}{#f/9}佩服吧？',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}等我加入皇家卫队，\n肯定要多建几个哨站。']
                    : [
                        '<25>{#p/undyne}{#f/1}* 话说，我之前\n  想把你的“哨站”翻新一下...',
                        '<25>{#p/undyne}{#f/14}* 为啥呢？\n  估计是想... 给你个惊喜！',
                        '<18>{#p/papyrus}{#f/4}你说啥？',
                        '<25>{#p/undyne}{#f/12}* 不过，呃，那个哨站\n  已经很完美了。',
'<25>{#p/undyne}{#f/12}* 所以这么搞可能会弄巧成拙。',
                        '<18>{#p/papyrus}{#f/5}那玩意\n已经“完美”了？',
                        '<18>{#p/papyrus}{#f/6}可你之前不是说过\n没有最好，只有更好吗！',
                        '<25>{|}{#p/undyne}{#f/17}* 呃... 是这样没错啦！\n* 我其实想说- {%}',
                        '<18>{#p/papyrus}几乎完美。\n这样说可以吧。',
                        '<25>{#p/undyne}{#f/12}* 对对对，就是这个。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}要是衫斯能找到点\n好建材，就好了。",
                        '<18>{#p/papyrus}{#f/6}纸箱子顶多\n就这样了！！'
                    ]
                    : ['<18>{#p/papyrus}人类，谢谢你...', '<18>可以当我\n几乎完美的\n朋友。']
        ),
        s_doggo: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}这不是遁狗的哨站嘛...',
                '<18>{#p/papyrus}{#f/5}那天，遁狗跟其他狗狗\n发生了点事...',
                "<18>{#p/papyrus}{#f/5}在那之后，他告诉我，\n自己再也没有\n被爱的感觉了。",
                '<18>{#p/papyrus}{#f/0}我抱了抱他，告诉他，\n心里有啥不快，\n就说出来吧。',
                '<18>{#p/papyrus}{#f/4}当然，犬卫队\n都很通情达理。',
                "<18>{#p/papyrus}{#f/0}事情一点点好起来\n也一点都不奇怪！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 是啊，我还记得这件事呢...',
                        '<25>{#p/undyne}{#f/22}* 他...\n* 他当时还在想...',
                        '<18>{#p/papyrus}{#f/5}...嗯？',
                        '<25>{#p/undyne}{#f/9}* ...幸好有你在。',
                        "<25>{#p/undyne}{#f/16}* 不然他说不定就...",
                        '<18>{#p/papyrus}{#f/6}啥？\n说不定就怎样？？',
                        '<25>{#p/undyne}{#f/12}* ...呃，他说不定就马上离队了。',
                        '<18>{#p/papyrus}{#f/0}哦，这样啊。',
                        '<18>{#p/papyrus}{#f/5}那可就太可惜了...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}善良的确是种美德啊！']
                    : ['<18>{#p/papyrus}{#f/9}没有一条狗\n能在我眼皮底下\n从皇家守卫辞职！']
        ),
        s_robot: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}作为一个建筑机器人，\n生活一定很艰难吧。',
                '<18>{#p/papyrus}{#f/5}那些玩意再智能，\n也只是一堆代码而已。\n就别太苛刻了。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 是啊... 尤其是一个\n  住在前哨站的机器人。',
                        '<25>{#p/undyne}{#f/9}* 为什么呢？\n* 我俩都清楚。',
                        '<18>{#p/papyrus}{#f/5}真是悲剧啊...',
                        "<25>{#p/undyne}{#f/17}* 但是，嘿！\n* 也没那么糟！！",
                        '<25>{#p/undyne}{#f/14}* 毕竟，你可以把它们的芯片\n  转移到一台新电脑上。',
                        '<18>{#p/papyrus}{#f/0}哦！哦！\n我大概懂了！',
                        "<18>{#p/papyrus}{#f/0}这样它们就可以\n上域外网了！",
                        '<18>{#p/papyrus}{#f/0}还有天文观测网络！',
                        '<18>{#p/papyrus}{#f/0}还有很多很多\n其他的平台！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}你永远不知道\n它们会孤独多久！！"]
                    : [
                        "<18>{#p/papyrus}{#f/0}不知道它们能不能\n看到我的浏览记录。",
                        '<18>{#p/papyrus}{#f/4}全是生意大利面条的图片...'
                    ]
        ),
        s_maze: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我懂，我懂，\n我知道我的谜题\n是有点难...',
                ...(SAVE.data.b.papyrus_fire
                    ? [
                        '<18>{#p/papyrus}{#f/9}不过，你就把它\n当一次学习机会嘛！',
                        '<18>{#p/papyrus}{#f/0}与其说这个谜题\n是为了考验\n你的技巧...',
'<18>{#p/papyrus}{#f/0}倒不如说\n它能磨砺你的品格！',
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/1}* 嗯哼？\n* 之前发生啥了？',
                                "<18>{#p/papyrus}{#f/5}人类在躲避烈火之墙\n那里的表现不咋地。",
                                '<25>{#p/undyne}{#f/10}* 啊...',
                                "<25>{#p/undyne}{#f/8}* 你是说那人没有\n  直接飞过去！？",
                                '<18>{#p/papyrus}{#f/6}人类还能飞？？',
                                '<25>{#p/undyne}{#f/17}* ...',
                                "<25>{#p/undyne}{#f/17}* 你是说那人没有\n  直接绕过去！？",
                                '<18>{#p/papyrus}{#f/6}呃...'
                            ])
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}但我的朋友，\n你真是个解谜大师啊！',
                        "<18>{#p/papyrus}{#f/9}这玩意可不是\n髓便就能过的。",
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/1}* 嗯哼？\n* 之前发生啥了？',
                                '<18>{#p/papyrus}{#f/0}人类前阵子把我那\n名声大糟的“躲避\n烈火之墙”给搞定了！',
                                '<25>{#p/undyne}{#f/8}* 我来猜猜！\n* 那人肯定是绕过去的！！',
                                '<18>{#p/papyrus}{#f/4}并不。\n事实上，那人巧妙地\n从中走出去了。',
                                '<25>{#p/undyne}{#f/1}* ...噢。',
                                '<25>{#p/undyne}{#f/14}* 我本来还想猜\n  那人是飞过去的。',
                                '<18>{#p/papyrus}{#f/0}不！\n这靠的就是\n坚持不懈的练习！',
                                "<18>{#p/papyrus}{#f/5}不过，\n我也搞不清楚\n那人是怎么练的...",
                                '<18>{#p/papyrus}{#f/4}明明是第一次\n遇到这个谜题啊。',
                                ...(SAVE.data.b.undyne_respecc
                                    ? [
                                        "<25>{#p/undyne}{#f/1}* 呵。\n* 我见识过\n  那人勇往直前的模样。",
                                        "<25>{#p/undyne}{#f/12}* 能够轻松解决这谜题，\n  我一点也不意外！"
                                    ]
                                    : [
                                        '<25>{#p/undyne}{#f/17}* 什么？\n* 练习？\n* 我去！！',
                                        '<25>{#p/undyne}{#f/7}* 把你的秘诀告诉我，\n  小混蛋！！',
                                        '<18>{#p/papyrus}{#f/6}别这样，\n让解谜大师\n安心解谜吧！'
                                    ])
                            ])
                    ])
            ],
            () =>
                SAVE.data.b.papyrus_fire
                    ? solo()
                        ? [
                            '<18>{#p/papyrus}{#f/0}一日一谜题，\n“脑瘫”远离你！',
                            '<18>{#p/papyrus}{#f/4}至少大家\n都是这么说的。'
                        ]
                        : [
                            "<18>{#p/papyrus}{#f/4}顺便提一嘴，\n其实你压根\n绕不过那玩意。",
                            "<18>{#p/papyrus}{#f/0}希望你之前\n没真傻乎乎地去试。"
                        ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/6}更何况你\n初见就通过了！！！']
                        : SAVE.data.b.undyne_respecc
                            ? [
                                '<18>{#p/papyrus}{#f/5}也许...',
                                '<18>{#p/papyrus}{#f/4}是你用强悍的气场\n把烈火吓退了。'
                            ]
                            : ['<18>{#p/papyrus}{#f/5}我们那么拼，\n就图能和你一样\n会解谜题啊！']
        ),
        s_dogs: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}这不是狗来米\n和狗媳儿的哨站嘛...',
                '<18>{#p/papyrus}{#f/0}有时候，\n我就挺好奇\n娶一只狗狗是啥感觉。',
                "<18>{#p/papyrus}{#f/4}不过，我大概也\n用不着知道，毕竟...",
                "<18>{#p/papyrus}{#f/9}我只想娶一个\n英俊的骷髅！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 这...\n  你说的是你自己吧。',
                        "<18>{#p/papyrus}{#f/6}啊？\n你咋会这么想呢？？",
                        "<25>{#p/undyne}{#f/12}* 这不很明显吗？\n* 还有谁能和你一样帅啊？",
                        '<18>{#p/papyrus}{#f/4}呃，我承认我确实\n长得英俊潇洒...',
                        "<18>{#p/papyrus}{#f/4}但我们注定是没戏的！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/6}你说啥！？！？\n我不能和你结婚！！",
                        ...(SAVE.data.b.flirt_papyrus
                            ? ["<18>{#p/papyrus}{#f/0}还记得吗？\n我们是不会有结果的，\n当时都说好了的啊！"]
                            : [
                                "<18>{#p/papyrus}{#f/0}我们已经是\n一对酷酷的朋友了啊！",
                                '<18>{#p/papyrus}{#f/5}而且要是我们结婚了...',
                                "<18>{#p/papyrus}{#f/6}那我就没法和你\n做朋友了！"
                            ])
                    ]
                    : ['<18>{#p/papyrus}{#f/4}那样的一对...\n有点过于强大了。']
        ),
        s_lesser: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这片空地\n以前是分开来的，\n被一座桥所连接着。',
                '<18>{#p/papyrus}{#f/4}左右两半，\n在中心相连...',
                '<18>{#p/papyrus}{#f/9}就像两个\n英勇的骷髅的灵魂！',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}...',
                        "<18>{#p/papyrus}{#f/5}话说，衫斯现在\n在想啥呢...",
                        "<18>{#p/papyrus}{#f/4}不是很确定，\n但我寻思肯定\n跟调味品有点关系。",
                        "<18>{#p/papyrus}{#f/5}要是他别老这么\n惦记调味品就好了...",
                        '<18>{#p/papyrus}{#f/7}不然我就得\n用雅莫酱好好\n{@fill=#ff0}酱{@fill=#fff}他一军了！！'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 对哦， \n  你俩之间是不是\n  有什么联结之类的东西？",
                        '<18>{#p/papyrus}{#f/0}从记事起，\n我们就一直是这样！',
                        '<25>{#p/undyne}{#f/14}* 这倒是让我想起了些\n  古老的故事...',
                        '<25>{#p/undyne}{#f/17}* ...那是关于\n  一个拿自己做实验的骷髅的。',
                        '<25>{#p/undyne}{#f/8}* 说不定，\n  你和你的兄弟\n  和他有点关系呢！！',
                        '<18>{#p/papyrus}{#f/1}我，\n在不知情的情况下\n参与了一场实验！？',
                        "<18>{#p/papyrus}{#f/7}这也太荒唐了！",
                        '<25>{#p/undyne}{#f/15}* ...谁知道呢...'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我想就这片空地\n再聊点别的...',
                        "<18>{#p/papyrus}{#f/4}但我现在满脑子想的\n都是调味品的事。"
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}嗯，\n我现在还真有点好奇\n我的过去了。",
                        "<18>{#p/papyrus}{#f/9}应该只要\n稍微调查一下，\n就能搞清楚了！",
                        "<25>{#p/undyne}{#f/14}* 需要的话，\n  我也可以帮你...",
                        "<18>{#p/papyrus}{#f/5}没关系，不用了。\n况且，作为卫队长...",
                        '<18>{#p/papyrus}{#f/4}你已经够忙的了。'
                    ]
        ),
        s_bros: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}衫斯很喜欢那些\n找不同的谜题...',
                '<18>{#p/papyrus}{#f/5}我之前做的找不同\n都挺简单的。',
                "<18>{#p/papyrus}{#f/7}但最近这些简直是\n不可能做得出来！",
                '<18>{#p/papyrus}{#f/4}要是没有可以进行\n像素级扫描的机器...',
                "<18>{#p/papyrus}{#f/7}根本没人能把不同点\n全找出来！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/7}太荒唐了！"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 我觉得这些应该是图书馆\n  那个谜题设计师绘制的。',
                        "<25>{#p/undyne}{#f/11}* ...感觉她认为\n  自己的工作相当无聊。",
                        "<18>{#p/papyrus}{#f/4}这算哪门子谜题...",
                        '<18>{#p/papyrus}{#f/0}看来我得去\n好好“处理”一下了！',
                        '<25>{#p/undyne}{#f/12}* 或许你也可以\n  自己设计一个...？',
                        '<18>{#p/papyrus}{#f/9}我或许可以吧！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}你想让我\n帮你找一找？',
                        '<18>{#p/papyrus}{#f/7}嘿，得了吧！',
                        "<18>{#p/papyrus}{#f/0}乱提难度的谜题\n不值得去解。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 每回卡在这种谜题上，\n  我就直接把图发给艾菲斯。',
                        "<25>{#p/undyne}{#f/14}* 她有个什么高级的\n  图像减影工具。",
                        '<18>{#p/papyrus}{#f/0}减影？',
                        '<18>{#p/papyrus}{#f/4}...“对比”这个词\n会更准确点吧？',
                        '<25>{#p/undyne}{#f/8}* 总之，那玩意确实能\n  减轻我头疼的程度！'
                    ]
        ),
        s_spaghetti: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}有人说那房间里的\n微波炉...',
                '<18>{#p/papyrus}{#f/0}有一个所谓的\n“隐藏功能”。',
                '<18>{#p/papyrus}{#f/5}不过，大多数人\n不知道的是...',
                '<18>{#p/papyrus}{#f/4}它发出的“微”波...\n其实是\n“微”小的引力波。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 我还以为\n  我那台热的“电冰箱”\n  已经够颠覆常识的了。',
                        '<25>{#p/undyne}{#f/8}* 今天这个“引力微波炉”\n  真让我见了世面了！',
                        '<25>{#p/undyne}{#f/11}* ...或者说，\n  相比“世面”，那盘“意面”\n  要更逆天点？',
                        '<18>{#p/papyrus}只有在被用来举起\n这样美味的佳肴时，\n才能体现这玩意的好。',
                        '<18>{#p/papyrus}{#f/6}呃，慢着！！\n别把引力波调太强...',
                        "<18>{#p/papyrus}{#f/6}它就会变成\n一个飞天意面怪的！",
                        "<25>{#p/undyne}{#f/14}* ...我可以考虑\n  信一下这个教。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}要是有办法\n关掉它就好了。']
                    : [
                        '<18>{#p/papyrus}{#f/5}说到飞天意面怪啊...',
                        '<18>{#p/papyrus}{#f/0}我还是想让\n我的意大利面\n老老实实地待着。',
                        '<18>{#p/papyrus}{#f/0}被漂漂亮亮地\n放在盘子里...',
'<18>{#p/papyrus}{#f/0}向世人证明\n我高超的厨艺...',
                        '<18>{#p/papyrus}{#f/4}并等着被吃掉。'
                    ]
        ),
        s_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}嗯... 你问我\n这个谜题怎么解...？',
                '<18>{#p/papyrus}{#f/5}呃，有的时候\n我就直接从激光上\n跨过去了。',
                '<18>{#p/papyrus}{#f/0}所以，其中一个解法\n就是要又高又帅！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...如果你个子太小\n绝对不要这样做。"]
                    : [
                        '<25>{#p/undyne}{#f/8}* 另一个解法就是用\n  你的喷气背包飞过去！！',
                        "<18>{#p/papyrus}{#f/4}喷气背包不见得\n就是万能的。",
                        '<18>{#p/papyrus}{#f/7}万一哪天你突然想\n欣赏风景了怎么办？',
                        '<25>{#p/undyne}{#f/16}* ...',
                        '<25>{#p/undyne}{#f/16}* 活了这么久我哪天没在\n  “欣赏风景”啊，帕派瑞斯。',
                        "<25>{#p/undyne}{#f/17}* 你就不会觉得腻吗！？",
                        '<18>{#p/papyrus}{#f/6}才不会呢！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}我正解这个谜题呢..."]
                    : [
                        '<18>{#p/papyrus}{#f/5}嗯...',
                        '<18>{#p/papyrus}{#f/0}安黛因真该关注一下\n望远镜的行情。',
                        '<18>{#p/papyrus}{#f/4}听说，我兄弟\n现在正在搞\n免费入会的活动呢...'
                    ]
        ),
        s_puzzle2: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}有人告诉我说\n这类谜题有个诀窍...",
                "<18>{#p/papyrus}{#f/5}让我看看地上那些方片。",
                '<18>{#p/papyrus}{#f/6}...我还以为这是个\n猜谜游戏呢！',
                '<18>{#p/papyrus}{#f/0}你看，今天又学到\n新东西了。',
'<18>{#p/papyrus}{#f/0}再接再厉！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 你有没有听说艾斯戈尔\n  最近发布的那个命令？',
                        '<25>{#p/undyne}{#f/16}* 说什么激光\n  对于小孩来说\n  “危险”、“有害”。',
                        '<18>{#p/papyrus}{#f/6}嗯，\n他说的确实有道理...',
                        '<25>{#p/undyne}{#f/4}* 别吧！\n* 这真是把乐趣\n  都给剥夺光了。',
                        '<25>{#p/undyne}{#f/12}* 我，呃，\n  小时候还经常玩\n  那些东西呢。',
                        '<18>{#p/papyrus}{#f/0}...啊。',
                        '<18>{#p/papyrus}{#f/4}也难怪你会觉得\n拿命去冒险\n会很“好玩”了。',
                        "<25>{#p/undyne}{#f/14}* 谁不觉得呢！？！？",
                        '<18>{#p/papyrus}{#f/6}呃...\n我？？？'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}等下，这是我\n兄弟的台词..."]
                    : [
                        "<18>{#p/papyrus}{#f/4}拿命去冒险\n是一回事...",
                        '<18>{#p/papyrus}{#f/7}白白浪费生命\n就是另一回事了！'
                    ]
        ),
        s_jenga: pager.create(
            0,
            () =>
                SAVE.data.b.s_state_puzzlenote
                    ? [
                        '<18>{#p/papyrus}{#f/5}哦？\n这个谜题啊。',
                        '<18>{#p/papyrus}{#f/5}我们永远也不会知道\n它会给出什么结果。',
                        '<18>{#p/papyrus}{#f/4}事实上，我现在\n唯一知道的事是...',
                        '<18>{#p/papyrus}{#f/5}实事求是的话，\n这下我们什么事\n都不知道了！',
                        ...(solo()
                            ? ['<18>{#p/papyrus}{#f/6}哇！！！']
                            : [
                                '<25>{#p/undyne}{#f/1}* 这有点像个绕口令。',
                                "<18>{#p/papyrus}{#f/7}啥啊！？\n骷髅明明\n连舌头都没有！",
                                '<25>{#p/undyne}{#f/17}* 呃，这还用说吗。',
                                "<25>{#p/undyne}{#f/16}* 这... 只是一种比喻。",
                                "<18>{#p/papyrus}{#f/4}嗯...\n想想看，\n骷髅不会有舌头...",
                                '<18>{#p/papyrus}{#f/5}而黄色小星星\n却可以有。',
                                '<25>{#p/undyne}{#f/12}* 你到底在说啥啊？',
                                '<18>{#p/papyrus}{#f/6}...没什么！！！'
                            ])
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/5}起初，这个谜题\n结果让我\n大失所望...",
                        '<18>{#p/papyrus}{#f/4}但后来，我就\n意识到了...',
                        '<18>{#p/papyrus}{#f/0}发生这种事情的\n概率很低...',
                        '<18>{#p/papyrus}{#f/9}...所以我们可能是\n仅有的见证了\n这一幕的人！！',
                        '<18>{#p/papyrus}{#f/0}你现在觉得\n很幸运了吧。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/12}* 你还不明白吗？",
                                '<18>{#p/papyrus}{#f/0}明白啥？',
                                "<25>{#p/undyne}{#f/1}* 这种情况是\n  专门有个说法的。",
                                '<25>{#p/undyne}{#f/1}* 叫“挥汗如雨，颗粒无收”。',
                                '<25>{#p/undyne}{#f/14}* 搞那些复杂的规则，\n  还铺垫大半天...',
                                '<25>{#p/undyne}{#f/12}* 结果毛用没有，\n  最后就只出来了\n  一个巨大的臃肿的零。',
                                "<18>{#p/papyrus}{#f/0}我不明白\n你在说什么，\n但是...",
                                '<18>{#p/papyrus}{#f/7}...等等，\n【你】怎么知道\n这里发生了啥的？',
                                "<25>{#p/undyne}{#f/15}* 呃... 我可能之前\n  去实验室那边转了转，\n  然后...",
                                '<18>{#p/papyrus}{#f/7}你在监视我！？',
                                '<25>{#p/undyne}{#f/8}* 没说是你，\n  帕派瑞斯！！',
                                '<18>{#p/papyrus}{#f/4}哦。',
                                '<18>{#p/papyrus}{#f/7}...所以你在\n监视人类！？！？',
                                "<25>{#p/undyne}{#f/17}* 我可是皇家卫队的队长！！\n* 你以为呢！"
                            ])
                    ],
            () =>
                solo()
                    ? SAVE.data.b.s_state_puzzlenote
                        ? ['<18>{#p/papyrus}{#f/5}噢天啊，\n我们真是还有很多\n未知或忘却的事啊...']
                        : ['<18>{#p/papyrus}幸运女神站在我们\n这边，人类！']
                    : SAVE.data.b.s_state_puzzlenote
                        ? ['<18>{#p/papyrus}{#f/5}怪物的生理构造\n真奇怪。']
                        : ['<18>{#p/papyrus}就算母星“克里”\n没能收获“颗粒”，\n但咱也挺幸运，是吧？']
        ),
        s_pacing: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}这不是小犬座的\n哨站嘛。',
                '<18>{#p/papyrus}{#f/4}那些月岩商人\n也老喜欢往那跑。',
                '<18>{#p/papyrus}{#f/5}嗯... 我挺好奇\n那些岩石都是用\n什么做成的。',
                "<18>{#p/papyrus}{#f/4}肯定不是用\n月亮做的，\n毕竟...",
                '<18>{#p/papyrus}{#f/7}月亮本身就是块\n巨大的岩石啊！',
                '<18>{#p/papyrus}{#f/5}这是不是说月亮本身\n就是块月岩呢？',
                '<18>{#p/papyrus}{#f/5}那“月亮”和“月岩”\n到底有啥区别嘛？',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 帕派瑞斯，\n  我觉得这种问题\n  是没有标准答案的。",
                        "<25>{#p/undyne}{#f/7}* ...不过这并不代表\n  你不该思考这个问题！！",
                        '<25>{#p/undyne}{#f/1}* 这种问题特别能\n  锻炼脑子！',
                        '<25>{#p/undyne}{#f/14}* 脑子可是你体内\n  最重要的那块肌肉。',
                        '<18>{#p/papyrus}{#f/4}对人类来说\n或许是这样...',
                        "<18>{#p/papyrus}{#f/7}但对怪物来说，\n可就不一样了！",
                        '<25>{|}{#p/undyne}{#f/12}* 我知道，\n  我只是想让那人\n  更容易理解-{%}',
                        "<18>{#p/papyrus}{#f/0}你看，\n怪物其实不是用\n脑子来思考的。",
                        "<18>{#p/papyrus}{#f/4}更像是...\n用个灵魂那样的东西。",
                        '<25>{#p/undyne}{#f/1}* 怪物把灵魂用走了，\n  正好给人类\n  剩了个零“头”。',
                        '<18>{#p/papyrus}{#f/7}老天啊！！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}也许我们这些凡人\n不配了解这些知识吧。']
                    : ['<25>{#p/undyne}{#f/12}* 以后就叫我“喻姐”吧。', "<18>{#p/papyrus}{#f/0}别吧。"]
        ),
        s_puzzle3: pager.create(
            0,
            [
                '<18>{#p/papyrus}{#f/5}呃...\n这个谜题啊...',
                '<18>{#p/papyrus}{#f/5}...',
                "<18>{#p/papyrus}{#f/4}咱要不别提了？"
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}...']
                    : [
                        "<25>{#p/undyne}{#f/12}* ...没那么糟吧？",
                        '<18>{#p/papyrus}{#f/5}我认真的。',
                        '<18>{#p/papyrus}{#f/4}糟透了。',
                        '<25>{#p/undyne}{#f/11}* ...好吧，\n  听你的...'
                    ],
            () => (solo() ? ['<18>{#p/papyrus}{#f/4}...'] : ['<25>{#p/undyne}{#f/7}* 他都让你别提这个了！！'])
        ),
        s_greater: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}这不是大犬座的\n哨站嘛...',
                '<18>{#p/papyrus}{#f/5}那只狗有一颗\n金子般的心。',
                '<18>{#p/papyrus}{#f/4}要是【我】加入\n皇家卫队就好了...',
                "<18>{#p/papyrus}{#f/0}这样我就能\n报答它的好意了！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 如果你愿意的话，\n  我可以帮你报答它。',
                        "<18>{#p/papyrus}{#f/7}我自己做\n才会更有意义！",
                        "<25>{#p/undyne}{#f/17}* 那你不能等它回家的时候\n  再报答吗！？",
                        "<18>{#p/papyrus}{#f/7}在它工作的地方报答\n才更有意义！",
                        "<25>{#p/undyne}{#f/1}* 你说得对。\n* 那我就让你以全息影像的\n  方式出现在那里吧。",
                        '<18>{#p/papyrus}{#f/7}哼！！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}真可惜我可能\n永远加入不了\n皇家卫队了。"]
                    : ['<18>{#p/papyrus}{#f/7}面对面交谈的作用\n是任何方式\n都无法比拟的！']
        ),
        s_math: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}数学【一直】是\n我最头疼的东西。',
                '<18>{#p/papyrus}{#f/5}又是微积分，\n又是几何学...',
                '<18>{#p/papyrus}{#f/4}用指骨数数不好吗？',
                '<18>{#p/papyrus}{#f/7}所有的“高等”数学\n都是完全没有\n必要的！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 你咋还真这么想啊？",
                        "<25>{#p/undyne}{#f/17}* 要是没有高等数学，\n  我们现在就还会\n  活在黑暗时代呢！",
                        "<25>{#p/undyne}{#f/16}* 不过话说回来，\n  那样的话，我们说不定\n  还能住在故园的星球上...",
                        '<18>{#p/papyrus}{#f/5}我明白，我明白...',
                        "<18>{#p/papyrus}{#f/7}我只是\n不喜欢做数学题！",
                        "<25>{#p/undyne}{#f/14}* 噢别吧。\n  这我完全同意。"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}如果你真的需要\n高等数学方面的\n帮助...',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}那就没有比\n艾菲斯博士更\n适合的人选了！",
                        "<18>{#p/papyrus}{#f/4}大家都说她像个\n行走的计算器...",
                        '<18>{#p/papyrus}{#f/0}而且是很科学的\n那种！'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 找艾菲斯博士就行了？',
                        '<18>{#p/papyrus}{#f/9}哇，\n我怎么就没想到呢！！',
                        '<18>{#p/papyrus}{#f/4}...噢等等。',
                        "<18>{#p/papyrus}{#f/4}这是因为\n她帮你整理了\n所有的报告。",
                        "<25>{#p/undyne}{#f/17}* 她确实挺会排日程的，\n  好吗？？"
                    ])
            ]
        ),
        s_bridge: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}还记得那个\n“致命恐怖\n大挑战”吗？',
                '<18>{#p/papyrus}{#f/4}不知道你信不信，\n其实还有个\n秘密的第七武器。',
                "<18>{#p/papyrus}{#f/6}那东西真的会让你\n魂飞魄散的！",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...']
                    : [
                        "<25>{#p/undyne}{#f/12}* 那能让人目瞪口呆的呢？",
                        "<18>{#p/papyrus}{#f/0}实际上，那是我\n超秘密的第八武器。",
                        '<25>{#p/undyne}{#f/1}* 哦。\n* 听起来很危险啊。',
                        "<18>{#p/papyrus}{#f/6}不然你以为我\n为啥没把它用上！？"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}...字面意义上的！！']
                    : [
                        "<18>{#p/papyrus}{#f/4}我都还没开始说...",
                        '<18>{#p/papyrus}{#f/4}那个超级无敌秘密的\n第十武器呢。',
                        '<18>{#p/papyrus}{#f/6}...等等，我把\n究级秘密的第九武器\n给忘了！',
                        '<18>{#p/papyrus}{#f/0}那玩意绝对能\n吓掉你的下巴。'
                    ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}幸好我没用上它啊，\n对吧？",
                        '<18>{#p/papyrus}{#f/4}更别提我还有\n其它二十种武器呢。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}吓掉你的衣服鞋子\n也不在话下...',
                        '<18>{#p/papyrus}{#f/6}...最后啊，\n你整个人都会被吓晕！'
                    ]
        ),
        s_town1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}星港小镇：\n北侧！',
                "<18>{#p/papyrus}{#f/5}是我不会花很多\n时间的一侧。",
                '<18>{#p/papyrus}{#f/4}然而，衫斯就...',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/4}...好吧，你可以\n大概猜一下他为什么\n喜欢这里。']
                    : [
                        "<25>{#p/undyne}{#f/14}* ...他喜欢烤尔比的\n  美味新品！",
                        '<18>{#p/papyrus}{#f/4}什么？\n美味新品？',
                        '<18>{#p/papyrus}{#f/5}那【确实】是\n比以前好吃点了...',
                        '<18>{#p/papyrus}{#f/7}但还是比不上\n在家做的意面啊！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}跟烤尔比是\n有关系的哦。"]
                    : [
                        '<18>{#p/papyrus}{#f/5}他要是能珍惜点\n我为他做的一切\n就好了。',
                        '<18>{#p/papyrus}{#f/6}好兄弟嘛，\n对吧。'
                    ]
        ),
        s_taxi: pager.create(
            0,
            () => [
                ...(SAVE.data.n.plot < 65
                    ? [
                        '<18>{#p/papyrus}{#f/0}今天运输船\n还开吗？',
                        '<18>{#p/papyrus}{#f/5}嗯... 一般来说\n晚些时候会\n过来的。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}我听说\n运输船终于开了！',
                        "<18>{#p/papyrus}{#f/5}嗯...\n这说明现在是\n“晚些时候”了。"
                    ]),
                '<18>{#p/papyrus}{#f/6}至于如何分辨\n“早些时候”和\n“晚些时候”...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...我回头再\n跟你讲。"]
                    : [
                        '<25>{#p/undyne}{#f/12}* 呃...\n  这是你瞎编的吧。',
                        '<25>{#p/undyne}{#f/17}* 前哨站压根就没有\n  “晚些时候”这种说法。',
                        '<18>{#p/papyrus}{#f/4}没错...',
                        '<18>{#p/papyrus}{#f/9}...但现在有了！',
                        '<18>{#p/papyrus}{#f/9}总有一天，\n所有人都会采用\n我的计时方法！',
                        "<18>{#p/papyrus}{#f/0}这将是一场\n伟大的计时改革！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}会讲的！！！']
                    : [
                        '<18>{#p/papyrus}{#f/4}为了召开我们的\n第一次改革会议...',
                        "<18>{#p/papyrus}{#f/0}我们需要确定\n一个具体的时间点。",
                        "<18>{#p/papyrus}{#f/9}别担心！\n我会告诉参会者们...",
                        '<18>{#p/papyrus}{#f/9}...在“早些时候”\n到达！',
                        '<25>{#p/undyne}{#f/1}* 那他们怎么知道\n  那是啥时候啊？',
                        '<18>{#p/papyrus}{#f/4}对哦...',
                        "<18>{#p/papyrus}{#f/0}看来我们得在会上\n讨论这个问题。"
                    ]
        ),
        s_town2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}星港小镇：\n南侧！',
                '<18>{#p/papyrus}{#f/4}或者我也喜欢\n叫做...',
                '<18>{#p/papyrus}{#f/9}宇宙中最好的\n一侧！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 这还用说，\n  你自己都住这。',
                        '<18>{#p/papyrus}{#f/4}不仅如此...',
                        "<18>{#p/papyrus}{#f/0}烤尔比\n还不在这！！"
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/4}难怪会有一个\n友好的幽灵\n在这里开店...",
                "<18>{#p/papyrus}{#f/9}谁不想接近\n这伟大的一边呢？",
                "<18>{#p/papyrus}{#f/0}我肯定是\n没法抗拒的。"
            ]
        ),
        s_battle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/9}你正站在\n我们那场传奇大战的\n场地上？',
                "<18>{#p/papyrus}{#f/0}没事没事，你继续。\n这可是个有着\n历史意义的地方。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 别欣赏太久风景了，\n  小混蛋！",
                        "<25>{#p/undyne}{#f/7}* 你还得去观摩一下\n  咱俩打那场传奇大战的\n  地方！",
                        '<18>{#p/papyrus}{#f/6}那人到底打过\n几场传奇大战啊？',
                        '<25>{#p/undyne}{#f/8}* 谁知道呢！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}总有一天他们会\n把这件事放进\n博物馆的..."]
                    : [
                        '<25>{#p/undyne}{#f/1}* 不管现在怎样...',
                        '<25>{#p/undyne}{#f/7}* 你最好别打出个\n  比我们那场\n  还传奇的大战！',
                        '<25>{#p/undyne}{#f/14}* 除非我也上场！\n* 呋呼呼！'
                    ]
        ),
        s_exit: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}你现在得\n小心点...',
                '<18>{#p/papyrus}{#f/0}那边那扇门是\n铸厂的入口。',
                '<18>{#p/papyrus}{#f/5}在这样的地方\n等待你的只有\n黑暗。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 这我不反对。",
                        '<25>{#p/undyne}{#f/16}* 我几乎一半的时间\n  都把喷气背包\n  当手电筒用...',
                        '<18>{#p/papyrus}{#f/6}那我给你的\n那些手电筒呢？',
                        '<25>{#p/undyne}{#f/1}* 哦，你说那些啊。',
                        '<25>{#p/undyne}{#f/14}* ...呃，\n  我大概在用喷气背包时\n  不小心给弄丢了。',
                        '<18>{#p/papyrus}{#f/4}我就知道...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}我刚才提到过\n等待着你的黑暗\n了吗？']
                    : [
                        "<18>{#p/papyrus}要说我在安黛因身上\n学到了什么...",
                        "<18>{#p/papyrus}{#f/5}那就是\n不管啥事都能扯到\n她的喷气背包上。",
                        '<18>{#p/papyrus}{#f/4}无论是何时何地\n都一个样...',
                        "<18>{#p/papyrus}{#f/5}她总因为那玩意\n而惹上麻烦。",
                        "<25>{#p/undyne}{#f/14}* 即使如此，你这不也能\n  接受我的怪癖，\n  没有排斥我吗！",
                        '<25>{#p/undyne}{#f/17}* 对吧？',
                        '<18>{#p/papyrus}{#f/6}...那肯定啊！！'
                    ]
        ),
        s_grillbys: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}所以...\n这里是烤尔比。",
                '<18>{#p/papyrus}{#f/5}他们真的安了台\n雅莫万能酱\n喷酱机吗...',
                "<18>{#p/papyrus}{#f/6}就只是为了满足\n我兄弟奇怪的\n念头？",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/13}* 啥玩意？',
                        '<18>{#p/papyrus}{#f/4}雅莫万能酱喷酱机。',
                        '<18>{#p/papyrus}{#f/4}就是用来\n喷雅莫万能酱的。'
                    ]),
                '<18>{#p/papyrus}{#f/4}...',
                '<18>{#p/papyrus}{#f/4}我通常都对\n我们一族\n抱有希望的，但...',
                '<18>{#p/papyrus}{#f/4}遇到这种事\n就不行了。',
                '<18>{#p/papyrus}{#f/5}...不过。',
                "<18>{#p/papyrus}{#f/5}还好他们把点唱机\n修好了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/8}* 真修好了！？',
                        "<25>{#p/undyne}{#f/7}* 那玩意在我出生前就坏了。"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}第三首是我个人\n最喜欢的。',
                ...(solo() ? [] : ["<25>{#p/undyne}{#f/1}* 我最喜欢第四首！"])
            ]
        ),
        s_backrooms: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}自从他们开始\n在这里使用复制器...',
                "<18>{#p/papyrus}{#f/5}我就一直不知道\n该怎么看待这事。",
                '<18>{#p/papyrus}{#f/0}一方面，\n这种新食物\n确实健康。',
                "<18>{#p/papyrus}{#f/7}但另一方面，\n他们完全把烹饪\n放弃掉了！",
                "<18>{#p/papyrus}{#f/4}看到你现在\n所在的这个\n房间了吗？",
                '<18>{#p/papyrus}{#f/7}猜猜它过去\n是干什么的吧！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 这不是小犬座\n  平时喜欢待的地方吗？",
                        '<25>{#p/undyne}{#f/10}* 就它自己...\n* 一个人在这玩牌...',
                        "<18>{#p/papyrus}{#f/4}噢，这没事的。\n它那样挺开心的。",
                        '<18>{#p/papyrus}{#f/0}它好像有一套\n自己的生活规划...',
                        '<18>{#p/papyrus}{#f/9}就包括打牌！！\n以及要好多摸头！',
                        "<25>{#p/undyne}{#f/14}* 关于摸头，\n  你说得可太对了。",
                        '<25>{#p/undyne}{#f/17}* 有一回它闯进\n  皇家卫队的会议，\n  就只是为了要摸摸！',
                        '<18>{#p/papyrus}{#f/6}有意思！！\n那你们怎么做的？',
                        '<25>{#p/undyne}{#f/12}* 嗯...\n  我们大家把它的头\n  摸了不少下呢。',
                        "<25>{#p/undyne}{#f/8}* 怎么可能不摸呢！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}是某种“厨房”...',
                        '<18>{#p/papyrus}{#f/5}现在他们只把这里\n当成玩私人纸牌\n游戏的地方了。'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/4}如果他们不打算\n把这里当厨房...",
                        '<18>{#p/papyrus}{#f/5}也许搞个摸头机\n要更好。'
                    ]
        ),
        s_bonehouse: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}还有什么地方能\n比我家更好呢！',
                "<18>{#p/papyrus}{#f/0}我们有超高水槽...\n还有宠物月岩...",
                '<18>{#p/papyrus}{#f/9}甚至还有个阳台，\n多适合户外生活！',
                "<18>{#p/papyrus}{#f/0}我基本只有在这\n才会有家的感觉。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 我本想说我家也不错，\n  但... 你知道的。",
                        '<18>{#p/papyrus}{#f/5}是啊...\n没家肯定会不好受。',
                        '<18>{#p/papyrus}{#f/6}...话说，\n现在哪里可以让你\n感觉像在家啊？',
                        "<25>{#p/undyne}{#f/1}* 想听真话吗？\n* 这里就挺好的！",
                        "<18>{#p/papyrus}{#f/5}但... 怎么会呢？\n我们只是在\n干站着啊！",
                        "<25>{#p/undyne}{#f/14}* 只要和你在一块，\n  哪儿都是家。\n* 呋呼呼。",
                        '<18>{#p/papyrus}{#f/5}...你认真的吗？',
                        '<25>{#p/undyne}{#f/8}* 当然了！！',
                        "<18>{#p/papyrus}{#f/8}不-不...！！\n你要把我弄哭了！"
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}不知道现在\n人类是怎么称呼\n“家”的。',
                '<18>{#p/papyrus}{#f/4}据我所知，\n他们还生活在\n地球上...',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 事实上，\n  听说地球已经一团糟了。',
                        '<25>{#p/undyne}{#f/12}* ...我在皇家实验室那边\n  听说的。',
                        '<25>{#p/undyne}{#f/13}* 他们好像找到了什么\n  关于自然灾害的“证据”...'
                    ])
            ]
        ),
        s_papyrusroom: pager.create(
            0,
            () =>
                SAVE.data.n.plot_date < 1.1
                    ? [
                        '<18>{#p/papyrus}哇，你只花了四秒钟\n就给我打电话了！',
                        '<18>你一定非常需要\n我的帮助！！！',
                        "<18>{#p/papyrus}{#f/9}但不要害怕。\n这是帕派瑞斯的\n热线电话！",
                        '<18>{#p/papyrus}{#f/9}只需要描述一下\n你的位置，然后...',
                        '<18>{#p/papyrus}{#f/4}...等等。',
                        "<18>{#p/papyrus}{#f/6}你还在我的\n房间里？？",
                        '<18>{#p/papyrus}{#f/5}...',
                        '<18>{#p/papyrus}{#f/5}你有没有听说过一种\n叫做... 门的东西？',
                        "<18>{#p/papyrus}{#f/6}别着急！！\n我会给你画个\n图解的！"
                    ]
                    : SAVE.data.n.plot_date < 1.2
                        ? [
                            "<18>{#p/papyrus}{#f/1}啥？？\n我以为你早就\n离开我房间了！！",
                            "<18>{#p/papyrus}{#f/4}看来我们得\n从头开始了...",
                            '<18>{#p/papyrus}{#f/5}首先，你还知道\n帕派瑞斯是\n谁吗！？'
                        ]
                        : [
                            '<18>{#p/papyrus}{#f/5}所以你\n又回我房间了，\n嗯？',
                            '<18>{#p/papyrus}{#f/5}（唉...）',
                            '<18>{#p/papyrus}{#f/5}只能说这里\n【确实】蛮酷的。',
                            ...(solo()
                                ? []
                                : [
                                    '<25>{#p/undyne}{#f/1}* 那我的房间呢？',
                                    "<18>{#p/papyrus}{#f/4}嗯...\n那房间很热。",
                                    '<18>{#p/papyrus}{#f/4}事实上，\n都着火了。',
                                    '<25>{#p/undyne}{#f/17}* 很好！！\n* 我就喜欢热乎的东西！'
                                ])
                        ],
            () =>
                SAVE.data.n.plot_date < 1.1
                    ? ["<18>{#p/papyrus}{#f/6}坚持住！\n我还在画！"]
                    : SAVE.data.n.plot_date < 1.2
                        ? ['<18>{#p/papyrus}{#f/1}【我】还知道\n帕派瑞斯是\n谁吗！？！？']
                        : [
                            ...(solo()
                                ? [
                                    "<18>{#p/papyrus}{#f/6}嘿，呃，\n既然你在那...",
                                    '<18>{#p/papyrus}{#f/6}能不能帮我照顾下\n我的那些动作玩偶？？',
                                    "<18>{#p/papyrus}{#f/5}他们最近...\n好像有点寂寞了。",
                                    '<18>{#p/papyrus}{#f/5}...谢了。'
                                ]
                                : ["<25>{#p/undyne}{#f/8}* 尤其是\n  当它们着火的时候！！！"])
                        ]
        ),
        s_innterior: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}旅馆是个好地方。",
                '<18>{#p/papyrus}床很舒服，\n旅馆的老板娘\n人就更好了。',
                '<18>{#p/papyrus}{#f/5}但我最喜欢的，\n还是墙上的那个\n照片...',
                "<18>{#p/papyrus}{#f/0}它时刻提醒我们\n怪物的真正能耐\n是怎样的。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 这也是最有名的\n  关于故园的照片之一了...",
                        '<25>{#p/undyne}{#f/9}* 仅存的几张照片之一啊。',
                        "<18>{#p/papyrus}{#f/5}...你觉得我们\n还能找到其它的吗？",
                        "<25>{#p/undyne}{#f/1}* 嗯，\n  要是我们有什么方法\n  能扫描怪物的记忆就好了...",
                        '<26>{#p/undyne}{#f/14}* 我们就可以找个\n  以前住那的怪物\n  扫描一下！',
                        '<18>{#p/papyrus}{#f/0}啊...\n听上去真不错！',
                        '<18>{#p/papyrus}{#f/4}...要是我们\n真有法子就好了。',
                        "<18>{#p/papyrus}{#f/4}然而我们没有。",
                        '<18>{#p/papyrus}{#f/4}太悲哀了。'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}要是我们能回到\n过去就好了...']
                    : [
                        '<18>{#p/papyrus}{#f/5}我觉得，\n眼下啊...',
                        '<18>{#p/papyrus}{#f/4}只能互相\n讲讲睡前故事了。',
                        "<25>{#p/undyne}{#f/1}* 对哦，\n  衫斯不是经常跟你讲吗？",
                        "<18>{#p/papyrus}{#f/0}当然了！\n那些故事简直就是\n想象力的源泉！",
                        '<25>{#p/undyne}{#f/1}* 想象一下，\n  你要是能找个来自故园的人\n  给你讲故事...',
                        '<25>{#p/undyne}{#f/14}* 那样的人绝对能给你讲上\n  几百个超棒的睡前故事！',
                        '<18>{#p/papyrus}那还用说！'
                    ]
        ),
        s_beddinng: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}有的时候，\n衫斯会给我读一个\n睡前故事。',
                '<18>{#p/papyrus}{#f/5}你听说过\n《伟大的怪物》吗？',
                '<18>{#p/papyrus}{#f/6}衫斯昨晚给我讲了\n这个故事，然后...',
                "<18>{#p/papyrus}{#f/8}...呃啊！\n我就哭得\n停不下来了！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/10}* 哎哟...\n* 那确实是个悲剧。",
                        '<25>{#p/undyne}{#f/16}* 尤其是它还是个人类写的。',
                        '<18>{#p/papyrus}{#f/6}...难道人类写的书里\n故事都这么悲惨吗？',
                        "<25>{#p/undyne}{#f/14}* 这我就不知道了。\n* 我就读过这一本。",
                        '<25>{#p/undyne}{#f/15}* 呃，除非你把\n  艾菲斯前几天发的\n  那些“书”也算上...',
                        "<18>{#p/papyrus}{#f/4}...那些\n我一点也不想听。"
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/4}下一次，我就让\n衫斯讲一个\n开心的故事了。",
                '<18>{#p/papyrus}{#f/6}要有一个\n【真正】意义上的\n幸福结局！',
                '<18>{#p/papyrus}{#f/5}每个人都该\n适得其所！！',
                '<18>{#p/papyrus}{#f/7}每个人都不用\n失去性命，\n不用道别！！！'
            ]
        ),
        s_librarby: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}嘘...\n（图书倌里是不能\n打电话的！）',
                "<18>{#p/papyrus}{#f/0}（不过可以等你出来\n之后再给我打\n电话！）",
                ...(solo() ? [] : ['<25>{|}{#p/undyne}{#f/8}* 呀哈哈让我们嗨起-{%}'])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}（你认真的吗...）']
                    : [
                        '<18>{#p/papyrus}{#f/4}（对了，\n我得挂掉电话，\n免得安黛因吵到你。）',
                        '<25>{|}{#p/undyne}{#f/8}* 呀- {%}'
                    ]
        ),
        f_start: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}看看铸厂里\n这不祥的气氛。',
                '<18>{#p/papyrus}{#f/4}他们说管道里\n住着怪物...',
                "<18>{#p/papyrus}{#f/0}说得绝对没错！",
                '<18>{#p/papyrus}{#f/5}有些怪物确实喜欢\n潮湿肮脏的环境。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}我就不一样！！']
                    : [
                        "<25>{#p/undyne}{#f/1}* 我把这些管子当成攀爬架爬\n  希望他们不要介意。",
                        '<25>{#p/undyne}{#f/8}* 我一直都把这东西\n  当攀爬架用的！',
                        '<18>{#p/papyrus}{#f/6}安黛因，哦不！\n好可怜的管道居民啊！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}我更喜欢在生活中\n卫生一点。']
                    : ['<18>{#p/papyrus}{#f/6}以后请轻攀慢爬。']
        ),
        f_sans: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在这\n有一个工作站。',
                '<18>{#p/papyrus}{#f/4}事实上，\n他同时管理两个站点。',
                "<18>{#p/papyrus}{#f/0}很惊人，是吧？",
                '<18>{#p/papyrus}{#f/0}他偷懒的次数\n是平时的两倍！！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 听起来他没少看啊。",
                        '<18>{#p/papyrus}{#f/0}啊，对...没少看。',
                        '<18>{#p/papyrus}{#f/4}确实没少看网上的视频\n啥的。',
                        "<25>{#p/undyne}{#f/3}* ...我想知道他是不是\n  《喵喵航天行》的粉丝。",
                        "<18>{#p/papyrus}{#f/7}那不是重点！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我们醒着的人只能\n梦想拥有这样的\n懒惰...']
                    : [
                        "<18>{#p/papyrus}{#f/5}就连安黛因都被衫斯的\n坏习惯影响了...",
                        '<25>{#p/undyne}{#f/17}* 我没有！！',
                        "<18>{#p/papyrus}{#f/4}...上班的时候别看，行吗？",
                        '<25>{#p/undyne}{#f/17}* 好啦！！'
                    ]
        ),
        f_corridor: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}你的次元箱里\n有什么？",
                "<18>{#p/papyrus}{#f/4}实际上，\n不用告诉我。",
                "<18>{#p/papyrus}{#f/7}不然就是公然\n侵犯你的隐私了！",
                ...(solo()
                    ? []
                    : SAVE.data.b.undyne_respecc
                        ? ['<25>{#p/undyne}{#f/17}* ...', "<25>{#p/undyne}{#f/14}* ...啊，还真是。"]
                        : [
                            '<25>{#p/undyne}{#f/8}* 等等，我撤回！\n* 我想知道！',
                            "<25>{#p/undyne}{#f/7}* 你！\n* 你都私藏了什么啊，小混蛋！？",
                            "<18>{#p/papyrus}{#f/6}啥也没有！\n就这样！！",
                            "<25>{#p/undyne}{#f/17}* 谁问你了。",
                            "<25>{#p/undyne}{#f/14}* ...呃，你要是不告诉我，\n  我待会自己去查\n  维度储存组。",
                            "<18>{#p/papyrus}{#f/6}啥！？\n那玩意真存在啊？",
                            '<18>{#p/papyrus}{#f/5}我就说物品肯定不能\n放进去就凭空消失了...'
                        ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}...至少告诉我\n不是“狗剩”就行。']
                    : [
                        '<18>{#p/papyrus}{#f/4}别跟别人说啊...',
                        "<18>{#p/papyrus}{#f/0}安黛因其实不是真的想\n偷你的东西的。",
                        "<25>{#p/undyne}{#f/12}* 我？偷他东西？\n* 噗，你说啥呢！",
                        "<18>{|}{#p/papyrus}看见了吧？\n他没有-{%}",
                        SAVE.data.b.undyne_respecc
                            ? "<25>{#p/undyne}{#f/14}* 我只会偷那种怂包的\n  东西啦！"
                            : "<25>{#p/undyne}{#f/14}* 我只会偷那种不友好的\n  小混蛋的东西的啦！",
                        "<18>{#p/papyrus}{#f/4}...那你为什么偷我东西？",
                        "<25>{#p/undyne}{#f/17}* 别想太多啦！"
                    ]
        ),
        f_doge: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}我总听别人说，\n“生活就如白云苍狗，\n 飘忽不定。”",
                '<18>{#p/papyrus}{#f/7}我就纳闷了，\n白云那么轻，怎么能\n藏住一只狗呢...',
                '<18>{#p/papyrus}{#f/5}不过，\n我倒知道这里\n藏着一只狗...',
                '<18>{#p/papyrus}{#f/6}她应该就在\n你的附近！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/16}* 说起来...',
                        '<25>{#p/undyne}{#f/9}* ...我的一位高级部下督吉\n  今天辞职了。',
                        '<18>{#p/papyrus}{#f/6}哦！\n他们说的“白云藏狗”\n指的是她吗？',
                        "<25>{#p/undyne}{#f/1}* 呃，白云里藏没藏狗我不知道，\n  但她确实是一位宝藏队员。",
                        '<25>{#p/undyne}{#f/16}* 她对我一直忠心耿耿...\n  是我待她不周了。',
                        '<18>{#p/papyrus}{#f/5}啊...',
                        '<18>{#p/papyrus}{#f/6}那就...\n找个机会和她道个歉，\n咋样？',
                        "<25>{#p/undyne}{#f/12}* ...好，\n  确实是个不错的起点。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}要是我水槽下面的\n那条狗有这样的\n优先权就好了...']
                    : ['<18>{#p/papyrus}{#f/0}有顾虑就直接问。', '<18>{#p/papyrus}{#f/9}这招总是很有效！']
        ),
        f_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}小心古人的\n塔架谜题！',
                '<18>{#p/papyrus}{#f/4}虽然他们的建造方法\n很简陋...',
                '<18>{#p/papyrus}{#f/6}但是设计却很复杂！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}我们这些怪物\n能解决这些谜题\n可真是个奇迹。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 这是怪物的智慧。\n* 换做人类就不行了...',
                        '<25>{#p/undyne}{#f/16}* 他们为了这点小破事就\n  跟我们发动了战争，\n  真是够蠢的。',
                        '<18>{#p/papyrus}{#f/6}...塔们也架不住\n这样折腾啊！',
                        "<25>{#p/undyne}{#f/12}* ...幸好，咱\n  有个超棒的人类\n  来挪这些塔架！",
                        '<18>{#p/papyrus}{#f/0}这回我【总算】\n不用亲自出马了。'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}我好奇人类会不会\n被怪物的谜题难住。']
                    : ['<18>{#p/papyrus}{#f/0}哈！人类也不全是坏的！']
        ),
        f_quiche: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我兄弟前几天\n来过这里...',
                '<18>{#p/papyrus}{#f/5}说他得送点\n东西过来。',
                '<18>{#p/papyrus}{#f/5}我问他要送什么，\n他给了我一个挑战...',
                '<18>{#p/papyrus}{#f/4}说要让我想\n一{@fill=#ff0}支世{@fill=#fff}俗的笑话。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 我应该知道它是什么意思，\n  帕派瑞斯。',
                        '<18>{#p/papyrus}{#f/6}啥！？\n说来听听？',
                        '<25>{#p/undyne}{#f/1}* 啊，得了吧。\n* 我还能有你了解你兄弟啊？\n  你不想解就直说嘛！',
                        '<25>{#p/undyne}{#f/12}* {@fill=#ff0}但高{@fill=#fff}手可不能临阵脱逃啊！\n  帕派瑞斯！',
                        '<18>{#p/papyrus}{#f/5}呃...\n芝士谜语...',
                        '<18>{#p/papyrus}{#f/4}搭配上蛋糕...'
                    ])
            ],
            ["<18>{#p/papyrus}{#f/6}等我想到答案了\n很快就来找你！"]
        ),
        f_puzzle2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}通常情况下，\n如果你没花时间\n好好读牌子的话...',
                "<18>{#p/papyrus}{#f/5}你可能是解不开\n谜题的。",
                "<18>{#p/papyrus}{#f/6}你以为仅凭直觉就\n可以了，但是...\n完全不够！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}...我已经没少\n因为这个尴尬了..."]
                    : [
                        '<25>{#p/undyne}{#f/14}* 是啊，逼人读牌子，有够烦。',
                        '<25>{#p/undyne}{#f/8}* 换做我就直接把矛往\n  接收器上丢，收工！',
                        "<18>{#p/papyrus}{#f/6}那谜题不就坏了吗！？",
                        '<25>{#p/undyne}{#f/14}* 没坏，我也很惊讶。',
                        '<25>{#p/undyne}{#f/14}* 人造谜题比人类还要耐磨。',
                        "<25>{#p/undyne}{#f/7}* 信我。\n* 我也不是没试过故意破坏。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}我以前说过，\n我还要再说一遍。",
                        '<18>{#p/papyrus}{#f/9}读！\n标！！\n牌！！！',
                        '<18>{#p/papyrus}{#f/4}注意我的感叹号\n用得越来越多。',
                        "<18>{#p/papyrus}{#f/7}意思就是说这\n非常重要！！！！"
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}呃，一句老话说得好...',
                        "<18>{#p/papyrus}{#f/0}砸不坏，就解开！",
                        '<18>{#p/papyrus}{#f/5}真是绕了好大一圈。'
                    ]
        ),
        f_story1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}讯星真的很厉害，\n对吧？',
                '<18>{#p/papyrus}{#f/5}不过，它们会\n周期性地重置。',
                '<18>{#p/papyrus}{#f/4}在重置之前，\n只能保留一条消息...',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* 所以我想传给艾菲斯信息的\n  计划才失败了的。",
                        '<18>{#p/papyrus}{#f/6}你用讯星给艾菲斯传过\n信！？',
                        '<18>{#p/papyrus}{#f/5}噢...\n安黛因...',
                        "<25>{#p/undyne}{#f/17}* 怎么？\n* 我就还以为它知道要给谁\n  说呢！",
                        "<25>{#p/undyne}{#f/11}* 讯星以前不就是这样的吗？？",
                        '<18>{#p/papyrus}{#f/0}啊，其实不是。',
                        '<18>{#p/papyrus}{#f/4}他们刚发芽的时候...',
                        '<18>{#p/papyrus}{#f/9}他们就很容易受到外界\n影响！',
                        '<18>{#p/papyrus}{#f/5}然后，他们一点点生长，\n接收信息的速度也越来\n越慢。',
                        '<25>{#p/undyne}{#f/1}* 哈。\n* 真迷人！',
                        "<25>{#p/undyne}{#f/12}* 那我得换个法子了。"
                    ])
            ],
            ["<18>{#p/papyrus}{#f/4}这通电话\n【应该】不会被录下来吧。"]
        ),
        f_prechase: pager.create(
            0,
            () =>
                SAVE.data.n.plot < 37.11
                    ? []
                    : SAVE.data.n.plot < 48
                        ? [
                            '<18>{#p/papyrus}这里以前有一座桥的，\n但是桥塌了。',
                            "<18>{#p/papyrus}{#f/5}希望他们很快能\n建一座新桥...",
                            '<18>{#p/papyrus}{#f/6}站在一个脆弱的\n浮动平台上\n太吓人了！'
                        ]
                        : [
                            '<18>{#p/papyrus}我听说这里的工人建了座桥。',
                            '<18>{#p/papyrus}{#f/5}谢宇谢宙...',
                            "<18>{#p/papyrus}{#f/6}我已经受够\n浮动平台了！！",
                            ...(solo()
                                ? []
                                : [
                                    "<25>{#p/undyne}{#f/7}* 那是你不懂享受。",
                                    "<18>{#p/papyrus}{#f/4}那可不么，\n我可没有火箭背包。",
                                    '<18>{#p/papyrus}{#f/6}我掉下去可咋办！',
                                    '<25>{#p/undyne}{#f/14}* 人生只有这点乐趣，\n  你甘心吗？',
                                    "<25>{#p/undyne}{#f/4}* 你就算掉下去了，\n  也摔不死。",
                                    "<25>{#p/undyne}{#f/1}* 撑死也就...四处飘几天。",
                                    "<25>{#p/undyne}{#f/14}* 我会用喷气背包\n  捞你上来的！",
                                    "<18>{#p/papyrus}{#f/6}我会用桥试试运气的，\n谢谢你！"
                                ])
                        ],
            () =>
                SAVE.data.n.plot < 37.11
                    ? []
                    : [
                        '<18>{#p/papyrus}{#f/0}没有什么比一座...',
                        '<18>{#p/papyrus}{#f/0}既坚固，又稳定，\n设计又合理的桥\n更安全的了。',
                        '<18>{#p/papyrus}{#f/9}这是对一流工程\n技术的真正证明！！'
                    ]
        ),
        f_chase: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}当我第一次看到\n这个房间时，\n我真的很惊讶。',
                "<18>{#p/papyrus}{#f/4}惊讶到，我找不到\n出去的路了。",
                '<18>{#p/papyrus}{#f/6}...就更别说这里的\n陷阱了！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 啊对，我都给那些玩意忘了...',
                        "<25>{#p/undyne}{#f/14}* 呃，反正人们基本都知道\n  怎么走。\n* 不会有事的。",
                        '<18>{#p/papyrus}{#f/6}听着八成会出事。',
                        "<25>{#p/undyne}{#f/12}* 别担心啦。\n* 其实，还挺方便的！",
                        '<25>{#p/undyne}{#f/1}* 我觉得犬卫队都开始\n  把那当训练场了。',
                        '<18>{#p/papyrus}{#f/4}到底是怎么训练的？',
                        '<25>{#p/undyne}{#f/17}* 好像是什么“战术性诱惑回避”？',
                        '<25>{#p/undyne}{#f/12}* 他们在有陷阱的路后面\n  放了点零食，然后让狗狗们试着\n  避开那些零食。',
                        "<18>{#p/papyrus}{#f/5}我收回之前\n“八成会出事”的观点。",
                        "<18>{#p/papyrus}{#f/6}现在是十成会出事了！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我觉得还是避开\n恐怖的迷宫游戏\n比较好。']
                    : [
                        "<25>{#p/undyne}{#f/1}* 其实陷阱已经少很多了。\n* 之前可不止这些。",
                        '<18>{#p/papyrus}{#f/6}之前多少？',
                        '<25>{#p/undyne}{#f/12}* ...\n* 绝对不少。',
                        '<18>{#p/papyrus}{#f/5}多少啊？',
                        '<25>{#p/undyne}{#f/17}* 很多。',
                        '<18>{#p/papyrus}{#f/6}有多多？？',
                        '<25>{#p/undyne}{#f/7}* 够了！'
                    ]
        ),
        f_entrance: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}你现在在一个叫做...",
                '<18>{#p/papyrus}{#f/9}“暗区”的地方。',
                "<18>{#p/papyrus}{#f/4}你肯定想不到\n它名字的来历的...",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 你真该谢谢我们怪物界的\n  起名天才——艾斯戈尔。\n* 这名是他起的。',
                        '<25>{#p/undyne}{#f/8}* 起名这块他称第二，\n  没人敢称第一。',
                        '<18>{#p/papyrus}{#f/0}我完全同意！\n所有东西的名字都\n超级容易理解！',
                        "<25>{#p/undyne}{#f/3}* ...你没开玩笑，对吧？",
                        "<18>{#p/papyrus}{#f/0}那是必然！\n我可很欣赏他的这个\n优点！",
                        '<25>{#p/undyne}{#f/1}* 好哦...',
                        '<18>{#p/papyrus}{#f/0}还有一点，\n你一定深有体会！',
                        "<18>{#p/papyrus}{#f/9}有了他起的名字，\n你就不可能【不】知道\n这东西是干啥的！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}剧透警告...', "<18>{#p/papyrus}{#f/4}...因为里面非常暗。"]
                    : ["<18>{#p/papyrus}{#f/0}这不是很有助于理解吗？"]
        ),
        f_lobby: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}我现在... 完全...\n联系不上你！",
                "<18>{#p/papyrus}{#f/6}手机... 绝对...\n出故障了！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}...',
                        "<18>{#p/papyrus}{#f/4}好吧，我承认其实\n并没有故障。",
                        '<18>{#p/papyrus}{#f/0}...但那台桌子肯定\n故障了！'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 我觉得，这手机{@fill=#ff0}芝士{@fill=#fff}太累了。\n* 咱俩也得像它一样\n  吃苦{@fill=#ff0}奶酪{@fill=#fff}才行。',
                        "<18>{#p/papyrus}{#f/5}我感觉不是。\n再吃苦奶酪，\n也不至于{@fill=#ff0}坏了{@fill=#fff}啊。"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}不过，讲真的，\n那东西到底是\n什么情况啊？"]
                    : ["<18>{#p/papyrus}{#f/4}真高兴，\n安黛因也会玩\n奶酪双关了。"]
        ),
        f_error: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这件房间标志着\n你的旅程已经走了一半...',
                '<18>{#p/papyrus}{#f/0}也就是从星港出发开始...',
                '<18>{#p/papyrus}{#f/0}到空境第一层的尽头。',
                '<18>{#p/papyrus}{#f/5}...不管你接下来\n要去哪里...',
                '<18>{#p/papyrus}{#f/6}你的旅程【至少】\n已经走完一半了！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/4}* 什么！？\n* 别这么说！",
                        "<18>{#p/papyrus}{#f/6}我-我是说，你的旅途终于\n算是开始了！",
                        "<18>{#p/papyrus}{#f/6}你还有好多东西\n没见识到呢！",
                        '<18>{#p/papyrus}{#f/6}而且还有好多地方\n没有去到呢！',
                        '<18>{#p/papyrus}{#f/4}最重要的是...',
                        '<18>{#p/papyrus}{#f/9}你还有好多朋友\n没有交到呢！',
                        "<25>{#p/undyne}{#f/12}* 这么说才对嘛。"
                    ])
            ],
            () =>
                solo()
                    ? ['<19>{#p/papyrus}{#f/5}走完一半了...']
                    : ["<19>{#p/papyrus}{#f/9}还有好长的路要走！"]
        ),
        f_telescope: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在这里经营\n望远镜生意。',
                '<18>{#p/papyrus}{#f/5}订阅、会员、\n注册、开券...',
                "<18>{#p/papyrus}{#f/6}这是个无穷无尽的\n条款和条件的迷宫！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我曾经试过报名，\n但是...',
                        "<18>{#p/papyrus}{#f/4}就算是我，\n耐力也是有限度的。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/13}* 我很怀疑真的有人能\n  注册上吗？',
                        "<18>{#p/papyrus}{#f/5}我认为...应该没有。",
                        '<18>{#p/papyrus}{#f/6}这些“最高级”望远镜真的\n能用吗！？',
                        '<25>{#p/undyne}{#f/8}* 谁知道呢！！',
                        "<25>{#p/undyne}{#f/1}* 倒也没事，\n  毕竟普通款能用就够了。",
                        '<25>{#p/undyne}{#f/14}* 我一直用的都是普通款！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}爱搞恶作剧的人\n总会把事情搞复杂...']
        ),
        f_bird: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/9}最是声名狼藉的。',
                '<18>{#p/papyrus}{#f/9}最是无所畏惧的。',
                '<18>{#p/papyrus}{#f/9}最是一往无前的。',
                '<18>{#p/papyrus}{#f/9}怪物。\n神话。\n传说...',
                '<18>{#p/papyrus}{#f/9}那只黄色的鸟。',
                ...(SAVE.data.n.plot < 42
                    ? [
                        '<18>{#p/papyrus}{#f/9}...',
                        '<18>{#p/papyrus}{#f/4}...等等。',
                        "<18>{#p/papyrus}{#f/1}不在这！？！？",
                        '<18>{#p/papyrus}{#f/8}怎么可能！！！'
                    ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/4}...看来我们没有\n别的办法来跨越\n这鸿沟了。']
                        : [
                            '<25>{#p/undyne}{#f/1}* 那只鸟会带任何人飞过这鸿沟。\n* 他从未拒绝过别人。',
                            '<25>{#p/undyne}{#f/16}* 我小的时候，它载过我一次。\n* 那次花了一个小时...',
                            '<25>{#p/undyne}{#f/17}* 但这只鸟未曾说过\n  “放弃”二字！！！',
                            '<25>{#p/undyne}{#f/1}* 珍惜那只鸟吧。'
                        ])
            ],
            () =>
                SAVE.data.n.plot < 42
                    ? [
                        "<18>{#p/papyrus}{#f/8}我就是不理解..！",
                        '<18>{#p/papyrus}{#f/8}那唯一一只黄鸟怎么就\n抛弃了我们？？？'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/0}相信我，\n那条沟比看起来要\n宽多了。',
                        '<18>{#p/papyrus}{#f/4}而且很可能是\n非欧的那种。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/7}* 所以你是说它\n  还得飞过来！？",
                                '<25>{#p/undyne}{#f/8}* 该死，更珍惜那只鸟一点！',
                                "<18>{#p/papyrus}{#f/6}我会竭尽全力珍惜的！！",
                                '<25>{#p/undyne}{#f/7}* 漂亮！！！'
                            ])
                    ]
        ),
        f_stand: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}有传言说...',
                '<18>当地卖冰淇淋的那个人\n会发明信片。',
                '<18>{#p/papyrus}{#f/4}听说这些“明信片”\n具有不可言说的力量...',
                '<18>{#p/papyrus}{#f/9}...可以解锁更多\n美味的口味！',
                ...(solo()
                    ? []
                    : [
                        '<26>{#p/undyne}{#f/8}* 而我喜欢好吃的！',
                        "<25>{#p/undyne}{#f/14}* 好吧，我不喜欢吃凉的。",
                        "<25>{#p/undyne}{#f/17}* 我是说“我没那么喜欢”\n  而已！！"
                    ])
            ],
            [
                '<18>{#p/papyrus}{#f/0}不知道这些明信片\n还有什么魔力...',
                '<18>{#p/papyrus}{#f/4}它们往往\n很快就会用完...'
            ]
        ),
        f_abyss: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我们望着这条布满\n讯星的蜿蜒小路...',
                '<18>{#p/papyrus}{#f/4}我们认为这“很正常”。',
                '<18>{#p/papyrus}{#f/0}你知道还有什么\n“很正常”吗？',
                '<18>{#p/papyrus}{#f/0}这通电话竟然能\n传到那里！',
                '<18>{#p/papyrus}{#f/6}太正常了！！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 你的意思是那不正常，\n  对吧？",
                        '<18>{#p/papyrus}{#f/0}差不多。',
                        '<25>{#p/undyne}{#f/14}* ...照这样下去，你迟早会晋升\n  为“阴阳大师”的！',
                        "<18>{#p/papyrus}{#f/4}我要找时间阴阳阴阳\n我兄弟。",
                        "<25>{#p/undyne}{#f/1}* 我不建议哦。\n* 他现在是比“阴阳大师”还要\n  高级的“阴阳仙尊”。",
                        "<25>{#p/undyne}{#f/17}* 你要是想打败他的话，\n  你就得疯狂的训练！",
                        "<18>{#p/papyrus}{#f/4}啊，相信我，安黛因，\n我准备好接受训练了。",
                        "<25>{#p/undyne}{#f/8}* 你最好没在阴阳我！"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/6}我绝对没有在\n阴阳怪气！！"]
                    : ["<19>{#p/papyrus}{#f/4}阴阳训练【绝对】是世界上\n最简单的事了。"]
        ),
        f_muffet: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}前几天我上网...',
                "<18>{#p/papyrus}{#f/6}我了解到了蜘蛛丝\n比你想象得更坚固！",
                '<18>{#p/papyrus}{#f/4}你问我上的是哪个网？',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/4}...你应该不想知道的。"]
                    : [
                        "<25>{#p/undyne}{#f/17}* ...认真的？\n* 这都不是第一次了！",
                        '<18>{#p/papyrus}{#f/6}我只是想知道丝和丝\n之间是怎么互联的！',
                        '<25>{#p/undyne}{#f/8}* 你上回用的就是这个借口！！',
                        '<18>{#p/papyrus}{#f/6}那我好奇怎么办嘛！！！',
                        '<25>{#p/undyne}{#f/12}* ...网还是留给蜘蛛爬吧。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}不是用电脑，\n这是肯定的。"]
                    : ['<18>{#p/papyrus}{#f/4}我应该找个机器人\n爬网...']
        ),
        f_shyren: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}我听说这里住着个\n很害羞的怪物...",
                '<18>{#p/papyrus}{#f/0}如果你想让别人敞开心扉...',
                '<18>{#p/papyrus}{#f/9}你就该跟他战斗！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}这是个适用于任何\n场合的可靠策略。']
                    : [
                        "<25>{#p/undyne}{#f/8}* 还有别忘了在他的面前\n  大声吵吵！",
                        '<18>{#p/papyrus}{#f/6}...这步可能有点多余。',
                        '<25>{#p/undyne}{#f/14}* 呃，可是昨天在特战队\n  那边起效了，所以嘛...',
                        '<18>{#p/papyrus}{#f/4}...',
                        "<18>{#p/papyrus}{#f/4}我要重新考虑\n我的职业道路了...",
                        "<25>{#p/undyne}{#f/17}* 诶，等等！！\n* 我不是说所有的守卫！",
                        '<18>{#p/papyrus}{#f/6}那要是我凑巧\n【去】了特战队呢？？？',
                        "<25>{#p/undyne}{#f/14}* ...那特殊对待你！",
                        "<18>{#p/papyrus}{#f/7}可你应该一视同仁！！",
                        '<25>{#p/undyne}{#f/17}* 得了吧！！'
                    ])
            ],
            () => ['<18>{#p/papyrus}{#f/0}哼哼哼...', ...(solo() ? [] : ['<25>{#p/undyne}{#f/12}* 哼哼哼...'])]
        ),
        f_statue: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}一座神秘的雕像...',
                '<18>{#p/papyrus}{#f/4}在工厂正中央...',
                '<18>{#p/papyrus}{#f/6}...我想知道这\n有什么意义！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/16}* 那座雕像永远摆在那...",
                        '<25>{#p/undyne}{#f/17}* ...但是没人知道\n  他是哪来的！',
                        '<25>{#p/undyne}{#f/1}* 里面倒是有个很酷的八音盒。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}劲爆消息。',
                        '<18>{#p/papyrus}{#f/4}神秘的雕像很神秘。',
                        "<18>{#p/papyrus}{#f/6}这谁能想得到！！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/11}* 有人说雕像还有第二个\n  八音盒...',
                        "<25>{#p/undyne}{#f/12}* ...我得亲耳听见我才相信。"
                    ]
        ),
        f_piano: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}要是有个房间...',
                '<18>能让我通过音乐\n表达自己就好了。',
                '<18>一个孤独的房间，\n与世隔绝...',
                '<18>中间唯有一架钢琴...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}...哦等下！\n不就是这个房间吗！"]
                    : [
                        '<25>{#p/undyne}{#f/10}* 也许那架钢琴可以\n  用来解谜...',
                        '<25>{#p/undyne}{#f/10}* 或是用那个雕像\n  练习战斗...',
                        '<25>{#p/undyne}{#f/10}* 又或是演奏一段充满了你\n  美好回忆的旋律...',
                        '<25>{#p/undyne}{#f/7}* ...要是你现在就在那个\n  房间就好了！！',
                        '<18>{#p/papyrus}{#f/6}别抢我台词！！'
                    ])
            ],
            ['<18>{#p/papyrus}下次我来这里，\n我要写一首曲子。', '<18>名字就叫\n《帕派瑞斯的故事》。']
        ),
        f_artifact: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}我觉得我之前从来\n没进过这个房间。",
                "<18>{#p/papyrus}{#f/6}这个房间什么样？\n里面有没有\n数不清的宝藏？",
                '<18>{#p/papyrus}{#f/4}声明一下，\n这个问题是反问句。',
                "<18>{#p/papyrus}{#f/7}我宁愿自己去\n寻找答案！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 看到你仍然有冒险精神，\n  我很高兴。",
                        '<18>{#p/papyrus}{#f/9}那当然！！\n我，伟大的帕派瑞斯...',
                        '<18>{#p/papyrus}{#f/9}拥有着无人能比的\n冒险精神！',
                        "<18>{#p/papyrus}{#f/4}好吧，其实有人能比。",
                        '<18>{#p/papyrus}{#f/6}衫斯每天都会以一种\n新方式探索沙发。',
                        '<25>{#p/undyne}{#f/17}* ...啊。',
                        "<25>{#p/undyne}{#f/17}* 怪不得那沙发那么乱。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}不要剧透！！！']
                    : ["<18>{#p/papyrus}{#f/4}这还不是他最令人\n印象深刻的壮举。"]
        ),
        f_path: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}继续走，\n你就能看到首塔了。",
                "<18>{#p/papyrus}{#f/4}通常你从这么远的地方\n看不到，但是...",
                '<18>{#p/papyrus}{#f/5}通过这个房间里的\n某个东西...',
                '<18>...就能看到了...',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 可能这就是艾菲斯总说的\n  “空间扭曲”现象吧。',
                        '<25>{#p/undyne}{#f/1}* 你离得太近的话，\n  时间的流逝会变慢的。',
                        '<18>{#p/papyrus}{#f/5}所以要小心点！',
                        '<18>{#p/papyrus}{#f/6}要是时间完全\n慢下来了，你还能\n跑掉吗？',
                        "<25>{#p/undyne}{#f/17}* ...在绝对的力量面前，\n  一切都是空谈！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}趁着还有机会，\n好好欣赏风景吧！']
                    : ['<18>{#p/papyrus}{#f/6}小心点！']
        ),
        f_view: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}你肯定是一个\n很会一心多用的人！',
                "<18>{#p/papyrus}{#f/4}因为只有像你\n这样的人...",
                '<18>{#p/papyrus}{#f/5}才会在【那种】美景\n附近还想着打电话\n给别人。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 在和特战队进行\n  人类追逐练习时...',
                        '<25>{#p/undyne}{#f/17}* 每次都肯定有个警卫被它\n  分心。',
                        "<25>{#p/undyne}{#f/10}* 无论是谜宇人\n  对美学本质的争执...",
                        '<25>{#p/undyne}{#f/10}* 又或是特雷莉亚对\n  “宇宙之美”的痴迷...',
                        "<25>{#p/undyne}{#f/9}* ...好吧其实也就这俩。",
                        '<18>{#p/papyrus}{#f/5}但是... 作为仍在世\n最年长的怪物...',
                        '<18>{#p/papyrus}{#f/6}他们干活都不应该\n马虎！！',
                        "<26>{#p/undyne}{#f/16}* 他们干活确实没马虎，\n  但是...他们训练\n  还是很马虎的。",
                        "<18>{#p/papyrus}{#f/5}好吧。\n呃，还真是不幸。",
                        "<25>{#p/undyne}{#f/1}* 幸好，景色再漂亮，\n  某个大队长也照样能\n  不为所动！！",
                        '<25>{#p/undyne}{#f/12}* ...要不然，为啥都让我\n  监督他们好好干活呢。',
                        '<18>{#p/papyrus}{#f/6}听起来好辛苦...',
                        "<18>{#p/papyrus}{#f/9}但我知道...\n这点事肯定难不倒你！",
                        '<25>{#p/undyne}{#f/14}* 谢咯，帕派瑞斯。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/7}眼前有那么美的景色...',
                        "<18>{#p/papyrus}{#f/7}为啥不去看风景，\n还跑来给我打电话！"
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 你没被招进皇家卫队，\n  就偷着乐吧！",
                        '<25>{#p/undyne}{#f/12}* 要不然...\n  被我逮到你在摸鱼，\n  有你好受的。'
                    ]
        ),
        f_plank: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}很不幸，这里没有什么\n特别好说的。",
                '<18>{#p/papyrus}{#f/4}除了我听说的那座\n不知道通往哪里的桥...',
                '<18>{#p/papyrus}{#f/5}真的就只是条\n死胡同。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 什么桥？\n* 我刚砍掉那座吗？？',
                        '<25>{#p/undyne}{#f/8}* 那只是工厂里面\n  很多旧桥的一小部分而已！',
                        '<18>{#p/papyrus}{#f/6}那座桥可算换掉了？？',
                        '<18>{#p/papyrus}{#f/5}哇吚...\n我还以为要用这旧桥\n用一辈子呢...',
                        '<25>{#p/undyne}{#f/14}* 那玩意还想用一辈子？\n* 早点砍了，才安全！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}也许你可以\n先到别的地方，\n再绕回来？']
                    : ['<18>{#p/papyrus}{#f/4}所以说，以前这里\n还有别的东西...']
        ),
        f_tunnel: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}啊... 你在垃圾场啊。',
                '<18>{#p/papyrus}{#f/0}人们有东西不想要了\n就丢那，可方便了。',
                '<18>{#p/papyrus}{#f/4}其实...',
                '<18>{#p/papyrus}{#f/9}你要是想免费寻宝就去那，\n也挺方便！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}我有的时候跟衫斯\n过来翻东西。']
                    : [
                        "<25>{#p/undyne}{#f/12}* 你确定那...呃，安全吗？",
                        "<25>{#p/undyne}{#f/10}* 我知道“甲之蜜糖，乙之砒霜”\n  这理啦，可-",
                        '<18>{#p/papyrus}{#f/0}布莱蒂和凯蒂\n捡垃圾还得去室外...',
                        '<18>{#p/papyrus}{#f/0}真不方便！\n而我和衫斯足不出户，\n一个房间就能捡到天黑！',
                        "<25>{#p/undyne}{#f/1}* 你说话这语气，\n  感觉不像坏事啊。",
                        '<25>{#p/undyne}{#f/17}* 就是别等垃圾处理器启动了，\n  才知道要逃！',
                        "<18>{#p/papyrus}{#f/6}当然！！\n我们可不想人间蒸发！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}上次我们甚至找到了\n一幅骨头画...',
                        '<18>{#p/papyrus}{#f/5}就是稍微有点\n脏而已！！'
                    ]
                    : ["<18>{#p/papyrus}{#f/6}我觉得你还是离开\n这个房间比较好。"]
        ),
        f_chute: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}地板上有三台\n平板电脑。',
                '<18>{#p/papyrus}{#f/0}一台是关于星花的，\n一台是关于虫洞的。',
                '<18>{#p/papyrus}{#f/4}还有一台里是\n科幻动漫。',
                "<18>{#p/papyrus}{#f/0}我【个人】觉得，\n这些东西都是有关联的。",
                '<18>{#p/papyrus}{#f/5}也就是说，星花\n是通过虫洞来的...',
                '<18>{#p/papyrus}{#f/5}就像那部科幻动漫\n预言的那样。',
                "<18>{#p/papyrus}{#f/6}这是能一次性解释清\n这三个东西的\n唯一办法！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 这就是你的理论？",
                        '<25>{#p/undyne}{#f/14}* 这样所有平板电脑上的信息\n  就都连起来了？',
                        '<18>{#p/papyrus}{#f/0}对。',
                        '<25>{#p/undyne}{#f/1}* 好。\n* 我就一个问题...',
                        "<25>{#p/undyne}{#f/7}* 空口无凭，证据呢！？",
                        '<18>{#p/papyrus}{#f/6}动漫里呢！！',
                        '<18>{#p/papyrus}{#f/4}科幻动漫。',
                        "<18>{#p/papyrus}{#f/4}证据都在动漫里。\n虽然我太忙没空看。",
                        '<25>{#p/undyne}{#f/17}* 科幻动漫？没空看！？',
                        "<25>{#p/undyne}{#f/8}* 开玩笑呢！！"
                    ])
            ],
            ['<18>{#p/papyrus}{#f/5}总有一天，人类...', '<18>{#p/papyrus}{#f/5}总有一天，我会证明\n我的理论给你看的。']
        ),
        f_dummy: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}不要忽略隐藏的\n路径...",
                '<18>{#p/papyrus}{#f/5}闭上眼睛，\n径直地走...',
                "<18>{#p/papyrus}{#f/5}迎接提米狂热的心情。",
                "<18>{#p/papyrus}{#f/4}...这是我听说的\n关于这个地方的谜语。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 嗯...\n  “不要忽略隐藏的路径...”',
                        '<25>{#p/undyne}{#f/11}* 什么隐藏路径？',
                        '<25>{#p/undyne}{#f/13}* 然后...“闭上眼睛”...',
                        '<25>{#p/undyne}{#f/12}* 好了，停停停，停。',
                        "<26>{#p/undyne}{#f/8}* 我啥也看不见了，\n  我还咋找提米村庄啊！",
                        '<18>{#p/papyrus}{#f/4}可惜，谜语是这么说的。',
                        '<18>{#p/papyrus}{#f/7}真是没用的谜语！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}【你】知道怎么解吗？']
        ),
        f_hub: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}如果你看到一家商店...',
                '<18>{#p/papyrus}{#f/4}你就该停下脚步...',
                '<18>{#p/papyrus}{#f/0}心急火燎地\n进去看看！！',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/9}因为我们在进行\n火热的大甩卖！！",
                        '<18>{#p/papyrus}{#f/5}这都是在我想象中\n卖火的商店里\n会发生的事。'
                    ]
                    : [
                        "<25>{#p/undyne}{#f/1}* 就像葛森的店那样吗？",
                        '<25>{#p/undyne}{#f/8}* 我都是从他那买东西的！',
                        "<18>{#p/papyrus}{#f/6}他卖的东西有什么\n特别的吗？",
                        '<25>{#p/undyne}{#f/17}* 你说啥呢？\n* 葛森可活过了人怪大战！',
                        "<25>{#p/undyne}{#f/14}* 他才是真英雄。",
                        '<18>{#p/papyrus}{#f/4}我之前还想说点别的\n什么的来着，但还是\n算了吧。',
                        '<18>{#p/papyrus}{#f/0}葛森万岁！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}这也是我的\n另一个梦想..."]
                    : [
                        "<18>{#p/papyrus}{#f/0}认可我们的英雄是\n很重要的。",
                        '<18>{#p/papyrus}{#f/5}没了他们，哪有我们\n现在的幸福生活。'
                    ]
        ),
        f_undyne: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}这里是安黛因的家。",
                ...(SAVE.data.n.plot < 48 || world.trueKills > 0
                    ? ['<18>{#p/papyrus}{#f/9}学习烹饪的\n理想的地方！']
                    : SAVE.data.n.plot_date < 1.3
                        ? ['<18>{#p/papyrus}{#f/4}你应该知道吧，就是\n门前站了只骷髅的那屋。']
                        : SAVE.data.n.plot_date < 2
                            ? ["<18>{#p/papyrus}{#f/9}别犹豫，快进来！"]
                            : SAVE.data.n.plot_date < 2.1
                                ? [
                                    "<18>{#p/papyrus}{#f/6}...你还在安黛因的\n家那里啊？？",
                                    "<18>{#p/papyrus}{#f/5}她，呃，\n还没跟我见面呢。",
                                    '<18>{#p/papyrus}{#f/4}要不你先\n离开房间然后...',
                                    '<18>{|}{#f/1}...{%}',
                                    '<25>{#p/undyne}{#f/12}* 呼... 哈...！',
                                    "<25>{#p/undyne}{#f/8}* 没错！！！\n* 那是我的家！！！",
                                    "<18>{#p/papyrus}{#f/6}呃，嗨，安黛因！\n你是怎么这么快\n就到这里的啊？",
                                    '<25>{#p/undyne}{#f/17}* 我跑过来的。',
                                    '<18>{#p/papyrus}{#f/1}什么？？\n那你肯定有一些...',
                                    '<18>{#p/papyrus}{#f/9}关于你家的\n很酷的事情\n要说吧！！！',
                                    '<25>{#p/undyne}{#f/14}* 没有！！！'
                                ]
                                : [
                                    '<18>{#p/papyrus}{#f/4}至少曾经是，\n直到...',
                                    '<25>{#p/undyne}{#f/12}* ...我们把它给点着了。',
                                    '<25>{#p/undyne}{#f/8}* 哎呀，管它呢？？',
                                    '<25>{#p/undyne}{#f/14}* 跟帕派瑞斯出去消遣\n  最棒了！'
                                ])
            ],
            () =>
                SAVE.data.n.plot < 48 || world.trueKills > 0
                    ? [
                        '<18>{#p/papyrus}{#f/0}专家提示：\n在跟安黛因烹饪时...',
                        '<18>{#p/papyrus}{#f/4}如果她开始攻击蔬菜...',
                        "<18>{#p/papyrus}{#f/5}...那就该溜了。"
                    ]
                    : SAVE.data.n.plot_date < 1.3
                        ? ['<18>{#p/papyrus}{#f/0}我也很高兴见到你！']
                        : SAVE.data.n.plot_date < 2
                            ? ["<18>{#p/papyrus}{#f/4}我们还在这等着呢，\n你知道吧..."]
                            : SAVE.data.n.plot_date < 2.1
                                ? [
                                    "<18>{#p/papyrus}{#f/0}我相信她很快就\n会想出来的。",
                                    "<25>{#p/undyne}{#f/14}* 你可别打包票！"
                                ]
                                : [
                                    '<18>{#p/papyrus}{#f/0}请叫我“消遣杂务工”。',
                                    '<18>{#p/papyrus}{#f/4}我虽然没办法\n修补你的家...',
                                    '<18>{#p/papyrus}{#f/9}但我还可以帮你\n“补上”美好的一天！'
                                ]
        ),
        f_blooky: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}也许有一天，\n我会过上平静的生活。",
                '<18>{#p/papyrus}{#f/5}养蜗牛，创作音乐...',
                '<18>{#p/papyrus}{#f/6}愁眉苦脸，\n不让任何人安慰我...',
                "<18>{#p/papyrus}{#f/5}转念一想，\n这个生活方式可能\n不太适合我。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 他都不想让我帮他，\n  好让他好受些！",
                        '<25>{#p/undyne}{#f/16}* ...我想应该不是每个人都是\n  一跟朋友出去玩就能\n  开心的。',
                        '<18>{#p/papyrus}{#f/5}是啊...\n衫斯有时候也是这样。',
                        "<18>{#p/papyrus}{#f/0}啊，别误会。\n他一般都好着呢！",
                        '<18>{#p/papyrus}{#f/6}但是，\n谁都有不如意的时候嘛。',
                        '<25>{#p/undyne}{#f/14}* 你这个“谁”包括帕派瑞斯吗？',
                        '<18>{#p/papyrus}{#f/4}好啦，好啦...',
                        '<18>{#p/papyrus}{#f/0}我把“谁”改成“大部分人”\n好了。'
                    ])
            ],
            [
                "<18>{#p/papyrus}{#f/0}唉，我感觉我更适合\n当啦啦队队员。",
                '<18>{#p/papyrus}{#f/5}...而不是那个\n要别人帮忙\n安慰我的人。'
            ]
        ),
        f_snail: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}我听说有一种方法\n可以赢这个游戏...",
                '<18>{#p/papyrus}{#f/0}就是关于提供\n“及时的鼓励”。',
                '<18>{#p/papyrus}{#f/5}及时的鼓励...',
                "<18>{#p/papyrus}{#f/4}怎么说得好像还有\n【不及时的】鼓励\n一样。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 啊，\n  有时候会有点尴尬...',
                        "<25>{#p/undyne}{#f/1}* 但是总的来说，你是对的。",
                        '<18>{#p/papyrus}{#f/0}你什么意思？',
                        '<25>{#p/undyne}{#f/1}* 呃...如果你一再鼓励...',
                        "<25>{#p/undyne}{#f/1}* 他们估计就以为\n  你在阿谀逢迎了。",
                        '<18>{#p/papyrus}{#f/7}鳄鱼！？蜂蝇！？\n我家里可没有这些！',
                        "<25>{#p/undyne}{#f/16}* 我是说啊，\n  如果你不断鼓励别人...",
                        "<25>{#p/undyne}{#f/16}* 他们会大脑过载的。",
                        '<25>{#p/undyne}{#f/17}* 所以嘛，要稳扎稳打！！',
                        "<18>{#p/papyrus}{#f/4}...我立刻开始处理这个\n建议。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/5}我要是想太多可能会\n让人不知所措...']
                    : ["<18>{#p/papyrus}{#f/6}我思考完了再回来！！！"]
        ),
        f_taxi: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}你有没有注意到一件\n怪事？',
                '<18>{#p/papyrus}{#f/4}我跟你保证这里肯定\n放着一首神秘的歌曲...',
                '<18>{#p/papyrus}{#f/5}肯定在特定的角度\n能看见一些\n平时看不见的东西...',
                "<18>{#p/papyrus}{#f/0}啊算了。\n只是我的想象罢了。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 其实...\n* 我也听得见那个歌声。",
                        '<25>{#p/undyne}{#f/17}* 而且那边也肯定有什么\n  平常看不见的东西。',
                        '<18>{#p/papyrus}{#f/5}那种声音，\n你能感受到...',
                        "<18>{#p/papyrus}{#f/4}...但是确切去听的时候，\n你又听不见了。",
                        "<25>{#p/undyne}{#f/1}* 对！！\n* 正是那个！！"
                    ])
            ],
            () => [
                "<18>{#p/papyrus}{#f/0}也许是宇宙起源之音吧。",
                '<18>{#p/papyrus}{#f/5}或许是星际中的迷失\n通讯...',
                '<18>{#p/papyrus}{#f/5}一切都要追溯到宇宙\n起源。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 那要是宇宙没有\n  起源呢？？',
                        '<18>{#p/papyrus}{#f/1}不-不...！！\n这是对我无懈可击\n推理的挑战！',
                        '<18>{#p/papyrus}{#f/5}现在我要找公关了...'
                    ])
            ]
        ),
        f_prepuzzle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我经常在想为什么\n人类要把我们\n困在这里。',
                '<18>{#p/papyrus}{#f/5}我知道他们害怕\n我们，但是...',
                "<18>{#p/papyrus}{#f/6}他们就不会逃跑吗！？",
                '<18>{#p/papyrus}{#f/6}或者，跟我们谈谈，\n这不也挺好吗！！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}很不幸，他们从来\n没有想过这些事情。"]
                    : [
                        '<25>{#p/undyne}{#f/16}* 对呀，我也经常这么想。',
                        "<25>{#p/undyne}{#f/17}* 他们蠢得让人印象深刻。",
                        "<18>{#p/papyrus}{#f/7}人类不蠢！！",
                        '<18>{#p/papyrus}{#f/5}人类就只是...',
                        "<18>{#p/papyrus}{#f/6}...不思考那些事而已。",
                        "<25>{#p/undyne}{#f/12}* 呃...\n* 或许你是对的。",
                        "<25>{#p/undyne}{#f/12}* 不管怎样，\n  到底咱还是被困在这。"
                    ])
            ],
            ['<18>{#p/papyrus}{#f/0}至少【我】是\n想过这些的！！']
        ),
        f_puzzle3: pager.create(
            0,
            ...[
                () => [
                    '<18>{#p/papyrus}{#f/6}我自称是谜题大师，\n但是...',
                    '<18>{#p/papyrus}{#f/5}这件事我得坦白。',
                    "<18>{#p/papyrus}{#f/4}...我从来没真正\n解决过这个难题。",
                    "<18>{#p/papyrus}{#f/6}等等！！\n别对我太苛刻！！",
                    '<18>{#p/papyrus}{#f/4}...我还没来得及试，\n他们就把它关掉了。',
                    ...(solo()
                        ? []
                        : [
                            "<25>{#p/undyne}{#f/17}* 要是没关掉，你就能解开？？",
                            '<25>{#p/undyne}{#f/14}* 很多人都试过解决这个谜题，\n  但是真正能解决的没有\n  几个。',
                            "<18>{#p/papyrus}{#f/0}啊，那不算什么难题。",
                            '<18>{#p/papyrus}{#f/0}这个类型的谜题我都\n解决多少个了！\n而且解决的极其迅速！',
                            '<25>{#p/undyne}{#f/14}* 如果你说的“极其迅速”是指\n  几个小时的话，我信了。',
                            '<18>{#p/papyrus}{#f/6}怎么？？几个小时？？',
                            '<18>{#p/papyrus}{#f/5}不出十秒钟，\n我就能解决那些谜题！',
                            '<25>{#p/undyne}{#f/17}* 加上你盯着看的时间呢...？',
                            '<18>{#p/papyrus}{#f/7}...那个不算！'
                        ])
                ],
                () =>
                    solo()
                        ? ['<18>{#p/papyrus}{#f/6}我知道的啊！\n所以它不公平啊！！']
                        : [
                            '<18>{#p/papyrus}{#f/0}思考的时间花的越多，\n解决的时间花的越少。',
                            '<18>{#p/papyrus}{#f/9}我送给各位一个\n谜题小贴士！'
                        ]
            ].map(
                lines => () =>
                    SAVE.data.n.plot < 45
                        ? SAVE.data.b.f_state_password
                            ? [
                                '<18>{#p/papyrus}{#f/6}“使用终端”！！',
                                '<18>{#p/papyrus}{#f/6}“就在右边”！！！',
                                '<18>{#p/papyrus}{#f/6}“祝你好运”！！'
                            ]
                            : ((SAVE.data.b.f_state_password = true),
                                [
                                    "<18>{#p/papyrus}{#f/4}啊...是【这个】谜题？",
                                    "<18>{#p/papyrus}{#f/5}...啊。\n这可不是最简单的那个。",
                                    '<18>{#p/papyrus}{#f/9}幸好，\n我有一个解决方案！',
                                    '<18>{#p/papyrus}{#f/0}听好了！',
                                    '<18>{#p/papyrus}{#f/0}使用就在右边的终端。',
                                    '<32>{#p/human}* （帕派瑞斯在你耳旁说了些\n  悄悄话。）',
                                    '<18>{#p/papyrus}{#f/6}希望对你有帮助！'
                                ])
                        : lines()
            )
        ),
        f_prespear: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}如果我是你，\n我会小心这个房间...',
                '<18>{#p/papyrus}{#f/5}安黛因经常来这里，\n威严地站在附近。',
                "<18>{#p/papyrus}{#f/6}她不止一次吓到过我！",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}即使我让自己\n很容易被当成靶子。']
                    : [
                        '<25>{#p/undyne}{#f/14}* 对。\n* 我来这里巡逻，为了寻找人类。',
                        "<25>{#p/undyne}{#f/7}* 我就是干这个的。",
                        '<18>{#p/papyrus}{#f/6}啊！！\n别那么咄咄逼人嘛！！',
                        "<25>{#p/undyne}{#f/14}* 我就是我，这一点永不变。",
                        '<18>{#p/papyrus}{#f/6}但是只要他们\n努力尝试，每个人都有\n机会改变自己！',
                        "<25>{#p/undyne}{#f/17}* 每条定理都有例外嘛！",
                        '<18>{#p/papyrus}{#f/7}那我的定理就是\n“每条定理都有例外”\n这条定理的例外！',
                        '<25>{#p/undyne}{#f/4}* ...',
                        '<25>{#p/undyne}{#f/5}* ...',
                        "<25>{#p/undyne}{#f/12}* ...行吧，我没想到这点。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}哦，还有不知道从哪里\n冒出来的长矛陷阱。',
                        '<18>{#p/papyrus}{#f/5}也小心点那些。'
                    ]
                    : ['<18>{#p/papyrus}{#f/4}为什么我们时不时要\n吵架呢...']
        ),
        f_spear: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}穿过这个房间\n所花的时间...',
                '<18>{#p/papyrus}{#f/5}...好像哪次都不一样。',
                "<18>{#p/papyrus}{#f/4}有的时候很长，\n有的时候就不一样...",
                '<18>{#p/papyrus}{#f/4}有的时候我穿\n圆点图案的衣服。',
                "<18>{#p/papyrus}{#f/0}不管怎么解释好像\n都说不通。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}说的是我刚才那句。']
                    : [
                        "<25>{#p/undyne}{#f/12}* 可能只是一种空间扭曲吧。",
                        '<25>{#p/undyne}{#f/17}* 我今天早些时候追人类时\n  感觉到了。',
                        '<18>{#p/papyrus}{#f/4}真是讨厌...',
                        '<18>{#p/papyrus}{#f/7}什么时候扭曲\n才会停下来啊！？',
                        "<25>{#p/undyne}{#f/1}* 呃，扭曲没有错。",
                        '<25>{#p/undyne}{#f/14}* 空间扭曲就只是，呃...\n  宇宙的一部分。',
                        '<18>{#p/papyrus}{#f/5}天哪...\n怎么宇宙也这样啊！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我刚才没提过\n圆点图案的衣服吗？']
                    : ["<18>{#p/papyrus}{#f/4}这就是我\n横跨整个星系的大阴谋..."]
        ),
        f_corner: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这个工厂里的\n很多地方...',
                '<18>{#p/papyrus}{#f/0}...只有跳过去\n才能到达。',
                '<18>{#p/papyrus}{#f/9}就比如，这个房间\n左右的两条道！',
                ...(solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}我听说人类可以\n跳得很高，所以...",
                        "<18>{#p/papyrus}{#f/0}你应该不会有\n什么问题的。"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 有的地方，\n  你还得飞过去呢！',
                        '<18>{#p/papyrus}{#f/6}比如呢？？',
                        '<25>{#p/undyne}{#f/8}* 比如，那个平台中间的洞！',
                        '<18>{#p/papyrus}{#f/0}啊。',
                        ...(SAVE.data.b.f_state_kidd_betray
                            ? [
                                '<25>{#p/undyne}{#f/16}* 但之前有个孩子\n  在这摔了...',
                                "<25>{#p/undyne}{#f/9}* 我当时要是不在那儿可就\n  坏了。",
                                "<18>{#p/papyrus}{#f/9}...好！！\n你在那真是太好了！",
                                "<25>{#p/undyne}{#f/16}* 是啊，那儿除了我肯定\n  没别人了。",
                                "<25>{#p/undyne}{#f/11}* 对吧，小混蛋？",
                                '<18>{#p/papyrus}{#f/6}...啥？？？'
                            ]
                            : [
                                '<25>{#p/undyne}{#f/1}* 之前有个孩子在这摔了，\n  但...',
                                '<25>{#p/undyne}{#f/1}* 人类在坏事之前救起了他。',
                                "<18>{#p/papyrus}{#f/9}...好！！\n人类在那儿真是太好了！",
                                '<18>{#p/papyrus}{#f/4}...\n慢着...',
                                '<18>{#p/papyrus}{#f/7}那【你】就在那儿站着\n干看着！？',
                                '<25>{#p/undyne}{#f/7}* 人类立马就上去了，\n  根本没给我机会！！'
                            ])
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/9}你能做到的！！\n我相信你！']
                    : SAVE.data.b.f_state_kidd_betray
                        ? ['<18>{#p/papyrus}{#f/6}你要不换个地方\n再打回来呢？']
                        : ['<18>{#p/papyrus}{#f/0}我真佩服你能\n那么迅速的救起\n那个孩子。']
        ),
        f_story2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}讯星真的很厉害，\n对吧？',
                '<18>{#p/papyrus}{#f/5}不过，它们会\n周期性地重置。',
                '<18>{#p/papyrus}{#f/4}在重置之前...',
                "<18>{#p/papyrus}{#f/6}等下，别的地方\n是不是也有一个\n类似的房间！？",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 这儿可比你想象的容易迷路\n  多了。",
                        '<25>{#p/undyne}{#f/4}* 最近一次，我在里面找一个\n  失踪的怪物的时候...',
                        '<25>{#p/undyne}{#f/7}* 就遇上了鬼打墙！',
                        '<18>{#p/papyrus}{#f/0}就好像讯星一直重复\n一个信息一样！',
                        '<25>{#p/undyne}{#f/10}* 比喻的其实不是很恰当...',
                        "<25>{#p/undyne}{#f/12}* 其实更像房间变得越来越...\n  长，不知道为什么。",
                        '<25>{#p/undyne}{#f/11}* ...哈。',
                        '<18>{#p/papyrus}{#f/5}...那你找到那个怪物\n没有？',
                        '<25>{#p/undyne}{#f/12}* 找到了，就是个小孩。',
                        '<25>{#p/undyne}{#f/10}* 我问他他家住哪，可...\n  他说...',
                        "<25>{#p/undyne}{#f/12}* ...呃，他说他没有家。",
                        '<18>{#p/papyrus}{#f/6}听起来...\n挺令人担忧的。',
                        '<25>{#p/undyne}{#f/17}* 还用你说！！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}我感觉有时候\n我只是把自己的话给\n重复了一遍。"]
                    : ["<18>{#p/papyrus}{#f/5}我很好奇我们是不是\n都在原地踏步啊。"]
        ),
        f_pacing: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}这个房间真的\n没什么可说的。",
                '<18>{#p/papyrus}{#f/4}它的存在只会让你\n走得越来越远，',
                '<18>{#p/papyrus}{#f/5}朝着出口\n一步一步迈出...',
                '<18>{#p/papyrus}{#f/4}充满了彻底的、\n无休止的悬念。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/14}* 总结完毕。'])
            ],
            ['<18>{#p/papyrus}{#f/7}彻底的！\n无休止的！！\n悬念！！！']
        ),
        f_battle: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}在这个房间里，\n你会看到\n安黛因的巨塔。",
                '<19>{#p/papyrus}{#f/9}那是由一颗古老\n小行星的残骸\n做成的！',
                "<18>{#p/papyrus}{#f/5}她总是在上面摆姿势...",
                '<18>{#p/papyrus}{#f/4}然后喃喃自语...',
                ...(solo()
                    ? []
                    : SAVE.data.b.undyne_respecc
                        ? [
                            '<25>{#p/undyne}{#f/12}* 啊，对，\n  “我们怪物一族的故事”...',
                            "<25>{#p/undyne}{#f/1}* 这故事我到底也没\n  讲出来。",
                            '<25>{#p/undyne}{#f/8}* 反正那小混蛋可能已经\n  听过了！'
                        ]
                        : [
                            '<25>{#p/undyne}{#f/12}* 啊，对，\n  “我们怪物一族的故事”...',
                            '<25>{#p/undyne}{#f/1}* 总之是草草了事了，\n  白排练了。',
                            '<25>{#p/undyne}{#f/8}* 忘了那些事先排练了\n  好几遍的多愁善感的\n  演讲吧！！'
                        ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}她可能有什么\n必须要记住的东西吧。"]
                    : ['<18>{#p/papyrus}{#f/9}我先说好，\n我爱爆事先排练了\n好几遍的演讲了！']
        ),
        f_exit: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}这个储液罐是\n专门放在这里的...',
                '<18>{#p/papyrus}{#f/0}因为某个皇家卫队\n队长觉得...',
                "<18>{#p/papyrus}{#f/4}觉得这可以作为\n一种安全措施...",
                '<18>{#p/papyrus}{#f/5}以避免她的巨型喷气\n背包进入充满静电的\n地方时出现的事故。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}...把静电全吸收掉是\n非常，非常危险的！！']
                    : [
                        "<25>{#p/undyne}{#f/17}* 别跟我说这事了！！\n* 我当时不是赶时间吗！",
                        "<18>{#p/papyrus}{#f/4}是是是，\n你成天赶时间...",
                        "<25>{#p/undyne}{#f/7}* 静电的危害，我能不知道？！",
                        '<18>{#p/papyrus}{#f/4}...那你还去抓人类干嘛。',
                        '<25>{#p/undyne}{#f/1}* 不敢直面危险，\n  哪还配叫皇家守卫？',
                        "<18>{#p/papyrus}{#f/6}直面危险\n也不是让你玩命啊？？",
                        '<25>{#p/undyne}{#f/12}* 俗话说的好：“富贵险中求。”',
                        "<18>{#p/papyrus}{#f/7}遇到危险，富贵算个球！！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}我只想用一个词来\n评价那个守卫队长。',
                        '<18>{#p/papyrus}{#f/4}那个词就是\n“注意看好路”。'
                    ]
                    : ["<18>{#p/papyrus}{#f/5}我很担心安黛因的\n人身安全。"]
        ),
        f_napstablook: pager.create(
            0,
            () =>
                SAVE.data.n.plot <= 48.1 && SAVE.data.n.state_foundry_blookdate < 2
                    ? [
                        "<18>{#p/papyrus}{#f/0}所以你跟一个幽灵\n交上朋友了。",
                        '<18>{#p/papyrus}{#f/1}你交友的范围是不是\n有点太宽泛了！？！？',
                        ...(solo()
                            ? ['<18>{#p/papyrus}{#f/6}你的实力真的\n太让人害怕了！！']
                            : [
                                "<25>{#p/undyne}{#f/14}* 要不然他咋能跟我交上\n  朋友呢。",
                                "<25>{#p/undyne}{#f/17}* 你应该提醒我的，帕派瑞斯！！\n* 我现在没退路了！",
                                '<18>{#p/papyrus}{#f/6}友谊的小船可不是\n说翻就翻的“帆”船！！'
                            ])
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}嗯...',
                        '<18>{#p/papyrus}{#f/4}我敢说，要是音乐声\n再大点，说不定你就得\n{@fill=#ff0}死于{@fill=#fff}耳聋了。',
                        ...(solo()
                            ? [
                                '<18>{#p/papyrus}{#f/0}...啥？死鱼耳聋？\n你听错了吧！',
                                '<18>{#p/papyrus}{#f/5}我明明说的是\n“私语”的儿童！'
                            ]
                            : [
                                "<25>{#p/undyne}{#f/8}* 别忘了我可在你旁边呢，\n  傻帽！",
                                '<18>{#p/papyrus}{#f/6}咋会忘呢！！\n我咋可能忘呢！！'
                            ])
                    ],
            () =>
                SAVE.data.n.plot <= 48.1 && SAVE.data.n.state_foundry_blookdate < 2
                    ? solo()
                        ? ['<18>{#p/papyrus}{#f/5}小心点灵质就行。']
                        : [
                            "<18>{#p/papyrus}{#f/5}至少她吸取教训了...",
                            '<25>{#p/undyne}{#f/14}* 是啊...真的！'
                        ]
                    : solo()
                        ? ['<18>{#p/papyrus}{#f/9}那个幽灵的立体音响\n里面有很多音乐！']
                        : ['<18>{#p/papyrus}{#f/0}有描写私语的儿童的，\n有能让你死于耳聋的。', '<25>{#p/undyne}{#f/8}* 真的有很多音乐！！']
        ),
        f_hapstablook: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}诶？\n你这是在哪？',
                "<18>{#p/papyrus}{#f/5}我...没来过这儿。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}也没...见别人来过这儿。']
                    : [
                        '<25>{#p/undyne}{#f/14}* ...是啊，那房子已经\n  废弃很久了。',
                        '<25>{#p/undyne}{#f/17}* 其实，那房子甚至比我\n  岁数还大！',
                        '<18>{#p/papyrus}{#f/6}多奇怪啊！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}老实说，这件事我不想再\n深入了解了..."]
                    : ['<18>{#p/papyrus}{#f/5}时间飞逝啊，是吧？', '<25>{#p/undyne}{#f/14}* 是啊！']
        ),
        a_start: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}你现在在空境吗？",
                "<18>{#p/papyrus}{#f/0}我想不只有我才喜欢\n装饰用的尖塔。",
                "<18>{#p/papyrus}{#f/4}不包括...\n不是装饰用的。",
                '<18>{#p/papyrus}{#f/4}那儿住着几百号人呢。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}但它们仍然\n有装饰作用！"]
                    : [
                        '<25>{#p/undyne}{#f/14}* 甚至艾菲斯博士\n  也住过那玩意。',
                        '<25>{#p/undyne}{#f/1}* 和她的童年玩伴\n  布莱蒂和凯蒂一起...',
                        '<25>{#p/undyne}{#f/1}* 这可是她当上科学员后\n  亲口告诉我的。',
                        "<18>{#p/papyrus}{#f/0}哦，\n我想知道更多！\n待会我去问问她。",
                        '<25>{#p/undyne}{#f/12}* 好啊。\n* 她好像喜欢谈论\n  这些事...？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/0}中间的那个是\n我最喜欢的。']
                    : ['<18>{#p/papyrus}{#f/5}在尖塔屋看到的景色\n一定大为震撼...']
        ),
        a_lab_entry: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}啊，实验室。\n那可真是个消遣的好地方。',
                '<18>{#p/papyrus}{#f/0}如果艾菲斯博士陪着\n就更是如此了。',
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}她真的很喜欢聊\n“科幻”之类的东西...',
                        "<18>{#p/papyrus}{#f/9}所以这何尝不是件\n好事呢！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 艾菲斯她... 一直都待在\n  实验室，帕派瑞斯。',
                        '<26>{#f/17}* 她的“房子”就是\n  楼上那个紫色立方体。',
                        "<26>{#f/16}* 别问我这是什么原理，\n  因为即使她告诉我...",
                        "<26>{#f/12}* 咱俩应该都不会理解。",
                        '<18>{#p/papyrus}{#f/4}确实。',
                        '<18>{#p/papyrus}{#f/0}所以原理是啥？',
                        '<25>{#p/undyne}{#f/17}* ...',
                        "<25>{#p/undyne}{#f/14}* 我待会告诉你。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}不过，她有个喜欢\n破坏东西的习惯。']
                    : ["<25>{#p/undyne}{#f/8}* 我待会会告诉你的！！！", '<18>{#p/papyrus}{#f/6}我知道了！！！']
        ),
        a_lab_main: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}我上次去实验室...',
                solo()
                    ? '<18>{#p/papyrus}{#f/0}...还是去找\n艾菲斯博士玩，\n就这周！'
                    : '<18>{#p/papyrus}{#f/0}...其实就今天早些时候，\n刚好咱要去休闲回廊！',
                '<18>{#p/papyrus}{#f/5}但在我小时候，\n衫斯就经常带我\n去实验室玩。',
                '<18>{#p/papyrus}{#f/5}数不胜数的科学奇迹\n让人心潮澎湃...',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/6}但可惜的是对此\n感兴趣的人不多！"]
                    : [
                        '<18>{#p/papyrus}{#f/0}你呢，安黛因？',
                        '<25>{#p/undyne}{#f/1}* 我吗？\n* 嗯...',
                        '<25>{#p/undyne}{#f/14}* 那个冰激淋机制作的\n  冰激淋真的很好吃。',
                        "<18>{#p/papyrus}{#f/4}...还有吗？",
                        '<25>{#p/undyne}{#f/20}* 我觉得艾菲斯能利用\n  高科技监视人类超酷...',
                        '<18>{#p/papyrus}{#f/0}哦，对！\n她也可以\n监视其他人！',
                        '<25>{#p/undyne}{#f/13}* ...',
                        '<25>{#p/undyne}{#f/7}* 我现在被监视了？？？'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}哦对了，\n我忘了说...',
                        '<18>{#p/papyrus}{#f/0}我兄弟过去是个\n实验室助手。',
                        "<18>{#p/papyrus}{#f/6}就是不知道\n他为啥要辞职...",
                        '<18>{#p/papyrus}{#f/5}他可是\n超爱这份工作的啊。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 我要去杀了她。',
                        "<18>{#p/papyrus}{#f/5}但你根本不知道\n你有没有被监视！",
                        "<25>{#p/undyne}{#f/8}* ...你觉得\n  她不会那样做吗！？",
                        "<18>{#p/papyrus}{#f/6}我不到啊！！",
                        "<25>{#p/undyne}{#f/14}* 你不会当真了吧，\n  我可不会去杀她。",
                        '<25>{#p/undyne}{#f/17}* 开个玩笑而已。',
                        "<18>{#p/papyrus}{#f/4}...好好好。"
                    ]
        ),
        a_lab_upstairs: pager.create(
            0,
            () =>
                SAVE.data.b.water
                    ? [
                        '<18>{#p/papyrus}{#f/5}这些回收站的真正用途\n实际上并非回收。',
                        "<18>{#p/papyrus}{#f/4}如果是的话，\n艾菲斯就不会计划...",
                        '<18>{#p/papyrus}{#f/5}制作一台用于分离\n里面所有垃圾的\n机器了。',
                        '<18>{#p/papyrus}{#f/6}比如，\n电尼阻液！',
                        ...(solo()
                            ? []
                            : [
                                '<25>{#p/undyne}{#f/17}* 人类居然还拿着杯子吗？',
                                "<25>{#p/undyne}{#f/8}* 你不会认真的吧！！",
                                "<18>{#p/papyrus}{#f/4}还好人类没有\n喝里面的液体。",
                                '<25>{#p/undyne}{#f/16}* 对，那液体\n  对人类有些害处。',
                                "<25>{#p/undyne}{#f/14}* 不过对怪物完全无害！"
                            ])
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}实验室里\n有一台奇怪的机器...",
                        '<18>{#p/papyrus}{#f/0}我听说艾菲斯\n用它做冰激淋。',
                        '<18>{#p/papyrus}{#f/4}...毫无疑问，\n她会在看\n科幻动漫时吃。',
                        ...(solo()
                            ? []
                            : [
                                "<25>{#p/undyne}{#f/17}* 啥？？\n* 她从来没带过我追剧...",
                                '<18>{#p/papyrus}{#f/4}嗯...',
                                '<18>{#p/papyrus}{#f/0}哦，我知道的！',
                                '<18>{#p/papyrus}{#f/9}你只需要和她\n“打破冰激淋”！',
                                '<25>{#p/undyne}{#f/13}* ...啥玩意？',
                                '<18>{#p/papyrus}{#f/0}打“破冰”激淋！',
                                "<25>{#p/undyne}{#f/14}* 那太荒谬了，\n  不过我喜欢。"
                            ])
                    ],
            () => [
                '<18>{#p/papyrus}{#f/0}说到食物和饮料...',
                '<18>{#p/papyrus}{#f/0}我听说镁塔顿\n曾想开一家食品店。',
                '<18>{#p/papyrus}{#f/4}特色食品叫做\n“NEO之力”。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}我不知道\n那是啥意思。"]
                    : [
                        '<25>{#p/undyne}{#f/12}* 听起来像是\n  廉价的山寨品牌。',
                        "<18>{#p/papyrus}{#f/7}啥？？\n镁塔顿才不会\n是那意思！"
                    ])
            ]
        ),
        a_lab_downstairs: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}自动售货机里的\n那些花哨的饮料...',
                '<18>{#p/papyrus}{#f/0}我一直都想尝一口...',
                '<18>{#p/papyrus}{#f/4}但每次我明明买了，\n可饮料就是出不来。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/8}* 要是吐不出来，\n  那就使劲晃机器，\n  啥时候出来啥时候停。",
                        "<18>{#p/papyrus}{#f/0}建议不错，\n但我更想把机器\n修好。",
                        "<25>{#p/undyne}{#f/1}* 一般摇摇就好了。\n* 我都是这么修的。",
                        '<18>{#p/papyrus}{#f/4}那你可能可以动“摇”\n我的想法。',
                        "<25>{#p/undyne}{#f/14}* 得了吧，这样就挺好。"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我还是喝桌子上的\n红色汽水吧。"]
                    : [
                        '<25>{#p/undyne}{#f/1}* 除了摇晃...',
                        '<25>{#p/undyne}{#f/14}* 超强电热带是我的\n  另一个修理方式。',
                        '<18>{#p/papyrus}{#f/0}哦对，\n那东西可以修\n任何东西。',
                        '<18>{#p/papyrus}{#f/4}...嗯，\n大部分东西。',
                        "<25>{#p/undyne}{#f/7}* 这样就够了！！"
                    ]
        ),
        a_lab_virt: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/4}真遗憾，\n虚拟空间并不是\n一直开着的。",
                "<18>{#p/papyrus}{#f/7}因此我失去了\n多少乐趣！",
                ...(solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}...太可惜了。',
                        "<18>{#p/papyrus}{#f/6}为此我不能经营\n我那举世闻名的餐厅！！"
                    ]
                    : [
                        '<25>{#p/undyne}{#f/7}* 我可不会用\n  “乐趣”这个词。',
                        '<18>{#p/papyrus}{#f/5}你真的忍心批评\n像我这样的骷髅...',
                        '<18>{#p/papyrus}{#f/6}想拥有一家\n举世闻名的餐厅的\n愿望吗？',
                        '<25>{#p/undyne}{#f/17}* 你这让我压力山大啊，\n  帕派瑞斯。',
                        '<18>{#p/papyrus}{#f/4}皇家卫队的队长\n居然会说这话。',
                        '<25>{#p/undyne}{#f/14}* 统领皇家卫队是一回事。',
                        '<25>{#p/undyne}{#f/7}* 但经营餐厅又是\n  另一回事！'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}哦对了，\n关于那家餐厅...',
                '<18>{#p/papyrus}{#f/9}它碰巧是一艘\n巨大的宇宙飞船！',
                '<18>{#p/papyrus}{#f/4}由番茄酱驱动。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/14}* ...还真是。'])
            ]
        ),
        a_path1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我听说空境\n曾经是一个待命区。',
                '<18>{#p/papyrus}{#f/5}他们打算建造\n特别多的酷玩意，\n但是...',
                '<18>{#p/papyrus}{#f/4}在实验室完成后，\n他们的紫色油漆\n用完了。',
                '<18>{#p/papyrus}{#f/4}对于油漆业来说，\n这真是一个巨大的\n退跃。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 你知道他们可以制作\n  更多油漆，对吧？",
                        '<25>{#p/undyne}{#f/7}* 他们放弃的真正原因\n  是因为镁塔顿\n  接管了这地盘！！',
                        "<18>{#p/papyrus}{#f/0}你说的跟\n这是件坏事似的。",
                        '<25>{#p/undyne}{#f/17}* ...',
                        '<25>{#p/undyne}{#f/17}* 他就想要\n  在这地盘称霸。',
                        "<18>{#p/papyrus}{#f/0}哦，我知道了。\n这下我可以\n理解他们了。",
                        '<18>{#p/papyrus}{#f/4}他的颜值确实可以\n称霸，没有人不会\n因此爱他。',
                        '<25>{#p/undyne}{#f/12}* ...我不是这意思，\n  但算了。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<19>{#p/papyrus}{#f/0}可惜我们永远都不能\n看到它们的全部\n潜力了。",
                        '<18>{#p/papyrus}{#f/5}包括那些\n奇怪的建筑\n和机器...',
                        "<18>{#p/papyrus}{#f/8}还有那些我本可以\n使用的小发明！"
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/4}如果镁塔顿\n没那么美就好了。",
                        "<18>{#p/papyrus}{#f/6}等等，\n那样就太糟了！",
                        '<18>{#p/papyrus}{#f/5}但放弃\n待命区也是...',
                        "<25>{#p/undyne}{#f/1}* 也许有一件小发明\n  可以解决这问题。",
                        '<18>{#p/papyrus}{#f/0}就像是...\n颜值补偿滤光镜！？',
                        '<25>{#p/undyne}{#f/18}* 我更倾向于\n  改变他的自我意识。',
                        '<25>{#p/undyne}{#f/17}* 你可以制作一个\n  “意识补偿滤波器”。',
                        '<18>{#p/papyrus}{#f/7}别想！'
                    ]
        ),
        a_path2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这些升降机\n特别好玩。',
                "<18>{#p/papyrus}{#f/0}有时候，\n在周围没人时...",
                "<18>{#p/papyrus}{#f/0}我就会\n来回搭乘它们。",
                '<18>{#p/papyrus}{#f/4}不过它\n需要一种\n特殊通行证。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/4}* 嘿，艾菲斯从来\n  都没给过我通行证！',
                        '<18>{#p/papyrus}{#f/0}也许你该\n向她要一个！',
                        '<25>{#p/undyne}{#f/3}* ...',
                        '<18>{#p/papyrus}{#f/6}...',
                        '<25>{#p/undyne}{#f/11}* ...',
                        '<25>{#p/undyne}{#f/8}* 门都没有！',
                        '<18>{#p/papyrus}{#f/6}好好说话！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/0}去吧，试试看！',
                        "<18>{#p/papyrus}{#f/5}不危险的...",
                        '<18>{#p/papyrus}{#f/6}...一般来说。'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}...',
                        "<18>{|}{#p/papyrus}{#f/4}我不是唯一\n一个认为你- {%}",
                        '<25>{#p/undyne}{#f/8}* 天啊别！！',
                        '<18>{#p/papyrus}{#f/6}好，好！'
                    ]
        ),
        a_path3: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我听说空境的\n教学模式很艰苦。',
                '<18>{#p/papyrus}{#f/6}是真的吗？\n学生真的要遭\n那么多罪吗？',
                "<18>{#p/papyrus}{#f/8}不敢想象如果我没提前\n受到教育会怎么样...！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/8}* 我十岁就退学了！！',
                        '<18>{#p/papyrus}{#f/1}啥！？！？',
                        '<18>{#p/papyrus}{#f/6}你怎么能这么彻底\n地违反体制！',
                        '<25>{#p/undyne}{#f/1}* 人的生命各不相同，\n  所以不是每个人都要走\n  相同的路，帕派瑞斯。',
                        '<25>{#p/undyne}{#f/1}* 我退学后，\n  艾斯戈尔就成为了\n  我的老师。',
                        '<25>{#p/undyne}{#f/14}* 同时他也是最棒的老师。',
                        '<18>{#p/papyrus}{#f/5}...看来我还有\n许多东西要学...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/8}甚至可能不会得到\n我的特殊攻击！"]
                    : ["<18>{#p/papyrus}{#f/6}别担心，\n我这就学！"]
        ),
        a_rg1: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}这里的实习守卫\n真的难以置信。",
                '<18>{#p/papyrus}{#f/4}他们似乎\n永远不会迷路。',
                '<18>{#p/papyrus}{#f/5}问题是...',
                '<18>{#p/papyrus}{#f/6}这地方看着...\n啥也没有啊！！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/7}所有的房间\n都看起来一模一样！']
                    : [
                        "<25>{#p/undyne}{#f/12}* 实际上，\n  你说的并不过分...",
                        "<25>{#p/undyne}{#f/1}* 他们花了很长时间\n  来记住这地方的布局。",
                        '<18>{#p/papyrus}{#f/0}但最后他们都\n成功记住了，\n对吧？',
                        '<25>{#p/undyne}{#f/16}* 嗯...\n  失败了亿百次后...',
                        '<25>{#p/undyne}{#f/17}* 我放弃了，\n  给他们头盔上\n  装了个导航模块。',
                        '<18>{#p/papyrus}{#f/1}啥！？！？',
                        '<18>{#p/papyrus}{#f/7}这是用科技作弊！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}想知道【你】为啥\n从来都没迷路过...']
                    : [
                        '<18>{#p/papyrus}{#f/4}我，伟大且\n天赋异禀的\n帕派瑞斯...',
                        '<18>{#p/papyrus}{#f/7}永远不会依赖科技\n来完成工作！',
                        "<18>{#p/papyrus}{#f/0}...除了真正需要时。"
                    ]
        ),
        a_path4: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}传说有一个地方\n可以将无用的垃圾\n变成珍贵的宝藏。',
                '<18>{#p/papyrus}{#f/9}一个可以将垃圾\n变成黄金的地方！',
                '<18>{#p/papyrus}{#f/4}一个吃\n太空金枪鱼的地方...',
                '<18>{#p/papyrus}{#f/5}嗯，放那的东西\n就那么直接消失了。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}你知道这样的地方吗？']
                    : [
                        "<25>{#p/undyne}{#f/1}* 听起来像是\n  布莱蒂和凯蒂的地盘。",
                        '<25>{#p/undyne}{#f/14}* 她们爱太空金枪鱼\n  甚至超过爱卖垃圾！',
                        '<25>{#p/undyne}{#f/17}* 而且她们\n  真的超爱卖垃圾！！',
                        '<18>{#p/papyrus}{#f/0}哇哦！',
                        '<18>{#p/papyrus}{#f/5}她们有时也会卖\n非垃圾的东西吗？',
                        '<25>{#p/undyne}{#f/8}* 她们为啥要卖！？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我就当这是一种\n响亮的“可能”吧。']
                    : [
                        '<18>{#p/papyrus}{#f/0}所以布莱蒂和凯蒂\n是垃圾贩子对吧？',
                        "<18>{#p/papyrus}{#f/4}她们肯定\n也认识我兄弟。"
                    ]
        ),
        a_barricade1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这个房间可能有也\n可能没有路障。',
                '<18>{#p/papyrus}{#f/4}他们说你必须回答\n问题才能解开它们。',
                '<18>{#p/papyrus}{#f/1}这不会是！？\n机智问答节目的\n秘密试镜吧！？',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 哈，问答节目？',
                        '<18>{#p/papyrus}{#f/9}...几乎全是\n冷知识类型的问题！！',
                        "<25>{#p/undyne}{#f/1}* 好，问你一个问题。",
                        '<25>{#p/undyne}{#f/12}* 需要多少鞋子...',
                        "<25>{#p/undyne}{#f/7}* 才能把那个机器人\n  踹飞到太空！！",
                        '<18>{#p/papyrus}{#f/6}呃...',
                        '<18>{#p/papyrus}{#f/5}... 嗯，呃...',
                        '<18>{#p/papyrus}{#f/4}实际上，\n这跟重力有关。',
                        '<25>{#p/undyne}{#f/8}* 帕派瑞斯！！'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}他【已经】有\n一段时间没播过了。"]
                    : [
                        "<25>{#p/undyne}{#f/1}* 如果你还想答，\n  我这还有一个问题。",
                        '<18>{#p/papyrus}{#f/5}...过几天吧。',
                        "<18>{#p/papyrus}{#f/4}而且，我们都知道\n他飞到哪了...",
                        '<25>{#p/undyne}{#f/7}* 对！！\n* 太空！！'
                    ]
        ),
        a_puzzle1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}你知道，可能只有\n我这么觉得，\n但是...',
                '<18>{#p/papyrus}{#f/4}这谜题超怪的。',
                '<18>{#p/papyrus}{#f/4}...我总是容易\n找到正确的终端。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...一遍又一遍...']
                    : [
                        '<25>{#p/undyne}{#f/1}* 是吗？\n* 每当我尝试解决\n  这谜题时...',
                        '<25>{#p/undyne}{#f/17}* 周围的的一切\n  都开始变得疯狂！！',
                        "<18>{#p/papyrus}{#f/6}艾菲斯从来都没\n把你拉回安全点\n过吗？",
                        '<25>{#p/undyne}{#f/12}* 嗯... 我...',
                        '<18>{#p/papyrus}{#f/6}安黛因，\n你干啥了！？！？',
                        '<25>{#p/undyne}{#f/12}* ...',
                        "<25>{#p/undyne}{#f/12}* 没啥。",
                        '<25>{#p/undyne}{#f/12}* 除了差点让我当场消逝。',
                        '<18>{#p/papyrus}{#f/8}不...！\n下次注意点！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}要是你喜欢做这个\n谜题，我将对你\n【另】眼相看。']
                    : ['<18>{#p/papyrus}{#f/4}这样的维度技术\n问题可大了。']
        ),
        a_mettaton1: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}一个小建议。",
                '<18>{#p/papyrus}{#f/4}当镁塔顿说要在\n节目中做什么时...',
                '<18>{#p/papyrus}{#f/4}听他指挥就行。',
                '<18>{#p/papyrus}{#f/0}没有什么“如果”\n“而且”“但是”！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* “然而”呢？',
                        '<18>{#p/papyrus}{#f/4}...',
                        '<18>{#p/papyrus}{#f/4}这只是\n“但是”的另一种说法。',
                        '<25>{#p/undyne}{#f/17}* ...确实。',
                        '<25>{#p/undyne}{#f/14}* 那“除非”呢？',
                        '<18>{#p/papyrus}{#f/4}我们都快禁止完了。',
                        "<25>{|}{#p/undyne}{#f/8}* 但是我还没说-{%}",
                        '<18>{#p/papyrus}{#f/6}没有但是！！！',
                        '<25>{|}{#p/undyne}{#f/7}* 如果你只会让我-{%}',
                        '<18>{#p/papyrus}{#f/7}没有如果！！'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}并且没有然而。']
                    : ['<18>{#p/papyrus}{#f/4}别让我\n把“也许”也禁了。']
        ),
        a_elevator1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}电梯多，耗时少...',
                "<18>{#p/papyrus}{#f/4}除非它们不工作。",
                '<18>{#p/papyrus}{#f/6}昨天我出来逛时\n不得不步行！！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}要是我知道为啥\n会有人关掉它\n就好了...']
                    : [
                        '<25>{#p/undyne}{#f/12}* 我听说是镁塔顿\n  为了演节目\n  而把电梯关了的。',
                        '<18>{#p/papyrus}{#f/4}真... 真的吗？',
                        '<25>{#p/undyne}{#f/17}* 据我所知！',
                        '<18>{#p/papyrus}{#f/7}...他只是这次\n冒失了点而已！',
                        '<18>{#p/papyrus}{#f/7}我现在就\n找他说句话！',
                        "<25>{#p/undyne}{#f/7}* 告诉他在你忙的时候\n  取消那些愚蠢的节目！"
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/5}这怎么看\n都是一场阴谋。"]
                    : [
                        '<18>{#p/papyrus}{#f/4}也许...\n这是我的一次\n机会...',
                        '<18>{#p/papyrus}{#f/9}...来提议建造\n更多的升降机！'
                    ]
        ),
        a_lift: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}这个电梯应该播放\n一套音乐专辑！',
                '<18>{#p/papyrus}{#f/5}最好是愉快的\n布鲁斯蓝调...',
                "<18>{#p/papyrus}{#f/6}可惜音响坏了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/13}* 布鲁斯蓝调？\n* 认真的？',
                        "<25>{#p/undyne}{#f/14}* 大伙都知道\n  摇滚乐才是主流！",
                        '<18>{#p/papyrus}{#f/4}啥玩意！？\n摇滚乐超怪的好吧...',
                        "<18>{#p/papyrus}{#f/9}你要是想听重吉他，\n重金属乐更好！！",
                        '<25>{#p/undyne}{#f/8}* 什么，重金属！？',
                        '<25>{#p/undyne}{#f/4}* 不不不，\n  你应该听回响贝斯。',
                        '<18>{#p/papyrus}{#f/6}回响贝斯！？！？'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}我可能听过，\n但也没听过几次。']
                    : [
                        '<18>{#p/papyrus}{#f/0}布鲁斯蓝调是很好，\n但我最喜欢的是\n斯卡音乐。',
                        '<18>{#p/papyrus}{#f/9}你永远都听不够\n那些扣人心弦的\n小号！'
                    ]
        ),
        a_elevator2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}欢迎来到\n空境二层。',
                '<18>{#p/papyrus}{#f/4}在这里，\n你可以找到\n许多神奇的东西...',
                '<18>{#p/papyrus}{#f/9}例如谜题！\n路障！\n甚至电视机！',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/5}...不对，那些不是\n一层的东西吗？"]
                    : [
                        "<25>{#p/undyne}{#f/14}* 所以... \n  这里和一层\n  一模一样吧。",
                        '<18>{#p/papyrus}{#f/6}我想确实？？？',
                        '<25>{#p/undyne}{#f/1}* 嘿。\n* 至少二层更大。',
                        '<18>{#p/papyrus}{#f/4}哦，棒欸。\n现在我可以\n更容易迷路了。',
                        '<25>{#p/undyne}{#f/17}* 至少二层有更多\n  酷东西可以看！！',
                        "<18>{#p/papyrus}{#f/6}但这些对迷路\n可没有帮助！"
                    ])
            ],
            [
                '<18>{#p/papyrus}{#f/5}创造这个区域的\n一定是条懒狗。',
                "<18>{#p/papyrus}{#f/4}这样那些哨站就\n说得通了..."
            ]
        ),
        a_sans: pager.create(
            0,
            () => [
                '<19>{#p/papyrus}{#f/0}是，我兄弟就用哨站\n卖玉米热狗。',
                '<18>{#p/papyrus}{#f/4}但是我觉得那并不\n“可口”。',
                "<18>{#p/papyrus}{#f/5}我也要开一个小吃摊，\n这样他就没生意做了...",
                '<18>{#p/papyrus}{#f/5}可是我试过了...',
                '<18>{#p/papyrus}{#f/6}星际黑帮总想分一杯羹。',
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/7}想都别想！！\n我绝不会向黑恶势力\n低头！"]
                    : [
                        '<25>{#p/undyne}{#f/17}* ...',
                        '<25>{#p/undyne}{#f/17}* 你说什么玩意？',
                        '<18>{#p/papyrus}{#f/0}星际黑帮啊。',
                        '<18>{#p/papyrus}{#f/4}你知道的，虚拟世界\n里的那些。',
                        '<25>{#p/undyne}{#f/12}* 啊，那个星际黑帮啊。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}但是他们穿的还蛮\n整洁的，这一点值得\n表扬。",
                        "<18>{#p/papyrus}{#f/7}可是那不会影响\n我对他们的看法！",
                        '<18>{#p/papyrus}{#f/4}你们的得体打扮就\n只能帮你到这了。'
                    ]
                    : [
                        '<25>{#p/undyne}{#f/1}* 你觉得“星际黑帮”会插手\n  衫斯的玉米热狗生意吗？',
                        "<18>{#p/papyrus}{#f/0}哇！好问题！",
                        '<25>{#p/undyne}{#f/14}* 真的吗？',
                        "<18>{#p/papyrus}{#f/0}但是我不想回答！"
                    ]
        ),
        a_pacing: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}今天我在域外网上\n收到了一条奇怪的\n消息。',
                '<18>{#p/papyrus}{#f/4}是关于一群被困在\n力场里的乌贼的。',
                '<18>{#p/papyrus}{#f/5}过着乌贼的生活，\n吃着乌贼的食物...',
                '<18>{#p/papyrus}{#f/4}那些乌贼渴望着有\n一天，他们能够触碰\n到星星。',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/6}...到底是什么意思！？']
                    : [
                        "<25>{#p/undyne}{#f/8}* 有很奇怪吗？\n* 哈！",
                        '<25>{#p/undyne}{#f/7}* 你听听我这个！',
                        '<18>{#p/papyrus}{#f/4}怎么，更多乌贼？',
                        '<25>{#p/undyne}{#f/14}* 怎么可能。',
                        '<18>{#p/papyrus}{#f/4}那是什么\n“稳赚不赔的投资”吗？',
                        '<25>{#p/undyne}{#f/14}* 怎么可能。',
                        '<18>{#p/papyrus}{#f/6}还是什么\n“离开前哨站”的\n独家捷径？',
                        "<25>{#p/undyne}{#f/14}* ...还真是。\n* 然后我就给他们\n  屏蔽了。",
                        '<25>{#p/undyne}{#f/7}* 敢拿假消息糊弄我，\n  还想让我饶了你？',
                        '<18>{#p/papyrus}{#f/0}就是啊！！',
                        '<18>{#p/papyrus}{#f/5}而且，咱可有\n【货真价实】的\n自由法宝呢...',
                        '<18>{#p/papyrus}{#f/6}而且，还正跟咱\n打电话呢！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}我其实挺好奇，\n那些乌贼会不会\n真的存在呢？',
                        '<18>{#p/papyrus}{#f/4}毕竟宇宙是没有尽头的...',
                        '<18>{#p/papyrus}{#f/9}那就意味着无尽的\n可能性，无尽的组合！！'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/0}祝你终能重获自由。",
                        '<18>{#p/papyrus}{#f/6}也祝我们未来\n能重获自由！！'
                    ]
        ),
        a_prepuzzle: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}散落在这附近的\n那些花...？',
                "<18>{#p/papyrus}{#f/0}啊，那其实是\n艾斯戈尔的主意。",
                '<18>{#p/papyrus}{#f/4}他就算不是前哨站的\n“大领导”...',
                '<18>{#p/papyrus}{#f/5}也能算个“大龄捣”。',
                '<18>{#p/papyrus}{#f/5}年龄大了，但还喜欢\n捣鼓花花草草的\n“大龄捣”。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 那我是什么？',
                        '<18>{#p/papyrus}{#f/0}我早就给你想好了。',
                        '<18>{#p/papyrus}{#f/4}他是“大领导”，\n你是“打凌刀”。',
                        '<25>{#p/undyne}{#f/14}* ...“打凌刀”是个啥？',
                        '<18>{#p/papyrus}{#f/9}路见不平，穷追猛{@fill=#ff0}打{@fill=#fff}。\n盛气{@fill=#ff0}凌{@fill=#fff}人，武功高强。\n朋友有难，两肋插{@fill=#ff0}刀{@fill=#fff}。',
                        '<25>{#p/undyne}{#f/8}* 妙，太妙了！！！'
                    ])
            ],
            ['<18>{#p/papyrus}{#f/4}国王是“大领导”，\n你是“打凌刀”，\n那我就是“大刀”。']
        ),
        a_puzzle2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}之前解这个谜题的时候...',
                "<18>{#p/papyrus}{#f/6}不管我往哪儿跑，\n最后总是回到起点！",
                '<18>{#p/papyrus}{#f/5}...至少那个时候\n确实是这样。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 哎呀真是的。\n* 白费这力气干嘛？',
                        '<18>{#p/papyrus}{#f/6}因为啊！！',
                        '<18>{#p/papyrus}{#f/6}解谜本应是一种乐趣的！！',
                        "<25>{#p/undyne}{#f/12}* 你就不能用飞行魔法\n  绕过去吗？",
                        '<18>{#p/papyrus}{#f/4}飞行魔法非紧急情况\n我是不会用的。',
                        '<25>{#p/undyne}{#f/1}* 那什么才算是“紧急情况”。',
                        '<18>{#p/papyrus}{#f/7}反正就解个谜肯定\n算不上紧急情况！',
                        "<25>{#p/undyne}{#f/14}* 那你就慢慢解吧，\n  有你好受的。",
                        '<18>{#p/papyrus}{#f/7}我偏要解！！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}数字，到处都是数字！！',
                        '<18>{#p/papyrus}{#f/6}到底是什么意思！？！？'
                    ]
                    : [
                        "<18>{#p/papyrus}{#f/5}到处飞来飞去可不公平。",
                        '<25>{#p/undyne}{#f/11}* 那你就甘愿自己受苦...？',
                        '<18>{#p/papyrus}{#f/9}一份付出，一份回报！',
                        '<25>{#p/undyne}{#f/17}* ...那什么才算是“付出”。'
                    ]
        ),
        a_mettaton2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}啊...时过金迁。',
                ...(SAVE.data.n.plot < 60
                    ? [
                        '<18>{#p/papyrus}{#f/4}正如你所知...',
                        "<18>{#p/papyrus}{#f/5}下一集里就没有我了。",
                        "<18>{#p/papyrus}{#f/6}...我坐在他旁边\n会很紧张的。"
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/4}镁塔顿想让我上，可...',
                        '<18>{#p/papyrus}{#f/5}经过一番思考，\n我意识到...',
                        "<18>{#p/papyrus}{#f/6}...我不能坐在他旁边，\n我会紧张死的。"
                    ]),
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* ...你真的很喜欢他啊。",
                        '<18>{#p/papyrus}{#f/4}呃，他【真的】很有魅力...',
                        "<18>{#p/papyrus}{#f/6}...但我还没\n下定决心！",
                        "<25>{#p/undyne}{#f/3}* 才几分钟而已。",
                        '<18>{#p/papyrus}{#f/4}哈？\n你是不是以为...',
                        '<18>{#p/papyrus}{#f/7}...我们俩之间有啥\n特殊关系吧！？！？',
                        '<25>{#p/undyne}{#f/14}* 才怪，\n  怎么可能。',
                        "<25>{#p/undyne}{#f/17}* 不过这也太明显了，\n  我都忍不住把真相\n  说出来了。",
                        '<18>{#p/papyrus}{#f/5}（唉...）'
                    ])
            ],
            () =>
                solo()
                    ? SAVE.data.n.plot < 60
                        ? ['<18>{#p/papyrus}{#f/0}幸好我找了个替身。']
                        : SAVE.data.b.undyne_respecc
                            ? ['<18>{#p/papyrus}{#f/0}谢天谢地，\n安黛因帮我\n参加了节目。']
                            : ['<18>{#p/papyrus}{#f/0}谢天谢地，\n我兄弟帮我\n参加了节目。']
                    : ['<25>{#p/undyne}{#f/12}* 帕派瑞斯正白日做梦，\n  没空接电话。']
        ),
        a_rg2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/6}小心点，人类！',
                '<18>{#p/papyrus}{#f/5}这区域的守卫\n刚刚结束了训练。',
                "<18>{#p/papyrus}{#f/6}她们也许会忽略\n一些皇家备忘录！",
                ...(solo()
                    ? ["<18>{#p/papyrus}{#f/0}顺便问下，\n啥是皇家备忘录？"]
                    : [
                        '<25>{#p/undyne}{#f/16}* 对这事我深有体会...',
                        '<18>{#p/papyrus}{#f/5}哈？\n她们经常忽略你的\n备忘录吗？',
                        '<25>{#p/undyne}{#f/14}* 哦，\n  那倒不会。',
                        "<25>{#p/undyne}{#f/10}* 不过她们倒是经常会忽略\n  艾菲斯的备忘录。",
                        "<18>{#p/papyrus}{#f/6}但她可是\n皇家科学员啊！",
                        "<18>{#p/papyrus}{#f/6}还是\n皇室的亲信！",
                        "<25>{#p/undyne}{#f/12}* 是啊...\n  按理说就是这样。",
                        "<25>{#p/undyne}{#f/16}* 但自从罗曼教授去世后，\n  我们每个人的心中\n  都还没做好替代他的准备。",
                        "<26>{#p/undyne}{#f/10}* 因此皇家卫队的大多数人\n  都不把他的继任者\n  当回事，所以..",
                        '<25>{#p/undyne}{#f/9}* 这也影响了\n  实习守卫对她的看法。',
                        '<18>{#p/papyrus}{#f/5}哦...',
                        "<25>{#p/undyne}{#f/17}* 我知道的。\n* 这确实... 不怎么样。",
                        "<26>{#f/9}* 但她太笨了，\n  还不能彻底地\n  证明自己。",
                        '<26>{#f/16}* 所以...\n  我大概能理解。',
                        "<18>{#p/papyrus}{#f/5}希望她终将\n得到应有的尊重。",
                        '<26>{#p/undyne}{#f/14}* 希望吧。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我想知道它和\n普通的备忘录\n有啥区别。"]
                    : ['<18>{#p/papyrus}{#f/4}希望\n那一天不会太远。']
        ),
        a_barricade2: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}对这个房间，\n我没啥要说的。",
                '<18>{#p/papyrus}{#f/5}实际上，\n我唯一要说的是...',
                '<18>{#p/papyrus}{#f/6}...是我\n【无】话可说！',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}额，实际上，\n我还是有话可说的。']
                    : [
                        '<26>{#p/undyne}{#f/1}* 我有句话要说。',
                        '<18>{#p/papyrus}{#f/6}啥？\n是什么？',
                        '<26>{#p/undyne}{#f/14}* 这个房间可能有\n  也可能没有路障。',
                        "<18>{#p/papyrus}{#f/4}在一层已经有\n一个这样的房间了。",
                        '<18>{#p/papyrus}{#f/7}说点原创的！！',
                        "<26>{#p/undyne}{#f/17}* 说不出来了。",
                        '<18>{#p/papyrus}{#f/5}... 没关系...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}也许在另一个房间\n我就有话说了。"]
                    : ["<18>{#p/papyrus}{#f/0}也许这个房间\n不是很有趣。"]
        ),
        a_split: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}看，那是著名的\n镁塔顿喷泉！",
                '<18>{#p/papyrus}{#f/4}我听说这费了\n九牛二虎之力\n才修建好。',
                '<18>{#p/papyrus}{#f/5}无数个日夜\n刻苦耐劳，\n兢兢业业...',
                '<18>{#p/papyrus}{#f/6}才得到那么\n完美无瑕的\n长方形。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/12}* 然后他毁了它，\n  这样就可以自己设计了。',
                        '<18>{#p/papyrus}{#f/6}真的吗？？',
                        '<25>{#p/undyne}{#f/1}* 第一个没有达到\n  他的“高标准”。',
                        '<18>{#p/papyrus}{#f/4}等等，\n电视上有关于\n这个的消息。',
                        '<25>{#p/undyne}{#f/14}* 哦对，他决定向\n  全前哨站直播。',
                        '<25>{#p/undyne}{#f/17}* 他必须向每个人展示\n  他那所谓的出类拔萃。',
                        '<18>{#p/papyrus}{#f/4}嗯，毕竟这是\n【他的】雕像...'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}我兄弟告诉我\n那说的并不完全对。"]
                    : [
                        '<18>{#p/papyrus}{#f/5}我想知道他为啥\n第一次要\n雇别人设计。',
                        "<18>{#p/papyrus}{#f/4}要是我最开始\n就自己做了..."
                    ]
        ),
        a_offshoot1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}信号似乎不太好。',
                "<18>{#p/papyrus}{#f/6}就像是...\n被干扰了？？",
                "<18>{#p/papyrus}{#f/4}也许最好在\n其他地方打电话。",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 也许人类在空境的\n  旧瞭望塔附近。",
                        "<25>{#p/undyne}{#f/17}* 他们过去\n  用的金属有点问题。"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}上一通电话\n没有打过去吗？']
                    : ["<25>{#p/undyne}{#f/14}* 不过没啥大不了的。"]
        ),
        a_elevator3: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}我第一次\n来到这个房间时...',
                '<18>{#p/papyrus}{#f/6}看到又得\n乘一部电梯，\n让我烦死了。',
                '<18>{#p/papyrus}{#f/5}然后，\n我有点释然了...',
                '<18>{#p/papyrus}{#f/4}...因为我发现\n附近没有一个\n无聊的广告。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 所以你喜欢乘电梯吗？',
                        '<18>{#p/papyrus}{#f/6}嗯...',
                        '<18>{#p/papyrus}{#f/5}有音乐还好，\n要是没音乐\n简直痛苦万分。',
                        '<18>{#p/papyrus}{#f/4}不过我承认\n它们是必需品。',
                        "<25>{#p/undyne}{#f/1}* 好吧，\n  你该庆幸自己\n  不住在尖塔房子里。",
                        '<18>{#p/papyrus}{#f/5}为啥？',
                        '<25>{#p/undyne}{#f/17}* 那里全是电梯。',
                        '<18>{#p/papyrus}{#f/6}不——...！',
                        "<25>{#p/undyne}{#f/7}* 而且它们甚至\n  都没啥必要。",
                        "<18>{#p/papyrus}{#f/8}不要啊...！",
                        "<25>{#p/undyne}{#f/8}* 最后它们甚至\n  不带音乐！！！",
                        "<18>{#p/papyrus}{#f/1}简直像是地狱！"
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}要是有更好的\n办法就好了。',
                        '<18>{#p/papyrus}{#f/0}...哦，等等，\n绝对有！',
                        '<18>{#p/papyrus}{#f/9}升降机！！！'
                    ]
                    : [
                        '<18>{#p/papyrus}{#f/5}没有音乐的电梯\n就像...',
                        '<18>{#p/papyrus}{#f/5}一盘不加番茄酱的\n意大利面。',
                        '<18>{#p/papyrus}{#f/4}如果是我兄弟那就是\n奶油奶酪酱。',
                        "<18>{#p/papyrus}{#f/4}...而且人们总是说\n我很奇怪。"
                    ]
        ),
        a_elevator4: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}如果一只骷髅\n勇闯安保门，\n会发生什么？',
                '<19>{#p/papyrus}{#f/4}答案是...\n他会差点被电嗝屁。',
                '<18>{#p/papyrus}{#f/6}就像我第一次\n来这里那样！',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/1}* 这么说，这电门跟你\n  关系不一般啊。",
                        '<18>{#p/papyrus}{#f/4}哦，这门给我留下了\n极其深刻的印象...',
                        '<18>{#p/papyrus}{#f/5}反正印象不咋样。',
                        '<25>{#p/undyne}{#f/14}* 这就叫“无知者无畏”吧？',
                        "<18>{#p/papyrus}{#f/7}别以为我傻！\n啥危险我能不知道？",
                        '<18>{#p/papyrus}{#f/5}要说“自不量力”\n还差不多。',
                        '<25>{#p/undyne}{#f/17}* 不对。',
                        "<25>{#p/undyne}{#f/17}* 那安保门给你“输送”了\n  那么多力量，\n  你咋还能“自不量力”？",
                        "<18>{#p/papyrus}{#f/4}哎，好像有道理..."
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/6}哎，说来话长啊，\n以后再说这事吧。"]
                    : ["<18>{#p/papyrus}{#f/0}这么一想，被电也挺好。"]
        ),
        a_auditorium: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我兄弟在这主持过\n一次喜剧节目。',
                '<18>{#p/papyrus}{#f/4}那场节目的名字\n叫做...',
                '<18>{#p/papyrus}{#f/4}...《衫燃肋下》。',
                "<18>{#p/papyrus}{#f/5}虽然名字很烂，\n但节目并没失败。",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}确切的说，\n那场节目大受欢迎！！']
                    : [
                        "<25>{#p/undyne}{#f/1}* 实话说，我很惊讶\n  他为啥不趁热打铁，\n  反而要功成身退。",
                        '<25>{#p/undyne}{#f/16}* 也许他只愿当个哨兵，\n  整天逍遥自在吧。',
                        '<18>{#p/papyrus}{#f/5}对。\n一定是这样的。',
                        "<18>{#p/papyrus}{#f/4}绝对没有其他原因。",
                        '<25>{#p/undyne}{#f/14}* ...啥？'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}我和你一样\n对此惊讶。"]
                    : ["<18>{#p/papyrus}{#f/0}有些事\n还不到提的时候。"]
        ),
        a_aftershow: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}所以这里是\n布莱蒂和凯蒂的\n工作区，对吧？',
                "<18>{#p/papyrus}{#f/0}比我想的还干净。",
                "<18>{#p/papyrus}{#f/4}她们俩不应该是\n垃圾贩子吗...？",
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/5}...也许垃圾\n被整理得很好。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 我觉得她们俩正很好地\n  保护着她们收集来的\n  垃圾。",
                        '<25>{#p/undyne}{#f/16}* 艾菲斯告诉过我\n  她们仨过去是怎么\n  捡垃圾的...',
                        "<25>{#p/undyne}{#f/9}* 并非只是古怪的爱好。\n* 也是生活。",
                        '<18>{#p/papyrus}{#f/0}感觉好好玩的亚子。',
                        '<25>{#p/undyne}{#f/1}* 此外，\n  所有最酷的玩意都是被\n  喜欢她们的人发现的。',
                        '<18>{#p/papyrus}{#f/9}像是上次电视节目\n中的那个喵喵玩偶！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/5}整理垃圾...',
                        "<18>{#p/papyrus}{#f/4}这俩词组成的句子\n我还是头一回说。"
                    ]
                    : ['<18>{#p/papyrus}{#f/0}不知道人类会不会\n喜欢翻怪物垃圾。']
        ),
        a_hub1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}哦... 这里是回廊中央。',
                '<18>{#p/papyrus}{#f/4}第一次听到\n这名的时候...',
                "<18>{#p/papyrus}{#f/5}我还纳闷...\n这里啥时候来了个\n姓“回”的郎中？",
                "<18>{#p/papyrus}{#f/0}但我一琢磨，\n这里好像真没医生，\n那来个郎中也合理！",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* “回廊”，“郎中”，“中央”...',
                        "<26>{#p/undyne}{#f/14}* 哇，我要是不认识你，\n  光听你念叨这些词，\n  还得把你当成大诗人呢！",
                        '<18>{#p/papyrus}{#f/6}...你说我，诗人？',
                        "<18>{#p/papyrus}{#f/5}算了吧，\n我可配不上。",
                        "<25>{#p/undyne}{#f/17}* 开玩笑吧？\n* 你很有这种天赋。",
                        '<18>{#p/papyrus}{#f/4}也说不定...'
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/4}而且，这里的食物\n也挺棒的。']
                    : ['<18>{#p/papyrus}{#f/0}如果我会写日本俳句，\n那我就叫“帕俳如诗”。', '<18>{#p/papyrus}{#f/5}“帕俳如诗”...\n这{@fill=#ff0}回琅{@fill=#fff}琅上口了。']
        ),
        a_dining: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/5}不知道你咋想，\n但这地方的食物...",
                '<18>{#p/papyrus}{#f/6}...都是些\n什么鬼玩意！！',
                "<18>{#p/papyrus}{#f/4}好像每个人\n都忘记了怎么烹饪。",
                "<18>{#p/papyrus}{#f/7}我的意面风味的\n意大利面哪去了！？",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/14}* 这提醒了我...',
                        '<25>{#p/undyne}{#f/1}* 我有次想给皇家卫队\n  添一个炊事员。',
                        "<25>{#p/undyne}{#f/16}* 我们会有充满美味的餐厅，\n  精致的食物....",
                        '<25>{#p/undyne}{#f/17}* ...直到，\n  艾斯戈尔尝了口我做的菜。',
                        '<18>{#p/papyrus}{#f/4}嗯...',
                        "<18>{#p/papyrus}{#f/9}也许你番茄酱\n没加够！",
                        '<25>{#p/undyne}{#f/3}* 再多的番茄酱\n  也不能弥补这种暴行。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}上次我想点它时，\n他们...',
                        "<18>{#p/papyrus}{#f/5}...这么说吧，\n似乎这让他们的大脑\n停止了思考。"
                    ]
                    : ['<18>{#p/papyrus}{#f/4}也许应该让我来做。']
        ),
        a_hub2: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}人生就像一盘棋局。',
                '<18>{#p/papyrus}{#f/5}让心\n静如水...',
                '<18>{#p/papyrus}{#f/5}然后捕获棋子...',
                '<18>{#p/papyrus}{#f/6}再然后，呃...',
                '<18>{#p/papyrus}{#f/4}好吧，\n人生一点都不像\n棋局。',
                '<18>{#p/papyrus}{#f/0}但它们之间\n确实有相同之处。',
                '<18>{#p/papyrus}{#f/9}就是你永远都不知道\n接下来会\n发生什么！！',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 也有点像一盒树胶。',
                        '<18>{#p/papyrus}{#f/0}是啊，\n确实很像！',
                        "<18>{#p/papyrus}{#f/4}不对，\n不应该像\n一盒巧克力吗？",
                        '<25>{#p/undyne}{#f/14}* 那是人类的表达。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/4}但也许更像\n一盒巧克力。"]
                    : ['<18>{#p/papyrus}{#f/0}巧克力和树胶的味道\n其实很像。']
        ),
        a_lookout: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/5}假以时日，\n我们都将成为\n星际旅者。',
                '<18>{#p/papyrus}{#f/5}去探索那些\n深邃的未知...',
                '<18>{#p/papyrus}{#f/5}远离这座\n古老的监狱。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/17}* 别告诉我\n  你在策划越狱！",
                        "<18>{#p/papyrus}{#f/5}别担心，\n这只是自由的寓言。",
                        '<18>{#p/papyrus}{#f/4}【真正的】越狱\n太可疑了。',
                        '<25>{#p/undyne}{#f/16}* 对对...',
                        '<18>{#p/papyrus}{#f/5}此外，\n如果我想做\n正确的事...',
                        "<18>{#p/papyrus}{#f/6}我将召开\n紧急会议！",
                        "<25>{#p/undyne}{#f/12}* 天，多么艰巨啊。"
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/4}只希望，\n当我们到达\n星星那边时...",
                        "<18>不会遇到任何\n特乌叛贼。"
                    ]
                    : ['<18>{#p/papyrus}{#f/5}抱歉。', "<18>{#p/papyrus}{#f/4}我可没吐槽。"]
        ),
        a_hub3: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}这不是那些\n喜好寒冷的人们\n常去的消遣之地吗？",
                '<18>{#p/papyrus}{#f/5}我为他们\n感到难过...',
                '<18>{#p/papyrus}{#f/9}...所以我打算哪天\n给他们买个冰箱！',
                "<18>{#p/papyrus}{#f/0}这样，\n他们附近就会有\n一块寒冷的地方了。",
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/1}* 说到附近...',
                        "<25>{#p/undyne}{#f/8}* 我们就在隔壁！！",
                        '<18>{#p/papyrus}{#f/9}对！！\n就在你右下角！！',
                        '<25>{#p/undyne}{#f/17}* 是隔壁，不是下面。',
                        "<18>{#p/papyrus}{#f/6}...是在平面图的\n下面！！",
                        '<25>{#p/undyne}{#f/14}* 我怀疑人类\n  都不知道那长啥样。'
                    ])
            ],
            () =>
                solo()
                    ? ["<18>{#p/papyrus}{#f/0}科技改变世界！"]
                    : [
                        '<18>{#p/papyrus}{#f/6}还在等什么呢？！！\n快下来！！',
                        '<25>{#p/undyne}{#f/7}* 他是说去隔壁！！'
                    ]
        ),
        a_plaza: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/0}那是堡兄的商店。",
                '<18>{#p/papyrus}{#f/6}尽管他卖的\n都是些垃圾食品...',
                '<18>{#p/papyrus}{#f/5}但他却像一个\n真正的男子汉。',
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/12}* 你要这么说也不是不行。",
                        '<18>{#p/papyrus}{#f/5}无可否认，\n和他说话确实会\n让人感到紧张。',
                        "<18>{#p/papyrus}{#f/6}但我不认为\n这是他的错！！",
                        "<18>{#p/papyrus}{#f/4}这... 实际上是\n镁塔顿的错。",
                        "<18>{#p/papyrus}{#f/9}但别担心！\n我待会就去跟他\n谈这事！"
                    ])
            ],
            () =>
                solo()
                    ? ['<18>{#p/papyrus}{#f/6}当然你必须\n要赢得他的尊重。']
                    : ['<18>{#p/papyrus}{#f/4}我和那机器人有...\n一大堆要讨论的。']
        ),
        a_elevator5: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/4}这个“休闲回廊”\n当然是用来休闲的...',
                '<18>{#p/papyrus}{#f/5}...想干啥都行。',
                "<18>{#p/papyrus}{#f/6}但我想知道\n蒲公罂到底有啥\n神奇的？",
                '<18>{#p/papyrus}{#f/4}可以回应\n人们的粟求吗？',
                ...(solo()
                    ? ['<18>{#p/papyrus}{#f/0}嗯...\n我想找个时间\n试试。']
                    : [
                        "<25>{#p/undyne}{#f/14}* 我想你不会喜欢的，\n  帕派瑞斯。",
                        "<25>{#p/undyne}{#f/17}* 这不是你的作风。",
                        "<18>{#p/papyrus}{#f/5}是啊，\n兴许我该听你的。",
                        '<25>{#p/undyne}{#f/14}* 那必须的。',
                        '<18>{#p/papyrus}{#f/9}但我还是要\n试一试！！',
                        '<25>{#p/undyne}{#f/17}* ...'
                    ])
            ],
            () => [
                '<18>{#p/papyrus}{#f/0}不过我尽量不会在\n休闲回廊试的。',
                '<18>{#p/papyrus}{#f/4}我这可是\n在为科学献身。',
                ...(solo() ? [] : ['<25>{#p/undyne}{#f/12}* 啐，是是是...'])
            ]
        ),
        a_hub4: pager.create(
            0,
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}所以那边\n有一堆好玩的？",
                        '<18>{#p/papyrus}{#f/9}听起来是个\n消遣的好去处！！',
                        "<18>{#p/papyrus}{#f/0}有时间我一定会去\n那边看看。",
                        "<18>{#p/papyrus}{#f/4}这可比杵在\n安黛因家门口好多了。"
                    ]
                    : ["<25>{#p/undyne}{#f/8}* 想聊天？\n* 我们就在这里，小混蛋！"],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/4}也许在我们\n跟她消遣过后...',
                        '<18>{#p/papyrus}{#f/0}我们就都\n可以去那玩了！'
                    ]
                    : ["<25>{#p/undyne}{#f/8}* 想聊天？\n* 我们就在这里，小混蛋！"]
        ),
        a_sleeping1: pager.create(
            0,
            () => [
                '<18>{#p/papyrus}{#f/0}我听说这家旅馆\n是在额外的维度\n建造的。',
                '<18>{#p/papyrus}{#f/4}维度...\n层面...',
                '<18>{#p/papyrus}{#f/5}他们会在我们打盹时\n多给我们一层\n毯子吗？',
                '<18>{#p/papyrus}{#f/0}当然我是\n替我朋友问的。',
                ...(solo()
                    ? []
                    : [
                        '<25>{#p/undyne}{#f/17}* 确实，因为你\n  一直精神抖擞。',
                        "<18>{#p/papyrus}{#f/0}完全正确！\n我不能浪费时间\n在打盹上。",
                        '<25>{#p/undyne}{#f/14}* 那睡觉呢？',
                        '<18>{#p/papyrus}{#f/6}睡觉？？？',
                        "<18>{#p/papyrus}{#f/4}...那只是我兄弟\n用来打盹的借口。",
                        '<25>{#p/undyne}{#f/17}* 显而易见！！'
                    ])
            ],
            () =>
                solo()
                    ? [
                        "<18>{#p/papyrus}{#f/0}哦，我？\n我才不打盹。",
                        '<18>{#p/papyrus}{#f/4}我只是碰巧\n闭了下眼睛。'
                    ]
                    : ["<18>{#p/papyrus}{#f/4}他能从床上爬起来\n真是个奇迹。"]
        ),
        a_hub5: pager.create(
            0,
            () => [
                "<18>{#p/papyrus}{#f/6}如果你是要离开\n休闲回廊然后继续\n前进，那我...",
                "<18>{#p/papyrus}{#f/5}那我就\n跟你\n打不了电话了。",
                "<18>{#p/papyrus}{#f/4}但你如果\n是要回去...",
                "<18>{#p/papyrus}{#f/0}...那就没问题了！！",
                ...(solo()
                    ? []
                    : [
                        "<25>{#p/undyne}{#f/14}* 我们哪都不去。",
                        '<18>{#p/papyrus}{#f/6}绝对不走！！！',
                        '<18>{#p/papyrus}{#f/5}虽然，在有些时候，\n我们免不了要离开。',
                        "<25>{#p/undyne}{#f/16}* 确实如此，但是...",
                        '<25>{#p/undyne}{#f/17}* 但是没必要担心这个！',
                        '<18>{#p/papyrus}{#f/0}完全正确。'
                    ])
            ],
            () =>
                solo()
                    ? [
                        '<18>{#p/papyrus}{#f/6}所以你\n是去是回？',
                        "<18>{#p/papyrus}{#f/5}这是个\n艰难的抉择。"
                    ]
                    : ['<18>{#p/papyrus}{#f/6}不过不需要担心！！']
        )
    },

    s_save_starton: {
        s_crossroads: {
            name: '星港 - 停靠港',
            text: () =>
                SAVE.data.n.plot < 29
                    ? world.edgy
                        ? ['<32>{#p/human}* （有个骷髅没有出现，\n  这使你充满了决心。）']
                        : ["<32>{#p/human}* （看那对骷髅兄弟唱双簧，\n  使你充满了决心。）"]
                    : papreal() || world.runaway
                        ? ['<32>{#p/human}* （孤零零的箱子使你充满了决心。）']
                        : ['<32>{#p/human}* （箱子终于可以好好歇歇了。）\n* （这当然使你充满了决心。）']
        },
        s_pacing: {
            name: '星港 - 月岩小路',
            text: () =>
                world.runaway || epilogueOverride(world.population < 6) || world.genocide || roomKills().s_pacing > 1
                    ? SAVE.data.n.plot < 29
                        ? ['<32>{#p/human}* （星光变得黯淡。）\n* （不知怎地，这使你充满了决心。）']
                        : ['<32>{#p/human}* （星光不再闪耀。）\n* （这当然使你充满了决心。）']
                    : SAVE.data.b.svr
                        ? [
                            '<32>{#p/human}* （无谓的争论总算平息了。）',
                            '<32>* （这使你充满了决心。）'
                        ]
                        : [
                            '<32>{#p/human}* （月岩商人在你面前\n  轻浮地争论着。）',
                            '<32>* （这使你充满了决心。）'
                        ]
        },
        s_spaghetti: {
            name: '星港 - 意面枢纽',
            text: () =>
                [
                    ['<32>{#p/human}* （这盘意大利面\n  牛顿看了都得破防，\n  这使你充满了决心。）'],
                    [
                        '<32>{#p/human}* （现在，这盘意大利面\n  也被牛顿驯服了。）',
                        '<32>{#p/human}* （这使你充满了决心。）'
                    ],
                    ['<32>{#p/human}* （意大利面没了。）', '<32>{#p/human}* （这使你充满了决心。）']
                ][trueSpaghettiState()]
        },
        s_town1: {
            name: '星港 - 小镇',
            text: () =>
                SAVE.data.b.svr
                    ? [
                        '<32>{#p/human}* （虽然已经没了人，\n  但小镇还是那么可爱。）',
                        '<32>{#p/human}* （这使你充满了决心。）'
                    ]
                    : papreal() || world.runaway
                        ? ['<32>{#p/human}* （小镇笼罩在阴影中，\n  这使你充满了决心。）']
                        : ['<32>{#p/human}* （这个可爱的小镇\n  使你充满了决心。）']
        }
    }
};


// END-TRANSLATE
